000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAZ1021.
000060 AUTHOR.                 山田 浩之
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【FPD書込】柔+ｳｨﾝﾄﾞｳｽﾞ版
000120*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2013-10-02
000130 DATE-COMPILED.          2013-10-02
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
001520     SELECT 作業ファイル１   ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
001530                             ORGANIZATION             IS  INDEXED
001540                             ACCESS MODE              IS  DYNAMIC
000905*                             RECORD      KEY          IS  作１－保険種別順序
000905                             RECORD      KEY          IS  作１－保険者番号
                                                                作１－種別
000908                                                          作１－本人家族区分
000908                                                          作１－患者カナ
000911                                                          作１－患者コード
000912                                                          作１－施術和暦年月
000952                             FILE STATUS              IS  状態キー
001600                             LOCK        MODE         IS  AUTOMATIC.
000390*
001270     SELECT 会提出ファイル ASSIGN    TO    FD-NAME
000410                             ORGANIZATION             IS  LINE SEQUENTIAL
000420                             ACCESS MODE              IS  SEQUENTIAL
000430                             FILE STATUS              IS  状態キー
000440                             LOCK      MODE           IS  AUTOMATIC.
000450******************************************************************
000460*                      DATA DIVISION                             *
000470******************************************************************
000480 DATA                    DIVISION.
000490 FILE                    SECTION.
000500*
001520 FD 作業ファイル１ RECORD  CONTAINS 1873 CHARACTERS.
001200 01 作１－レコード.
001210    03 作１－レコードキー.
001271       05 作１－保険者番号              PIC X(8).
             05 作１－種別                    PIC 9(2).
001280       05 作１－本人家族区分            PIC 9.
001300       05 作１－患者カナ                PIC X(50).
001310       05 作１－患者コード.
001320          07 作１－患者番号             PIC 9(6).
001330          07 作１－枝番                 PIC X(1).
001340       05 作１－施術和暦年月            PIC 9(5).
          03 作１－レコードデータ.
001340       05 作１－請求年月                PIC 9(6).
001340       05 作１－施術年月                PIC 9(6).
             05 作１－会員番号                PIC 9(7).
             05 作１－登録記号番号            PIC X(11).
             05 作１－保険者番号本体          PIC 9(8).
             05 作１－保険証記号              PIC X(30).
             05 作１－保険証番号              PIC X(16).
             05 作１－医療助成区分            PIC 9(1).
             05 作１－負担者番号１            PIC X(8).
             05 作１－受給者番号１            PIC X(16).
             05 作１－負担者番号２            PIC X(8).
             05 作１－受給者番号２            PIC X(16).
             05 作１－保険種別                PIC 9(1).
             05 作１－単併区分                PIC 9(1).
001280       05 作１－本家区分                PIC 9.
             05 作１－給付割合                PIC 9(2).
001280       05 作１－本人家族区分２          PIC 9.
             05 作１－被保険者カナ            PIC X(25).
             05 作１－被保険者氏名            PIC X(30).
             05 作１－受診者カナ              PIC X(25).
             05 作１－受診者氏名              PIC X(30).
             05 作１－患者性別                PIC 9(1).
             05 作１－患者生年月日            PIC 9(8).
             05 作１－合計金額                PIC 9(6).
             05 作１－一部負担金              PIC 9(6).
             05 作１－請求金額                PIC 9(6).
             05 作１－公費一部負担金          PIC 9(6).
             05 作１－公費請求金額            PIC 9(6).
             05 作１－実日数                  PIC 9(2).
             05 作１－部位数                  PIC 9(1).
             05 作１－再請求区分              PIC 9(1).
             05 作１－レセコン業者            PIC 9(2).
             05 作１－高齢者区分              PIC 9(1).
             05 作１－患者Ｎ                  PIC 9(8).
      */運動後療追加↓↓↓/20180712
             05 作１－運動後療料回数          PIC 9(1).
             05 作１－運動後療料              PIC 9(5).
      */明細書発行体制加算追加↓↓↓/20221012
             05 作１－明細書発行回数          PIC 9(1).
             05 作１－明細書発行              PIC 9(3).
             05 作１－明細書発行月日          PIC 9(4).
001598*       05 作１－予備                    PIC X(54).
001598*       05 作１－予備                    PIC X(48).
001598       05 作１－予備                    PIC X(40).
      */明細書発行体制加算追加↑↑↑/20221012
      */運動後療追加↑↑↑/20180712
000566       05 作１－負傷部位データ  OCCURS 5.
000567          07 作１－負傷区分             PIC 9.
000568          07 作１－負傷名               PIC X(32).
000570          07 作１－負傷年月日           PIC 9(8).
000571          07 作１－初検年月日           PIC 9(8).
000572          07 作１－施術開始年月日       PIC 9(8).
000573          07 作１－施術終了年月日       PIC 9(8).
000574          07 作１－部位実日数           PIC 9(2).
000575          07 作１－転帰区分             PIC 9.
000569          07 作１－初回処置回数         PIC 9.
000569          07 作１－初回処置料           PIC 9(5).
             05 作１－新規区分                PIC 9(1).
             05 作１－継続区分                PIC 9(1).
             05 作１－施術日                  PIC X(31).
             05 作１－初検回数                PIC 9(1).
             05 作１－初検料                  PIC 9(5).
             05 作１－初検休日加算回数        PIC 9(1).
             05 作１－初検深夜加算回数        PIC 9(1).
             05 作１－初検時間外加算回数      PIC 9(1).
             05 作１－初検加算                PIC 9(5).
             05 作１－相談支援回数            PIC 9(1).
             05 作１－相談支援料              PIC 9(5).
             05 作１－再検回数                PIC 9(1).
             05 作１－再検料                  PIC 9(5).
             05 作１－往療距離                PIC 9(3).
             05 作１－往療回数                PIC 9(2).
             05 作１－往療料                  PIC 9(5).
             05 作１－夜間加算往療回数        PIC 9(1).
             05 作１－難路加算往療回数        PIC 9(1).
             05 作１－暴風雨雪加算往療回数    PIC 9(1).
             05 作１－往療加算                PIC 9(5).
      */金属副子変更↓↓↓/20180712
000561       05 作１－金属副子回数            PIC 9.
000561       05 作１－ダミー                  PIC X(2).
000561*       05 作１－金属副子大              PIC 9.
000562*       05 作１－金属副子中              PIC 9.
000563*       05 作１－金属副子小              PIC 9.
      */金属副子変更↑↑↑/20180712
             05 作１－金属副子加算            PIC 9(5).
000564       05 作１－情報提供料回数          PIC 9.
000564       05 作１－情報提供料              PIC 9(5).
000566       05 作１－部位料金データ  OCCURS 6.
000570          07 作１－逓減開始月日         PIC 9(4).
000576          07 作１－後療回数             PIC 9(2).
000576          07 作１－後療料               PIC 9(5).
000577          07 作１－冷罨法回数           PIC 9.
000576          07 作１－冷罨法料             PIC 9(5).
000578          07 作１－温罨法回数           PIC 9(2).
000576          07 作１－温罨法料             PIC 9(5).
000579          07 作１－電療回数             PIC 9(2).
000576          07 作１－電療料               PIC 9(5).
000580          07 作１－多部位逓減率         PIC 9(2).
000576          07 作１－多部位逓減額         PIC 9(5).
000581          07 作１－長期逓減率           PIC 9(2).
000576          07 作１－部位別料金計         PIC 9(5).
             05 作１－住所                    PIC X(60).
             05 作１－負傷原因                PIC X(200).
             05 作１－経過                    PIC X(50).
             05 作１－長期理由                PIC X(400).
001320*
001330 FD  会提出ファイル RECORD CONTAINS 1798 CHARACTERS.
001340 01  会提－レコード.
001350     03  会提－レコードデータ PIC X(1798).
001980*
001990*----------------------------------------------------------------*
002000******************************************************************
002010*                WORKING-STORAGE SECTION                         *
002020******************************************************************
002030 WORKING-STORAGE         SECTION.
002040 01 キー入力                           PIC X    VALUE SPACE.
002050 01 状態キー                           PIC X(2) VALUE SPACE.
002060 01 終了フラグ                         PIC X(3) VALUE SPACE.
002070 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002080 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002090 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002100 01 ファイル名                         PIC N(8) VALUE SPACE.
002110 01 カウンタ                           PIC 9(1) VALUE ZERO.
002111 01 連番Ｗ                             PIC 9(4) VALUE ZERO.
       01 文字ＣＮＴ                         PIC 9(4)  VALUE ZERO.
002120**
002130** エラーメッセージ用
002140 01 エラーメッセージＷ.
002150    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002160    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002170    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002180    03 FILLER                          PIC X(10) VALUE SPACE.
002181*
002250* フロッピーパス用
002251 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002252 01 FD-NAME                            PIC X(30) VALUE SPACE.
002190******************************************************************
002200*                          連結項目                              *
002210******************************************************************
      *
      * 01 連入－画面情報ＹＳＳ１００ IS EXTERNAL.
      *    03 連入－定期修正ＦＤ              PIC X.
       01 連入－画面情報ＹＡＺ１００ IS EXTERNAL GLOBAL.
          03 連入－ドライブ                  PIC X(1).
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
002220*
002230********************
002240* メッセージ表示キー *
002250********************
002260 01 連メ－キー IS EXTERNAL.
002270    03  連メ－メッセージ               PIC N(20).
004090*
004091 01 連メ７－キー IS EXTERNAL.
004092    03  連メ７－メッセージ１               PIC X(40).
004102    03  連メ７－メッセージ２               PIC X(40).
002320*
002330******************************************************************
002340*                      PROCEDURE  DIVISION                       *
002350******************************************************************
002360 PROCEDURE               DIVISION.
002370************
002380*           *
002390* 初期処理   *
002400*           *
002410************
002420     PERFORM 初期化.
002430************
002440*           *
002450* 主処理     *
002460*           *
002470************
002480     PERFORM レコード作成.
002490************
002500*           *
002510* 終了処理   *
002520*           *
002530************
002540     PERFORM 終了処理.
002550     MOVE ZERO TO PROGRAM-STATUS.
002560     EXIT PROGRAM.
002570*
002580*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002590*================================================================*
002600 初期化 SECTION.
002610*
002620     PERFORM ファイルオープン.
002630*
002640*================================================================*
002650 ファイルオープン SECTION.
002660*
003324*     MOVE 連入－定期修正ＦＤ TO 定期修正ＦＤＷ
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\RYOYOHI.dat" TO FD-NAME
           ELSE
003324         MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003326         IF 定期修正ＦＤＷ = SPACE
003327            MOVE "A" TO 定期修正ＦＤＷ
003328         END-IF
003330         STRING 定期修正ＦＤＷ DELIMITED BY SIZE
                     ":\RYOYOHI.DAT"  DELIMITED BY SIZE
003334               INTO FD-NAME
003335         END-STRING
           END-IF.
      *
002670     OPEN OUTPUT 会提出ファイル.
002680     IF 状態キー  NOT =  "00"
002690         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
               MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
002700         CALL   "MSG007"
002710         CANCEL "MSG007"
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM
002770     END-IF.
002780*
002790     OPEN INPUT 作業ファイル１.
002800         MOVE NC"作１" TO ファイル名.
002810         PERFORM オープンチェック.
002820*================================================================*
002830 オープンチェック SECTION.
002840*
002850     IF 状態キー  NOT =  "00"
002860         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002870         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002880         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002890                                                 UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
002900         ACCEPT  キー入力 FROM CONS
002910         PERFORM ファイル閉鎖
002920         MOVE 99 TO PROGRAM-STATUS
002930         EXIT PROGRAM.
002940*================================================================*
002950 ファイル閉鎖 SECTION.
002960*
002970     CLOSE  会提出ファイル  作業ファイル１.
002980*================================================================*
002990 終了処理 SECTION.
003000*
003010     PERFORM ファイル閉鎖.
003020*================================================================*
003030 エラー表示 SECTION.
003040*
003050     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003060     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003070     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003080     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
003090     ACCEPT  キー入力 FROM CONS.
003100     PERFORM ファイル閉鎖.
003110     MOVE 99 TO PROGRAM-STATUS.
003120     EXIT PROGRAM.
003130*================================================================*
002480 レコード作成 SECTION.
004020*
           MOVE 1800   TO 文字ＣＮＴ.
           MOVE SPACE TO 終了フラグ.
           MOVE SPACE TO 作１－保険者番号.
           MOVE ZERO  TO 作１－施術和暦年月.
000580     MOVE ZERO  TO 作１－患者番号.
000590     MOVE SPACE TO 作１－枝番.
           MOVE SPACE TO 作１－患者カナ.
013770     START 作業ファイル１ KEY IS >= 作１－保険者番号
                                          作１－種別
                                          作１－本人家族区分
                                          作１－患者カナ
                                          作１－患者コード
                                          作１－施術和暦年月
           END-START.
011444     IF 状態キー = "00"
               PERFORM 作業ファイル１読込
               PERFORM UNTIL 終了フラグ = "YES"
                   MOVE 作１－レコードデータ TO 会提－レコード
                   PERFORM ファイル書込
                   PERFORM 作業ファイル１読込
               END-PERFORM
           END-IF.
004030*================================================================*
004040 作業ファイル１読込 SECTION.
004050*
004060     READ 作業ファイル１ NEXT
004070     AT END
004080         MOVE "YES" TO 終了フラグ
004090     END-READ.
004100*
004110*================================================================*
004120 ファイル書込 SECTION.
004130*
004140     WRITE 会提－レコード.
004150     IF 状態キー  NOT =  "00"
004160         MOVE NC"会提出ファイル" TO ファイル名
004170         PERFORM エラー表示
004180     END-IF.
004110*================================================================*
004200******************************************************************
004210 END PROGRAM YAZ1021.
004220******************************************************************
