000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YCH101.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【ﾃﾞｰﾀ作成】新柔版
000100* 請求年月Ver.
000110*      MED = YCH580
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2011-08-26
000140 DATE-COMPILED.          2011-08-26
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  保険者マスタ    ASSIGN      TO        HOKENSL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  保－保険種別
000310                                                          保－保険者番号
000320                             ALTERNATE RECORD KEY     IS  保－保険種別
000330                                                          保－保険者名称
000340                                                          保－保険者番号
000350                             FILE STATUS              IS  状態キー
000360                             LOCK        MODE         IS  AUTOMATIC.
000370     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000380                             ORGANIZATION             IS  INDEXED
000390                             ACCESS MODE              IS  DYNAMIC
000400                             RECORD KEY               IS  市－公費種別
000410                                                          市－市町村番号
000420                             ALTERNATE RECORD KEY     IS  市－公費種別
000430                                                          市－市町村名称
000440                                                          市－市町村番号
000450                             FILE STATUS              IS  状態キー
000460                             LOCK        MODE         IS  AUTOMATIC.
000470     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000480                             ORGANIZATION             IS  INDEXED
000490                             ACCESS MODE              IS  DYNAMIC
000500                             RECORD KEY               IS  元－元号区分
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
000600     SELECT  施術所情報マスタ ASSIGN      TO        SEJOHOL
000610                             ORGANIZATION             IS  INDEXED
000620                             ACCESS MODE              IS  DYNAMIC
000630                             RECORD KEY               IS 施情－施術所番号
000640                             FILE STATUS              IS  状態キー
000650                             LOCK        MODE         IS  AUTOMATIC.
000130     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000140                             ORGANIZATION             IS  INDEXED
000150                             ACCESS MODE              IS  DYNAMIC
000160                             RECORD KEY               IS  レセ－施術和暦年月
000170                                                          レセ－患者コード
000180                                                          レセ－レセ種別
000190                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000200                                                          レセ－施術和暦年月
000210                                                          レセ－レセ種別
000220                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000230                                                          レセ－施術和暦年月
000240                                                          レセ－患者コード
000250                                                          レセ－レセ種別
000260                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000270                                                          レセ－レセ種別
000280                                                          レセ－請求保険者番号
000290                                                          レセ－患者コード
000300                                                          レセ－施術和暦年月
000310                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000320                                                          レセ－請求保険者番号
000330                                                          レセ－患者コード
000340                                                          レセ－レセ種別
000350                                                          レセ－施術和暦年月
000360                             FILE STATUS              IS  状態キー
000370                             LOCK        MODE         IS  AUTOMATIC.
000750     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000760                             ORGANIZATION             IS  INDEXED
000770                             ACCESS MODE              IS  DYNAMIC
000780                             RECORD KEY               IS 受－施術和暦年月
000790                                                          受－患者コード
000800                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000810                                                          受－患者カナ
000820                                                          受－患者コード
000830                             ALTERNATE RECORD KEY     IS  受－患者コード
000840                                                         受－施術和暦年月
000850                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000860                                                          受－保険種別
000870                                                          受－保険者番号
000880                                                          受－患者コード
000890                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000900                                                          受－公費種別
000910                                                     受－費用負担者番号
000920                                                          受－患者コード
000930                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000940                                                          受－助成種別
000950                                                  受－費用負担者番号助成
000960                                                          受－患者コード
000970                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000980                                                      受－施術和暦年月
000990                                                      受－患者コード
001000                             FILE STATUS              IS  状態キー
001010                             LOCK        MODE         IS  AUTOMATIC.
001020     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
001030                             ORGANIZATION             IS  INDEXED
001040                             ACCESS MODE              IS  DYNAMIC
001050                             RECORD KEY               IS 負－施術和暦年月
001060                                                         負－患者コード
001070                             ALTERNATE RECORD KEY     IS 負－患者コード
001080                                                         負－施術和暦年月
001090                             FILE STATUS              IS  状態キー
001100                             LOCK        MODE         IS  AUTOMATIC.
001110     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
001120                             ORGANIZATION             IS  INDEXED
001130                             ACCESS                   IS  DYNAMIC
001140                             RECORD      KEY          IS  作１－請求和暦年月
001150                                                          作１－助成区分
001160                                                          作１－保険者番号
001170                                                          作１－本人家族区分
001180                                                          作１－施術和暦年月
001190                                                          作１－被保険者カナ
001200                                                          作１－患者コード
001210                             FILE        STATUS       IS  状態キー
001220                             LOCK        MODE         IS  AUTOMATIC.
001230******************************************************************
001240*                      DATA DIVISION                             *
001250******************************************************************
001260 DATA                    DIVISION.
001270 FILE                    SECTION.
001280*                           ［ＲＬ＝  ３２０］
001290 FD  保険者マスタ        BLOCK   CONTAINS   1   RECORDS.
001300     COPY HOKENS          OF  XFDLIB  JOINING   保   AS  PREFIX.
001310*                           ［ＲＬ＝  ２５６］
001320 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
001330     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
001340*                           ［ＲＬ＝  １２８］
001350 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001360     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001400*
001410 FD  施術所情報マスタ    BLOCK   CONTAINS   1   RECORDS.
001420     COPY SEJOHO         OF  XFDLIB  JOINING   施情   AS  PREFIX.
      *                          ［ＲＬ＝  １５３６］
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001460*                           ［ＲＬ＝  ３２０］
001470 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001480     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001490*                           ［ＲＬ＝  １２８］
001500 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001510     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001520*
001530*
001540 FD  作業ファイル１ RECORD  CONTAINS 300 CHARACTERS.
001550 01  作１－レコード.
001560     03  作１－レコードキー.
001570         05  作１－請求和暦年月.
001580             07  作１－請求和暦            PIC 9.
001590             07  作１－請求年              PIC 9(2).
001600             07  作１－請求月              PIC 9(2).
001610         05  作１－助成区分                PIC 9.
001620         05  作１－保険者番号              PIC 9(8).
001630         05  作１－本人家族区分            PIC 9.
001640         05  作１－施術和暦年月.
001650             07  作１－施術和暦            PIC 9.
001660             07  作１－施術年              PIC 9(2).
001670             07  作１－施術月              PIC 9(2).
001680         05  作１－被保険者カナ            PIC X(20).
001690         05  作１－患者コード.
001700             07 作１－患者番号             PIC 9(6).
001710             07 作１－枝番                 PIC X(1).
001720     03  作１－レコードデータ.
001730         05  作１－会員番号              PIC 9(7).
001740         05  作１－続柄                  PIC 9.
001750         05  作１－老人                  PIC 9.
001760         05  作１－保険種別              PIC 9.
001770**         05  作１－助成区分              PIC 9.
001780         05  作１－委任区分              PIC 9.
001790         05  作１－地域区分              PIC 9.
001800         05  作１－加入区分              PIC 9.
001810         05  作１－請求フラグ            PIC 9.
001820         05  作１－部位数                PIC 9.
001830         05  作１－実日数                PIC 9(3).
001840**         05  作１－保険者番号            PIC 9(8).
001850         05  作１－請求年月データ.
001860             07  作１－請求年データ      PIC 9(4).
001870             07  作１－請求月データ      PIC 9(2).
001880         05  作１－患者生年月日.
001890             07  作１－患者年            PIC 9(4).
001900             07  作１－患者月            PIC 9(2).
001910             07  作１－患者日            PIC 9(2).
001920         05  作１－施術年月データ.
001930             07  作１－施術年データ      PIC 9(4).
001940             07  作１－施術月データ      PIC 9(2).
001950         05  作１－被保険者カナデータ.
001960             07  作１－被保険者カナ１    PIC X(14).
001970             07  作１－被保険者カナ２    PIC X(6).
001980         05  作１－患者カナ.
001990             07  作１－患者カナ１        PIC X(8).
002000             07  作１－患者カナ２        PIC X(12).
002010         05  作１－費用負担者番号助成    PIC 9(8).
002020         05  作１－番号.
002030             07  作１－番号１            PIC X(14).
002040             07  作１－番号２.
002050                 09  作１－番号２１      PIC X(6).
002060                 09  作１－番号２２      PIC X(8).
002070         05  作１－記号.
002080             07  作１－記号１            PIC X(14).
002090             07  作１－記号２.
002100                 09  作１－記号２１      PIC X(2).
002110                 09  作１－記号２２      PIC X(12).
002120             07  作１－記号３            PIC X(4).
002130         05  作１－費用額                PIC 9(9).
002140         05  作１－請求額                PIC 9(9).
002150         05  作１－助成請求額            PIC 9(5). 
002160         05  作１－保険者名称.
002170             07  作１－保険者名称１      PIC X(14).
002180             07  作１－保険者名称２      PIC X(14).
002190             07  作１－保険者名称３      PIC X(12).
002200         05  FILLER                      PIC X(35).
002210*
002220*----------------------------------------------------------------*
002230******************************************************************
002240*                WORKING-STORAGE SECTION                         *
002250******************************************************************
002260 WORKING-STORAGE         SECTION.
002270 01 キー入力                           PIC X    VALUE SPACE.
002280 01 状態キー                           PIC X(2) VALUE SPACE.
002290 01 終了フラグ                         PIC X(3) VALUE SPACE.
002300 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002310 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002320 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002330 01 ファイル名                         PIC N(8) VALUE SPACE.
002340**
002350 01 保険種別ＷＲ                       PIC 9(2) VALUE ZERO.
002360 01 印刷形式ＷＲ                       PIC 9    VALUE ZERO.
002370 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002380 01 レセプト種類ＷＲ                   PIC X(4) VALUE SPACE.
002390 01 本人家族区分ＷＲ                   PIC 9    VALUE ZERO.
002400 01 請求和暦年月ＷＲ.
002410    03 請求和暦ＷＲ                    PIC 9    VALUE ZERO.
002420    03 請求年ＷＲ                      PIC 9(2) VALUE ZERO.
002430    03 請求月ＷＲ                      PIC 9(2) VALUE ZERO.
002440**
002450 01 カウンタ                           PIC 9(2)  VALUE ZERO.
002460 01 カウンタ２                         PIC 9(3)  VALUE ZERO.
002470 01 カウンタ３                         PIC 9(2)  VALUE ZERO.
002480 01 全角空白                           PIC X(2)  VALUE X"8140".
002490 01 半角空白                           PIC X(2)  VALUE X"2020".
002500**
002510** エラーメッセージ用
002520 01 エラーメッセージＷ.
002530    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002540    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002550    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002560    03 FILLER                          PIC X(10) VALUE SPACE.
002570** 保険者番号右詰め用
002580 01 保険者番号ＷＴ.
002590    03 保険者番号左詰めＷ.
002600      05 保険者番号左詰めＷ１          PIC X OCCURS 8 VALUE SPACE.
002610    03 保険者番号右詰めＷ.
002620      05 保険者番号右詰めＷ１          PIC X OCCURS 8 VALUE ZERO.
002630    03 保険者番号数字Ｗ                PIC 9(8)  VALUE ZERO.
002640    03 保険者番号Ｗ                    PIC X(8)  VALUE SPACE.
002650** 会員番号右詰め用
002660 01 会員番号ＷＴ.
002670    03 会員番号左詰めＷ.
002680      05 会員番号左詰めＷ１            PIC X OCCURS 7 VALUE SPACE.
002690    03 会員番号右詰めＷ.
002700      05 会員番号右詰めＷ１            PIC X OCCURS 7 VALUE ZERO.
002710    03 会員番号数字Ｗ                  PIC 9(7)  VALUE ZERO.
002720    03 会員番号Ｗ                      PIC X(7)  VALUE SPACE.
002730** 西暦日付ワーク用
002740 01 西暦年月Ｗ.
002750    03 西暦年Ｗ                        PIC 9(4) VALUE ZERO.
002760    03 西暦月Ｗ                        PIC 9(2) VALUE ZERO.
002770** 西暦請求年月用
002780 01 西暦請求年月Ｗ.
002790    03 西暦請求年Ｗ                    PIC 9(4) VALUE ZERO.
002800    03 西暦請求月Ｗ                    PIC 9(2) VALUE ZERO.
002810** 西暦施術年月用
002820 01 西暦施術年月Ｗ.
002830    03 西暦施術年Ｗ                    PIC 9(4) VALUE ZERO.
002840    03 西暦施術月Ｗ                    PIC 9(2) VALUE ZERO.
002850** 西暦患者生年月日用
002860 01 西暦患者年月日Ｗ.
002870    03 西暦患者年Ｗ                    PIC 9(4) VALUE ZERO.
002880    03 西暦患者月Ｗ                    PIC 9(2) VALUE ZERO.
002890    03 西暦患者日Ｗ                    PIC 9(2) VALUE ZERO.
002900** 記号左詰め用
002910 01 記号ＷＴ.
002920    03 記号元Ｗ.
002930      05 記号元Ｗ１                    PIC N OCCURS 12 VALUE SPACE.
002940    03 記号左詰めＷ.
002950      05 記号左詰めＷ１                PIC N OCCURS 12 VALUE SPACE.
003180    03 記号元ＸＷ.
003190      05 記号元ＸＷ１                  PIC X OCCURS 24 VALUE SPACE.
003200    03 記号左詰めＸＷ.
003210      05 記号左詰めＸＷ１              PIC X OCCURS 24 VALUE SPACE.
002960    03 記号Ｗ.
002970      05 記号ＮＷ                      PIC X(32) VALUE SPACE.
002980** 保険者名称用
002990 01 保険者名称Ｗ                       PIC X(40)  VALUE SPACE.
003000*
003010** 番号全角用
003020 01 番号ＷＴ.
003030    03 番号元Ｗ.
003040      05 番号元Ｗ１                    PIC X    OCCURS 20 VALUE SPACE.
003050    03 番号全角Ｗ.
003060      05 番号全角Ｗ１                  PIC X(2) OCCURS 20 VALUE SPACE.
003070    03 番号Ｗ                          PIC X(40) VALUE SPACE.
003080 01 半角文字Ｗ.
003090    03 半角文字１Ｗ                    PIC X(30)  VALUE
003100         "0123456789.+-*/><:;\)('&%$#!".
003110    03 半角文字２Ｗ                    PIC X(60)  VALUE
003120         "QWERTYUIOPASDFGHJKLZXCVBNMqwertyuiopasdfghjklzxcvbnm".
003130    03 半角文字合成Ｗ                  PIC X(90)  VALUE  SPACE.
003140    03 半角文字１Ｗ１ REDEFINES  半角文字合成Ｗ   PIC X OCCURS 90.
003150 01 全角文字Ｗ.
003160    03 全角文字１Ｗ                    PIC X(60)  VALUE
003170         "０１２３４５６７８９．＋－＊／＞＜：；￥）（’＆％＄＃！".
003180    03 全角文字２Ｗ                    PIC X(120)  VALUE
003190         "ＱＷＥＲＴＹＵＩＯＰＡＳＤＦＧＨＪＫＬＺＸＣＶＢＮＭｑｗｅｒｔｙｕｉｏｐａｓｄｆｇｈｊｋｌｚｘｃｖｂｎｍ".
003200    03 全角文字合成Ｗ                  PIC X(180)  VALUE  SPACE.
003210    03 全角文字１Ｗ１ REDEFINES  全角文字合成Ｗ   PIC X(2) OCCURS 90.
003220*
      *
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
003230*****************************************************************
003240 01 計算機西暦年Ｗ                     PIC 9(2).
003250* 日付ＷＯＲＫ
003260 01 計算機西暦.
003270    03 計算機西暦年                    PIC 9(4).
003280    03 計算機西暦月日                  PIC 9(4).
003290 01 計算機西暦Ｒ REDEFINES 計算機西暦.
003300    03 計算機世紀                      PIC 9(2).
003310    03 計算機日付                      PIC 9(6).
003320    03 計算機日付Ｒ REDEFINES 計算機日付.
003330       05 計算機年月                   PIC 9(4).
003340       05 計算機年月Ｒ REDEFINES 計算機年月.
003350         07 計算機年                   PIC 9(2).
003360         07 計算機月                   PIC 9(2).
003370       05 計算機日                     PIC 9(2).
003380*
003390******************************************************************
003400*                          連結項目                              *
003410******************************************************************
003420*
003430********************
003440* メッセージ表示キー *
003450********************
003460 01 連メ－キー IS EXTERNAL.
003470    03  連メ－メッセージ               PIC N(20).
003480*
003490 01 連メ３－キー IS EXTERNAL.
003500    03  連メ３－メッセージ             PIC N(20).
003510    03  連メ３－メッセージ１           PIC X(20).
003520****************
003530* 画面入力情報 *
003540****************
002900 01 連入－画面情報ＹＣＨ５８０ IS EXTERNAL.
002910    03 連入－印刷形式                  PIC 9.
002920    03 連入－請求和暦年月.
002930       05 連入－請求和暦               PIC 9.
002940       05 連入－請求年月.
002950         07 連入－請求年               PIC 9(2).
002960         07 連入－請求月               PIC 9(2).
003940*
      * 暗号複合用
       01 連暗号複合－暗号情報 IS EXTERNAL.
          03 連暗号複合－入力情報.
             05 連暗号複合－記号               PIC X(24).
             05 連暗号複合－番号               PIC X(30).
             05 連暗号複合－暗号化項目.
               07 連暗号複合－暗号患者番号     PIC X(6).
               07 連暗号複合－暗号判定記号     PIC X.
               07 連暗号複合－暗号判定番号     PIC X.
               07 連暗号複合－暗号記号         PIC X(24).
               07 連暗号複合－暗号番号         PIC X(30).
          03 連暗号複合－出力情報.
             05 連暗号複合－複合した記号       PIC X(24).
             05 連暗号複合－複合した番号       PIC X(30).
      * 
003950******************************************************************
003960*                      PROCEDURE  DIVISION                       *
003970******************************************************************
003980 PROCEDURE               DIVISION.
003990************
004000*           *
004010* 初期処理   *
004020*           *
004030************
004040     PERFORM 初期化.
004050     PERFORM 施術所情報取得.
004060************
004070*           *
004080* 主処理     *
004090*           *
004100************
004110     PERFORM 作業ファイル作成.
004120************
004130*           *
004140* 終了処理   *
004150*           *
004160************
004170     PERFORM 終了処理.
004180     MOVE ZERO TO PROGRAM-STATUS.
004190     EXIT PROGRAM.
004200*
004210*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004220*================================================================*
004230 初期化 SECTION.
004240*
004250     PERFORM ファイルオープン.
004260* 連結項目の待避
004270     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
004280     MOVE 連入－請求年        TO 請求年ＷＲ.
004290     MOVE 連入－請求月        TO 請求月ＷＲ.
004300*
004310* 西暦年月の取得
004320     MOVE 請求和暦ＷＲ  TO 元－元号区分.
004330     READ 元号マスタ
004340     NOT INVALID KEY
004350         MOVE 元－開始西暦年 TO 西暦年Ｗ
004360     END-READ.
004370*
004380     IF 西暦年Ｗ = ZERO
004390          MOVE  NC"元号マスタに開始西暦年を登録して下さい" TO 連メ－メッセージ
004400          CALL   "MSG001"
004410          CANCEL "MSG001"
004420          PERFORM ファイル閉鎖
004430          MOVE 99 TO PROGRAM-STATUS
004440          EXIT PROGRAM
004450     ELSE
004460          COMPUTE 西暦年Ｗ = 西暦年Ｗ + 請求年ＷＲ - 1
004470          MOVE 請求月ＷＲ TO 西暦月Ｗ
004480     END-IF.
004490*
004500*  中央の請求年月 (西暦,施術の翌月)
004510     MOVE 西暦年月Ｗ   TO  西暦請求年月Ｗ.
004520     COMPUTE  西暦請求月Ｗ = 西暦請求月Ｗ + 1.
004530     IF  西暦請求月Ｗ > 12
004540         COMPUTE  西暦請求年Ｗ = 西暦請求年Ｗ + 1
004550         MOVE  1       TO  西暦請求月Ｗ
004560     END-IF.
004570*
004580*================================================================*
004590 ファイルオープン SECTION.
004600*
004610     OPEN INPUT 保険者マスタ
004620         MOVE NC"保険者" TO ファイル名.
004630         PERFORM オープンチェック.
004640     OPEN INPUT 市町村マスタ
004650         MOVE NC"市町村" TO ファイル名.
004660         PERFORM オープンチェック.
004670     OPEN INPUT 元号マスタ.
004680         MOVE NC"元号マスタ" TO ファイル名.
004690         PERFORM オープンチェック.
004730     OPEN INPUT 施術所情報マスタ
004740         MOVE NC"施情" TO ファイル名.
004750         PERFORM オープンチェック.
004790     OPEN INPUT 受診者情報Ｆ.
004800         MOVE NC"受診者情報Ｆ" TO ファイル名.
004810         PERFORM オープンチェック.
004820     OPEN INPUT 負傷データＦ.
004830         MOVE NC"負傷データＦ" TO ファイル名.
004840         PERFORM オープンチェック.
006630     OPEN INPUT レセプトＦ.
006640         MOVE NC"レセ" TO ファイル名.
006650         PERFORM オープンチェック.
004850*================================================================*
004860 オープンチェック SECTION.
004870*
004880     IF 状態キー  NOT =  "00"
004890         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004900         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004910         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004920                                                 UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
004930         ACCEPT  キー入力 FROM CONS
004940         PERFORM ファイル閉鎖
004950         MOVE 99 TO PROGRAM-STATUS
004960         EXIT PROGRAM.
004970*================================================================*
004980 ファイル閉鎖 SECTION.
004990*
005000     CLOSE 元号マスタ レセプトＦ 受診者情報Ｆ 負傷データＦ
005010           施術所情報マスタ 保険者マスタ 市町村マスタ.
005020*================================================================*
005030 終了処理 SECTION.
005040*
005050     PERFORM ファイル閉鎖.
005060*================================================================*
005070 エラー表示 SECTION.
005080*
005090     DISPLAY NC"状態キー" 状態キー  UPON CONS.
005100     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
005110     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005120     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
005130     ACCEPT  キー入力 FROM CONS.
005140     PERFORM ファイル閉鎖.
005150     MOVE 99 TO PROGRAM-STATUS.
005160     EXIT PROGRAM.
005170*================================================================*
005180 施術所情報取得 SECTION.
005190*
005200     MOVE ZERO  TO 施情－施術所番号.
005210     READ 施術所情報マスタ
005220     INVALID KEY
005230          MOVE  NC"施術所情報マスタに登録後、実行して下さい" TO 連メ－メッセージ
005240          CALL   "MSG001"
005250          CANCEL "MSG001"
005260          PERFORM ファイル閉鎖
005270          MOVE 99 TO PROGRAM-STATUS
005280          EXIT PROGRAM
005290     NOT INVALID KEY
005300          IF  施情－接骨師会会員番号 = SPACE
005310              MOVE  NC"施術所マスタに会員番号を登録して下さい" TO 連メ－メッセージ
005320              CALL   "MSG001"
005330              CANCEL "MSG001"
005340              PERFORM ファイル閉鎖
005350              MOVE 99 TO PROGRAM-STATUS
005360              EXIT PROGRAM
005370          ELSE
005380              MOVE 施情－接骨師会会員番号  TO 会員番号Ｗ
005390              PERFORM 会員番号右詰め
005400          END-IF
005410     END-READ.
005420*
005430*================================================================*
005440 作業ファイル作成 SECTION.
005450*
005460     OPEN OUTPUT 作業ファイル１.
005470         MOVE NC"作１" TO ファイル名.
005480         PERFORM オープンチェック.
005490*
005500     PERFORM 作業ファイル１作成１
005510*
005520     CLOSE 作業ファイル１.
005530*
005540*================================================================*
005550 作業ファイル１作成１ SECTION.
005560*
005570*********************
005580*       全出力      *
005590*********************
005600*
005610     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005620     MOVE 請求年ＷＲ    TO レセ－請求年.
005630     MOVE 請求月ＷＲ    TO レセ－請求月.
005640     MOVE 1             TO レセ－施術和暦.
005650     MOVE ZERO          TO レセ－施術年.
005660     MOVE ZERO          TO レセ－施術月.
005670     MOVE ZERO          TO レセ－患者番号.
005680     MOVE LOW-VALUE     TO レセ－枝番.
013730     MOVE ZERO          TO レセ－レセ種別.
004840     START レセプトＦ   KEY IS >= レセ－請求和暦年月
004850                                  レセ－施術和暦年月
004860                                  レセ－患者コード
000250                                  レセ－レセ種別
005720     END-START.
005730     IF 状態キー = "00"
005740         MOVE SPACE  TO 終了フラグ
004900         PERFORM レセプトＦ読込
005760         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
004920                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
004930                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
004940                       ( レセ－請求月   NOT = 請求月ＷＲ   )
005800            PERFORM データチェック
005850** 生保単独は対象外 (親ありは、親のみ助成なしで出力)
005860            IF  ( 受－保険種別 = ZERO ) AND ( 受－助成種別 = 50 )
005870                MOVE SPACE  TO 実行キーＷ
005880            END-IF
005890**
005900            IF  実行キーＷ = "YES"
005930*
005940*            ********
005950*            * 健保 *
005960*            ********
005970                 IF ( 受－保険種別   NOT = ZERO ) AND
005980                    ( 受－保険者番号 NOT = SPACE )
005990*                **********************
006000*                * 作業ファイル作成 *
006010*                **********************
006020                     IF ( 受－公費種別       = ZERO  ) AND
006030                        ( 受－費用負担者番号 = SPACE )
006040                         IF  受－助成種別   = ZERO  OR 50
006050                             PERFORM 作１レコードセット健保
006060                         ELSE
006070                             PERFORM 作１レコードセット健保助成
006080                         END-IF
006090                         PERFORM 作１ファイル書込
006100                     END-IF
006110                 END-IF
006120*            ********
006130*            * 老人 *
006140*            ********
006150                 IF ( 受－公費種別       NOT = ZERO ) AND
006160                    ( 受－費用負担者番号 NOT = SPACE )
006170*                    **********************
006180*                    * 作業ファイル作成 *
006190*                    **********************
006200                         IF  受－助成種別   = ZERO  OR 50
006210                             PERFORM 作１レコードセット老人
006220                         ELSE
006230                             PERFORM 作１レコードセット老人助成
006240                         END-IF
006250                         PERFORM 作１ファイル書込
006260                 END-IF
006270             END-IF
006280             PERFORM レセプトＦ読込
006290         END-PERFORM
006300     END-IF.
006310*
006320*================================================================*
006330 データチェック SECTION.
006340*
006350     MOVE SPACE  TO 実行キーＷ.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
019640     IF ( レセ－請求対象区分 NOT = ZERO ) AND
005778        ( レセ－償還払い区分 NOT = 1 )
      *        IF(レセ－レセ種別 = 3) AND ( レセ－会総括表印刷対象区分 = 1 )
              IF(レセ－レセ種別 = 3)
                 CONTINUE
              ELSE
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
005786**      健保のみ
005787              IF 受－保険分類 = 1
019880                 MOVE "YES"  TO 実行キーＷ
022370                 MOVE 受－施術和暦       TO 負－施術和暦
022380                 MOVE 受－施術年         TO 負－施術年
022390                 MOVE 受－施術月         TO 負－施術月
022400                 MOVE 受－患者コード     TO 負－患者コード
022410                 READ 負傷データＦ
                       END-READ
005789              END-IF
019950           END-READ
              END-IF
019960     END-IF.
006810*
006910*================================================================*
012910 レセプトＦ読込 SECTION.
012920*
012930     READ レセプトＦ NEXT
012940     AT END
012950         MOVE "YES" TO 終了フラグ
012960     END-READ.
006980*
007060*================================================================*
007070 作１レコードセット健保 SECTION.
007080*
007090**********/  健保助成なしの時  /**********
007100*
007110     MOVE SPACE TO 作１－レコード.
007120     INITIALIZE 作１－レコード.
007130     MOVE レセ－請求和暦     TO 作１－請求和暦.
007140     MOVE レセ－請求年       TO 作１－請求年.
007150     MOVE レセ－請求月       TO 作１－請求月.
007160     MOVE 受－施術和暦       TO 作１－施術和暦.
007170     MOVE 受－施術年         TO 作１－施術年.
007180     MOVE 受－施術月         TO 作１－施術月.
007190     MOVE 受－患者コード     TO 作１－患者コード.
007200     MOVE 会員番号数字Ｗ     TO 作１－会員番号.
007210     MOVE 受－本人家族区分   TO 作１－本人家族区分 作１－続柄.
007220     MOVE ZERO               TO 作１－老人.
007230*
007240     PERFORM 保険種別取得.
007250*
007260     MOVE ZERO               TO 作１－助成区分.
007270     MOVE 負－部位数         TO 作１－部位数
007280     MOVE レセ－レセ実日数   TO 作１－実日数
007290*
007300     MOVE 受－保険者番号     TO 保険者番号Ｗ.
007310     PERFORM 保険者番号右詰め.
007320     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号.
007330*
007340     MOVE 西暦請求年月Ｗ     TO 作１－請求年月データ.
007350     PERFORM 西暦施術年月取得.
007360     MOVE 西暦施術年月Ｗ     TO 作１－施術年月データ.
007370*
007380     MOVE 受－被保険者カナ   TO 作１－被保険者カナ 作１－被保険者カナデータ.
007390     MOVE 受－患者カナ       TO 作１－患者カナ.
007400*
007410     MOVE ZERO               TO 作１－費用負担者番号助成.
007420*
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
      *-----------------------------------------------------------------*
007430*     IF ( 受－番号(1:1) = "*"  ) OR
007440*        ( 受－番号(1:2) = "＊" )
007430     IF ( 連暗号複合－複合した番号(1:1) = "*"  ) OR
007440        ( 連暗号複合－複合した番号(1:2) = "＊" )
007450        MOVE SPACE           TO 作１－番号
007460        INSPECT 作１－番号  REPLACING ALL 半角空白 BY 全角空白
007470     ELSE
007480***        MOVE 受－番号           TO 作１－番号
007490        PERFORM 番号全角取得
007500        MOVE 番号Ｗ          TO 作１－番号
007510     END-IF.
007520*
007530*     IF 受－記号(1:2)  = "＊" 
007530     IF 連暗号複合－複合した記号(1:2)  = "＊" 
007540        MOVE SPACE              TO 作１－記号
007550*        INSPECT 作１－記号  REPLACING ALL 半角空白 BY 全角空白
007560     ELSE
007570        PERFORM 記号左詰め
007580        MOVE 記号Ｗ             TO 作１－記号
007590     END-IF.
007600*
007610     MOVE レセ－合計       TO 作１－費用額.
007620     MOVE レセ－請求金額       TO 作１－請求額.
007630     MOVE ZERO               TO 作１－助成請求額.
007640*
007650     PERFORM 保険者名称取得.
007660     MOVE 保険者名称Ｗ       TO 作１－保険者名称.
007670*
007680*
007690* 14/10追加
007700     PERFORM 西暦患者年月日取得.
007710     MOVE 西暦患者年月日Ｗ   TO 作１－患者生年月日.
007720*
007730****************************************************
007740* 転記なし
007750*         05  作１－委任区分              PIC 9.
007760*         05  作１－地域区分              PIC 9.
007770*         05  作１－加入区分              PIC 9.
007780*         05  作１－請求フラグ            PIC 9.
007790*================================================================*
007800 作１レコードセット老人 SECTION.
007810*
007820**********/  老人助成なしの時  /**********
007830*
007840     MOVE SPACE TO 作１－レコード.
007850     INITIALIZE 作１－レコード.
007860     MOVE レセ－請求和暦     TO 作１－請求和暦.
007870     MOVE レセ－請求年       TO 作１－請求年.
007880     MOVE レセ－請求月       TO 作１－請求月.
007890     MOVE 受－施術和暦       TO 作１－施術和暦.
007900     MOVE 受－施術年         TO 作１－施術年.
007910     MOVE 受－施術月         TO 作１－施術月.
007920     MOVE 受－患者コード     TO 作１－患者コード.
007930     MOVE 会員番号数字Ｗ     TO 作１－会員番号.
007940     MOVE 受－本人家族区分   TO 作１－本人家族区分.
007950     MOVE 1                  TO 作１－続柄.
007951     IF 受－保険種別 = 05
007952        MOVE ZERO            TO 作１－老人
007953     ELSE
007954        MOVE 1               TO 作１－老人
007955     END-IF.
007970*
007980     PERFORM 保険種別取得.
007990*
008000     MOVE ZERO               TO 作１－助成区分.
008010     MOVE 負－部位数         TO 作１－部位数
008020     MOVE レセ－レセ実日数   TO 作１－実日数
008030*
008040     MOVE 受－費用負担者番号 TO 保険者番号Ｗ.
008050     PERFORM 保険者番号右詰め.
008060     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号.
008070*
008080     MOVE 西暦請求年月Ｗ     TO 作１－請求年月データ.
008090     PERFORM 西暦施術年月取得.
008100     MOVE 西暦施術年月Ｗ     TO 作１－施術年月データ.
008110*
008120     MOVE 受－被保険者カナ   TO 作１－被保険者カナ.
008130* 老人は、患者カナ
008140     MOVE 受－患者カナ       TO 作１－被保険者カナデータ.
008150     MOVE 受－患者カナ       TO 作１－患者カナ.
008160*
008170     MOVE ZERO               TO 作１－費用負担者番号助成.
008180*
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
      *-----------------------------------------------------------------*
008190*     IF ( 受－番号(1:1) = "*"  ) OR
008200*        ( 受－番号(1:2) = "＊" )
008190     IF ( 連暗号複合－複合した番号(1:1) = "*"  ) OR
008200        ( 連暗号複合－複合した番号(1:2) = "＊" )
008210        MOVE SPACE           TO 作１－番号
008220        INSPECT 作１－番号  REPLACING ALL 半角空白 BY 全角空白
008230     ELSE
008240***        MOVE 受－番号           TO 作１－番号
008250        PERFORM 番号全角取得
008260        MOVE 番号Ｗ          TO 作１－番号
008270     END-IF.
008280*
008290*     IF 受－記号(1:2)  = "＊" 
008290     IF 連暗号複合－複合した記号(1:2)  = "＊" 
008300        MOVE SPACE              TO 作１－記号
008310*        INSPECT 作１－記号  REPLACING ALL 半角空白 BY 全角空白
008320     ELSE
008330        PERFORM 記号左詰め
008340        MOVE 記号Ｗ             TO 作１－記号
008350     END-IF.
008360*
008370*
008380     MOVE レセ－合計         TO 作１－費用額.
008390     MOVE レセ－請求金額     TO 作１－請求額.
008400     MOVE ZERO               TO 作１－助成請求額.
008410*
008420     PERFORM 市町村名称取得.
008430     MOVE 保険者名称Ｗ       TO 作１－保険者名称.
008440*
008450*
008460* 14/10追加
008470     PERFORM 西暦患者年月日取得.
008480     MOVE 西暦患者年月日Ｗ   TO 作１－患者生年月日.
008490*
008500****************************************************
008510* 転記なし
008520*         05  作１－委任区分              PIC 9.
008530*         05  作１－地域区分              PIC 9.
008540*         05  作１－加入区分              PIC 9.
008550*         05  作１－請求フラグ            PIC 9.
008560*================================================================*
008570 作１レコードセット健保助成 SECTION.
008580*
008590**********/  健保助成ありの時  /**********
008600*
008610     MOVE SPACE TO 作１－レコード.
008620     INITIALIZE 作１－レコード.
008630     MOVE レセ－請求和暦     TO 作１－請求和暦.
008640     MOVE レセ－請求年       TO 作１－請求年.
008650     MOVE レセ－請求月       TO 作１－請求月.
008660     MOVE 受－施術和暦       TO 作１－施術和暦.
008670     MOVE 受－施術年         TO 作１－施術年.
008680     MOVE 受－施術月         TO 作１－施術月.
008690     MOVE 受－患者コード     TO 作１－患者コード.
008700     MOVE 会員番号数字Ｗ     TO 作１－会員番号.
008710     MOVE 受－本人家族区分   TO 作１－本人家族区分 作１－続柄.
008720* 41老は 2
008730     IF 受－助成種別 = 51
008740        MOVE 2               TO 作１－老人
008750     ELSE
008760        MOVE ZERO            TO 作１－老人
008770     END-IF.
008780*
008790     PERFORM 保険種別取得.
008800*
008810     MOVE 1                  TO 作１－助成区分.
008820     MOVE 負－部位数         TO 作１－部位数
008830     MOVE レセ－レセ実日数   TO 作１－実日数
008840*
008850     MOVE 受－保険者番号     TO 保険者番号Ｗ.
008860     PERFORM 保険者番号右詰め.
008870     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号.
008880*
008890     MOVE 西暦請求年月Ｗ     TO 作１－請求年月データ.
008900     PERFORM 西暦施術年月取得.
008910     MOVE 西暦施術年月Ｗ     TO 作１－施術年月データ.
008920*
008930     MOVE 受－被保険者カナ   TO 作１－被保険者カナ 作１－被保険者カナデータ.
008940     MOVE 受－患者カナ       TO 作１－患者カナ.
008950*
008960     IF 受－費用負担者番号助成(1:2) NOT = "99"
008970        MOVE 受－費用負担者番号助成  TO 保険者番号Ｗ
008980        PERFORM 保険者番号右詰め
008990        MOVE 保険者番号数字Ｗ   TO 作１－費用負担者番号助成
009000     END-IF.
009010*
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
      *-----------------------------------------------------------------*
009020*     IF ( 受－番号(1:1) = "*"  ) OR
009030*        ( 受－番号(1:2) = "＊" )
009020     IF ( 連暗号複合－複合した番号(1:1) = "*"  ) OR
009030        ( 連暗号複合－複合した番号(1:2) = "＊" )
009040        MOVE SPACE           TO 作１－番号
009050        INSPECT 作１－番号  REPLACING ALL 半角空白 BY 全角空白
009060     ELSE
009070***        MOVE 受－番号           TO 作１－番号
009080        PERFORM 番号全角取得
009090        MOVE 番号Ｗ          TO 作１－番号
009100     END-IF.
009110*
009120*     IF 受－記号(1:2)  = "＊" 
009120     IF 連暗号複合－複合した記号(1:2)  = "＊" 
009130        MOVE SPACE              TO 作１－記号
009140*        INSPECT 作１－記号  REPLACING ALL 半角空白 BY 全角空白
009150     ELSE
009160        PERFORM 記号左詰め
009170        MOVE 記号Ｗ             TO 作１－記号
009180     END-IF.
009190*
009200     MOVE レセ－合計           TO 作１－費用額.
009210     MOVE レセ－請求金額       TO 作１－請求額.
009220     MOVE レセ－助成請求金額   TO 作１－助成請求額.
009230*
009240     PERFORM 保険者名称取得.
009250     MOVE 保険者名称Ｗ       TO 作１－保険者名称.
009260*
009270*
009280* 14/10追加
009290     PERFORM 西暦患者年月日取得.
009300     MOVE 西暦患者年月日Ｗ   TO 作１－患者生年月日.
009310*
009320****************************************************
009330* 転記なし
009340*         05  作１－委任区分              PIC 9.
009350*         05  作１－地域区分              PIC 9.
009360*         05  作１－加入区分              PIC 9.
009370*         05  作１－請求フラグ            PIC 9.
009380*================================================================*
009390 作１レコードセット老人助成 SECTION.
009400*
009410**********/  老人助成あり(27身障etc)  /**********
009420*
009430     MOVE SPACE TO 作１－レコード.
009440     INITIALIZE 作１－レコード.
009450     MOVE レセ－請求和暦     TO 作１－請求和暦.
009460     MOVE レセ－請求年       TO 作１－請求年.
009470     MOVE レセ－請求月       TO 作１－請求月.
009480     MOVE 受－施術和暦       TO 作１－施術和暦.
009490     MOVE 受－施術年         TO 作１－施術年.
009500     MOVE 受－施術月         TO 作１－施術月.
009510     MOVE 受－患者コード     TO 作１－患者コード.
009520     MOVE 会員番号数字Ｗ     TO 作１－会員番号.
009530     MOVE 受－本人家族区分   TO 作１－本人家族区分.
009540     MOVE 1                  TO 作１－続柄.
009541     IF 受－保険種別 = 05
009542        MOVE ZERO            TO 作１－老人
009543     ELSE
009544        MOVE 1               TO 作１－老人
009545     END-IF.
009560*
009570     PERFORM 保険種別取得.
009580*
009590     MOVE 1                  TO 作１－助成区分.
009600     MOVE 負－部位数         TO 作１－部位数
009610     MOVE レセ－レセ実日数   TO 作１－実日数
009620*
009630     MOVE 受－費用負担者番号 TO 保険者番号Ｗ.
009640     PERFORM 保険者番号右詰め.
009650     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号.
009660*
009670     MOVE 西暦請求年月Ｗ     TO 作１－請求年月データ.
009680     PERFORM 西暦施術年月取得.
009690     MOVE 西暦施術年月Ｗ     TO 作１－施術年月データ.
009700*
009710     MOVE 受－被保険者カナ   TO 作１－被保険者カナ.
009720* 老人は、患者カナ
009730     MOVE 受－患者カナ       TO 作１－被保険者カナデータ.
009740     MOVE 受－患者カナ       TO 作１－患者カナ.
009750*
009760     IF 受－費用負担者番号助成(1:2) NOT = "99"
009770        MOVE 受－費用負担者番号助成  TO 保険者番号Ｗ
009780        PERFORM 保険者番号右詰め
009790        MOVE 保険者番号数字Ｗ   TO 作１－費用負担者番号助成
009800     END-IF.
009810*
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
      *-----------------------------------------------------------------*
009820*     IF ( 受－番号(1:1) = "*"  ) OR
009830*        ( 受－番号(1:2) = "＊" )
009820     IF ( 連暗号複合－複合した番号(1:1) = "*"  ) OR
009830        ( 連暗号複合－複合した番号(1:2) = "＊" )
009840        MOVE SPACE           TO 作１－番号
009850        INSPECT 作１－番号  REPLACING ALL 半角空白 BY 全角空白
009860     ELSE
009870***        MOVE 受－番号           TO 作１－番号
009880        PERFORM 番号全角取得
009890        MOVE 番号Ｗ          TO 作１－番号
009900     END-IF.
009910*
009920*     IF 受－記号(1:2)  = "＊" 
009920     IF 連暗号複合－複合した記号(1:2)  = "＊" 
009930        MOVE SPACE              TO 作１－記号
009940*        INSPECT 作１－記号  REPLACING ALL 半角空白 BY 全角空白
009950     ELSE
009960        PERFORM 記号左詰め
009970        MOVE 記号Ｗ             TO 作１－記号
009980     END-IF.
009990*
010000     MOVE レセ－合計           TO 作１－費用額.
010010     MOVE レセ－請求金額       TO 作１－請求額.
010020     MOVE レセ－助成請求金額   TO 作１－助成請求額.
010030*
010040     PERFORM 市町村名称取得.
010050     MOVE 保険者名称Ｗ       TO 作１－保険者名称.
010060*
010070*
010080* 14/10追加
010090     PERFORM 西暦患者年月日取得.
010100     MOVE 西暦患者年月日Ｗ   TO 作１－患者生年月日.
010110*
010120****************************************************
010130* 転記なし
010140*         05  作１－委任区分              PIC 9.
010150*         05  作１－地域区分              PIC 9.
010160*         05  作１－加入区分              PIC 9.
010170*         05  作１－請求フラグ            PIC 9.
010180*================================================================*
010370 作１ファイル書込 SECTION.
010380*
010390     WRITE 作１－レコード
010400     INVALID KEY
010410         MOVE NC"作１"  TO ファイル名
010420         PERFORM エラー表示
010430     END-WRITE.
010440*================================================================*
010450 保険者番号右詰め SECTION.
010460*
010470     MOVE 保険者番号Ｗ    TO  保険者番号左詰めＷ.
010480     MOVE ZERO            TO  保険者番号右詰めＷ.
010490     MOVE ZERO            TO  保険者番号数字Ｗ.
010500*
010510     MOVE  9  TO  カウンタ.
010520*
010530     IF  保険者番号左詰めＷ１(8) NOT = SPACE
010540         COMPUTE カウンタ = カウンタ  -  1
010550         MOVE 保険者番号左詰めＷ１(8)  TO  保険者番号右詰めＷ１(カウンタ)
010560     END-IF.
010570     IF  保険者番号左詰めＷ１(7) NOT = SPACE
010580         COMPUTE カウンタ = カウンタ  -  1
010590         MOVE 保険者番号左詰めＷ１(7)  TO  保険者番号右詰めＷ１(カウンタ)
010600     END-IF.
010610     IF  保険者番号左詰めＷ１(6) NOT = SPACE
010620         COMPUTE カウンタ = カウンタ  -  1
010630         MOVE 保険者番号左詰めＷ１(6)  TO  保険者番号右詰めＷ１(カウンタ)
010640     END-IF.
010650     IF  保険者番号左詰めＷ１(5) NOT = SPACE
010660         COMPUTE カウンタ = カウンタ  -  1
010670         MOVE 保険者番号左詰めＷ１(5)  TO  保険者番号右詰めＷ１(カウンタ)
010680     END-IF.
010690     IF  保険者番号左詰めＷ１(4) NOT = SPACE
010700         COMPUTE カウンタ = カウンタ  -  1
010710         MOVE 保険者番号左詰めＷ１(4)  TO  保険者番号右詰めＷ１(カウンタ)
010720     END-IF.
010730     IF  保険者番号左詰めＷ１(3) NOT = SPACE
010740         COMPUTE カウンタ = カウンタ  -  1
010750         MOVE 保険者番号左詰めＷ１(3)  TO  保険者番号右詰めＷ１(カウンタ)
010760     END-IF.
010770     IF  保険者番号左詰めＷ１(2) NOT = SPACE
010780         COMPUTE カウンタ = カウンタ  -  1
010790         MOVE 保険者番号左詰めＷ１(2)  TO  保険者番号右詰めＷ１(カウンタ)
010800     END-IF.
010810     IF  保険者番号左詰めＷ１(1) NOT = SPACE
010820         COMPUTE カウンタ = カウンタ  -  1
010830         MOVE 保険者番号左詰めＷ１(1)  TO  保険者番号右詰めＷ１(カウンタ)
010840     END-IF.
010850*
010860     MOVE 保険者番号右詰めＷ TO 保険者番号数字Ｗ.
010870*
010880*================================================================*
010890 会員番号右詰め SECTION.
010900*
010910     MOVE 会員番号Ｗ      TO  会員番号左詰めＷ.
010920     MOVE ZERO            TO  会員番号右詰めＷ.
010930     MOVE ZERO            TO  会員番号数字Ｗ.
010940*
010950     MOVE  8  TO  カウンタ.
010960*
010970     IF  会員番号左詰めＷ１(7) NOT = SPACE
010980         COMPUTE カウンタ = カウンタ  -  1
010990         MOVE 会員番号左詰めＷ１(7)  TO  会員番号右詰めＷ１(カウンタ)
011000     END-IF.
011010     IF  会員番号左詰めＷ１(6) NOT = SPACE
011020         COMPUTE カウンタ = カウンタ  -  1
011030         MOVE 会員番号左詰めＷ１(6)  TO  会員番号右詰めＷ１(カウンタ)
011040     END-IF.
011050     IF  会員番号左詰めＷ１(5) NOT = SPACE
011060         COMPUTE カウンタ = カウンタ  -  1
011070         MOVE 会員番号左詰めＷ１(5)  TO  会員番号右詰めＷ１(カウンタ)
011080     END-IF.
011090     IF  会員番号左詰めＷ１(4) NOT = SPACE
011100         COMPUTE カウンタ = カウンタ  -  1
011110         MOVE 会員番号左詰めＷ１(4)  TO  会員番号右詰めＷ１(カウンタ)
011120     END-IF.
011130     IF  会員番号左詰めＷ１(3) NOT = SPACE
011140         COMPUTE カウンタ = カウンタ  -  1
011150         MOVE 会員番号左詰めＷ１(3)  TO  会員番号右詰めＷ１(カウンタ)
011160     END-IF.
011170     IF  会員番号左詰めＷ１(2) NOT = SPACE
011180         COMPUTE カウンタ = カウンタ  -  1
011190         MOVE 会員番号左詰めＷ１(2)  TO  会員番号右詰めＷ１(カウンタ)
011200     END-IF.
011210     IF  会員番号左詰めＷ１(1) NOT = SPACE
011220         COMPUTE カウンタ = カウンタ  -  1
011230         MOVE 会員番号左詰めＷ１(1)  TO  会員番号右詰めＷ１(カウンタ)
011240     END-IF.
011250*
011260     MOVE 会員番号右詰めＷ TO 会員番号数字Ｗ.
011270*
011280*================================================================*
011290 記号左詰め SECTION.
011300*
011310***** 記号の無駄なSPACEを取り除いて、左詰めにする。
011320     MOVE SPACE           TO  記号ＮＷ.
011330     MOVE SPACE           TO  記号元Ｗ.
011340     MOVE SPACE           TO  記号左詰めＷ.
011350*     MOVE 受－記号        TO  記号元Ｗ.
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
           MOVE 連暗号複合－複合した記号 TO 記号元Ｗ
      *
      *-----------------------------------------------------------------*
011360*
011370     MOVE  ZERO  TO  カウンタ２.
011380     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 12
011390          IF  記号元Ｗ１(カウンタ) NOT = SPACE
011400              COMPUTE カウンタ２ = カウンタ２  +  1
011410              MOVE 記号元Ｗ１(カウンタ)  TO  記号左詰めＷ１(カウンタ２)
011420          END-IF
011430     END-PERFORM.
020410*
020300     MOVE SPACE           TO  記号元ＸＷ.
020310     MOVE SPACE           TO  記号左詰めＸＷ.
020320     MOVE 記号左詰めＷ    TO  記号元ＸＷ.
020330*
020340     MOVE  ZERO  TO  カウンタ２.
020350     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 24
020360          IF  記号元ＸＷ１(カウンタ) NOT = SPACE
020370              COMPUTE カウンタ２ = カウンタ２  +  1
020380              MOVE 記号元ＸＷ１(カウンタ)  TO  記号左詰めＸＷ１(カウンタ２)
020390          END-IF
020400     END-PERFORM.
011440*
011450     MOVE 記号左詰めＸＷ    TO 記号ＮＷ.
011460*
011470*半角スペースを全角にかえる
011480*     INSPECT 記号Ｗ REPLACING ALL 半角空白 BY 全角空白.
011490*
011500*================================================================*
011510 保険種別取得 SECTION.
011520***********************************************************
011530* 親保険の保険種別をセットする
011540***********************************************************
011550* 中央保険種別:保険(マキシー保険種別)                     *
011560*    1:社保(02)                                           *
011570*    2:日雇(06)                                           *
011580*    3:船員(07)                                           *
011590*    4:組合(03)                                           *
011600*    5:共済(04)                                           *
011610*    5:自衛官(09)                                         *
011620*    6:国保(01)                                           *
011630*    7:退職(08)                                           *
011640*    8:後高(05)                                           *
011650***********************************************************
011660*
011670     EVALUATE 受－保険種別
011680* 国保
011690     WHEN 01
011700        MOVE 6 TO 作１－保険種別
011710* 社保
011720     WHEN 02
011730        MOVE 1 TO 作１－保険種別
011740* 組合
011750     WHEN 03
011760        MOVE 4 TO 作１－保険種別
011770* 共済
011780     WHEN 04
011790        MOVE 5 TO 作１－保険種別
011800* 共済
011810     WHEN 05
011820        MOVE 8 TO 作１－保険種別
011830* 日雇
011840     WHEN 06
011850        MOVE 2 TO 作１－保険種別
011860* 船員
011870     WHEN 07
011880        MOVE 3 TO 作１－保険種別
011890* 退職
011900     WHEN 08
011910        MOVE 7 TO 作１－保険種別
011920* 自衛官
011930     WHEN 09
011940        MOVE 5 TO 作１－保険種別
011950*
011960     WHEN OTHER
011970             MOVE SPACE                TO エラーメッセージＷ
011980             MOVE 受－患者コード       TO エラー患者コードＷ
011990             MOVE 受－保険種別         TO エラー保険種別Ｗ
012000             MOVE "-"                  TO エラー区切りＷ
012010             MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
012020             MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
012030             CALL   "MSG003"
012040             CANCEL "MSG003"
012050     END-EVALUATE.
012060*
012070*================================================================*
012080 西暦施術年月取得 SECTION.
012090* 
012100     MOVE ZERO          TO 西暦年月Ｗ  西暦施術年月Ｗ.
012110     MOVE 受－施術和暦  TO 元－元号区分.
012120     READ 元号マスタ
012130     NOT INVALID KEY
012140         MOVE 元－開始西暦年 TO 西暦年Ｗ
012150     END-READ.
012160**
012170     IF 西暦年Ｗ = ZERO
012180          MOVE  NC"元号マスタに開始西暦年を登録して下さい" TO 連メ－メッセージ
012190          CALL   "MSG001"
012200          CANCEL "MSG001"
012210          PERFORM ファイル閉鎖
012220          MOVE 99 TO PROGRAM-STATUS
012230          EXIT PROGRAM
012240     ELSE
012250          COMPUTE 西暦年Ｗ = 西暦年Ｗ + 受－施術年 - 1
012260          MOVE 受－施術月 TO 西暦月Ｗ
012270     END-IF.
012280*
012290     MOVE 西暦年月Ｗ   TO  西暦施術年月Ｗ.
012300*
012310*================================================================*
012320 西暦患者年月日取得 SECTION.
012330* 
012340* 14/10追加
012350     MOVE ZERO          TO 西暦患者年月日Ｗ.
012360     MOVE 受－患者和暦  TO 元－元号区分.
012370     READ 元号マスタ
012380     NOT INVALID KEY
012390          COMPUTE 西暦患者年Ｗ = 元－開始西暦年 + 受－患者年 - 1
012400          MOVE 受－患者月 TO 西暦患者月Ｗ
012410          MOVE 受－患者日 TO 西暦患者日Ｗ
012420     END-READ.
012430*
012440*================================================================*
012450 保険者名称取得 SECTION.
012460*
012470     MOVE SPACE          TO 保険者名称Ｗ.
012480     MOVE 受－保険種別   TO 保－保険種別.
012490     MOVE 受－保険者番号 TO 保－保険者番号.
012500     READ 保険者マスタ
012510     INVALID KEY
012520         MOVE SPACE      TO 保険者名称Ｗ
012530     NOT INVALID KEY
012540* 社保・日雇は「社会保険事務所」をつける
012550                 EVALUATE 受－保険種別 
012560                 WHEN  02
012570                 WHEN  06
012580                     STRING 保－保険者名称       DELIMITED BY SPACE
012590                           "社会保険事務所"      DELIMITED BY SIZE
012600                           INTO 保険者名称Ｗ
012610                     END-STRING
012620** 組合・共済は支部名をつける
012630                 WHEN  03
012640                     STRING 保－保険者名称  DELIMITED BY SPACE
012650                            "健康保険組合"  DELIMITED BY SIZE
012660                            保－支部部署名  DELIMITED BY SPACE
012670                           INTO 保険者名称Ｗ
012680                     END-STRING
012690                 WHEN  04
012700                     STRING 保－保険者名称  DELIMITED BY SPACE
012710                            保－支部部署名  DELIMITED BY SPACE
012720                           INTO 保険者名称Ｗ
012730                     END-STRING
012740                 WHEN OTHER
012750                     MOVE 保－保険者名称   TO 保険者名称Ｗ
012760                 END-EVALUATE
012770     END-READ.
012780*
012790*半角スペースを全角にかえる
012800     INSPECT 保険者名称Ｗ REPLACING ALL 半角空白 BY 全角空白.
012810*
012820*================================================================*
012830 市町村名称取得 SECTION.
012840*
012850     MOVE SPACE              TO 保険者名称Ｗ.
012860     MOVE 受－公費種別       TO 市－公費種別.
012870     MOVE 受－費用負担者番号 TO 市－市町村番号.
012880     READ 市町村マスタ
012890     INVALID KEY
012900         MOVE SPACE          TO 保険者名称Ｗ
012910     NOT INVALID KEY
012920         MOVE 市－市町村名称 TO 保険者名称Ｗ
012930     END-READ.
012940*
012950*半角スペースを全角にかえる
012960     INSPECT 保険者名称Ｗ REPLACING ALL 半角空白 BY 全角空白.
012970*
012980*================================================================*
012990 番号全角取得 SECTION.
013000*
013010***** 番号を全角にする。*******************************
013020* カウンタ　：元の半角の番号１バイトの位置
013030* カウンタ２：文字変換テーブルの１バイトの位置
013040* カウンタ３：全角変換後の文字１バイトの位置
013050*******************************************************
013060* 漢字コード  X"81" ～ X"9F" と X"E0" ～ X"FC" 
013070*******************************************************
013080*
013090     STRING  半角文字１Ｗ    DELIMITED BY SPACE
013100             半角文字２Ｗ    DELIMITED BY SPACE
013110             INTO 半角文字合成Ｗ
013120     END-STRING.
013130     STRING  全角文字１Ｗ    DELIMITED BY SPACE
013140             全角文字２Ｗ    DELIMITED BY SPACE
013150             INTO 全角文字合成Ｗ
013160     END-STRING.
013170*
013180     MOVE SPACE           TO  番号元Ｗ 番号全角Ｗ 番号Ｗ.
013190*     MOVE 受－番号        TO  番号元Ｗ.
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
           MOVE 連暗号複合－複合した番号 TO 番号元Ｗ.
      *
      *-----------------------------------------------------------------*
013200*
013210     MOVE 1  TO  カウンタ３.
013220     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 20
013230         IF 番号元Ｗ１(カウンタ) NOT = SPACE
013240            PERFORM VARYING カウンタ２ FROM 1 BY 1 UNTIL カウンタ２ > 90
013250               IF 番号元Ｗ１(カウンタ) =  半角文字１Ｗ１(カウンタ２)
013260                  MOVE 全角文字１Ｗ１(カウンタ２)  TO  番号全角Ｗ１(カウンタ３)
013270               END-IF
013280            END-PERFORM
013290** 漢字の時、そのまま転記
013300            IF (( 番号元Ｗ１(カウンタ) >= X"81" ) AND ( 番号元Ｗ１(カウンタ) <= X"9F" ) 
013310               OR
013320                ( 番号元Ｗ１(カウンタ) >= X"E0" ) AND ( 番号元Ｗ１(カウンタ) <= X"FC" )) 
013330               MOVE 番号元Ｗ(カウンタ : 2 )        TO  番号全角Ｗ１(カウンタ３)
013340               COMPUTE カウンタ   = カウンタ   + 1
013350            END-IF
013360            COMPUTE カウンタ３ = カウンタ３ + 1
013370         END-IF
013380     END-PERFORM.
013390*
013400     MOVE 番号全角Ｗ  TO  番号Ｗ.
013410
013420*半角スペースを全角にかえる
013430     INSPECT 番号Ｗ REPLACING ALL 半角空白 BY 全角空白.
013440*
013450*================================================================*
013460******************************************************************
013470 END PROGRAM YCH101.
013480******************************************************************
