000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YCH7132.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         カルテ裏印刷(複数月)　再生紙 
000100*         MED = YCH7130 YCH715P
      */複数月での長期理由の印刷はしない
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2018-02-13
000130 DATE-COMPILED.          2018-02-13
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000320     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000330                             ORGANIZATION             IS  INDEXED
000340                             ACCESS MODE              IS  DYNAMIC
000350                             RECORD KEY               IS  制－制御区分
000360                             FILE STATUS              IS  状態キー
000370                             LOCK        MODE         IS  AUTOMATIC.
000380     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000390                             ORGANIZATION             IS  INDEXED
000400                             ACCESS MODE              IS  DYNAMIC
000410                             RECORD KEY               IS  受－施術和暦年月
000420                                                          受－患者コード
000430                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000440                                                          受－患者カナ
000450                                                          受－患者コード
000460                             ALTERNATE RECORD KEY     IS  受－患者コード
000470                                                          受－施術和暦年月
000480                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000490                                                          受－保険種別
000500                                                          受－保険者番号
000510                                                          受－患者コード
000520                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000530                                                          受－公費種別
000540                                                          受－費用負担者番号
000550                                                          受－患者コード
000560                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000570                                                          受－助成種別
000580                                                          受－費用負担者番号助成
000590                                                          受－患者コード
000600                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000610                                                          受－施術和暦年月
000620                                                          受－患者コード
000630                             FILE STATUS              IS  状態キー
000640                             LOCK        MODE         IS  AUTOMATIC.
000293     SELECT  長期継続者Ｆ    ASSIGN      TO        CHOKEIL
000294                             ORGANIZATION             IS INDEXED
000295                             ACCESS MODE              IS DYNAMIC
000296                             RECORD KEY               IS  長継－施術和暦年月
000297                                                          長継－患者コード
000298                             ALTERNATE RECORD KEY     IS  長継－患者コード
000299                                                          長継－施術和暦年月
000300                             FILE STATUS              IS  状態キー
000301                             LOCK      MODE           IS  AUTOMATIC.
000530     SELECT  作業ファイル１  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7131L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作１－施術和暦年月日
000610                                                          作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－施術和暦年月日
                                                                作１－患者カナ
                                                                作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－患者コード
                                                                作１－施術和暦年月日
000910                             ALTERNATE RECORD KEY     IS  作１－患者カナ
                                                                作１－患者コード
                                                                作１－施術和暦年月日
000620                             FILE        STATUS       IS  状態キー
000630                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  作業ファイル２  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7132L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作２－施術和暦年月
000610                                                          作２－患者コード
000910                             ALTERNATE RECORD KEY     IS  作２－患者コード
                                                                作２－施術和暦年月
000620                             FILE        STATUS       IS  状態キー
000630                             LOCK        MODE         IS  AUTOMATIC.
      */枝番有りチェック用
000970     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W7133L.DAT"
000980                             ORGANIZATION             IS  INDEXED
000990                             ACCESS                   IS  DYNAMIC
001000                             RECORD      KEY    IS        作３－患者番号
                                                                作３－施術和暦年月
001010                             FILE        STATUS       IS  状態キー
001020                             LOCK        MODE         IS  AUTOMATIC.
000920     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF002
000930                             SYMBOLIC    DESTINATION  IS "PRT"
000940                             FORMAT                   IS  定義体名Ｐ
000950                             GROUP                    IS  項目群名Ｐ
000960                             PROCESSING  MODE         IS  処理種別Ｐ
000970                             UNIT        CONTROL      IS  拡張制御Ｐ
000980                             FILE        STATUS       IS  通知情報Ｐ.
000990******************************************************************
001000*                      DATA DIVISION                             *
001010******************************************************************
001020 DATA                    DIVISION.
001030 FILE                    SECTION.
001070*                           ［ＲＬ＝  ２５６］
001080 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001090     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001090     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
001100*                           ［ＲＬ＝  ３２０］
001110 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001120     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
000686*                           ［ＲＬ＝  １２８］
000687 FD  長期継続者Ｆ          BLOCK   CONTAINS   1   RECORDS.
000688     COPY CHOKEI          OF  XFDLIB  JOINING   長継   AS  PREFIX.
001340*                         ［ＲＬ＝  ３８４］
001350 FD  作業ファイル１ RECORD  CONTAINS 384 CHARACTERS.
001020 01 作１－レコード.
001030    03 作１－レコードキー.
001040       05  作１－施術和暦年月日.
001050          07 作１－施術和暦               PIC 9.
001060          07 作１－施術年月.
001070             09 作１－施術年              PIC 9(2).
001080             09 作１－施術月              PIC 9(2).
001090          07 作１－施術日                 PIC 9(2).
001110       05 作１－患者コード.
001120          07 作１－患者番号               PIC 9(6).
001130          07 作１－枝番                   PIC X.
001100    03 作１－レコードデータ.
             05 作１－患者カナ                  PIC X(50).
001140* ＊＊＊　日毎＋部位毎データ　＊＊＊
001150       05  作１－日チェック               PIC 9.
001160       05  作１－部位データ               OCCURS 5.
001170           07  作１－部位計               PIC 9(5).
001180       05  作１－電罨料.
001190           07  作１－罨法金額             PIC 9(4).
001200           07  作１－電療金額             PIC 9(4).
001210       05  作１－一部負担金               PIC 9(5).
001210       05  作１－金属料                   PIC 9(4).
001210       05  作１－運動料                   PIC 9(3).
001551       05  作１－コメント                 PIC X(100).
             05 作１－初検                      PIC 9.
003280       05 作１－初診料.
003290          07 作１－初検料                 PIC 9(4).
003300          07 作１－初検加算料             PIC 9(4).
003310          07 作１－休日                   PIC 9.
003320          07 作１－深夜                   PIC 9.
003330          07 作１－時間外                 PIC 9.
             05 作１－相談料                    PIC 9(4).
003340       05 作１－再検料                    PIC 9(4).
003350       05 作１－初回処置                  OCCURS 5.
003360          07 作１－初回処置料             PIC 9(5).
003370       05 作１－施療料チェック            PIC N.
003380       05 作１－整復料チェック            PIC N.
003390       05 作１－固定料チェック            PIC N.
003400       05 作１－往療加算.
003410          07 作１－夜間                   PIC 9.
003420          07 作１－暴風                   PIC 9.
003430          07 作１－往療加算料             PIC 9(5).
003440          07 作１－距離                   PIC 9(3)V9.
003450       05 作１－往療料                    OCCURS 3.
003460          07 作１－月                     PIC 9(2).
003470          07 作１－回数                   PIC 9(2).
003480          07 作１－往療料金額             PIC 9(6).
003490       05 作１－金属大                    PIC 9.
003500       05 作１－金属中                    PIC 9.
003510       05 作１－金属小                    PIC 9.
003520       05 作１－金額                      PIC 9(6).
003530       05 作１－情報提供料                PIC 9(6).
001220       05  FILLER                         PIC X(43).
001230*
001340*                         ［ＲＬ＝  ６４］
001350 FD  作業ファイル２ RECORD  CONTAINS 64 CHARACTERS.
001360 01 作２－レコード.
001370    03 作２－レコードキー.
001535       05 作２－施術和暦年月.
001536          07 作２－施術和暦                PIC 9.
001537          07 作２－施術年月.
001538             09 作２－施術年               PIC 9(2).
001539             09 作２－施術月               PIC 9(2).
001460       05 作２－患者コード.
001470          07 作２－患者番号                PIC 9(6).
001480          07 作２－枝番                    PIC X(1).
001490    03 作２－レコードデータ.
             05 作２－月合計.
001551          07 作２－実日数                  PIC 9(2).
001551          07 作２－費用額                  PIC 9(7).
001551          07 作２－負担額                  PIC 9(6).
001551          07 作２－請求額                  PIC 9(7).
001500       05 FILLER                           PIC X(30).
      *
001580*                           ［ＲＬ＝  １６］
001590 FD  作業ファイル３ RECORD  CONTAINS 16 CHARACTERS.
001600 01 作３－レコード.
001610    03 作３－レコードキー.
001700       05 作３－患者番号                  PIC 9(6).
001620       05 作３－施術和暦年月.
001630          07 作３－施術和暦               PIC 9.
001640          07 作３－施術年月.
001650             09 作３－施術年              PIC 9(2).
001660             09 作３－施術月              PIC 9(2).
001680    03 作３－レコードデータ.
001720       05 作３－枝番Ｆ                    PIC 9.
             05 作３－保険変更Ｆ                PIC 9.
001520       05 FILLE                           PIC X(3).
001530*
001540 FD  印刷ファイル.
001550     COPY YCH715P        OF  XMDLIB.
001560*----------------------------------------------------------------*
001570******************************************************************
001580*                WORKING-STORAGE SECTION                         *
001590******************************************************************
001600 WORKING-STORAGE         SECTION.
001610 01 キー入力                           PIC X     VALUE SPACE.
001620 01 状態キー                           PIC X(2)  VALUE SPACE.
001630 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001640 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001640 01 終了フラグ３                       PIC X(3)  VALUE SPACE.
001650 01 初検フラグ                         PIC 9(1)  VALUE ZERO.
001650 01 脱出フラグ                         PIC X(3)  VALUE SPACE.
001660 01 ファイル名                         PIC N(6)  VALUE SPACE.
001670 01 レセプトＰＧＷ                     PIC X(8)  VALUE SPACE.
001680 01 前和暦Ｗ                           PIC 9     VALUE ZERO.
001690 01 カレント元号Ｗ                     PIC 9(1)  VALUE ZERO.
001700 01 印刷位置ＣＮＴ                     PIC 9(2)  VALUE ZERO.
001710 01 カウンタ                           PIC 9(2)  VALUE ZERO.
001720 01 部位ＣＮＴ                         PIC 9     VALUE ZERO.
001730 01 患者番号Ｗ                         PIC 9(6)  VALUE ZERO.
001210 01 オープンフラグ                     PIC X(3)   VALUE SPACE.
001210 01 メッセージＷ                       PIC X(240) VALUE SPACE.
002420 01 改頁確認Ｗ                         PIC 9(1) VALUE ZERO.
       01 改行Ｗ                             PIC X(2)  VALUE X"0D0A".
001740**
001750 01 遅延フラグ                         PIC X(3) VALUE SPACE.
001760 01 遅延回数Ｗ                         PIC 9(4) VALUE ZERO.
001770 01 遅延ＣＮＴ                         PIC 9(5) VALUE ZERO.
001740**
001060 01 施術和暦年月Ｗ.
001070    03 施術和暦Ｗ                    PIC 9(1) VALUE ZERO.
001080    03 施術年Ｗ                      PIC 9(2) VALUE ZERO.
001090    03 施術月Ｗ                      PIC 9(2) VALUE ZERO.
001870 01 終了和暦年月Ｗ.
001880    03 終了和暦Ｗ                    PIC 9(1)  VALUE ZERO.
001890    03 終了年Ｗ                      PIC 9(2)  VALUE ZERO.
001900    03 終了月Ｗ                      PIC 9(2)  VALUE ZERO.
001780**
      */長期理由文用ワーク↓↓↓0601
       01 長期理由文２Ｗ.
          03 長期理由文Ｗ PIC N(40) OCCURS 16 VALUE SPACE.
001201 01 番号カウンタ                       PIC 9(2) VALUE ZERO.
001329****
005080 01 月末日取得用Ｗ.
005090    03 請求終了日Ｗ                    PIC 9(2) VALUE ZERO.
005100    03 対象西暦Ｗ                      PIC 9(4) VALUE ZERO.
005110    03 商Ｗ                            PIC 9(3) VALUE ZERO.
005120    03 余Ｗ                            PIC 9(3) VALUE ZERO.
001329****
001330 01 長期負傷種別Ｗ                     PIC 9(2) VALUE ZERO.
001331 01 長期部位Ｗ                         PIC 9(2) VALUE ZERO.
001332 01 理由コードＷ                       PIC 9(3) VALUE ZERO.
001340 01 症状コードＷ                       PIC 9(2) VALUE ZERO.
001350 01 症状名Ｗ                           PIC N(4) VALUE SPACE.
001361 01 合成理由文Ｗ.
001369    03 長期番号Ｗ                      PIC X(2)   VALUE SPACE.
001360    03 理由文Ｗ                        PIC X(320) VALUE SPACE.
001362 01 長期行数Ｗ                         PIC 9(2)  VALUE ZERO.
001363 01 全角空白                           PIC X(2)  VALUE X"8140".
001364 01 半角空白                           PIC X(2)  VALUE X"2020".
001365***
001366*** 症状用
001367 01 症状Ｗ.
001368    03 症状内容Ｗ                      PIC N(29) VALUE SPACE.
001401** 適用２５文字用
001402 01 理由２５桁Ｗ.
001403    03 理由２５桁１Ｗ                  PIC X(50) VALUE SPACE.
001404    03 理由２５桁２Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁３Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁４Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁５Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁６Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁７Ｗ                  PIC X(50) VALUE SPACE.
001405    03 理由２５桁８Ｗ                  PIC X(50) VALUE SPACE.
001401** 適用３５文字用
001402 01 理由３５桁Ｗ.
001403    03 理由３５桁１Ｗ                  PIC N(35) VALUE SPACE.
001404    03 理由３５桁２Ｗ                  PIC N(35) VALUE SPACE.
001405    03 理由３５桁３Ｗ                  PIC N(35) VALUE SPACE.
001405    03 理由３５桁４Ｗ                  PIC N(35) VALUE SPACE.
001405    03 理由３５桁５Ｗ                  PIC N(35) VALUE SPACE.
001405    03 理由３５桁６Ｗ                  PIC N(35) VALUE SPACE.
001401** 適用４０文字レセプト用
001402 01 理由４０桁Ｗ.
001403    03 理由４０桁１Ｗ                  PIC N(40) VALUE SPACE.
001404    03 理由４０桁２Ｗ                  PIC N(40) VALUE SPACE.
001405    03 理由４０桁３Ｗ                  PIC N(40) VALUE SPACE.
001405    03 理由４０桁４Ｗ                  PIC N(40) VALUE SPACE.
001405    03 理由４０桁５Ｗ                  PIC N(40) VALUE SPACE.
      *
      */長期理由文用ワーク↑↑↑0601
001790*
001800****************
001810* 連結項目待避 *
001820****************
001830*    ************
001840*    * 印刷キー *
001850*    ************
001860 01 対象データＷＲ.
001870    03 開始和暦年月ＷＲ.
001880       05 開始和暦ＷＲ                  PIC 9(1)  VALUE ZERO.
001890       05 開始年ＷＲ                    PIC 9(2)  VALUE ZERO.
001900       05 開始月ＷＲ                    PIC 9(2)  VALUE ZERO.
001910    03 開始日ＷＲ                       PIC 9(2)  VALUE ZERO.
001870    03 終了和暦年月日ＷＲ.
001870       05 終了和暦年月ＷＲ.
001880          07 終了和暦ＷＲ               PIC 9(1)  VALUE ZERO.
001890          07 終了年ＷＲ                 PIC 9(2)  VALUE ZERO.
001900          07 終了月ＷＲ                 PIC 9(2)  VALUE ZERO.
001920       05 終了日ＷＲ                    PIC 9(2)  VALUE ZERO.
001990    03 患者カナＷＲ                     PIC X(50) VALUE SPACE.
002000    03 患者コードＷＲ.
002010       05 患者番号ＷＲ                  PIC 9(6)  VALUE ZERO.
002020       05 枝番ＷＲ                      PIC X(1)  VALUE SPACE.
002030    03 氏名モードＷＲ                   PIC 9(1)  VALUE ZERO.
002040    03 日ごとモードＷＲ                 PIC 9(1)  VALUE ZERO.
002090    03 コメントモードＷＲ               PIC 9(1)  VALUE ZERO.
002050    03 初検明細モードＷＲ               PIC 9(1)  VALUE ZERO.
002060    03 月合計モードＷＲ                 PIC 9(1)  VALUE ZERO.
002120    03 印字位置ＣＮＴ                   PIC 9(2)  VALUE ZERO.
002130    03 段数ＷＲ                         PIC 9(1)  VALUE ZERO.
002160*
002190**************
002200* 受診者情報 *
002210*************
002220 01 受診者情報Ｗ.
002230    03 施術和暦年月ＷＲ.
001070       05 施術和暦ＷＲ                 PIC 9(1) VALUE ZERO.
002240       05 施術年ＷＲ                   PIC 9(2)   VALUE ZERO.
002250       05 施術月ＷＲ                   PIC 9(2)   VALUE ZERO.
002260    03 保険者番号Ｗ                    PIC X(8)   VALUE SPACE.
002330    03 費用負担者番号助成Ｗ            PIC X(8)   VALUE SPACE.
002360    03 保険種別Ｗ                      PIC 9(2)   VALUE ZERO.
002360    03 助成種別Ｗ                      PIC 9(2)   VALUE ZERO.
002370    03 患者情報Ｗ.
002380       05 患者カナＷ                   PIC X(50)  VALUE SPACE.
002390       05 患者氏名Ｗ                   PIC X(50)  VALUE SPACE.
002400************
002410* 料金情報 *
002420************
001870 01 料金情報Ｗ.
001880    03 初検加算Ｗ.
001890       05 時間外チェックＷ                PIC N(1) VALUE SPACE.
001900       05 休日チェックＷ                  PIC N(1) VALUE SPACE.
001910       05 深夜チェックＷ                  PIC N(1) VALUE SPACE.
001920    03 往療加算Ｗ.
001930       05 夜間チェックＷ                  PIC N(1) VALUE SPACE.
001940       05 暴風チェックＷ                  PIC N(1) VALUE SPACE.
001950    03 往療距離ＷＲ                       PIC 9(3)V9 VALUE ZERO.
001960    03 往療料ＷＲ                         OCCURS 3.
001970       05 往療月ＷＲ                      PIC 9(2)  VALUE ZERO.
001980       05 往療回数ＷＲ                    PIC 9(2)  VALUE ZERO.
001990       05 往療料金ＷＲ                    PIC 9(6)  VALUE ZERO.
002000    03 往療加算料ＷＲ                     PIC 9(5)  VALUE ZERO.
002010    03 金属副子チェックＷ.
002020       05 大チェックＷ                    PIC N(1) VALUE SPACE.
002030       05 中チェックＷ                    PIC N(1) VALUE SPACE.
002040       05 小チェックＷ                    PIC N(1) VALUE SPACE.
002050    03 金属副子料ＷＲ                     PIC 9(5) VALUE ZERO.
002060    03 初検料ＷＲ                         PIC 9(4) VALUE ZERO.
002060    03 相談料ＷＲ                         PIC 9(4) VALUE ZERO.
002070    03 再検料ＷＲ                         PIC 9(4) VALUE ZERO.
002080    03 初検加算料ＷＲ                     PIC 9(4) VALUE ZERO.
002090    03 初回処置料ＷＲ                     PIC 9(5) OCCURS 5 VALUE ZERO.
002100    03 初回処置料チェックＷ.
002110       05 整復料チェックＷ                PIC N(1) VALUE SPACE.
002120       05 固定料チェックＷ                PIC N(1) VALUE SPACE.
002130       05 施療料チェックＷ                PIC N(1) VALUE SPACE.
002140    03 情報提供料ＷＲ                     PIC 9(6) VALUE ZERO.
002150 01 明細.
002160    03 罨法料Ｗ                           PIC 9(4) VALUE ZERO.
002170    03 電療料Ｗ                           PIC 9(4) VALUE ZERO.
002180    03 一部負担金Ｗ                       PIC 9(5) VALUE ZERO.
002190    03 部位Ｗ                             OCCURS 5.
002200       05 部位計Ｗ                        PIC 9(5) VALUE ZERO.
002210       05 日数Ｗ                          PIC 9(2) VALUE ZERO.
002520    03 コメントＷ.
002530       05 コメント１Ｗ                    PIC X(50) VALUE SPACE.
002540       05 コメント２Ｗ                    PIC X(50) VALUE SPACE.
002550*******************************************************************
002560 01 印刷制御.
002570     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
002580     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
002590     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
002600     03 拡張制御Ｐ.
002610         05 端末制御Ｐ.
002620             07 移動方向Ｐ             PIC X(1) VALUE SPACE.
002630             07 移動行数Ｐ             PIC 9(3) VALUE ZERO.
002640         05 詳細制御Ｐ                 PIC X(2) VALUE SPACE.
002650     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
002660     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
002670*
002680 01 計算機西暦年Ｗ                     PIC 9(2) VALUE ZERO.
002690* 日付ＷＯＲＫ
002700 01 和暦終了年Ｗ                       PIC 9(4) VALUE ZERO.
002710 01 計算機西暦.
002720    03 計算機西暦年                    PIC 9(4) VALUE ZERO.
002730    03 計算機西暦月日                  PIC 9(4) VALUE ZERO.
002740 01 計算機西暦Ｒ REDEFINES 計算機西暦.
002750    03 計算機世紀                      PIC 9(2).
002760    03 計算機日付                      PIC 9(6).
002770    03 計算機日付Ｒ REDEFINES 計算機日付.
002780       05 計算機年月                   PIC 9(4).
002790       05 計算機年月Ｒ REDEFINES 計算機年月.
002800         07 計算機年                   PIC 9(2).
002810         07 計算機月                   PIC 9(2).
002820       05 計算機日                     PIC 9(2).
002280*
001831* POWER COBOL用
001832 01 dll-name  PIC X(260)  VALUE SPACE.
001833 01 form-name PIC X(14)   VALUE SPACE.
002830*
002840******************************************************************
002850*                          連結項目                              *
002860******************************************************************
002870************
002880* 印刷キー *
002890************
       01 連印－対象データＹＣＨ７１３０ IS EXTERNAL GLOBAL.
          03 連印－施術和暦年月.
             05 連印－施術和暦                  PIC 9(1).
             05 連印－施術年                    PIC 9(2).
             05 連印－施術月                    PIC 9(2).
          03 連印－患者コード.
             05 連印－患者番号                  PIC 9(6).
             05 連印－枝番                      PIC X(1).
          03 連印－氏名モード                   PIC 9(1).
          03 連印－明細モード                   PIC 9(1).
          03 連印－コメントモード               PIC 9(1).
          03 連印－初検明細モード               PIC 9(1).
          03 連印－月合計モード                 PIC 9(1).
          03 連印－月合計段数                   PIC 9(1).
          03 連印－読み順                       PIC X(4).
          03 連印－段数                         PIC 9(2).
          03 連印－処理キー                     PIC X(4).
003620*
003140****************
003150* 画面入力情報 *
003160****************
       01 連入－入力データＹＣＨ７１３０ IS EXTERNAL GLOBAL.
          03 連入－開始和暦年月日.
             05 連入－開始和暦                  PIC 9(1).
             05 連入－開始年                    PIC 9(2).
             05 連入－開始月                    PIC 9(2).
             05 連入－開始日                    PIC 9(2).
          03 連入－終了和暦年月日.
             05 連入－終了和暦                  PIC 9(1).
             05 連入－終了年                    PIC 9(2).
             05 連入－終了月                    PIC 9(2).
             05 連入－終了日                    PIC 9(2).
          03 連入－保険種別                     PIC 9(2).
          03 連入－本人家族区分                 PIC 9(1).
          03 連入－患者コード.
             05 連入－患者番号                  PIC 9(6).
             05 連入－枝番                      PIC X(1).
          03 連入－印刷条件                     PIC 9(2).
      *
       01 連入－表示フラグＹＣＨ７１３０ IS EXTERNAL.
          03 連入－プレビュー区分              PIC 9(1).
003480*
003490**********************
003500* メッセージ表示キー *
003510**********************
003520 01 連メ－キー IS EXTERNAL.
003530    03  連メ－メッセージ                 PIC N(20).
003540*
       01 連メッセージＰ情報００５１ IS EXTERNAL.
          03 連メＰ－メッセージ番号       PIC 9(2).
          03 連メＰ－メッセージ.
             05 連メＰ－メッセージ内容    PIC X(40) OCCURS 6.
          03 連メＰ－メッセージ１         PIC X(20).
          03 連メＰ－メッセージ２         PIC X(12).
          03 連メＰ－返り値               PIC X.
003540*
       01 連ＰＣメッセージ情報 IS EXTERNAL.
          03 連ＰＣメ－メッセージ内容      PIC X(240).
003554*
000540************************************
000550* プリンタファイル作成用           *
000560************************************
000570 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
000580     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
000590     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
000600     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
000610     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
000993************************************
000994* プリンタファイル作成特殊用       *
000995************************************
000996 01 Ｈ連特殊ＰＲＴＦ－作成データ IS EXTERNAL.
000997     03 Ｈ連特殊ＰＲＴＦ－用紙種類         PIC X(8).
003555*
003560******************************************************************
003570*                      PROCEDURE  DIVISION                       *
003580******************************************************************
003590 PROCEDURE               DIVISION.
003600************
003610*           *
003620* 初期処理   *
003630*           *
003640************
002570     PERFORM プリンタファイル作成.
003650     PERFORM 初期化.
003660     PERFORM 制御情報取得.
003670************
003680*           *
003690* 主処理     *
003700*           *
003710************
003720* 印刷
003730     PERFORM 連結項目待避.
           MOVE "YES"             TO 終了フラグ.
003770     PERFORM 印刷セット.
003790     PERFORM 印刷処理.
003800************
003810*           *
003820* 終了処理   *
003830*           *
003840************
003850     PERFORM 終了処理.
003860     PERFORM 遅延処理.
003870     EXIT PROGRAM.
003880*
003890*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002860*================================================================*
002870 プリンタファイル作成 SECTION.
002880*================================================================*
002890*   / 初期化 /
002900     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
002910     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
002225     MOVE SPACE TO Ｈ連特殊ＰＲＴＦ－作成データ.
002226     INITIALIZE Ｈ連特殊ＰＲＴＦ－作成データ.
002920*
002930*
002940*--↓↓ 変更箇所 ↓↓--------------------------------------*
002230*   使用する用紙種別セット
           MOVE "KARUTE"              TO Ｈ連特殊ＰＲＴＦ－用紙種類.
002970*   使用するプリンタファイル名セット
002231     MOVE "PRTF002"             TO Ｈ連ＰＲＴＦ－ファイル名.
002972*
002973*   使用する帳票プログラム名セット
002974     MOVE "YCH715"              TO Ｈ連ＰＲＴＦ－帳票プログラム名.
002975*
002976*--↑↑-----------------------------------------------------*
002980*
002990*   / プレビュー区分セット /
003000     MOVE 連入－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003010*
003020     CALL   "CRTPRTF".
003030     CANCEL "CRTPRTF".
003040*
003900*================================================================*
003910 初期化 SECTION.
003920*
003930     PERFORM ファイルオープン.
003940*    /* 現在日付取得 */
003950     ACCEPT 計算機日付 FROM DATE.
003960*    /* 1980～2079年の間で設定 */
003970     IF 計算機年 > 80
003980         MOVE 19 TO 計算機世紀
003990     ELSE
004000         MOVE 20 TO 計算機世紀
004010     END-IF.
004040     COMPUTE 計算機西暦年Ｗ = 計算機西暦年 - 1988.
004450*================================================================*
004460 ファイルオープン SECTION.
004470*
004510     OPEN INPUT   制御情報マスタ
004520         MOVE NC"制御情報" TO ファイル名.
004530         PERFORM オープンチェック.
004540     OPEN INPUT   受診者情報Ｆ.
004550         MOVE NC"受情" TO ファイル名.
004560         PERFORM オープンチェック.
002650     OPEN INPUT   長期継続者Ｆ.
002651         MOVE NC"長期継続者Ｆ" TO ファイル名.
002652         PERFORM オープンチェック.
004630*     OPEN I-O   印刷ファイル
004640*         PERFORM エラー処理Ｐ.
004650*================================================================*
004660 オープンチェック SECTION.
004670*
004680     IF 状態キー  NOT =  "00"
004690         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004700         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004710         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004720                                                 UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
004730         ACCEPT  キー入力 FROM CONS
004740         PERFORM ファイル閉鎖
004750         EXIT PROGRAM.
004760*================================================================*
004770 制御情報取得 SECTION.
004780*
004790     MOVE ZERO TO 制－制御区分
004800     READ 制御情報マスタ
004810     NOT INVALID KEY
004820         MOVE 制－遅延回数       TO 遅延回数Ｗ
004830     END-READ.
004840*
004850*================================================================*
004860 遅延処理 SECTION.
004870*
004880     PERFORM VARYING 遅延ＣＮＴ FROM 1 BY 1
004890                                UNTIL 遅延ＣＮＴ > 遅延回数Ｗ
004900         MOVE SPACE TO 遅延フラグ
004910     END-PERFORM.
004920*
004930*================================================================*
004940 連結項目待避 SECTION.
004950*
004960     MOVE 連入－開始和暦           TO 開始和暦ＷＲ 施術和暦ＷＲ 施術和暦Ｗ.
004970     MOVE 連入－開始年             TO 開始年ＷＲ 施術年ＷＲ 施術年Ｗ.
004980     MOVE 連入－開始月             TO 開始月ＷＲ 施術月ＷＲ 施術月Ｗ.
004990     MOVE 連入－開始日             TO 開始日ＷＲ.
004960     MOVE 連入－終了和暦           TO 終了和暦ＷＲ 終了和暦Ｗ.
004970     MOVE 連入－終了年             TO 終了年ＷＲ 終了年Ｗ.
004980     MOVE 連入－終了月             TO 終了月ＷＲ 終了月Ｗ.
005000     MOVE 連入－終了日             TO 終了日ＷＲ.
005010     MOVE 連入－患者番号           TO 患者番号ＷＲ.
005020     MOVE 連入－枝番               TO 枝番ＷＲ.
005150     MOVE 連印－氏名モード         TO 氏名モードＷＲ.
005040     MOVE 連印－明細モード         TO 日ごとモードＷＲ.
005090     MOVE 連印－コメントモード     TO コメントモードＷＲ.
005050     MOVE 連印－初検明細モード     TO 初検明細モードＷＲ.
005060     MOVE 連印－月合計モード       TO 月合計モードＷＲ.
005120     MOVE 連印－段数               TO 印刷位置ＣＮＴ.
005130     MOVE 連印－月合計段数         TO 段数ＷＲ.
      *
005160*================================================================*
005170 印刷セット SECTION.
005180*
004600     OPEN INPUT 作業ファイル１
004610         MOVE NC"作業１" TO ファイル名.
004620         PERFORM オープンチェック.
004600     OPEN INPUT 作業ファイル２
004610         MOVE NC"作業２" TO ファイル名.
004620         PERFORM オープンチェック.
004600     OPEN INPUT 作業ファイル３
004610         MOVE NC"作業３" TO ファイル名.
004620         PERFORM オープンチェック.
      *
005190     PERFORM 項目初期化.
005200     PERFORM 受診者情報取得.
005370     IF ( 日ごとモードＷＲ = 1 ) OR
005390        ( コメントモードＷＲ = 1 ) OR ( 初検明細モードＷＲ = 1 ) 
005400         PERFORM 印刷データセット
005410         PERFORM 印刷行数退避
           ELSE
005220         IF 氏名モードＷＲ = 1
                   PERFORM ヘッダセット
005360         END-IF
           END-IF.
005220     IF 月合計モードＷＲ = 1
               MOVE 終了和暦年月ＷＲ  TO 終了和暦年月Ｗ
               PERFORM 月合計セット２
005360     END-IF.
008670     CLOSE  作業ファイル１ 作業ファイル２ 作業ファイル３.
005460*================================================================*
005470 項目初期化 SECTION.
005480*
005500     INITIALIZE 料金情報Ｗ.
005510     MOVE SPACE TO YCH715P.
008200*================================================================*
008210 受診者情報取得 SECTION.
008220*
008230**************************************************
008240* 連結データから受診者情報Ｆより以下の情報を取得 *
008250* ● 施術年 ..... 施術年Ｗに格納                 *
008260* ● 施術月 ..... 施術月Ｗに格納                 *
008270* ● 患者番号.... 患者番号Ｗに格納※ＦＤ連番用   *
008280* ● 患者氏名 ....患者氏名Ｗに格納               *
008290**************************************************
008300     MOVE 施術和暦ＷＲ       TO 受－施術和暦.
008310     MOVE 施術年ＷＲ         TO 受－施術年.
008320     MOVE 施術月ＷＲ         TO 受－施術月.
008330     MOVE 患者コードＷＲ     TO 受－患者コード.
008340     READ 受診者情報Ｆ
008350     INVALID KEY
008360         CONTINUE
008370*            /* ありえない */
008380     NOT INVALID KEY
008420         MOVE 受－患者氏名     TO 患者氏名Ｗ
008430     END-READ.
005530*================================================================*
005540 印刷データセット SECTION.
005550*
           MOVE 1                  TO 初検フラグ.
           MOVE SPACE              TO 終了フラグ.
005560     MOVE 開始和暦ＷＲ       TO 作１－施術和暦.
005570     MOVE 開始年ＷＲ         TO 作１－施術年.
005580     MOVE 開始月ＷＲ         TO 作１－施術月.
005590     MOVE 開始日ＷＲ         TO 作１－施術日.
005590     MOVE 患者コードＷＲ     TO 作１－患者コード.
005600     START 作業ファイル１ KEY IS >= 作１－患者コード
                                          作１－施術和暦年月日
005610     END-START.
005620     IF 状態キー = "00"
005630         PERFORM 作業ファイル１読込
               MOVE 患者番号ＷＲ     TO 作３－患者番号
               MOVE 開始和暦年月ＷＲ TO 作３－施術和暦年月
008420         READ 作業ファイル３
               NOT INVALID KEY
                  IF (枝番ＷＲ = SPACE) AND (作３－枝番Ｆ = 1)
                     MOVE SPACE  TO  連メッセージＰ情報００５１
                     MOVE 10     TO  連メＰ－メッセージ番号
                     MOVE "枝番があります。"               TO 連メＰ－メッセージ内容(1)
                     MOVE "印刷してよろしければ［はい］を" TO 連メＰ－メッセージ内容(2)
                     MOVE "押してください。"               TO 連メＰ－メッセージ内容(3)
                     MOVE "PMSG0051.DLL"     TO dll-name
                     MOVE "PMSG0051"         TO form-name
                     CALL "POWEROPENSHEET" USING dll-name form-name
                     EVALUATE  連メＰ－返り値
                     WHEN "Y"
                         CONTINUE
                     WHEN OTHER
                         PERFORM 終了処理
005933                   PERFORM 遅延処理
005934                   EXIT PROGRAM
                     END-EVALUATE
                  END-IF
               END-READ
005220         IF 氏名モードＷＲ = 1
                   PERFORM ヘッダセット
005360         END-IF
005640         PERFORM UNTIL (作１－施術和暦年月日 > 終了和暦年月日ＷＲ) OR
                             (終了フラグ = "YES") OR
                             (作１－患者コード NOT = 患者コードＷＲ)
005640            PERFORM UNTIL (作１－施術和暦     NOT = 施術和暦ＷＲ) OR
                                (作１－施術年       NOT = 施術年ＷＲ) OR
                                (作１－施術月       NOT = 施術月ＷＲ) OR
                                (終了フラグ = "YES") OR
                                (作１－患者コード NOT = 患者コードＷＲ)
                     IF ( 作１－初検 = 1 ) AND (初検フラグ = ZERO)
                        STRING "初検があります。"                  DELIMITED BY SIZE
                               改行Ｗ                              DELIMITED BY SIZE
                               "初検の前まで印刷して中断します。"  DELIMITED BY SIZE
                          INTO メッセージＷ
                        END-STRING
005830                  MOVE SPACE  TO  連ＰＣメッセージ情報
                        MOVE メッセージＷ     TO 連ＰＣメ－メッセージ内容
004793                  MOVE "Pmsg001.DLL"    TO dll-name
004794                  MOVE "Pmsg001"        TO form-name
004795                  CALL "POWEROPENSHEET" USING dll-name form-name
005830                  MOVE SPACE            TO  メッセージＷ
005430                  IF 月合計モードＷＲ = 1
                           MOVE 施術和暦ＷＲ  TO 終了和暦Ｗ
                           MOVE 施術年ＷＲ    TO 終了年Ｗ
                           MOVE 施術月ＷＲ    TO 終了月Ｗ
                           PERFORM 月合計セット２
005450                  END-IF
005810                  PERFORM 印刷処理
005820                  PERFORM 改頁処理
                        PERFORM 印刷行数退避
005932                  PERFORM 終了処理
005933                  PERFORM 遅延処理
005934                  EXIT PROGRAM
                     END-IF
005470               IF 印刷位置ＣＮＴ > 31
005430                  IF 月合計モードＷＲ = 1
                           MOVE 施術和暦ＷＲ  TO 終了和暦Ｗ
                           MOVE 施術年ＷＲ    TO 終了年Ｗ
                           MOVE 施術月ＷＲ    TO 終了月Ｗ
                           PERFORM 月合計セット
005450                  END-IF
                        PERFORM 印刷処理
005820                  PERFORM 改頁処理
005510                  MOVE 1      TO 印刷位置ＣＮＴ
005510                  MOVE 1      TO 段数ＷＲ
005520                  MOVE SPACE  TO  連メ－キー
005530                  MOVE NC"新しい用紙をセットしてください" TO 連メ－メッセージ
005540                  CALL   "MSG001"
005550                  CANCEL "MSG001"
005900                  IF 氏名モードＷＲ = 1
                            PERFORM ヘッダセット
005930                  END-IF
005940               END-IF
005340               IF (日ごとモードＷＲ = 1) AND (作１－日チェック = 1)
005350                  MOVE 作１－施術月       TO 月(印刷位置ＣＮＴ)
005360                  MOVE "/"                TO スラッシュ(印刷位置ＣＮＴ)
005370                  MOVE 作１－施術日       TO 日(印刷位置ＣＮＴ)
005380                  MOVE 作１－部位計(1)    TO 後療１(印刷位置ＣＮＴ)
005390                  MOVE 作１－部位計(2)    TO 後療２(印刷位置ＣＮＴ)
005400                  MOVE 作１－部位計(3)    TO 後療３(印刷位置ＣＮＴ)
005410                  MOVE 作１－部位計(4)    TO 後療４(印刷位置ＣＮＴ)
005420                  MOVE 作１－部位計(5)    TO 後療５(印刷位置ＣＮＴ)
005430                  MOVE 作１－罨法金額     TO 冷罨温罨(印刷位置ＣＮＴ)
005440                  MOVE 作１－電療金額     TO 電療(印刷位置ＣＮＴ)
005450                  MOVE 作１－一部負担金   TO 一部負担金(印刷位置ＣＮＴ)
005440                  MOVE 作１－金属料       TO 金属副子(印刷位置ＣＮＴ)
                        IF 作１－金属料 NOT = ZERO
                           MOVE NC"金"          TO 金(印刷位置ＣＮＴ)
                        END-IF
005440                  MOVE 作１－運動料       TO 運動後療(印刷位置ＣＮＴ)
                        IF 作１－運動料 NOT = ZERO
                           MOVE NC"運"          TO 運(印刷位置ＣＮＴ)
                        END-IF
005450               END-IF
005340               IF コメントモードＷＲ = 1
005450                  MOVE 作１－コメント     TO コメントＷ
                        MOVE コメント１Ｗ       TO コメント１(印刷位置ＣＮＴ)
                        MOVE コメント２Ｗ       TO コメント２(印刷位置ＣＮＴ)
005450               END-IF
005460               COMPUTE 印刷位置ＣＮＴ = 印刷位置ＣＮＴ + 1
005340               IF (初検明細モードＷＲ = 1) AND (作１－初検 = 1)
                        PERFORM 初検明細セット
005450               END-IF
                     MOVE 0             TO 初検フラグ
007950               PERFORM 作業ファイル１読込
                  END-PERFORM
      */月途中変更があった場合終了
                  IF (作１－患者コード = 患者コードＷＲ) AND
                     ((作１－施術和暦 NOT = 施術和暦ＷＲ) OR
                      (作１－施術年   NOT = 施術年ＷＲ) OR
                      (作１－施術月   NOT = 施術月ＷＲ))
                     MOVE 患者番号ＷＲ       TO 作３－患者番号
                     MOVE 作１－施術和暦     TO 作３－施術和暦
                     MOVE 作１－施術年       TO 作３－施術年
                     MOVE 作１－施術月       TO 作３－施術月
008420               READ 作業ファイル３
                     NOT INVALID KEY
                        IF (作１－枝番 = SPACE) AND
                           ((作３－枝番Ｆ = 1) OR (作３－保険変更Ｆ = 1))
                           STRING "保険証内容が変更されています。"   DELIMITED BY SIZE
                                  改行Ｗ                             DELIMITED BY SIZE
                                  "確認してください。"               DELIMITED BY SIZE
                                  改行Ｗ                             DELIMITED BY SIZE
                                  "変更の前月まで印刷して中断します。"  DELIMITED BY SIZE
                             INTO メッセージＷ
                           END-STRING
005830                     MOVE SPACE  TO  連ＰＣメッセージ情報
                           MOVE メッセージＷ     TO 連ＰＣメ－メッセージ内容
004793                     MOVE "Pmsg001.DLL"    TO dll-name
004794                     MOVE "Pmsg001"        TO form-name
004795                     CALL "POWEROPENSHEET" USING dll-name form-name
005830                     MOVE SPACE            TO  メッセージＷ
                           MOVE "YES"            TO 終了フラグ
005430                     IF 月合計モードＷＲ = 1
                              MOVE 施術和暦ＷＲ  TO 終了和暦Ｗ
                              MOVE 施術年ＷＲ    TO 終了年Ｗ
                              MOVE 施術月ＷＲ    TO 終了月Ｗ
                              PERFORM 月合計セット２
005450                     END-IF
005810                     PERFORM 印刷処理
005820                     PERFORM 改頁処理
                           PERFORM 印刷行数退避
005932                     PERFORM 終了処理
005933                     PERFORM 遅延処理
005934                     EXIT PROGRAM
                        END-IF
                     END-READ
                     MOVE 作１－施術和暦      TO 施術和暦ＷＲ
                     MOVE 作１－施術年        TO 施術年ＷＲ
                     MOVE 作１－施術月        TO 施術月ＷＲ
                  END-IF
007960         END-PERFORM
007970     END-IF.
           IF 枝番ＷＲ NOT = SPACE
003970         MOVE  NC"印刷の続きがないか確認して下さい。" TO 連メ－メッセージ
013150         CALL   "MSG001"
013160         CANCEL "MSG001"
           END-IF.
007980*================================================================*
007990 ヘッダセット SECTION.
008000*
005230     MOVE 受－患者氏名         TO 患者氏名.
004900*================================================================*
004910 初検明細セット SECTION.
004920*
004860     MOVE 作１－初検料        TO  初検料.
           MOVE 作１－相談料        TO  相談料.
           IF 作１－相談料 NOT = ZERO
               MOVE "初検時相談支援料" TO  相談料Ｔ
               MOVE "円"               TO  相談料円
           END-IF.
           IF 作１－時間外 = 1
004870         MOVE NC"○"          TO  時間外チェック
           END-IF.
           IF 作１－休日 = 1
004880         MOVE NC"○"          TO  休日チェック
           END-IF.
           IF 作１－深夜 = 1
004890         MOVE NC"○"          TO  深夜チェック
           END-IF.
004900     MOVE 作１－初検加算料    TO  初検加算.
004910     MOVE 作１－再検料        TO  再検料.
           MOVE 作１－施療料チェック    TO  施療料チェック.
004890     MOVE 作１－整復料チェック    TO  整復料チェック.
004890     MOVE 作１－固定料チェック    TO  固定料チェック.
004950     MOVE 作１－初回処置料(1) TO  初回処置料(1).
004960     MOVE 作１－初回処置料(2) TO  初回処置料(2).
004970     MOVE 作１－初回処置料(3) TO  初回処置料(3).
004980     MOVE 作１－初回処置料(4) TO  初回処置料(4).
004990     MOVE 作１－初回処置料(5) TO  初回処置料(5).
005000     MOVE 作１－距離          TO  往療距離.
005010     MOVE 作１－月(1)         TO  往療月１.
005020     MOVE 作１－回数(1)       TO  往療回数１.
005030     MOVE 作１－往療料金額(1) TO  往療料１.
           IF 作１－夜間 = 1
004890         MOVE NC"○"          TO  夜間チェック
           END-IF.
           IF 作１－暴風 = 1
004890         MOVE NC"○"          TO  暴風チェック
           END-IF.
005060     MOVE 作１－往療加算料    TO  往療加算.
005070     MOVE 作１－情報提供料    TO  情報提供料.
           IF 施術和暦年月ＷＲ < 43006
               IF 作１－金属大 = 1
004890             MOVE NC"○"          TO  大チェック
               END-IF
               IF 作１－金属中 = 1
004890             MOVE NC"○"          TO  中チェック
               END-IF
               IF 作１－金属小 = 1
004890             MOVE NC"○"          TO  小チェック
               END-IF
005110         MOVE 作１－金額          TO  金属料
           END-IF.
007980*================================================================*
007990 月合計セット SECTION.
008000*
           MOVE 施術和暦年月Ｗ     TO 作２－施術和暦年月.
           MOVE 患者コードＷＲ     TO 作２－患者コード.
           START 作業ファイル２ KEY IS >= 作２－患者コード
                                          作２－施術和暦年月
           END-START.
005620     IF 状態キー = "00"
               MOVE SPACE  TO 終了フラグ２
               MOVE SPACE  TO 脱出フラグ
005630         PERFORM 作業ファイル２読込
005640         PERFORM UNTIL (終了フラグ２ = "YES") OR (脱出フラグ = "YES") OR
                             (作２－患者コード NOT = 患者コードＷＲ) OR
                             ((作２－施術和暦年月 = 終了和暦年月Ｗ))
                   IF 段数ＷＲ < 4
                       PERFORM 請求期間取得
                       PERFORM 月合計データセット
                   ELSE
                       MOVE 作２－施術和暦年月 TO 施術和暦年月Ｗ
                       MOVE "YES"  TO 脱出フラグ
                   END-IF
005630             PERFORM 作業ファイル２読込
               END-PERFORM
               IF 脱出フラグ = SPACE
                   MOVE 作２－施術和暦年月 TO 施術和暦年月Ｗ
               END-IF
005420     END-IF.
007980*================================================================*
007990 月合計セット２ SECTION.
008000*
           MOVE 施術和暦年月Ｗ     TO 作２－施術和暦年月.
           MOVE 患者コードＷＲ     TO 作２－患者コード.
           START 作業ファイル２ KEY IS >= 作２－患者コード
                                          作２－施術和暦年月
           END-START.
005620     IF 状態キー = "00"
               MOVE SPACE  TO 終了フラグ２
005630         PERFORM 作業ファイル２読込
005640         PERFORM UNTIL (終了フラグ２ = "YES") OR
                             (作２－患者コード NOT = 患者コードＷＲ) OR
                             ((終了フラグ = SPACE) AND (作２－施術和暦年月 = 終了和暦年月Ｗ)) OR
                             ((終了フラグ = "YES") AND (作２－施術和暦年月 > 終了和暦年月Ｗ))
                   IF 段数ＷＲ > 3
                       PERFORM 印刷処理
005820                 PERFORM 改頁処理
005510                 MOVE 1      TO 段数ＷＲ
005520                 MOVE SPACE  TO  連メ－キー
005530                 MOVE NC"新しい用紙をセットしてください" TO 連メ－メッセージ
005540                 CALL   "MSG001"
005550                 CANCEL "MSG001"
005900                 IF 氏名モードＷＲ = 1
                           PERFORM ヘッダセット
005930                 END-IF
                   END-IF
                   PERFORM 請求期間取得
                   PERFORM 月合計データセット
005630             PERFORM 作業ファイル２読込
               END-PERFORM
005420     END-IF.
007980*================================================================*
007990 月合計データセット SECTION.
008000*
021840     MOVE 作２－施術年 TO 金額行年       (段数ＷＲ).
021850     MOVE 作２－施術月 TO 金額行月       (段数ＷＲ).
021860     MOVE NC"年"       TO 金額行年表示   (段数ＷＲ).
021880     MOVE 作２－施術年 TO 提出年         (段数ＷＲ).
021890     MOVE 作２－施術月 TO 提出月         (段数ＷＲ).
021900     MOVE 請求終了日Ｗ TO 提出日         (段数ＷＲ).
021910     MOVE 作２－施術年 TO 請求開始年     (段数ＷＲ)
021920                          請求終了年     (段数ＷＲ).
021930     MOVE 作２－施術月 TO 請求開始月     (段数ＷＲ)
021940                          請求終了月     (段数ＷＲ).
021950     MOVE 1            TO 請求開始日     (段数ＷＲ).
021960     MOVE 請求終了日Ｗ TO 請求終了日     (段数ＷＲ).
021870     MOVE 作２－実日数 TO 実日数         (段数ＷＲ).
021970     MOVE 作２－費用額 TO 費用額         (段数ＷＲ).
021970     MOVE 作２－負担額 TO 負担額         (段数ＷＲ).
021970     MOVE 作２－請求額 TO 請求額         (段数ＷＲ).
           COMPUTE 段数ＷＲ = 段数ＷＲ + 1.
008140*
008390*================================================================*
008400 作業ファイル１読込 SECTION.
008410*
008420     READ 作業ファイル１ NEXT
008430     AT END
008440         MOVE "YES" TO 終了フラグ
008450     END-READ.
008460*
008390*================================================================*
008400 作業ファイル２読込 SECTION.
008410*
008420     READ 作業ファイル２ NEXT
008430     AT END
008440         MOVE "YES" TO 終了フラグ２
008450     END-READ.
008460*
008470*================================================================*
008480 印刷処理 SECTION.
008490*
004310     IF ( オープンフラグ NOT = "YES" )
004320        MOVE "YES" TO オープンフラグ
004330        OPEN I-O  印刷ファイル
004340        PERFORM エラー処理Ｐ
004350     END-IF.
007220*
006420     MOVE "YCH715P"  TO  定義体名Ｐ.
006430     MOVE "GRP001"   TO  項目群名Ｐ.
006440     MOVE SPACE      TO  処理種別Ｐ.
006450     MOVE SPACE      TO  拡張制御Ｐ.
006460     WRITE YCH715P.
006470     PERFORM エラー処理Ｐ.
006500*
006510     MOVE "YCH715P"  TO  定義体名Ｐ.
006520     MOVE "GRP002"   TO  項目群名Ｐ.
006530     MOVE SPACE      TO  処理種別Ｐ.
006540     MOVE SPACE      TO  拡張制御Ｐ.
006550     WRITE YCH715P.
006560     PERFORM エラー処理Ｐ.
      *
008560*================================================================*
008570 改頁処理  SECTION.
008580
006600     MOVE "YCH715P" TO  定義体名Ｐ.
006610     MOVE "CT"      TO  処理種別Ｐ.
006620     MOVE "PAGE"    TO  拡張制御Ｐ.
006630     MOVE SPACE     TO  項目群名Ｐ.
006640     WRITE YCH715P.
006650     PERFORM エラー処理Ｐ.
006660     MOVE SPACE     TO  拡張制御Ｐ.
005190     PERFORM 項目初期化.
008660*
008670     CLOSE  印刷ファイル.
004310     IF ( オープンフラグ = "YES" )
004320        MOVE SPACE TO オープンフラグ
004350     END-IF.
008680*     OPEN I-O   印刷ファイル.
008690*     PERFORM エラー処理Ｐ.
008700*
008940*================================================================*
008950 エラー処理Ｐ SECTION.
008960*
008970     IF 通知情報Ｐ NOT = "00"
008980         DISPLAY NC"帳票エラー"              UPON CONS
008990         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
009000         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
009010         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
009020         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
009030                                             UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
009040         ACCEPT  キー入力 FROM CONS
009050         PERFORM ファイル閉鎖
009060         MOVE 99 TO PROGRAM-STATUS
009070         EXIT PROGRAM
009080     END-IF.
009090*================================================================*
009100 ファイル閉鎖 SECTION.
009110*
002990     IF ( オープンフラグ = "YES" )
002991         CLOSE 印刷ファイル
003041     END-IF.
009130     CLOSE 制御情報マスタ   受診者情報Ｆ     長期継続者Ｆ.
009150*================================================================*
009160 終了処理 SECTION.
009170*
009180     PERFORM ファイル閉鎖.
009190*================================================================*
009200 印刷行数退避 SECTION.
009210*
009220     CLOSE 受診者情報Ｆ.
009230     PERFORM 遅延処理.
009240     OPEN I-O 受診者情報Ｆ.
009250         MOVE NC"受診" TO ファイル名.
009260         PERFORM オープンチェック.
009270     PERFORM 遅延処理.
009280*
009290     MOVE ZERO            TO 受－施術和暦.
009300     MOVE ZERO            TO 受－施術年.
009310     MOVE ZERO            TO 受－施術月.
009320     MOVE 患者番号ＷＲ    TO 受－患者番号.
009330     MOVE 枝番ＷＲ        TO 受－枝番.
009340*
009350     READ 受診者情報Ｆ
009360     NOT INVALID KEY
009370         MOVE 印刷位置ＣＮＴ TO 受－カルテ裏印刷行数
009380         REWRITE 受－レコード
009390         INVALID KEY
009400             MOVE NC"受Ｆ" TO ファイル名
009410             PERFORM エラー表示
009420         END-REWRITE
009430     END-READ.
009440     PERFORM 遅延処理.
009450     CLOSE 受診者情報Ｆ.
009460     PERFORM 遅延処理.
009470     OPEN INPUT 受診者情報Ｆ.
009480         MOVE NC"受診" TO ファイル名.
009490         PERFORM オープンチェック.
009500*
007980*================================================================*
007990 長期理由文セット SECTION.
008000*
           PERFORM 長期理由文取得.
           PERFORM VARYING カウンタ FROM 1 BY 1
                   UNTIL   カウンタ > 11
               MOVE 長期理由文Ｗ(カウンタ) TO 長期理由文(カウンタ)
           END-PERFORM.
007290*================================================================*
035270 長期理由文取得 SECTION.
003034     MOVE  ZERO   TO  カウンタ.
003034     MOVE  ZERO   TO  長期行数Ｗ.
035280*
004502     MOVE 施術和暦ＷＲ   TO 長継－施術和暦.
004503     MOVE 施術年ＷＲ     TO 長継－施術年.
004504     MOVE 施術月ＷＲ     TO 長継－施術月.
004505     MOVE 患者番号ＷＲ   TO 長継－患者番号.
004506     MOVE 枝番ＷＲ       TO 長継－枝番.
004507*
004508     READ 長期継続者Ｆ 
004509     INVALID KEY
                CONTINUE
004522     NOT INVALID KEY
004523         IF  (長継－理由文(1)  = SPACE )  AND
004524             (長継－理由文(2)  = SPACE )  AND
004525             (長継－理由文(3)  = SPACE )  AND
004526             (長継－理由文(4)  = SPACE )  AND
004527             (長継－理由文(5)  = SPACE )
                   CONTINUE
004535         ELSE
                   PERFORM 理由文セット
004537         END-IF
004538     END-READ.
035430*================================================================*
004541 理由文セット SECTION.
004542*
004543     PERFORM VARYING 番号カウンタ FROM 1 BY 1
004544             UNTIL   番号カウンタ  > 5 
004548*
004560         IF  長継－理由文(番号カウンタ) NOT = SPACE 
004561             PERFORM 番号転記
004595* 理由文
004598             MOVE 長継－理由文(番号カウンタ)  TO  理由文Ｗ
                   PERFORM 理由文分解４０桁
004631         END-IF
004632**
004637     END-PERFORM.
004647*
005590*================================================================*
005600 番号転記 SECTION.
005601*
005605      EVALUATE 番号カウンタ
005606      WHEN  1
005607          MOVE "①"  TO 長期番号Ｗ
005608      WHEN  2
005609          MOVE "②"  TO 長期番号Ｗ
005610      WHEN  3
005611          MOVE "③"  TO 長期番号Ｗ
005612      WHEN  4
005613          MOVE "④"  TO 長期番号Ｗ
005614      WHEN  5
005615          MOVE "⑤"  TO 長期番号Ｗ
005616      WHEN  OTHER
005617          CONTINUE
005618      END-EVALUATE.
005619*
005705*================================================================*
005706 理由文分解４０桁 SECTION.
005707**********
005708*** ４０桁
005709**********
005716* 合成した理由文を分割する。
005717     INITIALIZE 理由４０桁Ｗ.
005718     MOVE  合成理由文Ｗ  TO  理由４０桁Ｗ.
005945*半角スペースを全角にかえる(189ﾊﾞｲﾄより長いｴﾘｱに半角空白が入っているので)
005946     INSPECT 理由４０桁Ｗ REPLACING ALL 半角空白 BY 全角空白.
005719*
005720     IF  理由４０桁１Ｗ  NOT = SPACE
005721         COMPUTE カウンタ = カウンタ  +  1
005722         MOVE 理由４０桁１Ｗ  TO 長期理由文Ｗ(カウンタ)
005724     END-IF.
005725     IF  理由４０桁２Ｗ  NOT = SPACE
005726         COMPUTE カウンタ = カウンタ  +  1
005727         MOVE 理由４０桁２Ｗ  TO 長期理由文Ｗ(カウンタ)
005729     END-IF.
005730     IF  理由４０桁３Ｗ  NOT = SPACE
005731         COMPUTE カウンタ = カウンタ  +  1
005732         MOVE 理由４０桁３Ｗ  TO 長期理由文Ｗ(カウンタ)
005733     END-IF.
           IF  理由４０桁４Ｗ  NOT = SPACE
               COMPUTE カウンタ = カウンタ  +  1
               MOVE 理由４０桁４Ｗ  TO 長期理由文Ｗ(カウンタ)
           END-IF.
           IF  理由４０桁５Ｗ  NOT = SPACE
               COMPUTE カウンタ = カウンタ  +  1
               MOVE 理由４０桁５Ｗ  TO 長期理由文Ｗ(カウンタ)
           END-IF.
005734*
021810*================================================================*
022380  請求期間取得 SECTION.
022390*
022400     EVALUATE 作２－施術月
022410     WHEN 4
022420     WHEN 6
022430     WHEN 9
022440     WHEN 11
022450         MOVE 30 TO 請求終了日Ｗ
022460     WHEN 2
022470         COMPUTE 対象西暦Ｗ = 和暦終了年Ｗ + 作２－施術年
022480         DIVIDE 4 INTO 対象西暦Ｗ GIVING    商Ｗ
022490                                  REMAINDER 余Ｗ
022500         END-DIVIDE
022510         IF 余Ｗ = ZERO
022520             MOVE 29 TO 請求終了日Ｗ
022530         ELSE
022540             MOVE 28 TO 請求終了日Ｗ
022550         END-IF
022560     WHEN 1
022570     WHEN 3
022580     WHEN 5
022590     WHEN 7
022600     WHEN 8
022610     WHEN 10
022620     WHEN 12
022630         MOVE 31 TO 請求終了日Ｗ
022640     WHEN OTHER
022650         MOVE  NC"未知のエラー発生" TO 連メ－メッセージ
022660         CALL   "MSG001"
022670         CANCEL "MSG001"
022680     END-EVALUATE.
009850*================================================================*
009860 エラー表示 SECTION.
009870*
009880     DISPLAY ファイル名 NC"ファイル書込エラー"     UPON CONS.
009890     DISPLAY NC"状態キー：" 状態キー               UPON CONS.
009900     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
009910     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
009920     ACCEPT  キー入力 FROM CONS.
009930     PERFORM ファイル閉鎖.
009940     EXIT PROGRAM.
009950*================================================================*
009960******************************************************************
009970 END PROGRAM YCH7132.
009980******************************************************************
