000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAI582.
000060 AUTHOR.                 池田  幸子
000070*
000080*----------------------------------------------------------------*
000090*        【柔+ｳｨﾝﾄﾞｳｽﾞ版　各種保険取扱表】
000100*        【印刷】
000110*         MED = YAI580 YAI582P 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2013-06-27
000140 DATE-COMPILED.          2013-06-27
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000330     SELECT  施術所情報マスタ ASSIGN     TO        SEJOHOL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS  施情－施術所番号
000370                             FILE STATUS              IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000720     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5811L.DAT"
000730                             ORGANIZATION             IS  INDEXED
000740                             ACCESS                   IS  DYNAMIC
000750                             RECORD      KEY          IS  作１－保険種別
000780                                                          作１－県内外区分
000790                                                          作１－返戻区分
000800                             FILE        STATUS       IS  状態キー
000810                             LOCK        MODE         IS  AUTOMATIC.
000470     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000480                             ORGANIZATION             IS  INDEXED
000490                             ACCESS MODE              IS  DYNAMIC
000500                             RECORD KEY               IS  元－元号区分
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
000490     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF001
000500                             SAIBOLIC    DESTINATION  IS "PRT"
000510                             FORMAT                   IS  定義体名Ｐ
000520                             GROUP                    IS  項目群名Ｐ
000530                             PROCESSING  MODE         IS  処理種別Ｐ
000540                             UNIT        CONTROL      IS  拡張制御Ｐ
000550                             FILE        STATUS       IS  通知情報Ｐ.
000560******************************************************************
000570*                      DATA DIVISION                             *
000580******************************************************************
000590 DATA                    DIVISION.
000600 FILE                    SECTION.
000640*                           ［ＲＬ＝  ６４０］
000650 FD  施術所情報マスタ    BLOCK   CONTAINS   1   RECORDS.
000660     COPY SEJOHO         OF  XFDLIB  JOINING    施情 AS  PREFIX.
000670*
000970 FD  作業ファイル１ RECORD  CONTAINS 16 CHARACTERS.
000980 01  作１－レコード.
000990   03  作１－レコードキー.
001020     05  作１－保険種別                PIC 9(2).
001030     05  作１－県内外区分              PIC 9(1).
001040     05  作１－返戻区分                PIC 9(1).
001050   03  作１－レコードデータ.
001060     05  作１－件数                    PIC 9(3).
001070     05  作１－費用額                  PIC 9(7).
001080     05  FILLER                        PIC X(2).
002110*                           ［ＲＬ＝  １２８］
002120 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
002130     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
000800*
000810 FD  印刷ファイル.
000820     COPY YAI582P        OF  XMDLIB.
000830*
000840******************************************************************
000850*                WORKING-STORAGE SECTION                         *
000860******************************************************************
000870 WORKING-STORAGE         SECTION.
000880 01 キー入力                           PIC X    VALUE SPACE.
000890 01 状態キー                           PIC X(2) VALUE SPACE.
000900 01 終了フラグ                         PIC X(3) VALUE SPACE.
000910 01 終了フラグ２                       PIC X(3) VALUE SPACE.
000920 01 終了フラグ３                       PIC X(3) VALUE SPACE.
000940 01 ファイル名Ｗ                       PIC N(2) VALUE SPACE.
001210 01 オープンフラグ                     PIC X(3)   VALUE SPACE.
000960 01 実行キーＷ                         PIC X(4) VALUE SPACE.
001120 01 カウンタ                           PIC 9(2) VALUE ZERO.
001130 01 印刷枚数ＣＮＴ                     PIC 9(2) VALUE ZERO.
001140 01 総括表Ｗ.
001150    03 施術所住所Ｗ                    PIC X(50) VALUE SPACE.
001160    03 施術所住所１Ｗ                  PIC X(50) VALUE SPACE.
001170    03 施術所住所２Ｗ                  PIC X(50) VALUE SPACE.
001180    03 接骨院名Ｗ                      PIC X(50) VALUE SPACE.
001190    03 代表者名Ｗ                      PIC X(50) VALUE SPACE.
001200    03 代表者カナＷ                    PIC X(50) VALUE SPACE.
001210    03 施術所電話番号Ｗ                PIC X(15) VALUE SPACE.
001220    03 会員番号Ｗ                      PIC X(10) VALUE SPACE.
001230    03 施術所郵便番号Ｗ.
001240       05 施術所郵便番号１Ｗ           PIC X(3)   VALUE SPACE.
001250       05 施術所郵便番号２Ｗ           PIC X(4)   VALUE SPACE.
001260    03 明細行.
001270       05 社保件数Ｗ                   PIC 9(3)  VALUE ZERO.
001280       05 社保費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001280       05 社保平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001290       05 社保返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001300       05 社保返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001470       05 組合件数Ｗ                   PIC 9(3)  VALUE ZERO.
001480       05 組合費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001480       05 組合平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001490       05 組合返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001500       05 組合返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001670       05 共済件数Ｗ                   PIC 9(3)  VALUE ZERO.
001680       05 共済費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001680       05 共済平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001690       05 共済返件数Ｗ                 PIC 9(4)  VALUE ZERO.
001700       05 共済返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001670       05 生保件数Ｗ                   PIC 9(3)  VALUE ZERO.
001680       05 生保費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001680       05 生保平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001690       05 生保返件数Ｗ                 PIC 9(4)  VALUE ZERO.
001700       05 生保返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001510       05 国外件数Ｗ                   PIC 9(3)  VALUE ZERO.
001520       05 国外費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001520       05 国外平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001530       05 国外返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001540       05 国外返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001510       05 国内件数Ｗ                   PIC 9(3)  VALUE ZERO.
001520       05 国内費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001520       05 国内平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001530       05 国内返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001540       05 国内返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001550       05 退外件数Ｗ                   PIC 9(3)  VALUE ZERO.
001560       05 退外費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001560       05 退外平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001570       05 退外返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001580       05 退外返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001590       05 退内件数Ｗ                   PIC 9(3)  VALUE ZERO.
001600       05 退内費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001600       05 退内平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001610       05 退内返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001620       05 退内返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001790       05 老外件数Ｗ                   PIC 9(3)  VALUE ZERO.
001800       05 老外費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001800       05 老外平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001810       05 老外返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001820       05 老外返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001790       05 老内件数Ｗ                   PIC 9(3)  VALUE ZERO.
001800       05 老内費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001800       05 老内平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001810       05 老内返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001820       05 老内返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001830       05 労災件数Ｗ                   PIC 9(3)  VALUE ZERO.
001840       05 労災費用額Ｗ                 PIC 9(7)  VALUE ZERO.
001840       05 労災平均額Ｗ                 PIC 9(7)  VALUE ZERO.
001850       05 労災返件数Ｗ                 PIC 9(3)  VALUE ZERO.
001860       05 労災返費用額Ｗ               PIC 9(7)  VALUE ZERO.
001870       05 合計件数Ｗ                   PIC 9(4)  VALUE ZERO.
001880       05 合計費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001880       05 合計平均額Ｗ                 PIC 9(8)  VALUE ZERO.
001890       05 合計返件数Ｗ                 PIC 9(4)  VALUE ZERO.
001900       05 合計返費用額Ｗ               PIC 9(8)  VALUE ZERO.
002020*
002030 01 頁数Ｗ                             PIC 9(1)  VALUE ZERO.
002040 01 全頁Ｗ                             PIC 9(1)  VALUE ZERO.
002050 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002060 01 公費種別Ｗ                         PIC 9(2)  VALUE ZERO.
002070 01 施術所コードＷ                     PIC X(7)  VALUE SPACE.
002080*
002090 01 印刷制御.
002100     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
002110     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
002120     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
002130     03 拡張制御Ｐ.
002140         05 端末制御Ｐ.
002150             07 移動方向Ｐ             PIC X(1).
002160             07 移動行数Ｐ             PIC 9(3).
002170         05 詳細制御Ｐ                 PIC X(2).
002180     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
002190     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
002200 01 施術和暦年月ＷＲ.
002210    03 施術和暦ＷＲ                  PIC 9     VALUE ZERO.
002220    03 施術年ＷＲ                    PIC 9(2)  VALUE ZERO.
002230    03 施術月ＷＲ                    PIC 9(2)  VALUE ZERO.
002200 01 提出和暦年月ＷＲ.
002210    03 提出和暦ＷＲ                  PIC 9     VALUE ZERO.
002220    03 提出年ＷＲ                    PIC 9(2)  VALUE ZERO.
002230    03 提出月ＷＲ                    PIC 9(2)  VALUE ZERO.
002230    03 提出日ＷＲ                    PIC 9(2)  VALUE ZERO.
002240*
002250******************************************************************
002260*                          連結項目                              *
002270******************************************************************
002280*
002491********************
002492* メッセージ表示キー *
002493********************
002494 01 連メ－キー IS EXTERNAL.
002495    03  連メ－メッセージ                 PIC N(20).
002497*
002050 01 連入－画面情報ＹＡＩ５８０ IS EXTERNAL.
002060    03 連入－請求和暦年月.
002070       05 連入－請求和暦                PIC 9.
002080       05 連入－請求年月.
002090         07 連入－請求年                PIC 9(2).
002100         07 連入－請求月                PIC 9(2).
          03 連入－作成和暦年月日.
             05 連入－作成和暦年月.
                07 連入－作成和暦             PIC 9(1).
                07 連入－作成年               PIC 9(2).
                07 連入－作成月               PIC 9(2).
             05 連入－作成日                  PIC 9(2).
      *
       01 連印－プレビュー IS EXTERNAL.
          03 連印－プレビュー区分            PIC 9.
002560*
000540************************************
000550* プリンタファイル作成用           *
000560************************************
000570 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
000580     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
000590     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
000600     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
000610     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
002980*
002350******************************************************************
002360*                      PROCEDURE  DIVISION                       *
002370******************************************************************
002380 PROCEDURE               DIVISION.
002390************
002400*           *
002410* 初期処理   *
002420*           *
002430************
002560     MOVE SPACE TO オープンフラグ.
002570     PERFORM プリンタファイル作成.
002440     PERFORM 初期化.
002450************
002460*           *
002470* 主処理     *
002480*           *
002490************
002500     PERFORM 施術所情報マスタ読込.
002510     PERFORM 金額集計.
002520     PERFORM 印刷レコードセット.
002530     PERFORM 印刷処理.
002540************
002550*           *
002560* 終了処理   *
002570*           *
002580************
002590     PERFORM 終了処理.
002600     EXIT PROGRAM.
002610*
002620*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002860*================================================================*
002870 プリンタファイル作成 SECTION.
002880*================================================================*
002890*   / 初期化 /
002900     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
002910     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
002920*
002930*
002940*--↓↓ 変更箇所 ↓↓--------------------------------------*
002970*   使用するプリンタファイル名セット
002971     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
002972*
002973*   使用する帳票プログラム名セット
002974     MOVE "YAI582"              TO Ｈ連ＰＲＴＦ－帳票プログラム名.
002975*
002976*--↑↑-----------------------------------------------------*
002980*
002990*   / プレビュー区分セット /
003000     MOVE 連印－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003010*
003020     CALL   "CRTPRTF".
003030     CANCEL "CRTPRTF".
003040*
002630*================================================================*
002640 初期化 SECTION.
002650*
002690     OPEN INPUT 施術所情報マスタ.
002700             MOVE NC"施情" TO ファイル名Ｗ.
002710             PERFORM オープンチェック.
015230     OPEN INPUT   元号マスタ
015240         MOVE NC"元号" TO ファイル名Ｗ.
015250         PERFORM オープンチェック.
002740*
002750* 連結項目の待避
002760     MOVE 連入－請求和暦 TO 施術和暦ＷＲ.
002770     MOVE 連入－請求年   TO 施術年ＷＲ.
002780     MOVE 連入－請求月   TO 施術月ＷＲ.
002780     MOVE 連入－作成月   TO 提出月ＷＲ.
002780     MOVE 連入－作成日   TO 提出日ＷＲ.
002790*
002800*================================================================*
002810 オープンチェック SECTION.
002820*
002830     IF 状態キー  NOT =  "00"
002840         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
002850         DISPLAY NC"状態キー：" 状態キー           UPON CONS
002860         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002870                                                   UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
002880         ACCEPT  キー入力 FROM CONS
002890         PERFORM ファイル閉鎖
002900         EXIT PROGRAM.
002970*================================================================*
002980 施術所情報マスタ読込 SECTION.
002990*
003000     MOVE ZERO TO 施情－施術所番号.
003010     READ 施術所情報マスタ
003020     INVALID KEY
003030         MOVE NC"施情" TO ファイル名Ｗ
003040         PERFORM エラー表示Ｒ
003050         PERFORM ファイル閉鎖
003060         MOVE 99 TO PROGRAM-STATUS
003070         EXIT PROGRAM
003080     NOT INVALID KEY
003090*         MOVE 施情－新柔整師番号     TO 登録番号コードＷ
003100         MOVE 施情－接骨師会会員番号  TO 会員番号Ｗ
003110         MOVE 施情－郵便番号１       TO 施術所郵便番号１Ｗ
003120         MOVE 施情－郵便番号２       TO 施術所郵便番号２Ｗ
003130         STRING 施情－住所１  DELIMITED BY SPACE
003140                施情－住所２  DELIMITED BY SPACE
003150           INTO 施術所住所Ｗ
003160         END-STRING
003170*         MOVE 施情－接骨院名         TO 接骨院名Ｗ
003180         MOVE 施情－代表者名         TO 代表者名Ｗ
003190         MOVE 施情－代表者カナ       TO 代表者カナＷ
003200*         MOVE 施情－電話番号         TO 施術所電話番号Ｗ
003210     END-READ.
003220*
003270*================================================================*
003280 ファイル閉鎖 SECTION.
003290*
003570     IF ( オープンフラグ = "YES" )
003580         CLOSE 印刷ファイル
003590     ELSE
003600         MOVE  NC"　　データが０件です。確認して下さい。" TO 連メ－メッセージ
003610         CALL   "MSG001"
003620         CANCEL "MSG001"
003630     END-IF.
003640*
003300     CLOSE  施術所情報マスタ 元号マスタ.
003310*================================================================*
003320 終了処理 SECTION.
003330*
003340     PERFORM ファイル閉鎖.
003350*================================================================*
003360 金額集計 SECTION.
003370*
003380     OPEN INPUT 作業ファイル１.
003390         MOVE NC"作１" TO ファイル名Ｗ.
003400         PERFORM オープンチェック.
003410     MOVE SPACE TO 終了フラグ２.
003420     PERFORM 作業ファイル１読込.
003430     PERFORM UNTIL ( 終了フラグ２ NOT = SPACE )
003440         PERFORM 集計処理１
003450         PERFORM 作業ファイル１読込
003460     END-PERFORM.
003470     PERFORM 合計集計処理.
003480     CLOSE 作業ファイル１.
003490*================================================================*
003500 作業ファイル１読込 SECTION.
003510*
003520     READ 作業ファイル１ NEXT
003530     AT END
003540         MOVE "YES" TO 終了フラグ２
003550         INITIALIZE 作１－レコード
003560     END-READ.
003570*================================================================*
003580 集計処理１ SECTION.
003590*
003890     EVALUATE 作１－保険種別
003900     WHEN 1
               IF 作１－県内外区分 = ZERO
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 国外件数Ｗ  
003930                 MOVE 作１－費用額 TO 国外費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 国外平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 国外返件数Ｗ  
003960                 MOVE 作１－費用額 TO 国外返費用額Ｗ
                   END-IF
               ELSE
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 国内件数Ｗ  
003930                 MOVE 作１－費用額 TO 国内費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 国内平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 国内返件数Ｗ  
003960                 MOVE 作１－費用額 TO 国内返費用額Ｗ
                   END-IF
003970         END-IF
003980     WHEN 2
003980     WHEN 6
003980     WHEN 7
004000         IF 作１－返戻区分 = 1
004010             MOVE 作１－件数   TO 社保件数Ｗ  
004020             MOVE 作１－費用額 TO 社保費用額Ｗ
                   IF 作１－件数 NOT = ZERO
                       COMPUTE 社保平均額Ｗ = 作１－費用額 / 作１－件数
                   END-IF
004050         ELSE
004060             MOVE 作１－件数   TO 社保返件数Ｗ  
004070             MOVE 作１－費用額 TO 社保返費用額Ｗ
004100         END-IF
004240     WHEN 3
004260         IF 作１－返戻区分 = 1
004270             MOVE 作１－件数   TO 組合件数Ｗ  
004280             MOVE 作１－費用額 TO 組合費用額Ｗ
                   IF 作１－件数 NOT = ZERO
                       COMPUTE 組合平均額Ｗ = 作１－費用額 / 作１－件数
                   END-IF
004310         ELSE
004320             MOVE 作１－件数   TO 組合返件数Ｗ  
004330             MOVE 作１－費用額 TO 組合返費用額Ｗ
004360         END-IF
004500     WHEN 4
004500     WHEN 9
004520         IF 作１－返戻区分 = 1
004530             MOVE 作１－件数   TO 共済件数Ｗ  
004540             MOVE 作１－費用額 TO 共済費用額Ｗ
                   IF 作１－件数 NOT = ZERO
                       COMPUTE 共済平均額Ｗ = 作１－費用額 / 作１－件数
                   END-IF
004570         ELSE
004580             MOVE 作１－件数   TO 共済返件数Ｗ  
004590             MOVE 作１－費用額 TO 共済返費用額Ｗ
004620         END-IF
003900     WHEN 5
               IF 作１－県内外区分 = ZERO
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 老外件数Ｗ  
003930                 MOVE 作１－費用額 TO 老外費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 老外平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 老外返件数Ｗ  
003960                 MOVE 作１－費用額 TO 老外返費用額Ｗ
                   END-IF
               ELSE
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 老内件数Ｗ  
003930                 MOVE 作１－費用額 TO 老内費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 老内平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 老内返件数Ｗ  
003960                 MOVE 作１－費用額 TO 老内返費用額Ｗ
                   END-IF
003970         END-IF
004760     WHEN 8
               IF 作１－県内外区分 = ZERO
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 退外件数Ｗ  
003930                 MOVE 作１－費用額 TO 退外費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 退外平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 退外返件数Ｗ  
003960                 MOVE 作１－費用額 TO 退外返費用額Ｗ
                   END-IF
               ELSE
003910             IF 作１－返戻区分 = 1
003920                 MOVE 作１－件数   TO 退内件数Ｗ  
003930                 MOVE 作１－費用額 TO 退内費用額Ｗ
                       IF 作１－件数 NOT = ZERO
                           COMPUTE 退内平均額Ｗ = 作１－費用額 / 作１－件数
                       END-IF
003940             ELSE
003950                 MOVE 作１－件数   TO 退内返件数Ｗ  
003960                 MOVE 作１－費用額 TO 退内返費用額Ｗ
                   END-IF
003970         END-IF
005020     WHEN 70
005030         IF 作１－返戻区分 = 1
005040             MOVE 作１－件数   TO 労災件数Ｗ  
005050             MOVE 作１－費用額 TO 労災費用額Ｗ
                   IF 作１－件数 NOT = ZERO
                       COMPUTE 労災平均額Ｗ = 作１－費用額 / 作１－件数
                   END-IF
005060         ELSE
005070             MOVE 作１－件数   TO 労災返件数Ｗ  
005080             MOVE 作１－費用額 TO 労災返費用額Ｗ
005090         END-IF
005020     WHEN 85
005030         IF 作１－返戻区分 = 1
005040             MOVE 作１－件数   TO 生保件数Ｗ  
005050             MOVE 作１－費用額 TO 生保費用額Ｗ
                   IF 作１－件数 NOT = ZERO
                       COMPUTE 生保平均額Ｗ = 作１－費用額 / 作１－件数
                   END-IF
005060         ELSE
005070             MOVE 作１－件数   TO 生保返件数Ｗ  
005080             MOVE 作１－費用額 TO 生保返費用額Ｗ
005090         END-IF
005100     END-EVALUATE.
005130*================================================================*
005140 合計集計処理 SECTION.
005150*
005160     COMPUTE 合計件数Ｗ = 社保件数Ｗ + 組合件数Ｗ + 共済件数Ｗ + 国外件数Ｗ + 国内件数Ｗ +
005170                          退外件数Ｗ + 退内件数Ｗ + 老外件数Ｗ + 老内件数Ｗ + 労災件数Ｗ +
                                生保件数Ｗ.
005180     COMPUTE 合計費用額Ｗ = 社保費用額Ｗ + 組合費用額Ｗ + 共済費用額Ｗ + 国外費用額Ｗ +
005190                            国内費用額Ｗ + 退外費用額Ｗ + 退内費用額Ｗ + 老外費用額Ｗ +
                                  老内費用額Ｗ + 労災費用額Ｗ + 生保費用額Ｗ.
005200     COMPUTE 合計返件数Ｗ = 社保返件数Ｗ + 組合返件数Ｗ + 共済返件数Ｗ + 国外返件数Ｗ +
005210                            国内返件数Ｗ + 退外返件数Ｗ + 退内返件数Ｗ + 老外返件数Ｗ +
                                  老内返件数Ｗ + 労災返件数Ｗ + 生保返件数Ｗ.
005220     COMPUTE 合計返費用額Ｗ = 社保返費用額Ｗ + 組合返費用額Ｗ + 共済返費用額Ｗ +
                                    国外返費用額Ｗ + 国内返費用額Ｗ + 退外返費用額Ｗ +
005230                              退内返費用額Ｗ + 老外返費用額Ｗ + 老内返費用額Ｗ +
005240                              労災返費用額Ｗ + 生保返費用額Ｗ.
005270*
005280*================================================================*
005290 印刷レコードセット SECTION.
005300*
005310     MOVE SPACE TO YAI582P.
005320*     INITIALIZE YAI582P.
      */元号修正/↓↓↓20190514
037370     IF 施術和暦ＷＲ > 4
              MOVE 施術和暦ＷＲ       TO 元－元号区分
037380        READ 元号マスタ
037390        NOT INVALID KEY
037400            MOVE 元－元号名称   TO 施術和暦
037410        END-READ
              MOVE "===="             TO 施術和暦訂正
           END-IF.
      */元号修正/↑↑↑20190514
005330     MOVE 施術年ＷＲ           TO 請求年.
005330     MOVE 施術月ＷＲ           TO 請求月.
005330     MOVE 提出月ＷＲ           TO 提出月.
005330     MOVE 提出日ＷＲ           TO 提出日.
005340     MOVE 会員番号Ｗ           TO 会員番号.
005340     MOVE 代表者名Ｗ           TO 会員氏名.
005350*
005360     MOVE 社保件数Ｗ           TO 社保件数  .
005370     MOVE 社保費用額Ｗ         TO 社保費用額.
005370     MOVE 社保平均額Ｗ         TO 社保平均額.
005380     MOVE 社保返件数Ｗ         TO 社保返戻件数  .
005390     MOVE 社保返費用額Ｗ       TO 社保返戻費用額.
005490*
005500     MOVE 組合件数Ｗ           TO 組合件数  .
005510     MOVE 組合費用額Ｗ         TO 組合費用額.
005510     MOVE 組合平均額Ｗ         TO 組合平均額.
005520     MOVE 組合返件数Ｗ         TO 組合返戻件数  .
005530     MOVE 組合返費用額Ｗ       TO 組合返戻費用額.
005820*
005830     MOVE 共済件数Ｗ           TO 共済件数  .
005840     MOVE 共済費用額Ｗ         TO 共済費用額.
005840     MOVE 共済平均額Ｗ         TO 共済平均額.
005850     MOVE 共済返件数Ｗ         TO 共済返戻件数  .
005860     MOVE 共済返費用額Ｗ       TO 共済返戻費用額.
005820*
005830     MOVE 生保件数Ｗ           TO 生保件数  .
005840     MOVE 生保費用額Ｗ         TO 生保費用額.
005840     MOVE 生保平均額Ｗ         TO 生保平均額.
005850     MOVE 生保返件数Ｗ         TO 生保返戻件数  .
005860     MOVE 生保返費用額Ｗ       TO 生保返戻費用額.
005630*
005640     MOVE 国外件数Ｗ           TO 国外件数  .
005650     MOVE 国外費用額Ｗ         TO 国外費用額.
005650     MOVE 国外平均額Ｗ         TO 国外平均額.
005660     MOVE 国外返件数Ｗ         TO 国外返戻件数  .
005670     MOVE 国外返費用額Ｗ       TO 国外返戻費用額.
005640     MOVE 国内件数Ｗ           TO 国内件数  .
005650     MOVE 国内費用額Ｗ         TO 国内費用額.
005650     MOVE 国内平均額Ｗ         TO 国内平均額.
005660     MOVE 国内返件数Ｗ         TO 国内返戻件数  .
005670     MOVE 国内返費用額Ｗ       TO 国内返戻費用額.
005680*
005690     MOVE 退外件数Ｗ           TO 退外件数  .
005700     MOVE 退外費用額Ｗ         TO 退外費用額.
005700     MOVE 退外平均額Ｗ         TO 退外平均額.
005710     MOVE 退外返件数Ｗ         TO 退外返戻件数  .
005720     MOVE 退外返費用額Ｗ       TO 退外返戻費用額.
005730     MOVE 退内件数Ｗ           TO 退内件数  .
005740     MOVE 退内費用額Ｗ         TO 退内費用額.
005740     MOVE 退内平均額Ｗ         TO 退内平均額.
005750     MOVE 退内返件数Ｗ         TO 退内返戻件数  .
005760     MOVE 退内返費用額Ｗ       TO 退内返戻費用額.
005960*
005970     MOVE 老外件数Ｗ           TO 老外件数  .
005980     MOVE 老外費用額Ｗ         TO 老外費用額.
005980     MOVE 老外平均額Ｗ         TO 老外平均額.
005990     MOVE 老外返件数Ｗ         TO 老外返戻件数  .
006000     MOVE 老外返費用額Ｗ       TO 老外返戻費用額.
005970     MOVE 老内件数Ｗ           TO 老内件数  .
005980     MOVE 老内費用額Ｗ         TO 老内費用額.
005980     MOVE 老内平均額Ｗ         TO 老内平均額.
005990     MOVE 老内返件数Ｗ         TO 老内返戻件数  .
006000     MOVE 老内返費用額Ｗ       TO 老内返戻費用額.
006010*
006020     MOVE 労災件数Ｗ           TO 労災件数  .
006030     MOVE 労災費用額Ｗ         TO 労災費用額.
006030     MOVE 労災平均額Ｗ         TO 労災平均額.
006040     MOVE 労災返件数Ｗ         TO 労災返戻件数  .
006050     MOVE 労災返費用額Ｗ       TO 労災返戻費用額.
006060*
006070     MOVE 合計件数Ｗ           TO 合計件数  .
006080     MOVE 合計費用額Ｗ         TO 合計費用額.
006080     MOVE 合計平均額Ｗ         TO 合計平均額.
006090     MOVE 合計返件数Ｗ         TO 合計返戻件数  .
006100     MOVE 合計返費用額Ｗ       TO 合計返戻費用額.
006240*
006250*================================================================*
006260 印刷処理 SECTION.
006270*
006050     IF ( オープンフラグ NOT = "YES" )
006060        MOVE "YES" TO オープンフラグ
006070        OPEN I-O  印刷ファイル
006080        PERFORM エラー処理Ｐ
006090     END-IF.
006280     MOVE "YAI582P"  TO  定義体名Ｐ.
006290     MOVE "SCREEN"   TO  項目群名Ｐ.
006300     MOVE SPACE      TO  処理種別Ｐ.
006310     MOVE SPACE      TO  拡張制御Ｐ.
006320     WRITE YAI582P.
006330     PERFORM エラー処理Ｐ.
006340*================================================================*
006350 エラー表示 SECTION.
006360*
006370     DISPLAY NC"ファイル書込エラー：" ファイル名Ｗ UPON CONS.
006380     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
006390     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
006400     ACCEPT  キー入力 FROM CONS.
006410*================================================================*
006420 エラー処理Ｐ SECTION.
006430*
006440     IF 通知情報Ｐ NOT = "00"
006450         DISPLAY NC"帳票エラー"              UPON CONS
006460         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
006470         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
006480         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
006490         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
006500                                             UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
006510         ACCEPT  キー入力 FROM CONS
006520         PERFORM ファイル閉鎖
006530         MOVE 99 TO PROGRAM-STATUS
006540         EXIT PROGRAM
006550     END-IF.
006560*================================================================*
006570 エラー表示Ｒ SECTION.
006580*
006590     DISPLAY NC"ファイル読込エラー" ファイル名Ｗ UPON CONS.
006600     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
006610     ACCEPT  キー入力 FROM CONS.
006620     PERFORM ファイル閉鎖.
006630     EXIT PROGRAM.
006730*================================================================*
006740******************************************************************
006750 END PROGRAM YAI582.
006760******************************************************************
