000001******************************************************************
000002*            IDENTIFICATION      DIVISION                        *
000003******************************************************************
000004 IDENTIFICATION          DIVISION.
000005 PROGRAM-ID.             YAI583.
000006 AUTHOR.                 池田　幸子
000007*
000008*----------------------------------------------------------------*
000009*         総括票（Ⅰ）【ﾃﾞｰﾀ作成】柔＋ｳｨﾝﾄﾞｳｽﾞ
000010*  請求年月バージョン 
000011*         MED = YAI580 
000012*----------------------------------------------------------------*
000013 DATE-WRITTEN.           2013-06-27
000014 DATE-COMPILED.          2013-06-27
000015*----------------------------------------------------------------*
000016******************************************************************
000017*            ENVIRONMENT         DIVISION                        *
000018******************************************************************
000019 ENVIRONMENT             DIVISION.
000020 CONFIGURATION           SECTION.
000021 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000022 OBJECT-COMPUTER.        FMV-DESKPOWER.
000023 SPECIAL-NAMES.          CONSOLE  IS  CONS
000024                         SYSERR   IS  MSGBOX.
000025 INPUT-OUTPUT            SECTION.
000026 FILE-CONTROL.
000033     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000034                             ORGANIZATION             IS  INDEXED
000035                             ACCESS MODE              IS  DYNAMIC
000036                             RECORD KEY               IS 受－施術和暦年月
000037                                                          受－患者コード
000038                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000039                                                          受－患者カナ
000040                                                          受－患者コード
000041                             ALTERNATE RECORD KEY     IS  受－患者コード
000042                                                         受－施術和暦年月
000043                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000044                                                          受－保険種別
000045                                                          受－保険者番号
000046                                                          受－患者コード
000047                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000048                                                          受－公費種別
000049                                                     受－費用負担者番号
000050                                                          受－患者コード
000051                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000052                                                          受－助成種別
000053                                                  受－費用負担者番号助成
000054                                                          受－患者コード
000055                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000056                                                      受－施術和暦年月
000057                                                      受－患者コード
000058                             FILE STATUS              IS  状態キー
000059                             LOCK        MODE         IS  AUTOMATIC.
000078     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000079                             ORGANIZATION             IS  INDEXED
000080                             ACCESS MODE              IS  DYNAMIC
000081                             RECORD KEY               IS  請先－保険種別
000082                                                          請先－保険者番号
000083                             FILE STATUS              IS  状態キー
000084                             LOCK    MODE             IS  AUTOMATIC.
000085     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000086                             ORGANIZATION             IS  INDEXED
000087                             ACCESS MODE              IS  DYNAMIC
000088                             RECORD KEY               IS  市－公費種別
000089                                                          市－市町村番号
000090                             ALTERNATE RECORD KEY     IS  市－公費種別
000091                                                          市－市町村名称
000092                                                          市－市町村番号
000093                             FILE STATUS              IS  状態キー
000094                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000095     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5830L.DAT"
000096                             ORGANIZATION             IS  INDEXED
000097                             ACCESS                   IS  DYNAMIC
000098                             RECORD      KEY          IS  作１－請求和暦年月
000099                                                          作１－保険種別
000100                                                          作１－保険者番号
000104                                                          作１－患者コード
000105                                                          作１－施術和暦年月
000106                             FILE        STATUS       IS  状態キー
000107                             LOCK        MODE         IS  AUTOMATIC.
000108     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5831L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作２－保険種別
000113                                                          作２－保険者番号
000114                             ALTERNATE RECORD KEY     IS  作２－印刷順序１
000115                                                          作２－県
000116                                                          作２－印刷順序
000117                                                          作２－保険種別
000118                                                          作２－保険者番号
000119                             FILE        STATUS       IS  状態キー
000120                             LOCK        MODE         IS  AUTOMATIC.
000121******************************************************************
000122*                      DATA DIVISION                             *
000123******************************************************************
000124 DATA                    DIVISION.
000125 FILE                    SECTION.
000129*                           ［ＲＬ＝  ３２０］
000130 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000131     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
000138*                           ［ＲＬ＝  １２８］
000139 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
000140     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
000141*                           ［ＲＬ＝  ２５６］
000142 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
000143     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
000144* 
000145 FD  作業ファイル１ RECORD  CONTAINS 64 CHARACTERS.
000146 01  作１－レコード.
000147     03  作１－レコードキー.
000148         05  作１－請求和暦年月.
000149             07  作１－請求和暦              PIC 9.
000150             07  作１－請求年                PIC 9(2).
000151             07  作１－請求月                PIC 9(2).
000152         05  作１－保険種別                  PIC 9(2).
000153         05  作１－保険者番号                PIC X(10).
000157         05  作１－患者コード.
000158             07 作１－患者番号               PIC 9(6).
000159             07 作１－枝番                   PIC X(1).
000160         05  作１－施術和暦年月.
000161             07  作１－施術和暦              PIC 9.
000162             07  作１－施術年                PIC 9(2).
000163             07  作１－施術月                PIC 9(2).
000164     03  作１－レコードデータ.
000167         05  作１－費用額                    PIC 9(7).
000168         05  作１－負担額                    PIC 9(7).
000169         05  作１－請求額                    PIC 9(7).
000170         05  作１－本人家族区分              PIC 9.
000171         05  作１－県                        PIC X(2).
000172         05  FILLER                          PIC X(11).
000173*
000174*                           ［ＲＬ＝  １２８］
000175 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
000176 01  作２－レコード.
000177     03  作２－レコードキー.
000182         05  作２－保険種別                  PIC 9(2).
000183         05  作２－保険者番号                PIC X(10).
000188     03  作２－レコードデータ.
000184         05  作２－県                        PIC X(2).
000185         05  作２－印刷順序.
000186             07  作２－印刷順序１            PIC 9(2).
000187             07  作２－印刷順序２            PIC 9.
000189         05  作２－件数                      PIC 9(4).
000190         05  作２－費用額                    PIC 9(9).
000191         05  作２－負担額                    PIC 9(9).
000192         05  作２－請求額                    PIC 9(9).
000193         05  作２－本人件数                  PIC 9(3).
000194         05  作２－本人費用額                PIC 9(7).
000195         05  作２－本人負担額                PIC 9(7).
000196         05  作２－本人請求額                PIC 9(7).
000197         05  作２－家族件数                  PIC 9(3).
000198         05  作２－家族費用額                PIC 9(7).
000199         05  作２－家族負担額                PIC 9(7).
000200         05  作２－家族請求額                PIC 9(7).
000201         05  FILLER                          PIC X(32).
000202*----------------------------------------------------------------*
001240******************************************************************
001250*                WORKING-STORAGE SECTION                         *
001260******************************************************************
001270 WORKING-STORAGE         SECTION.
001280 01 キー入力                           PIC X     VALUE SPACE.
001290 01 状態キー                           PIC X(2)  VALUE SPACE.
001300 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001301 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001302 01 作成フラグ                         PIC X(3)  VALUE SPACE.
001303 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
001304 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
001305*
001310 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
001311 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
001320 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
001321 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
001330 01 請求和暦年月ＷＲ.
001340    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
001350    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
001360    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
001370*
001410 01 請求年月Ｗ.
001420    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001430    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
001440    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
001441 01 施術年月Ｗ.
001442    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001443    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
001444    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
001450 01 集計作業用Ｗ.
001460    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
001461    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
001470    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
001480    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
001490    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
001500    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
001510 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
001520 01 ファイル名                         PIC N(2)  VALUE SPACE.
001530 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
001540 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
001541 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
001542*
001543* 本人/家族集計用
001544 01 本人家族集計用Ｗ.
001545    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
001548    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001549    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001550    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001551    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
001552    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001553    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001554    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001555*
001556* 県内県外用
001557 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
001558 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
001559 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001560 01 県内県外チェック                   PIC 9     VALUE ZERO.
001561 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001562 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
001563 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
001564 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
001565*
001566* エラーメッセージ用
001567 01 エラーメッセージＷ.
001568    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
001569    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
001570    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
001571    03 FILLER                          PIC X(10) VALUE SPACE.
001572* 順序用
001573 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
001574 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
001576*
001577** 助成レセまとめ用
001578 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
001579*
001580* 例外用
001581 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
001582*
      *
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
001583******************************************************************
001584*                          連結項目                              *
001585******************************************************************
001586*
001587****************
001588* 画面入力情報 *
001589****************
001590**
       01 連入－画面情報ＹＡＩ５８０ IS EXTERNAL.
          03 連入－請求和暦年月.
             05 連入－請求和暦               PIC 9(1).
             05 連入－請求年月.
                07 連入－請求年              PIC 9(2).
                07 連入－請求月              PIC 9(2).
          03 連入－作成和暦年月日.
             05 連入－作成和暦年月.
                07 連入－作成和暦            PIC 9(1).
                07 連入－作成年              PIC 9(2).
                07 連入－作成月              PIC 9(2).
             05 連入－作成日                 PIC 9(2).
001609*
001782********************
001792* メッセージ表示キー *
001802********************
001812 01 連メ３－キー IS EXTERNAL.
001822    03  連メ３－メッセージ             PIC N(20).
001832    03  連メ３－メッセージ１           PIC X(20).
001842*
001852************************
001862* 助成レセまとめ
001872************************
001882 01 連レセまとめ－キー IS EXTERNAL.
001892    03 連レセまとめ－施術和暦年月.
001902       05 連レセまとめ－施術和暦               PIC 9.
001912       05 連レセまとめ－施術年月.
001922          07 連レセまとめ－施術年              PIC 9(2).
001932          07 連レセまとめ－施術月              PIC 9(2).
001942    03 連レセまとめ－患者コード.
001952       05 連レセまとめ－患者番号               PIC 9(6).
001962       05 連レセまとめ－枝番                   PIC X(1).
001972**-------------------------------------------------------**
001982*   1:助成レセプトなしの本体まとめの判定
001992*   2:横浜・川崎用の社保助成レセかの判定
002002    03 連レセまとめ－判定区分                  PIC 9.
002012**-------------------------------------------------------**
002022*  / OUT /　 0:対象外、1:対象
002032    03 連レセまとめ－判定結果                  PIC 9.
002042**
      *
       01 連保険者番号変換－キー IS EXTERNAL.
          03 連保険者番号変換－施術和暦年月.
             05 連保険者番号変換－施術和暦               PIC 9.
             05 連保険者番号変換－施術年月.
                07 連保険者番号変換－施術年              PIC 9(2).
                07 連保険者番号変換－施術月              PIC 9(2).
          03 連保険者番号変換－保険種別                  PIC 9(2).
          03 連保険者番号変換－元保険者番号              PIC X(10).
      * 0:通常（施術年月関係なし）
          03 連保険者番号変換－呼出区分                  PIC 9(2).
      *  / OUT /
          03 連保険者番号変換－後保険者番号              PIC X(10).
      *
002160******************************************************************
002170*                      PROCEDURE  DIVISION                       *
002180******************************************************************
002190 PROCEDURE               DIVISION.
002200************
002210*           *
002220* 初期処理   *
002230*           *
002240************
002250     PERFORM ファイルオープン.
002251     PERFORM 連結項目待避.
002270************
002280*           *
002290* 主処理     *
002300*           *
002310************
002320     PERFORM 作業ファイル１作成.
002330     PERFORM 作業ファイル２作成.
002340************
002350*           *
002360* 終了処理   *
002370*           *
002380************
002390     PERFORM 終了処理.
002400     MOVE ZERO TO PROGRAM-STATUS.
002410     EXIT PROGRAM.
002420*
002430*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002440*================================================================*
002450 連結項目待避 SECTION.
002460*
002470* 連結項目の待避
002500     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002510     MOVE 連入－請求年        TO 請求年ＷＲ.
002520     MOVE 連入－請求月        TO 請求月ＷＲ.
002554*
002560*================================================================*
002570 ファイルオープン SECTION.
002580*
002590     OPEN INPUT 受診者情報Ｆ.
002600         MOVE NC"受診者情報Ｆ" TO ファイル名.
002610         PERFORM オープンチェック.
002617     OPEN INPUT 請求先マスタ.
002618         MOVE NC"請求先" TO ファイル名.
002619         PERFORM オープンチェック.
002620     OPEN INPUT 市町村マスタ.
002621         MOVE NC"市町村" TO ファイル名.
002622         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
002623*================================================================*
002630 オープンチェック SECTION.
002640*
002650     IF 状態キー  NOT =  "00"
002660         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002670         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002680         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002690                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
002700         ACCEPT  キー入力 FROM CONS
002710         PERFORM ファイル閉鎖
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM.
002741*================================================================*
002750 エラー表示 SECTION.
002760*
002770     DISPLAY NC"状態キー" 状態キー  UPON CONS.
002780     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
002790     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
002800     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
002810     ACCEPT  キー入力 FROM CONS.
002820     PERFORM ファイル閉鎖.
002830     MOVE 99 TO PROGRAM-STATUS.
002840     EXIT PROGRAM.
002850*================================================================*
002860 作業ファイル１作成 SECTION.
002870*
002880     OPEN OUTPUT 作業ファイル１.
002890         MOVE NC"作業" TO ファイル名.
002900         PERFORM オープンチェック.
002901*
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE ZERO          TO レセ－レセ種別.
005200     MOVE ZERO          TO レセ－施術和暦.
005210     MOVE ZERO          TO レセ－施術年.  
005220     MOVE ZERO          TO レセ－施術月.  
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
004472     END-START.
004473     IF 状態キー = "00"
004474         MOVE SPACE  TO 終了フラグ
003720         PERFORM レセプトＦ読込
004476         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   )
003770             PERFORM データチェック
004492** 労災・自賠責・自費・生保単独　除く
004493             IF  レセ－レセ種別 = 4 OR 5 OR 6 OR 7
004494                 MOVE SPACE  TO 実行キーＷ
004495             END-IF
004496***
004497             IF 実行キーＷ = "YES"
004480** 県外の社保・船員のみ /1308
004481                MOVE SPACE  TO  作成フラグ
      */協会健保
004482                IF 受－保険種別 = 02
                         IF 受－保険者番号(5:5) = SPACE
006875                      IF 受－保険者番号(1:2) NOT = "23"
004484                         MOVE "YES"  TO  作成フラグ
006877                      END-IF
006878                      MOVE 受－保険者番号(1:2) TO 県ＷＫ
006879                      PERFORM 県統一
006880                      MOVE 県統一ＷＫ TO 県ＷＫ
                         ELSE
                            IF 受－保険者番号(3:2) NOT = "23"
004484                         MOVE "YES"  TO  作成フラグ
                            END-IF
                            MOVE 受－保険者番号(3:2) TO 県ＷＫ
                         END-IF
                      END-IF
006881* 船員
004482                IF 受－保険種別 = 07
006893                   IF 受－保険者番号(3:2) NOT = "23"
004484                      MOVE "YES"  TO  作成フラグ
006895                   END-IF
                         MOVE 受－保険者番号(3:2) TO 県ＷＫ
004488                END-IF 
004489                IF 作成フラグ  = "YES"
004498*
005610                   EVALUATE TRUE
004499*                ******************
004500*                * 健保 老人含まず*
004501*                ******************
013940                   WHEN レセ－レセ種別   = 1
004506**                 / 県内県外か /
004507*                      MOVE SPACE  TO  作成フラグ
004508*                      MOVE 受－保険種別 TO 保険種別県用ＷＫ
004509*                      PERFORM 県内県外取得
004510*                  (県内1、県外2、両方0)
004511*                      IF 県内県外ＷＲ NOT = ZERO
004512*                         IF 県内県外ＷＲ = 1
004513*                            IF 県内県外チェック = 1
004514*                               MOVE "YES"  TO  作成フラグ
004515*                            END-IF
004516*                         ELSE
004517*                            IF 県内県外チェック = ZERO
004518*                               MOVE "YES"  TO  作成フラグ
004519*                            END-IF
004520*                         END-IF
004521*                      ELSE
004522*                         MOVE "YES"  TO  作成フラグ
004523*                      END-IF 
004528*
004529*                      IF 作成フラグ  = "YES"
004530                         MOVE SPACE TO 作１－レコード
004531                         INITIALIZE 作１－レコード
004532                         MOVE 受－保険種別    TO 作１－保険種別
004533                         MOVE 受－保険者番号  TO 作１－保険者番号
004534                         PERFORM レコードセット
004535                         PERFORM 健保料金計算
004536                         PERFORM ファイル書込
004537*                      END-IF
004540*                ********
004541*                * 老人 *
004542*                ********
      *                   WHEN レセ－レセ種別   = 2 
004545**                 / 県内県外か /
004546*                      MOVE SPACE  TO  作成フラグ
004547*                      MOVE 受－公費種別 TO 保険種別県用ＷＫ
004548*                      PERFORM 県内県外取得
004549**                 (県内1、県外2、両方0)
004550*                      IF 県内県外ＷＲ NOT = ZERO
004551*                         IF 県内県外ＷＲ = 1
004552*                            IF 県内県外チェック = 1
004553*                               MOVE "YES"  TO  作成フラグ
004554*                            END-IF
004555*                         ELSE
004556*                            IF 県内県外チェック = ZERO
004557*                               MOVE "YES"  TO  作成フラグ
004558*                            END-IF
004559*                         END-IF
004560*                      ELSE
004561*                         MOVE "YES"  TO  作成フラグ
004562*                      END-IF 
004563***
004564*                      IF 作成フラグ  = "YES"
004565*                         MOVE SPACE TO 作１－レコード
004566*                         INITIALIZE 作１－レコード
004567*                         MOVE 受－公費種別           TO 作１－保険種別
004568*                         MOVE 受－費用負担者番号     TO 作１－保険者番号
004570*                         PERFORM レコードセット
004580*                         PERFORM 健保料金計算
004591** 請求額が ZERO の時は、書き込まない。
004592*                         IF  作１－請求額 NOT = ZERO
004593*                             PERFORM ファイル書込
004594*                         END-IF
004595*                      END-IF
004610*                ********
004620*                * 助成 *
004630*                ********
      *                   WHEN レセ－レセ種別   = 3
004651***                 / 県内県外か /
004652*                      MOVE SPACE  TO  作成フラグ
004653*                      MOVE 受－助成種別 TO 保険種別県用ＷＫ
004654*                      PERFORM 県内県外取得
004655**                  (県内1、県外2、両方0)
004656*                      IF 県内県外ＷＲ NOT = ZERO
004657*                         IF 県内県外ＷＲ = 1
004658*                            IF 県内県外チェック = 1
004659*                               MOVE "YES"  TO  作成フラグ
004660*                            END-IF
004661*                         ELSE
004662*                            IF 県内県外チェック = ZERO
004663*                               MOVE "YES"  TO  作成フラグ
004664*                            END-IF
004665*                         END-IF
004666*                      ELSE
004667*                         MOVE "YES"  TO  作成フラグ
004668*                      END-IF 
004669***
004670*                      IF 作成フラグ  = "YES"
004671*                         MOVE SPACE TO 作１－レコード
004672*                         INITIALIZE 作１－レコード
004673*                         MOVE 受－助成種別           TO 作１－保険種別
004674*                         MOVE 受－費用負担者番号助成 TO 作１－保険者番号
004680*                         PERFORM レコードセット
004690*                         PERFORM 助成料金計算
004697** 請求額が ZERO の時は、書き込まない。
004698**                         IF  作１－請求額 NOT = ZERO
004699**                             PERFORM ファイル書込
004700*                         END-IF
004710*                      END-IF
004711                   END-EVALUATE
                      END-IF
004712             END-IF
004720             PERFORM レセプトＦ読込
004730         END-PERFORM
004740     END-IF.
002945*
003140     CLOSE 作業ファイル１.
003141*
004450*================================================================*
006930 レセプトＦ読込 SECTION.
006940*
006950     READ レセプトＦ NEXT
004490     AT END
004500         MOVE "YES" TO 終了フラグ
004510     END-READ.
004811*================================================================*
004812 データチェック SECTION.
004813*
004814     MOVE SPACE          TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
      *
      */協会健保の対応、旧保険者番号でも新保険者番号とまとめて請求する/081016
                    INITIALIZE 連保険者番号変換－キー
                    MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
                    MOVE  受－保険種別      TO 連保険者番号変換－保険種別
                    MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
                    MOVE  ZERO              TO 連保険者番号変換－呼出区分
                    CALL   "CHGHOKNO"
                    CANCEL "CHGHOKNO"
      *   / 置換え /
                    MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号
      *
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
004860*
004868*================================================================*
004869 レコードセット SECTION.
004870*
004871     MOVE レセ－請求和暦    TO 作１－請求和暦.
004872     MOVE レセ－請求年      TO 作１－請求年.
004873     MOVE レセ－請求月      TO 作１－請求月.
004874     MOVE 受－施術和暦      TO 作１－施術和暦.
004875     MOVE 受－施術年        TO 作１－施術年.
004876     MOVE 受－施術月        TO 作１－施術月.
004878     MOVE 受－患者コード    TO 作１－患者コード.
004932*
004933* / 助成は、本人とする /
004934     EVALUATE  作１－保険種別 
004935***     WHEN 05
004936     WHEN 50 THRU 60
004937         MOVE 1                 TO 作１－本人家族区分
004938     WHEN OTHER
004939         MOVE 受－本人家族区分  TO 作１－本人家族区分
004940     END-EVALUATE.
004941*
004942*
004943     MOVE 県ＷＫ TO 作１－県.
004944*
004945*************************************************************************************
004946*  請求先マスタを読んで、データがある時は、請求先市町村コードを保険者番号に転記する。
004947*************************************************************************************
004948     MOVE 作１－保険種別    TO 請先－保険種別.
004949     MOVE 作１－保険者番号  TO 請先－保険者番号.
004950     READ 請求先マスタ
004951     NOT INVALID KEY
004952         MOVE 請先－請求先市町村   TO 作１－保険者番号
004953     END-READ.
004954*
005110*================================================================*
005120 健保料金計算 SECTION.
005130*
005210     MOVE レセ－合計       TO 作１－費用額.
005220     MOVE レセ－一部負担金 TO 作１－負担額.
005230     MOVE レセ－請求金額   TO 作１－請求額.
005238*
005370*================================================================*
005380 助成料金計算 SECTION.
005390*
005210     MOVE レセ－合計         TO 作１－費用額.
005220     MOVE レセ－受給者負担額 TO 作１－負担額.
005230     MOVE レセ－助成請求金額 TO 作１－請求額.
005498*
005500*================================================================*
005510 ファイル書込 SECTION.
005520*
005530     WRITE 作１－レコード
005540     INVALID KEY
005550         MOVE NC"作業"  TO ファイル名
005560         PERFORM エラー表示
005570     END-WRITE.
005580*================================================================*
005590 作業ファイル２作成 SECTION.
005600*
005610     OPEN INPUT  作業ファイル１.
005620     OPEN OUTPUT 作業ファイル２.
005630*
005640     PERFORM 作業ファイル２作成処理.
005650*
005660     CLOSE 作業ファイル２.
005670     CLOSE 作業ファイル１.
005680*================================================================*
005690 作業ファイル２作成処理 SECTION.
005700*
005710     MOVE ZERO       TO 作１－請求和暦     請求和暦Ｗ.
005720     MOVE ZERO       TO 作１－請求年       請求年Ｗ.
005730     MOVE ZERO       TO 作１－請求月       請求月Ｗ.
005734     MOVE ZERO       TO 作１－保険種別     保険種別Ｗ.
005735     MOVE LOW-VALUE  TO 作１－保険者番号   保険者番号Ｗ.
005739     MOVE ZERO       TO 作１－患者番号.
005740     MOVE LOW-VALUE  TO 作１－枝番.
005750     MOVE ZERO       TO 作１－施術和暦.
005760     MOVE ZERO       TO 作１－施術年.
005770     MOVE ZERO       TO 作１－施術月.
005800     START 作業ファイル１ KEY IS >=  作１－請求和暦年月
005853                                     作１－保険種別
005854                                     作１－保険者番号
005858                                     作１－患者コード
005859                                     作１－施術和暦年月
005860     END-START.
005861     IF 状態キー = "00"
005870*
005880         MOVE SPACE TO 終了フラグ
005890         MOVE ZERO  TO 件数Ｗ
005910         MOVE ZERO  TO 費用額Ｗ
005920         MOVE ZERO  TO 負担額Ｗ
005930         MOVE ZERO  TO 請求額Ｗ
005931         INITIALIZE 本人家族集計用Ｗ
005940*
005950         PERFORM 作業ファイル１読込
005960         MOVE 作１－請求和暦     TO 請求和暦Ｗ
005970         MOVE 作１－請求年       TO 請求年Ｗ
005980         MOVE 作１－請求月       TO 請求月Ｗ
005990         MOVE 作１－保険種別     TO 保険種別Ｗ
006000         MOVE 作１－保険者番号   TO 保険者番号Ｗ
006010         MOVE 作１－県           TO 県ＷＫ２
006020         PERFORM UNTIL 終了フラグ = "YES"
006030*
006040             MOVE SPACE TO 作２－レコード
006050             INITIALIZE 作２－レコード
006060             PERFORM 作業レコード２累計
006070*
006071             MOVE 作１－請求和暦     TO 請求和暦Ｗ
006072             MOVE 作１－請求年       TO 請求年Ｗ
006073             MOVE 作１－請求月       TO 請求月Ｗ
006110             MOVE 作１－保険種別     TO 保険種別Ｗ
006120             MOVE 作１－保険者番号   TO 保険者番号Ｗ
006130             MOVE 作１－県           TO 県ＷＫ２
006140             PERFORM 作業ファイル１読込
006150         END-PERFORM
006160         PERFORM 作業レコード２セット
006170         PERFORM 作業ファイル２書込
006180     END-IF.
006190*================================================================*
006200 作業ファイル１読込 SECTION.
006210*
006220     READ 作業ファイル１ NEXT
006230     AT END
006240         MOVE "YES" TO 終了フラグ
006250     END-READ.
006260*================================================================*
006270 作業レコード２累計 SECTION.
006280*
006290     IF ( 作１－請求和暦 NOT = 請求和暦Ｗ ) OR
006300        ( 作１－請求年   NOT = 請求年Ｗ   ) OR
006310        ( 作１－請求月   NOT = 請求月Ｗ   ) OR
006337        ( 作１－保険種別 NOT = 保険種別Ｗ ) OR
006338        ( 作１－保険者番号 NOT = 保険者番号Ｗ ) 
006350         PERFORM 作業レコード２セット
006360         PERFORM 作業ファイル２書込
006380         MOVE ZERO  TO 件数Ｗ
006390         MOVE ZERO  TO 費用額Ｗ
006400         MOVE ZERO  TO 負担額Ｗ
006410         MOVE ZERO  TO 請求額Ｗ
006411         INITIALIZE 本人家族集計用Ｗ
006420         PERFORM 作業レコード２加算
006430     ELSE
006440         PERFORM 作業レコード２加算
006450     END-IF.
006460*================================================================*
006470 作業レコード２加算 SECTION.
006480*
006490     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
006510     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
006520     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
006530     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
006531*
006532     IF 作１－本人家族区分 = 1
006534        COMPUTE 本人件数Ｗ   = 本人件数Ｗ   + 1
006535        COMPUTE 本人費用額Ｗ = 本人費用額Ｗ + 作１－費用額
006536        COMPUTE 本人負担額Ｗ = 本人負担額Ｗ + 作１－負担額
006537        COMPUTE 本人請求額Ｗ = 本人請求額Ｗ + 作１－請求額
006538     ELSE
006539        COMPUTE 家族件数Ｗ   = 家族件数Ｗ   + 1
006540        COMPUTE 家族費用額Ｗ = 家族費用額Ｗ + 作１－費用額
006541        COMPUTE 家族負担額Ｗ = 家族負担額Ｗ + 作１－負担額
006542        COMPUTE 家族請求額Ｗ = 家族請求額Ｗ + 作１－請求額
006543     END-IF.
006544*
006547*===============================================================*
006550 作業レコード２セット SECTION.
006560*
006600     MOVE 保険種別Ｗ     TO 作２－保険種別.
006610     MOVE 保険者番号Ｗ   TO 作２－保険者番号.
006630     MOVE 件数Ｗ         TO 作２－件数.
006650     MOVE 費用額Ｗ       TO 作２－費用額.
006660     MOVE 負担額Ｗ       TO 作２－負担額.
006670     MOVE 請求額Ｗ       TO 作２－請求額.
006671*
006672     MOVE 本人件数Ｗ     TO 作２－本人件数.
006673     MOVE 本人費用額Ｗ   TO 作２－本人費用額.
006674     MOVE 本人負担額Ｗ   TO 作２－本人負担額.
006675     MOVE 本人請求額Ｗ   TO 作２－本人請求額.
006676     MOVE 家族件数Ｗ     TO 作２－家族件数.
006677     MOVE 家族費用額Ｗ   TO 作２－家族費用額.
006678     MOVE 家族負担額Ｗ   TO 作２－家族負担額.
006679     MOVE 家族請求額Ｗ   TO 作２－家族請求額.
006680*
006681     MOVE 県ＷＫ２       TO 作２－県.
006682*
006683     PERFORM 印刷順序セット.
006684     MOVE    印刷順序Ｗ  TO 作２－印刷順序.
006685*
006687*===============================================================*
006690 作業ファイル２書込 SECTION.
006700*
006710     WRITE 作２－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作２" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006790*================================================================*
006800 ファイル閉鎖 SECTION.
006810*
006820     CLOSE 受診者情報Ｆ
006821           請求先マスタ 市町村マスタ レセプトＦ.
006830*================================================================*
006840 終了処理 SECTION.
006850*
006860     PERFORM ファイル閉鎖.
006861*================================================================*
006862*================================================================*
006863 県内県外取得 SECTION.
006864*
006865      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
006866      EVALUATE  保険種別県用ＷＫ
006867* 国保
006868      WHEN  01
006869         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
006870            MOVE  1  TO  県内県外チェック
006871         END-IF
006872         MOVE 受－保険者番号(1:2) TO 県ＷＫ
006873* 社保
006874      WHEN  02
      */協会健保の対応/081009
               IF 受－保険者番号(5:5) = SPACE
006875             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
006876                MOVE  1  TO  県内県外チェック
006877             END-IF
006878             MOVE 受－保険者番号(1:2) TO 県ＷＫ
006879             PERFORM 県統一
006880             MOVE 県統一ＷＫ TO 県ＷＫ
               ELSE
                   IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
                       MOVE  1  TO  県内県外チェック
                   END-IF
                   MOVE 受－保険者番号(3:2) TO 県ＷＫ
               END-IF
006881* 船員
006882* 日雇
006883* 組合
006884* 共済
006885* 自衛官
006886* 退職国保
006887      WHEN  06
006888      WHEN  07
006889      WHEN  08
006890      WHEN  09
006891      WHEN  04
006892      WHEN  03
006893         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
006894            MOVE  1  TO  県内県外チェック
006895         END-IF
006896         MOVE 受－保険者番号(3:2) TO 県ＷＫ
006897* 助成
006898      WHEN 50 THRU 60
006899         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
006900            MOVE  1  TO  県内県外チェック
006901         END-IF
006902         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
006903* 老人
006904      WHEN  05
006905         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
006906            MOVE  1  TO  県内県外チェック
006907         END-IF
006908         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
006910* 労災、自賠責・自費・生保単独は除外
006911      WHEN  70
006912      WHEN  80
006912      WHEN  85
006913      WHEN  90
006914      WHEN  ZERO
006915         CONTINUE
006916*
006917     WHEN OTHER
006918         MOVE SPACE                TO エラーメッセージＷ
006919         MOVE 受－患者コード       TO エラー患者コードＷ
006920         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
006921         MOVE "-"                  TO エラー区切りＷ
006922         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
006923         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
006924         CALL   "MSG003"
006925         CANCEL "MSG003"
006926     END-EVALUATE.
006927*
006928*================================================================*
006929 県統一 SECTION.
006930*
006931     MOVE ZERO  TO  県統一ＷＫ.
006932     EVALUATE  県ＷＫ
006933*北海道
006934      WHEN  01
006935         MOVE 01 TO 県統一ＷＫ
006936*青森
006937      WHEN  02
006938         MOVE 02 TO 県統一ＷＫ
006939*岩手
006940      WHEN  03
006941         MOVE 03 TO 県統一ＷＫ
006942*宮城
006943      WHEN  04
006944         MOVE 04 TO 県統一ＷＫ
006945*秋田
006946      WHEN  05
006947         MOVE 05 TO 県統一ＷＫ
006948*山形
006949      WHEN  06
006950         MOVE 06 TO 県統一ＷＫ
006951*福島
006952      WHEN  07
006953         MOVE 07 TO 県統一ＷＫ
006954*茨城
006955      WHEN  08
006956         MOVE 08 TO 県統一ＷＫ
006957*栃木
006958      WHEN  09
006959         MOVE 09 TO 県統一ＷＫ
006960*群馬
006961      WHEN  10
006962         MOVE 10 TO 県統一ＷＫ
006963*埼玉
006964      WHEN  11
006965         MOVE 11 TO 県統一ＷＫ
006966*千葉
006967      WHEN  12
006968         MOVE 12 TO 県統一ＷＫ
006969*東京
006970      WHEN  21
006971         MOVE 13 TO 県統一ＷＫ
006972*神奈川
006973      WHEN  31
006974         MOVE 14 TO 県統一ＷＫ
006975*新潟
006976      WHEN  32
006977         MOVE 15 TO 県統一ＷＫ
006978*富山
006979      WHEN  33
006980         MOVE 16 TO 県統一ＷＫ
006981*石川
006982      WHEN  34
006983         MOVE 17 TO 県統一ＷＫ
006984*福井
006985      WHEN  35
006986         MOVE 18 TO 県統一ＷＫ
006987*山梨
006988      WHEN  36
006989         MOVE 19 TO 県統一ＷＫ
006990*長野
006991      WHEN  37
006992         MOVE 20 TO 県統一ＷＫ
006993*岐阜
006994      WHEN  38
006995         MOVE 21 TO 県統一ＷＫ
006996*静岡
006997      WHEN  39
006998         MOVE 22 TO 県統一ＷＫ
006999*愛知
007000      WHEN  51
007001         MOVE 23 TO 県統一ＷＫ
007002*三重
007003      WHEN  52
007004         MOVE 24 TO 県統一ＷＫ
007005*滋賀
007006      WHEN  53
007007         MOVE 25 TO 県統一ＷＫ
007008*京都
007009      WHEN  54
007010         MOVE 26 TO 県統一ＷＫ
007011*大阪
007012      WHEN  41
007013         MOVE 27 TO 県統一ＷＫ
007014*兵庫
007015      WHEN  42
007016         MOVE 28 TO 県統一ＷＫ
007017*奈良
007018      WHEN  55
007019         MOVE 29 TO 県統一ＷＫ
007020*和歌山
007021      WHEN  56
007022         MOVE 30 TO 県統一ＷＫ
007023*鳥取
007024      WHEN  57
007025         MOVE 31 TO 県統一ＷＫ
007026*島根
007027      WHEN  58
007028         MOVE 32 TO 県統一ＷＫ
007029*岡山
007030      WHEN  59
007031         MOVE 33 TO 県統一ＷＫ
007032*広島
007033      WHEN  60
007034         MOVE 34 TO 県統一ＷＫ
007035*山口
007036      WHEN  61
007037         MOVE 35 TO 県統一ＷＫ
007038*徳島
007039      WHEN  71
007040         MOVE 36 TO 県統一ＷＫ
007041*香川
007042      WHEN  72
007043         MOVE 37 TO 県統一ＷＫ
007044*愛媛
007045      WHEN  73
007046         MOVE 38 TO 県統一ＷＫ
007047*高知
007048      WHEN  74
007049         MOVE 39 TO 県統一ＷＫ
007050*福岡
007051      WHEN  75
007052         MOVE 40 TO 県統一ＷＫ
007053*佐賀
007054      WHEN  76
007055         MOVE 41 TO 県統一ＷＫ
007056*長崎
007057      WHEN  77
007058         MOVE 42 TO 県統一ＷＫ
007059*熊本
007060      WHEN  78
007061         MOVE 43 TO 県統一ＷＫ
007062*大分
007063      WHEN  79
007064         MOVE 44 TO 県統一ＷＫ
007065*宮崎
007066      WHEN  80
007067         MOVE 45 TO 県統一ＷＫ
007068*鹿児島
007069      WHEN  81
007070         MOVE 46 TO 県統一ＷＫ
007071*沖縄
007072      WHEN  82
007073         MOVE 47 TO 県統一ＷＫ
007074*その他
007075      WHEN  OTHER
007076         CONTINUE
007077     END-EVALUATE.
007078*
007079*================================================================*
007080*================================================================*
007081 印刷順序セット SECTION.
007082*
007083**///  印刷順序の変更はこのSECTIONで   ////**
007084*
007085*************************************************************************
007086*  印刷順序:保険名称(保険種別コード)                                    *
007087*                                                                       *
007092*    10:社保(2)                                                         *
007093*    11:日雇(6)                                                         *
007094*    20:船員(7)                                                         *
007095*    30:組合(3)                                                         *
007096*    40:共済(4)                                                         *
007097*    41:自衛官(9)                                                       *
007088*    50:国保(1)                                                         *
007089*    51:退職(8)                                                         *
007090*    52:老人(5)                                                         *
007091*    53:助成(50-60)                                                     *
007098*                                                                       *
007099*   労災、自賠責、自費、生保はのぞく                                          *
007100*                                                                       *
007101* ※ 国保系を 6号用紙でまとめて印字する為に、50番台とする。             *
007102* ※ 社保系を 6号用紙でまとめて印字する為に、10番台とする。             *
007103*                                                                       *
007104**************************************************************************
007105*
007106*
007107      EVALUATE  保険種別Ｗ
007108* 国保
007109      WHEN  01
007110            MOVE  50  TO  印刷順序Ｗ
007111* 社保
007112      WHEN  02
007113            MOVE  10  TO  印刷順序Ｗ
007114* 船員
007115      WHEN  07
007116            MOVE  20  TO  印刷順序Ｗ
007117* 日雇
007118      WHEN  06
007119            MOVE  11  TO  印刷順序Ｗ
007120* 組合
007121      WHEN  03
007122            MOVE  30  TO  印刷順序Ｗ
007123* 共済
007124      WHEN  04
007125            MOVE  40  TO  印刷順序Ｗ
007126* 自衛官
007127      WHEN  09
007128            MOVE  41  TO  印刷順序Ｗ
007129* 老人
007130      WHEN  05
007131            MOVE  52  TO  印刷順序Ｗ
007132* 退職国保
007133      WHEN  08
007134            MOVE  51  TO  印刷順序Ｗ
007135* 助成
007136      WHEN 50 THRU 60
007137            MOVE  53  TO  印刷順序Ｗ
007139* 労災、自賠責・自費・生保単独は除外
007140      WHEN  70
007141      WHEN  80
007141      WHEN  85
007142      WHEN  90
007143      WHEN  ZERO
007144         CONTINUE
007145*
007146     WHEN OTHER
007147         MOVE SPACE                TO エラーメッセージＷ
007148         MOVE 受－患者コード       TO エラー患者コードＷ
007149         MOVE 保険種別Ｗ           TO エラー保険種別Ｗ
007150         MOVE "-"                  TO エラー区切りＷ
007151         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
007152         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
007153         CALL   "MSG003"
007154         CANCEL "MSG003"
007155     END-EVALUATE.
007156*
007157*================================================================*
007158*================================================================*
007159 助成レセ判定 SECTION.
007160* 特別処理（助成レセまとめ）
007161     MOVE SPACE TO 助成レセまとめフラグ.
007162*
007163     IF 受－助成種別 NOT = ZERO  
      */後期高齢を追加/101111
007164            IF ( 受－保険種別 = 01 OR 08 OR 05)
007165                PERFORM 助成レセまとめ判定
007166            END-IF
007167     END-IF.
007168*
007169*================================================================*
007170*================================================================*
007171 助成レセまとめ判定 SECTION.
007177*
007178     MOVE SPACE TO 助成レセまとめフラグ.
007179*
           IF ( レセ－本体まとめ区分 = 1 )
042620           MOVE "YES" TO 助成レセまとめフラグ
042640     END-IF.
007209*
007229*================================================================*
007231******************************************************************
007232 END PROGRAM YAI583.
007233******************************************************************
