000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAI722.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         施術の事実（柔+ｳｨﾝﾄﾞｳｽﾞ版）
000100*         MED = YAI720 YAI722P
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2013-07-02
000130 DATE-COMPILED.          2013-07-02
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000320     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000330                             ORGANIZATION             IS  INDEXED
000340                             ACCESS MODE              IS  DYNAMIC
000350                             RECORD KEY               IS  制－制御区分
000360                             FILE STATUS              IS  状態キー
000370                             LOCK        MODE         IS  AUTOMATIC.
000380     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000390                             ORGANIZATION             IS  INDEXED
000400                             ACCESS MODE              IS  DYNAMIC
000410                             RECORD KEY               IS 受－施術和暦年月
000420                                                          受－患者コード
000430                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000440                                                          受－患者カナ
000450                                                          受－患者コード
000460                             ALTERNATE RECORD KEY     IS  受－患者コード
000470                                                         受－施術和暦年月
000480                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000490                                                          受－保険種別
000500                                                          受－保険者番号
000510                                                          受－患者コード
000520                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000530                                                          受－公費種別
000540                                                     受－費用負担者番号
000550                                                          受－患者コード
000560                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000570                                                          受－助成種別
000580                                                  受－費用負担者番号助成
000590                                                          受－患者コード
000600                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000610                                                      受－施術和暦年月
000620                                                      受－患者コード
000630                             FILE STATUS              IS  状態キー
000640                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  作業ファイル１  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7211L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作１－施術和暦年月日
000610                                                          作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－施術和暦年月日
                                                                作１－患者カナ
                                                                作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－患者コード
                                                                作１－施術和暦年月日
000910                             ALTERNATE RECORD KEY     IS  作１－患者カナ
                                                                作１－患者コード
                                                                作１－施術和暦年月日
000620                             FILE        STATUS       IS  状態キー
000630                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  作業ファイル２  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7212L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作２－施術和暦年月
000610                                                          作２－患者コード
000620                             FILE        STATUS       IS  状態キー
000630                             LOCK        MODE         IS  AUTOMATIC.
000720     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF002
000730                             SYMBOLIC    DESTINATION  IS "PRT"
000740                             FORMAT                   IS  定義体名Ｐ
000750                             GROUP                    IS  項目群名Ｐ
000760                             PROCESSING  MODE         IS  処理種別Ｐ
000770                             UNIT        CONTROL      IS  拡張制御Ｐ
000780                             FILE        STATUS       IS  通知情報Ｐ.
000790******************************************************************
000800*                      DATA DIVISION                             *
000810******************************************************************
000820 DATA                    DIVISION.
000830 FILE                    SECTION.
000870*                           ［ＲＬ＝  ２５６］
000880 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000890     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000900*                           ［ＲＬ＝  ３２０］
000910 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000920     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001310*****************
001320* 作業ファイル１ *
001330*****************
001340*                         ［ＲＬ＝  １６０］
001350 FD  作業ファイル１ RECORD  CONTAINS 160 CHARACTERS.
001360 01 作１－レコード.
001370    03 作１－レコードキー.
001535       05 作１－施術和暦年月日.
001536          07 作１－施術和暦               PIC 9.
001537          07 作１－施術年月.
001538             09 作１－施術年              PIC 9(2).
001539             09 作１－施術月              PIC 9(2).
001540          07 作１－施術日                 PIC 9(2).
001460       05 作１－患者コード.
001470          07 作１－患者番号                PIC 9(6).
001480          07 作１－枝番                    PIC X(1).
001490    03 作１－レコードデータ.
             05 作１－患者カナ                   PIC X(50).
             05 作１－患者氏名                   PIC X(50).
             05 作１－料金.
001550          07 作１－初検金額                PIC 9(5).
                07 作１－加算金額                PIC 9(5).
001550          07 作１－整復金額                PIC 9(5).
001550          07 作１－後療金額                PIC 9(5).
001550          07 作１－罨法金額                PIC 9(5).
001550          07 作１－電療金額                PIC 9(5).
001551          07 作１－費用額                  PIC 9(5).
001551          07 作１－一部負担金              PIC 9(5).
001500       05 FILLER                           PIC X(6).
001340*                         ［ＲＬ＝  １２８］
001350 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
001360 01 作２－レコード.
001370    03 作２－レコードキー.
001535       05 作２－施術和暦年月.
001536          07 作２－施術和暦                PIC 9.
001537          07 作２－施術年月.
001538             09 作２－施術年               PIC 9(2).
001539             09 作２－施術月               PIC 9(2).
001460       05 作２－患者コード.
001470          07 作２－患者番号                PIC 9(6).
001480          07 作２－枝番                    PIC X(1).
001490    03 作２－レコードデータ.
             05 作２－初検計                     PIC 9(5).
001550       05 作２－加算計                     PIC 9(5).
001550       05 作２－整復計                     PIC 9(5).
001550       05 作２－後療計                     PIC 9(5).
001550       05 作２－罨法計                     PIC 9(5).
001550       05 作２－電療計                     PIC 9(5).
001551       05 作２－費用計                     PIC 9(6).
001551       05 作２－負担計                     PIC 9(5).
             05 作２－月合計.
001551          07 作２－実日数合計              PIC 9(2).
001551          07 作２－費用合計                PIC 9(7).
001551          07 作２－負担合計                PIC 9(6).
001551          07 作２－請求合計                PIC 9(7).
001500       05 FILLER                           PIC X(53).
001150*
001160 FD  印刷ファイル.
001170     COPY YAI722P        OF  XMDLIB.
001180*----------------------------------------------------------------*
001190******************************************************************
001200*                WORKING-STORAGE SECTION                         *
001210******************************************************************
001220 WORKING-STORAGE         SECTION.
001230 01 キー入力                           PIC X     VALUE SPACE.
001240 01 状態キー                           PIC X(2)  VALUE SPACE.
001250 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001260 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001270 01 初検フラグ                         PIC X(3)  VALUE SPACE.
001280 01 ファイル名                         PIC N(6)  VALUE SPACE.
001290 01 レセプトＰＧＷ                     PIC X(8)  VALUE SPACE.
001300 01 前和暦Ｗ                           PIC 9     VALUE ZERO.
001310 01 カレント元号Ｗ                     PIC 9(1)  VALUE ZERO.
001210 01 オープンフラグ                     PIC X(3)   VALUE SPACE.
001330 01 部位ＣＮＴ                         PIC 9     VALUE ZERO.
001330 01 カウンタ                           PIC 9(2)  VALUE ZERO.
001330 01 カウンタ１                         PIC 9(2)  VALUE ZERO.
001330 01 月段数Ｗ                           PIC 9(1)  VALUE ZERO.
001340 01 患者番号Ｗ                         PIC 9(6)  VALUE ZERO.
001720 01 確認Ｗ                             PIC X(4) VALUE SPACE.
001240 01 行カウンタ                         PIC 9(2) VALUE 0.
001260 01 最大行数                           PIC 9(2) VALUE 0.
001270 01 ヘッダ行数                         PIC 9(2) VALUE 0.
001280 01 移動行数Ｗ                         PIC 9(2) VALUE 0.
001363 01 全角空白                           PIC X(2)  VALUE X"8140".
001364 01 半角空白                           PIC X(2)  VALUE X"2020".
001350**
001360 01 遅延フラグ                         PIC X(3) VALUE SPACE.
001370 01 遅延回数Ｗ                         PIC 9(4) VALUE ZERO.
001380 01 遅延ＣＮＴ                         PIC 9(5) VALUE ZERO.
001390**
001360 01 合計Ｗ.
001380    03 初検料計Ｗ                      PIC 9(5) VALUE ZERO.
001390    03 加算料計Ｗ                      PIC 9(5) VALUE ZERO.
001390    03 整復料計Ｗ                      PIC 9(5) VALUE ZERO.
001400    03 後療料計Ｗ                      PIC 9(5) VALUE ZERO.
001400    03 罨法料計Ｗ                      PIC 9(5) VALUE ZERO.
001400    03 電療料計Ｗ                      PIC 9(5) VALUE ZERO.
001400    03 負担金計Ｗ                      PIC 9(5) VALUE ZERO.
001400*
001360 01 料金Ｗ.
001380    03 初検料Ｗ                        PIC 9(5) VALUE ZERO.
001390    03 加算料Ｗ                        PIC 9(5) VALUE ZERO.
001390    03 整復料Ｗ                        PIC 9(5) VALUE ZERO.
001400    03 後療料Ｗ                        PIC 9(5) VALUE ZERO.
001400    03 罨法料Ｗ                        PIC 9(5) VALUE ZERO.
001400    03 電療料Ｗ                        PIC 9(5) VALUE ZERO.
001400    03 負担金Ｗ                        PIC 9(5) VALUE ZERO.
001410****************
001420* 連結項目待避 *
001430****************
001440*    ************
001450*    * 印刷キー *
001460*    ************
001470 01 対象データＷＲ.
001480    03 施術和暦年月ＷＲ.
001490       05 施術和暦ＷＲ                  PIC 9(1)  VALUE ZERO.
001500       05 施術年ＷＲ                    PIC 9(2)  VALUE ZERO.
001510       05 施術月ＷＲ                    PIC 9(2)  VALUE ZERO.
001520    03 開始日ＷＲ                       PIC 9(2)  VALUE ZERO.
001530    03 終了日ＷＲ                       PIC 9(2)  VALUE ZERO.
001540    03 患者カナＷＲ                     PIC X(50) VALUE SPACE.
001550    03 患者コードＷ.
001560       05 患者番号Ｗ                    PIC 9(6)  VALUE ZERO.
001570       05 枝番Ｗ                        PIC X(1)  VALUE SPACE.
001580    03 印刷モードＦＷＲ                 PIC 9(1)  VALUE ZERO.
001630    03 印字位置ＣＮＴ                   PIC 9(2)  VALUE ZERO.
001640**************
001650* 受診者情報 *
001660**************
001670 01 受診者情報Ｗ.
001680    03 施術年月Ｗ.
001690       05 施術和暦Ｗ                   PIC 9(1)   VALUE ZERO.
001690       05 施術年Ｗ                     PIC 9(2)   VALUE ZERO.
001700       05 施術月Ｗ                     PIC 9(2)   VALUE ZERO.
001710    03 保険者番号Ｗ.
001720       05 印刷保険者番号Ｗ             PIC X(6)   VALUE SPACE.
001730       05 FILLER                       PIC X(4)   VALUE SPACE.
001740    03 退職保険者番号Ｗ.
001750       05 FILLER                       PIC X(2)   VALUE SPACE.
001760       05 退職印刷保険者番号Ｗ         PIC X(6)   VALUE SPACE.
001770       05 FILLER                       PIC X(2)   VALUE SPACE.
001780    03 市町村番号Ｗ.
001790       05 印刷市町村番号Ｗ             PIC X(8)   VALUE SPACE.
001800       05 FILLER                       PIC X(2)   VALUE SPACE.
001810    03 保険種別Ｗ                      PIC 9(2)   VALUE ZERO.
001810    03 公費種別Ｗ                      PIC 9(2)   VALUE ZERO.
001810    03 助成種別Ｗ                      PIC 9(2)   VALUE ZERO.
001820    03 患者情報Ｗ.
001830       05 患者カナＷ                   PIC X(50)  VALUE SPACE.
001840       05 患者氏名Ｗ                   PIC X(50)  VALUE SPACE.
       01 患者氏名ＷＰ.
          03 患者名ＷＰ                      OCCURS 10. 
             05 患者名Ｗ                        PIC N(1)   VALUE SPACE.
       01 コメントＷ.
          03 コメント１Ｗ                       PIC X(50) VALUE SPACE.
          03 コメント２Ｗ                       PIC X(50) VALUE SPACE.
002210*******************************************************************
002220 01 印刷制御.
002230     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
002240     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
002250     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
002260     03 拡張制御Ｐ.
002270         05 端末制御Ｐ.
002280             07 移動方向Ｐ             PIC X(1) VALUE SPACE.
002290             07 移動行数Ｐ             PIC 9(3) VALUE ZERO.
002300         05 詳細制御Ｐ                 PIC X(2) VALUE SPACE.
002310     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
002320     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
002330*
002340 01 計算機西暦年Ｗ                     PIC 9(2) VALUE ZERO.
002350* 日付ＷＯＲＫ
002360 01 和暦終了年Ｗ                       PIC 9(4) VALUE ZERO.
002370 01 計算機西暦.
002380    03 計算機西暦年                    PIC 9(4) VALUE ZERO.
002390    03 計算機西暦月日                  PIC 9(4) VALUE ZERO.
002400 01 計算機西暦Ｒ REDEFINES 計算機西暦.
002410    03 計算機世紀                      PIC 9(2).
002420    03 計算機日付                      PIC 9(6).
002430    03 計算機日付Ｒ REDEFINES 計算機日付.
002440       05 計算機年月                   PIC 9(4).
002450       05 計算機年月Ｒ REDEFINES 計算機年月.
002460         07 計算機年                   PIC 9(2).
002470         07 計算機月                   PIC 9(2).
002480       05 計算機日                     PIC 9(2).
002490*
002500******************************************************************
002510*                          連結項目                              *
002520******************************************************************
002510**********************
002520* メッセージ表示キー *
002530**********************
002540 01 連メ－キー IS EXTERNAL.
002550    03  連メ－メッセージ                 PIC N(20).
002560*
002870************
002880* 印刷キー *
002890************
002900 01 連印－対象データＹＡＩ７２０ IS EXTERNAL.
003120    03 連印－施術和暦年月日.
003130       05 連印－施術和暦                  PIC 9(1).
003140       05 連印－施術年                    PIC 9(2).
003150       05 連印－施術月                    PIC 9(2).
003150       05 連印－施術日                    PIC 9(2).
003190    03 連印－患者コード.
003200       05 連印－患者番号                  PIC 9(6).
003210       05 連印－枝番                      PIC X(1).
003020    03 連印－氏名モード                   PIC 9(1).
          03 連印－金属モード                   PIC 9(1).
003020    03 連印－明細モード                   PIC 9(1).
003020    03 連印－月合計モード                 PIC 9(1).
003020    03 連印－月合計段数                   PIC 9(1).
          03 連印－請求月日.
             05 連印－請求月                    PIC 9(2).
             05 連印－請求日                    PIC 9(2).
          03 連印－読み順                       PIC X(4).
003070    03 連印－段数                         PIC 9(2).
003070    03 連印－処理キー                     PIC X(4).
003110 01 連印－印刷データＹＡＩ７２１ IS EXTERNAL.
          03 連印－前期高齢                     PIC 9(1).
          03 連印－負担割合                     PIC 9(2).
003170    03 連印－金属副子                     PIC 9(5).
003170    03 連印－大                           PIC 9(1).
003170    03 連印－中                           PIC 9(1).
003170    03 連印－小                           PIC 9(1).
003170    03 連印－情報提供                     PIC 9(5).
003080****************
003090* 画面入力情報 *
003100****************
003110 01 連入－入力データＹＡＩ７２０ IS EXTERNAL.
003120    03 連入－開始和暦年月日.
003130       05 連入－開始和暦                  PIC 9(1).
003140       05 連入－開始年                    PIC 9(2).
003150       05 連入－開始月                    PIC 9(2).
003150       05 連入－開始日                    PIC 9(2).
003120    03 連入－終了和暦年月日.
003130       05 連入－終了和暦                  PIC 9(1).
003140       05 連入－終了年                    PIC 9(2).
003150       05 連入－終了月                    PIC 9(2).
003150       05 連入－終了日                    PIC 9(2).
003170    03 連入－保険種別                     PIC 9(2).
003180    03 連入－本人家族区分                 PIC 9(1).
003190    03 連入－患者コード.
003200       05 連入－患者番号                  PIC 9(6).
003210       05 連入－枝番                      PIC X(1).
          03 連入－印刷条件                     PIC 9(2).
      *
       01 連入－表示フラグＹＡＩ７２０ IS EXTERNAL.
          03 連入－プレビュー区分               PIC 9(1).
004580*
000540************************************
000550* プリンタファイル作成用           *
000560************************************
000570 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
000580     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
000590     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
000600     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
000610     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
000993************************************
000994* プリンタファイル作成特殊用       *
000995************************************
000996 01 Ｈ連特殊ＰＲＴＦ－作成データ IS EXTERNAL.
000997     03 Ｈ連特殊ＰＲＴＦ－用紙種類         PIC X(8).
003080*
003090******************************************************************
003100*                      PROCEDURE  DIVISION                       *
003110******************************************************************
003120 PROCEDURE               DIVISION.
003130************
003140*           *
003150* 初期処理   *
003160*           *
003170************
002570     PERFORM プリンタファイル作成.
003180     PERFORM 初期化.
003190     PERFORM 制御情報取得.
003200************
003210*           *
003220* 主処理     *
003230*           *
003240************
003250* 印刷
003290     PERFORM 印刷セット１.
003350************
003360*           *
003370* 終了処理   *
003380*           *
003390************
003400     PERFORM 終了処理.
003410     PERFORM 遅延処理.
003420     EXIT PROGRAM.
003430*
003440*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002860*================================================================*
002870 プリンタファイル作成 SECTION.
002880*================================================================*
002890*   / 初期化 /
002900     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
002910     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
002225     MOVE SPACE TO Ｈ連特殊ＰＲＴＦ－作成データ.
002226     INITIALIZE Ｈ連特殊ＰＲＴＦ－作成データ.
002920*
002930*
002940*--↓↓ 変更箇所 ↓↓--------------------------------------*
002230*   使用する用紙種別セット
           MOVE "KARUTE"              TO Ｈ連特殊ＰＲＴＦ－用紙種類.
002970*   使用するプリンタファイル名セット
002231     MOVE "PRTF002"             TO Ｈ連ＰＲＴＦ－ファイル名.
002972*
002973*   使用する帳票プログラム名セット
002974     MOVE "YAI722"             TO Ｈ連ＰＲＴＦ－帳票プログラム名.
002975*
002976*--↑↑-----------------------------------------------------*
002980*
002990*   / プレビュー区分セット /
003000     MOVE 連入－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003000*     MOVE 1 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003010*
003020     CALL   "CRTPRTF".
003030     CANCEL "CRTPRTF".
003040*
003450*================================================================*
003460 初期化 SECTION.
003470*
004040     OPEN INPUT   制御情報マスタ
004050         MOVE NC"制御情報" TO ファイル名.
004060         PERFORM オープンチェック.
004070     OPEN INPUT   受診者情報Ｆ.
004080         MOVE NC"受情" TO ファイル名.
004090         PERFORM オープンチェック.
004100     OPEN INPUT 作業ファイル１
004110         MOVE NC"作業１" TO ファイル名.
004120         PERFORM オープンチェック.
004100     OPEN INPUT 作業ファイル２
004110         MOVE NC"作業２" TO ファイル名.
004120         PERFORM オープンチェック.
004130*     OPEN I-O   印刷ファイル
004140*         PERFORM エラー処理Ｐ.
004150*================================================================*
004160 オープンチェック SECTION.
004170*
004180     IF 状態キー  NOT =  "00"
004190         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004200         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004210         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004220                                                 UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
004230         ACCEPT  キー入力 FROM CONS
004240         PERFORM ファイル閉鎖
004250         EXIT PROGRAM.
004260*================================================================*
004270 制御情報取得 SECTION.
004280*
004290     MOVE ZERO TO 制－制御区分
004300     READ 制御情報マスタ
004310     NOT INVALID KEY
004320         MOVE 制－遅延回数       TO 遅延回数Ｗ
004330     END-READ.
004340*
004350*================================================================*
004360 遅延処理 SECTION.
004370*
004380     PERFORM VARYING 遅延ＣＮＴ FROM 1 BY 1
004390                                UNTIL 遅延ＣＮＴ > 遅延回数Ｗ
004400         MOVE SPACE TO 遅延フラグ
004410     END-PERFORM.
004420*
004590*================================================================*
004600 印刷セット１ SECTION.
004610*
002940     MOVE SPACE TO 終了フラグ.
002950     MOVE ZERO  TO 行カウンタ.
002980     PERFORM 合計値初期化.
           INITIALIZE YAI722P.
           MOVE SPACE TO YAI722P.
           MOVE 連印－患者コード  TO 作１－患者コード.
           MOVE 連印－施術和暦    TO 作１－施術和暦.
           MOVE 連印－施術年      TO 作１－施術年.
           MOVE 連印－施術月      TO 作１－施術月.
           MOVE 連印－施術日      TO 作１－施術日.
           START 作業ファイル１ KEY IS >= 作１－患者コード
                                          作１－施術和暦年月日
           END-START.
013500     IF 状態キー  =  "00"
013510         MOVE SPACE  TO 終了フラグ
013520         PERFORM 作業ファイル１読込
003000         MOVE 作１－患者コード   TO 患者コードＷ
               MOVE 作１－施術和暦     TO 施術和暦Ｗ
               MOVE 作１－施術年       TO 施術年Ｗ
               MOVE 作１－施術月       TO 施術月Ｗ
               IF 連印－氏名モード = 1
                   PERFORM ヘッダ印刷処理
               END-IF
               IF 連印－金属モード = 1
                   PERFORM 金属印刷処理
               END-IF
               IF 連印－月合計段数 = ZERO
                   MOVE 1                TO 月段数Ｗ
               ELSE
                   MOVE 連印－月合計段数 TO 月段数Ｗ
               END-IF
               IF 連印－段数 = ZERO
                   MOVE 1              TO 行カウンタ
               ELSE
                   MOVE 連印－段数     TO 行カウンタ
               END-IF
003070         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
003090                       ( 作１－患者コード NOT = 患者コードＷ )
                   MOVE 行カウンタ TO カウンタ
004380             PERFORM UNTIL ( カウンタ > 31 ) OR
003090                           ( 作１－患者コード NOT = 患者コードＷ ) OR
                                 ( 終了フラグ = "YES" )
004380                 IF ( 作１－施術年 NOT = 施術年Ｗ ) OR
                          ( 作１－施術月 NOT = 施術月Ｗ )
      *                     IF 連印－合計モード = 1
003130*                         PERFORM 合計印刷処理
      *                         IF 連印－月合計モード = 1
      *                             PERFORM 月合計印刷処理
      *                         END-IF
      *                         IF カウンタ > 31
      *                             PERFORM 明細印刷
003650*                             PERFORM 改頁処理
      *                             INITIALIZE YAI722P
      *                             MOVE SPACE TO YAI722P
      *                             MOVE 1  TO 印字位置ＣＮＴ 行カウンタ カウンタ 月段数Ｗ
      *                             MOVE  NC"　　　次の用紙をセットしてください" TO 連メ－メッセージ
      *                             CALL   "MSG001"
      *                             CANCEL "MSG001"
      *                         END-IF
      *                         PERFORM 合計値初期化
      *                     ELSE
                               IF 連印－月合計モード = 1
                                   PERFORM 月合計印刷処理
                               END-IF
      *                     END-IF
                       END-IF
004640                 IF 連印－明細モード = 1
                           PERFORM 明細印刷処理
                           COMPUTE カウンタ = カウンタ + 1
                       END-IF
003590                 MOVE 作１－患者コード   TO 患者コードＷ
003590                 MOVE 作１－施術和暦     TO 施術和暦Ｗ
003590                 MOVE 作１－施術年       TO 施術年Ｗ
003590                 MOVE 作１－施術月       TO 施術月Ｗ
003600                 PERFORM 作業ファイル１読込
003610             END-PERFORM
      *             IF ( 連印－合計モード NOT = 1) AND
                   IF ((終了フラグ           = "YES"        ) OR
                      ( 作１－患者コード NOT = 患者コードＷ ))
                       IF 連印－月合計モード = 1
                           PERFORM 月合計印刷処理
                       END-IF
                   END-IF
                   IF カウンタ > 31
                       PERFORM 明細印刷
003650                 PERFORM 改頁処理
                       MOVE 1  TO 印字位置ＣＮＴ 行カウンタ 月段数Ｗ
      */１人の患者で改頁の必要がある場合次の用紙をセットさせる旨のメッセージを表示する。↓↓↓20328
      *                 IF 終了フラグ = "YES"
      *                    IF 連印－合計モード = 1
      *                         MOVE  NC"　　　次の用紙をセットしてください" TO 連メ－メッセージ
      *                         CALL   "MSG001"
      *                         CANCEL "MSG001"
      *                     END-IF
      *                 ELSE
                           IF (作１－患者コード = 患者コードＷ)
      *                        OR (連印－合計モード = 1) 
                               MOVE  NC"　　　次の用紙をセットしてください" TO 連メ－メッセージ
                               CALL   "MSG001"
                               CANCEL "MSG001"
                               PERFORM ヘッダ印刷処理
                           END-IF
      *                 END-IF
      */１人の患者で改頁の必要がある場合次の用紙をセットさせる旨のメッセージを表示する。↑↑↑20328
HILO  */３０行ちょうどで改頁する場合、合計行が印字されない。↓↓↓20327
      */明細が３０行で終わっていて作業ファイルを読み終えているか問合せ時で１患者分の読込が終わっている場合合計行を印刷
      *                 IF ( 連印－合計モード = 1) AND
003070*                    ((終了フラグ           = "YES"        ) OR
003090*                    ( 作１－患者コード NOT = 患者コードＷ ))
      *                     INITIALIZE YAI722P
      *                     MOVE SPACE TO YAI722P
      *                     MOVE 1 TO カウンタ
      *                     PERFORM 合計印刷処理
      *                     IF 連印－月合計モード = 1
      *                         PERFORM 月合計印刷処理
      *                     END-IF
      *                     PERFORM 合計値初期化
      *                     PERFORM 明細印刷
      *                     PERFORM 改頁処理
      *                     MOVE カウンタ TO 印字位置ＣＮＴ
      *                 END-IF
HILO  */３０行ちょうどで改頁する場合、合計行が印字されない。↑↑↑20327
                   ELSE
      *                 IF 連印－合計モード = 1
      *                     IF カウンタ > 31
      *                         PERFORM 明細印刷
003650*                         PERFORM 改頁処理
      *                     END-IF
      *                     PERFORM 合計印刷処理
      *                     IF 連印－月合計モード = 1
      *                         PERFORM 月合計印刷処理
      *                     END-IF
      *                 END-IF
                       PERFORM 合計値初期化
                       PERFORM 明細印刷
                       PERFORM 改頁処理
                       MOVE カウンタ TO 印字位置ＣＮＴ
                   END-IF
003620         END-PERFORM
HILO  */行数が３１行を超えている場合は１をセットする。20329
               IF カウンタ > 31
                   MOVE 1          TO  印字位置ＣＮＴ
               ELSE
                   MOVE カウンタ   TO  印字位置ＣＮＴ
               END-IF
               PERFORM 印刷行数退避
      *         IF 月段数Ｗ > 4
      *             MOVE  NC"月合計の行がオーバーしました。" TO 連メ－メッセージ
      *             CALL   "MSG001"
      *             CANCEL "MSG001"
      *         END-IF
           END-IF.
004900*================================================================*
004910 ヘッダ印刷処理 SECTION.
004920*
           MOVE 作１－施術和暦     TO 受－施術和暦.
           MOVE 作１－施術年       TO 受－施術年.
           MOVE 作１－施術月       TO 受－施術月.
           MOVE 作１－患者コード   TO 受－患者コード.
           READ 受診者情報Ｆ.
      *
           MOVE 作１－患者番号     TO 患者番号.
           MOVE 作１－枝番         TO 枝番.
           MOVE 作１－患者氏名     TO 患者氏名.
           EVALUATE 連入－保険種別
           WHEN 1
      */全国土木建設・全国左官タイル塗装業、全国板金業は組合
               IF 受－保険者番号(1:6) = "133033" OR "133231" OR "133280"
008480             MOVE NC"○"     TO 組合チェック
               ELSE
016860             MOVE NC"○"     TO 国保チェック
               END-IF
           WHEN 2
               MOVE NC"○"         TO 社保チェック
           WHEN 3
               MOVE NC"○"         TO 組合チェック
           WHEN 4
           WHEN 9
               MOVE NC"○"         TO 共済チェック
           WHEN 5
               MOVE NC"○"         TO 後高チェック
           WHEN 6
               MOVE NC"○"         TO 日雇チェック
           WHEN 7
               MOVE NC"○"         TO 船員チェック
           WHEN 8
               MOVE NC"○"         TO 退職チェック
           WHEN 70
               MOVE NC"○"         TO 労災チェック
           WHEN 80
               MOVE NC"○"         TO 自賠チェック
           WHEN 85
               MOVE NC"○"         TO 生保チェック
           WHEN 90
               MOVE NC"○"         TO 自費チェック
           END-EVALUATE.
           IF 連印－前期高齢 = 1
               MOVE NC"○"         TO 前高チェック
           END-IF.
           EVALUATE 連印－負担割合
           WHEN 0
               MOVE NC"○"         TO ０割チェック
           WHEN 1
               MOVE NC"○"         TO １割チェック
           WHEN 2
               MOVE NC"○"         TO ２割チェック
           WHEN 3
               MOVE NC"○"         TO ３割チェック
           END-EVALUATE.
004900*================================================================*
004910 金属印刷処理 SECTION.
004920*
           MOVE 連印－金属副子     TO 金属副子.
           IF 連印－大 = 1
              MOVE NC"○"          TO 大チェック
           END-IF.
           IF 連印－中 = 1
              MOVE NC"○"          TO 中チェック
           END-IF.
           IF 連印－小 = 1
              MOVE NC"○"          TO 小チェック
           END-IF.
           MOVE 連印－情報提供     TO 情報提供.
004900*================================================================*
004910 明細印刷処理 SECTION.
004920*
005510     MOVE 作１－施術月       TO 月(カウンタ).
005520     MOVE 作１－施術日       TO 日(カウンタ).
004940********************
004950* 料金データセット *
004960********************
005010     MOVE 作１－初検金額     TO  初検料等(カウンタ).
005010     MOVE 作１－加算金額     TO  加算料(カウンタ).
005010     MOVE 作１－整復金額     TO  整復料(カウンタ).
005010     MOVE 作１－後療金額     TO  後療料(カウンタ).
005010     MOVE 作１－罨法金額     TO  罨法料(カウンタ).
005010     MOVE 作１－電療金額     TO  電療料(カウンタ).
005010     MOVE 作１－費用額       TO  合計金額(カウンタ).
005010     MOVE 作１－一部負担金   TO  窓口金額(カウンタ).
005730*================================================================*
005740 合計値初期化 SECTION.
005750*
005760     MOVE ZERO  TO 合計Ｗ.
004900*================================================================*
004910 合計印刷処理 SECTION.
004920*
           MOVE 施術和暦Ｗ   TO 作２－施術和暦.
           MOVE 施術年Ｗ     TO 作２－施術年.
           MOVE 施術月Ｗ     TO 作２－施術月.
           MOVE 患者コードＷ TO 作２－患者コード.
           READ 作業ファイル２
           NOT INVALID KEY
               MOVE NC"合計"     TO 合計(カウンタ)
               MOVE 作２－初検計 TO 初検料等(カウンタ)
               MOVE 作２－加算計 TO 加算料(カウンタ)
               MOVE 作２－整復計 TO 整復料(カウンタ)
               MOVE 作２－後療計 TO 後療料(カウンタ)
               MOVE 作２－罨法計 TO 罨法料(カウンタ)
               MOVE 作２－電療計 TO 電療料(カウンタ)
005010         MOVE 作２－費用計 TO 合計金額(カウンタ)
005010         MOVE 作２－負担計 TO 窓口金額(カウンタ)
               COMPUTE カウンタ = カウンタ + 1
           END-READ.
004900*================================================================*
004910 月合計印刷処理 SECTION.
004920*
           MOVE 施術和暦Ｗ   TO 作２－施術和暦.
           MOVE 施術年Ｗ     TO 作２－施術年.
           MOVE 施術月Ｗ     TO 作２－施術月.
           MOVE 患者コードＷ TO 作２－患者コード.
           READ 作業ファイル２
           NOT INVALID KEY
               IF 月段数Ｗ <= 4
005010             MOVE 作２－施術月     TO 合計月(月段数Ｗ)
005010             MOVE 連印－請求月     TO 請求月(月段数Ｗ)
005010             MOVE 連印－請求日     TO 請求日(月段数Ｗ)
005010             MOVE 作２－費用合計   TO 合計費用額(月段数Ｗ)
005010             MOVE 作２－負担合計   TO 合計負担額(月段数Ｗ)
                   COMPUTE 月段数Ｗ = 月段数Ｗ + 1
               END-IF
           END-READ.
007070*================================================================*
007080 作業ファイル１読込 SECTION.
007090*
007100     READ 作業ファイル１ NEXT
007110     AT END
007120         MOVE "YES" TO 終了フラグ
007130     END-READ.
007140*
007150*================================================================*
007160 明細印刷 SECTION.
007170*
      ****     PERFORM テスト印字.
004310     IF ( オープンフラグ NOT = "YES" )
004320        MOVE "YES" TO オープンフラグ
004330        OPEN I-O  印刷ファイル
004340        PERFORM エラー処理Ｐ
004350     END-IF.
011300*
007180     MOVE "YAI722P"  TO  定義体名Ｐ.
007190     MOVE "MEISAI"   TO  項目群名Ｐ.
003770     MOVE SPACE      TO  処理種別Ｐ.
007200     WRITE YAI722P.
007210     PERFORM エラー処理Ｐ.
003730*================================================================*
003740 改頁処理  SECTION.
003750*
003760     MOVE "YAI722P" TO  定義体名Ｐ.
003770     MOVE "CT"      TO  処理種別Ｐ.
003780     MOVE "PAGE"    TO  拡張制御Ｐ.
003790     MOVE SPACE     TO  項目群名Ｐ.
003800     WRITE YAI722P.
003810     PERFORM エラー処理Ｐ.
003820     MOVE SPACE     TO  拡張制御Ｐ.
003821*
           INITIALIZE YAI722P.
           MOVE SPACE TO YAI722P.
004320     MOVE SPACE     TO オープンフラグ.
003822     CLOSE  印刷ファイル.
003825*
007610*================================================================*
007620 エラー表示 SECTION.
007630*
007640     DISPLAY ファイル名   NC"ファイル書込エラー"   UPON CONS.
007650     DISPLAY NC"状態キー：" 状態キー               UPON CONS.
007660     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
007670     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
007680     ACCEPT  キー入力 FROM CONS.
007690     PERFORM ファイル閉鎖.
007700     EXIT PROGRAM.
007290*================================================================*
007300 エラー処理Ｐ SECTION.
007310*
007320     IF 通知情報Ｐ NOT = "00"
007330         DISPLAY NC"帳票エラー"              UPON CONS
007340         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
007350         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
007360         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
007370         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
007380                                             UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
007390         ACCEPT  キー入力 FROM CONS
007400         PERFORM ファイル閉鎖
007410         MOVE 99 TO PROGRAM-STATUS
007420         EXIT PROGRAM
007430     END-IF.
007440*================================================================*
007450 ファイル閉鎖 SECTION.
007460*
002990     IF ( オープンフラグ = "YES" )
002991         CLOSE 印刷ファイル
003041     END-IF.
007480     CLOSE 制御情報マスタ 受診者情報Ｆ 作業ファイル１ 作業ファイル２.
007490*================================================================*
007500 終了処理 SECTION.
007510*
007520     PERFORM ファイル閉鎖.
006850*================================================================*
006860 印刷行数退避 SECTION.
006870     CLOSE 受診者情報Ｆ.
006880     PERFORM 遅延処理.
006890     OPEN I-O 受診者情報Ｆ.
006900         MOVE NC"受診" TO ファイル名.
006910         PERFORM オープンチェック.
006920     PERFORM 遅延処理.
006930*
006940     MOVE ZERO            TO 受－施術和暦.
006950     MOVE ZERO            TO 受－施術年.
006960     MOVE ZERO            TO 受－施術月.
006970     MOVE 患者コードＷ    TO 受－患者コード.
006990*
007000     READ 受診者情報Ｆ
007010     NOT INVALID KEY
007020         MOVE 印字位置ＣＮＴ TO 受－カルテ裏印刷行数
007030         REWRITE 受－レコード
007040         INVALID KEY
007050             MOVE NC"受Ｆ" TO ファイル名
007060             PERFORM エラー表示
007070         END-REWRITE
007080     END-READ.
007090     PERFORM 遅延処理.
007100     CLOSE 受診者情報Ｆ.
007110     PERFORM 遅延処理.
007120     OPEN INPUT 受診者情報Ｆ.
007130         MOVE NC"受診" TO ファイル名.
007140         PERFORM オープンチェック.
024750*================================================================*
       テスト印字 SECTION.
      *
           MOVE NC"○"  TO 
             国保チェック 社保チェック 組合チェック 共済チェック 船員チェック
             労災チェック 自賠チェック 退職チェック 後高チェック 前高チェック
             日雇チェック 生保チェック 自費チェック 大チェック 中チェック
             小チェック ０割チェック １割チェック ２割チェック ３割チェック.
           MOVE ALL "静"  TO 患者氏名.
           MOVE ALL "9"  TO
             月(1) 月(31) 日(1) 日(31) 初検料等(1) 初検料等(31)
             加算料(1) 加算料(31) 整復料(1) 整復料(31) 後療料 (1) 
             後療料 (31) 罨法料(1) 罨法料(31) 電療料(1) 電療料(31)
             合計金額(1) 合計金額(31) 窓口金額(1) 窓口金額(31)
             合計月(1) 合計月(3) 合計月(6) 合計費用額(1) 合計費用額(3)
             合計費用額(6) 金属副子 情報提供.
007530*================================================================*
007540******************************************************************
007550 END PROGRAM YAI722.
007560******************************************************************
