000011******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YGN594.
000060 AUTHOR.                 池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*         【柔+ｳｨﾝﾄﾞｳｽﾞ版　群馬用 療養費請求書集計表】
000100*         MED = YGN580 YGN594P
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2025-01-15
000130 DATE-COMPILED.          2025-01-15
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000270                             ORGANIZATION             IS  INDEXED
000280                             ACCESS MODE              IS  DYNAMIC
000290                             RECORD KEY               IS  元－元号区分
000300                             FILE STATUS              IS  状態キー
000310                             LOCK        MODE         IS  AUTOMATIC.
000371     SELECT  施術所情報マスタ  ASSIGN      TO        SEJOHOL
000372                             ORGANIZATION             IS  INDEXED
000373                             ACCESS MODE              IS  DYNAMIC
000374                             RECORD KEY               IS  施情－施術所番号
000375                             FILE STATUS              IS  状態キー
000376                             LOCK        MODE         IS  AUTOMATIC.
000380     SELECT  作業ファイル１    ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5931L.DAT"
000390                             ORGANIZATION             IS  INDEXED
000400                             ACCESS                   IS  DYNAMIC
001110                             RECORD      KEY          IS  作１－印刷順番
001120                                                          作１－区分
000420                             FILE        STATUS       IS  状態キー
000430                             LOCK        MODE         IS  AUTOMATIC.
000440     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF001
000450                             SYMBOLIC    DESTINATION  IS "PRT"
000460                             FORMAT                   IS  定義体名Ｐ
000470                             GROUP                    IS  項目群名Ｐ
000480                             PROCESSING  MODE         IS  処理種別Ｐ
000490                             UNIT        CONTROL      IS  拡張制御Ｐ
000500                             FILE        STATUS       IS  通知情報Ｐ.
000510******************************************************************
000520*                      DATA DIVISION                             *
000530******************************************************************
000540 DATA                    DIVISION.
000550 FILE                    SECTION.
000560*                           ［ＲＬ＝  １２８］
000570 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
000580     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
000611*                           ［ＲＬ＝  ６４０］
000612 FD  施術所情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000613     COPY SEJOHO          OF  XFDLIB  JOINING   施情   AS  PREFIX.
001200*                           ［ＲＬ＝  ３２］
001420 FD  作業ファイル１ RECORD  CONTAINS 32 CHARACTERS.
001430 01  作１－レコード.
001440   03  作１－レコードキー.
001450     05  作１－印刷順番                PIC 9(2).
001460     05  作１－区分                    PIC 9(1).
001470   03  作１－レコードデータ.
001480     05  作１－件数                    PIC 9(4).
001480     05  作１－日数                    PIC 9(5).
001500     05  作１－費用額                  PIC 9(9).
001520     05  作１－請求額                  PIC 9(9).
001530     05  FILLER                        PIC X(2).
000620*
000630 FD  印刷ファイル.
000640     COPY YGN594P        OF  XMDLIB.
000800******************************************************************
000810*                WORKING-STORAGE SECTION                         *
000820******************************************************************
000830 WORKING-STORAGE         SECTION.
000840 01 キー入力                           PIC X(1) VALUE SPACE.
000850 01 状態キー                           PIC X(2) VALUE SPACE.
000860 01 終了フラグ                         PIC X(3) VALUE SPACE.
000870 01 終了フラグ２                       PIC X(3) VALUE SPACE.
000920 01 ファイル名Ｗ                       PIC N(2) VALUE SPACE.
001210 01 オープンフラグ                     PIC X(3)   VALUE SPACE.
000930 01 カレント元号Ｗ                     PIC 9(1) VALUE ZERO.
000940 01 行カウンタ                         PIC 9(2) VALUE ZERO.
000990 01 ファイル名                         PIC N(4) VALUE SPACE.
001030*
001040 01 施術和暦年月Ｗ.
001050     03 施術和暦Ｗ                   PIC 9(1).
001060     03 施術年月Ｗ.
001070        05 施術年Ｗ                  PIC 9(2).
001080        05 施術月Ｗ                  PIC 9(2).
002930*
002940 01 集計Ｗ.
002950    03 国保合計件数Ｗ                PIC 9(5).
002950    03 国保合計日数Ｗ                PIC 9(6).
002970    03 国保合計費用額Ｗ              PIC 9(9).
002990    03 国保合計請求額Ｗ              PIC 9(9).
002950    03 国保返戻合計件数Ｗ            PIC 9(5).
002950    03 国保返戻合計日数Ｗ            PIC 9(6).
002970    03 国保返戻合計費用額Ｗ          PIC 9(9).
002990    03 国保返戻合計請求額Ｗ          PIC 9(9).
002950    03 社保合計件数Ｗ                PIC 9(5).
002950    03 社保合計日数Ｗ                PIC 9(6).
002970    03 社保合計費用額Ｗ              PIC 9(9).
002990    03 社保合計請求額Ｗ              PIC 9(9).
002950    03 社保返戻合計件数Ｗ            PIC 9(5).
002950    03 社保返戻合計日数Ｗ            PIC 9(6).
002970    03 社保返戻合計費用額Ｗ          PIC 9(9).
002990    03 社保返戻合計請求額Ｗ          PIC 9(9).
002950    03 組合合計件数Ｗ                PIC 9(5).
002950    03 組合合計日数Ｗ                PIC 9(6).
002970    03 組合合計費用額Ｗ              PIC 9(9).
002990    03 組合合計請求額Ｗ              PIC 9(9).
002950    03 組合返戻合計件数Ｗ            PIC 9(5).
002950    03 組合返戻合計日数Ｗ            PIC 9(6).
002970    03 組合返戻合計費用額Ｗ          PIC 9(9).
002990    03 組合返戻合計請求額Ｗ          PIC 9(9).
002950    03 共済合計件数Ｗ                PIC 9(5).
002950    03 共済合計日数Ｗ                PIC 9(6).
002970    03 共済合計費用額Ｗ              PIC 9(9).
002990    03 共済合計請求額Ｗ              PIC 9(9).
002950    03 共済返戻合計件数Ｗ            PIC 9(5).
002950    03 共済返戻合計日数Ｗ            PIC 9(6).
002970    03 共済返戻合計費用額Ｗ          PIC 9(9).
002990    03 共済返戻合計請求額Ｗ          PIC 9(9).
002950    03 後高合計件数Ｗ                PIC 9(5).
002950    03 後高合計日数Ｗ                PIC 9(6).
002970    03 後高合計費用額Ｗ              PIC 9(9).
002990    03 後高合計請求額Ｗ              PIC 9(9).
002950    03 後高返戻合計件数Ｗ            PIC 9(5).
002950    03 後高返戻合計日数Ｗ            PIC 9(6).
002970    03 後高返戻合計費用額Ｗ          PIC 9(9).
002990    03 後高返戻合計請求額Ｗ          PIC 9(9).
001320*
001330 01 印刷制御.
001340     03 定義体名Ｐ                   PIC X(8) VALUE SPACE.
001350     03 項目群名Ｐ                   PIC X(8) VALUE SPACE.
001360     03 処理種別Ｐ                   PIC X(2) VALUE SPACE.
001370     03 拡張制御Ｐ.
001380         05 端末制御Ｐ.
001390             07 移動方向Ｐ           PIC X(1).
001400             07 移動行数Ｐ           PIC 9(3).
001410         05 詳細制御Ｐ               PIC X(2).
001420     03 通知情報Ｐ                   PIC X(2) VALUE SPACE.
001430     03 ユニット名Ｐ                 PIC X(8) VALUE SPACE.
001440*
001620******************************************************************
001630*                          連結項目                              *
001640******************************************************************
001820*
001830********************
001840* メッセージ表示キー *
001850********************
001860 01 連メ－キー IS EXTERNAL.
001870    03  連メ－メッセージ             PIC N(20).
001880*
002350****************
002360* 画面入力情報 *
002370****************
       01 連入－入力データＹＧＮ５８０ IS EXTERNAL.
          03 連入－施術和暦年月.
             05 連入－施術和暦               PIC 9(1).
             05 連入－施術年月.
                07 連入－施術年              PIC 9(2).
                07 連入－施術月              PIC 9(2).
003240*
       01 連入－入力データＹＧＮ５８５ IS EXTERNAL GLOBAL.
          03 連入－請求和暦年月日.
             05 連入－請求和暦               PIC 9(1).
             05 連入－請求年                 PIC 9(2).
             05 連入－請求月                 PIC 9(2).
             05 連入－請求日                 PIC 9(2).
          03 連入－保険者番号                PIC X(10).
      *
       01 連入－プレビュー IS EXTERNAL GLOBAL.
          03 連入－プレビュー区分            PIC 9.
      *
002940 01 連印－印刷情報ＹＧＮ５９３ IS EXTERNAL.
002950    03 連印－小計１件数                PIC 9(5).
002950    03 連印－小計１日数                PIC 9(6).
002970    03 連印－小計１合計額              PIC 9(9).
002990    03 連印－小計１請求額              PIC 9(9).
002950    03 連印－返戻小計１件数            PIC 9(5).
002950    03 連印－返戻小計１日数            PIC 9(6).
002970    03 連印－返戻小計１合計額          PIC 9(9).
002990    03 連印－返戻小計１請求額          PIC 9(9).
002950    03 連印－小計２件数                PIC 9(5).
002950    03 連印－小計２日数                PIC 9(6).
002970    03 連印－小計２合計額              PIC 9(9).
002990    03 連印－小計２請求額              PIC 9(9).
002950    03 連印－返戻小計２件数            PIC 9(5).
002950    03 連印－返戻小計２日数            PIC 9(6).
002970    03 連印－返戻小計２合計額          PIC 9(9).
002990    03 連印－返戻小計２請求額          PIC 9(9).
002950    03 連印－合計件数                  PIC 9(5).
002950    03 連印－合計日数                  PIC 9(6).
002970    03 連印－合計合計額                PIC 9(9).
002990    03 連印－合計請求額                PIC 9(9).
002950    03 連印－返戻合計件数              PIC 9(5).
002950    03 連印－返戻合計日数              PIC 9(6).
002970    03 連印－返戻合計合計額            PIC 9(9).
002990    03 連印－返戻合計請求額            PIC 9(9).
000540************************************
000550* プリンタファイル作成用           *
000560************************************
000570 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
000580     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
000590     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
000600     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
000610     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
002470
002480******************************************************************
002490*                      PROCEDURE  DIVISION                       *
002500******************************************************************
002510 PROCEDURE               DIVISION.
002520************
002530*           *
002540* 初期処理   *
002550*           *
002560************
002560     MOVE SPACE TO オープンフラグ.
002570     PERFORM プリンタファイル作成.
002570     PERFORM 初期化.
002580************
002590*           *
002600* 主処理     *
002610*           *
002620************
002630*
002640     PERFORM 印刷処理.
002650************
002660*           *
002670* 終了処理   *
002680*           *
002690************
002700     PERFORM 終了処理.
002710     EXIT PROGRAM.
002720*
002730*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002860*================================================================*
002870 プリンタファイル作成 SECTION.
002880*================================================================*
002890*   / 初期化 /
002900     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
002910     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
002920*
002930*
002940*--↓↓ 変更箇所 ↓↓--------------------------------------*
002970*   使用するプリンタファイル名セット
002971     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
002972*
002973*   使用する帳票プログラム名セット
002974     MOVE "YGN594"              TO Ｈ連ＰＲＴＦ－帳票プログラム名.
002975*
002976*--↑↑-----------------------------------------------------*
002980*
002990*   / プレビュー区分セット /
003000     MOVE 連入－プレビュー区分   TO Ｈ連ＰＲＴＦ－プレビュー区分.
003000*     MOVE 1 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003010*
003020     CALL   "CRTPRTF".
003030     CANCEL "CRTPRTF".
003040*
002740*================================================================*
002750 初期化 SECTION.
002760*
002770     OPEN INPUT 元号マスタ.
002780             MOVE NC"元号" TO ファイル名Ｗ.
002790             PERFORM オープンチェック.
002821     OPEN INPUT 施術所情報マスタ
002822             MOVE NC"施情" TO ファイル名Ｗ.
002823             PERFORM オープンチェック.
002830     OPEN INPUT 作業ファイル１.
002840             MOVE NC"作１" TO ファイル名Ｗ.
002850             PERFORM オープンチェック.
002880*
003000*================================================================*
003010 オープンチェック SECTION.
003020*
003030     IF 状態キー  NOT =  "00"
003040         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
003050         DISPLAY NC"状態キー：" 状態キー           UPON CONS
003060         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003070                                                   UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
003080         ACCEPT  キー入力 FROM CONS
003090         PERFORM ファイル閉鎖
003100         EXIT PROGRAM.
003200*================================================================*
003210 ファイル閉鎖 SECTION.
003590*
003570     IF ( オープンフラグ = "YES" )
003580         CLOSE 印刷ファイル
003590     ELSE
003600         MOVE  NC"　　データが０件です。確認して下さい。" TO 連メ－メッセージ
003610         CALL   "MSG001"
003620         CANCEL "MSG001"
003630     END-IF.
003220*
003230     CLOSE 元号マスタ 施術所情報マスタ 作業ファイル１.
003240*================================================================*
003250 終了処理 SECTION.
003260*
003270     PERFORM ファイル閉鎖.
003280*================================================================*
003290 印刷処理 SECTION.
003300*
005120     INITIALIZE YGN594P.
003310     PERFORM ヘッダ印刷処理.
003320*
           INITIALIZE 集計Ｗ.
003330     MOVE SPACE  TO 終了フラグ.
003340     MOVE ZERO   TO 作１－印刷順番.
003340     MOVE ZERO   TO 作１－区分.
003350     START 作業ファイル１ KEY IS > 作１－印刷順番
                                         作１－区分
003360     END-START.
003370     IF 状態キー = "00"
003380         PERFORM 作業ファイル１読込
               PERFORM UNTIL 終了フラグ NOT = SPACE
                  PERFORM 明細セット
                  PERFORM 集計処理
003380            PERFORM 作業ファイル１読込
               END-PERFORM
           END-IF.
           PERFORM 合計セット.
005058     PERFORM 明細印字.
      *
005078*================================================================*
005079 明細セット  SECTION.
005080*
           EVALUATE 作１－印刷順番
           WHEN 11
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 協県内本件数
004050             MOVE 作１－日数       TO 協県内本日数
004080             MOVE 作１－費用額     TO 協県内本合計額
004100             MOVE 作１－請求額     TO 協県内本請求額
               ELSE
004050             MOVE 作１－件数       TO 協返戻県内本件数
004050             MOVE 作１－日数       TO 協返戻県内本日数
004080             MOVE 作１－費用額     TO 協返戻県内本合計額
004100             MOVE 作１－請求額     TO 協返戻県内本請求額
               END-IF
           WHEN 12
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 協県内家件数
004050             MOVE 作１－日数       TO 協県内家日数
004080             MOVE 作１－費用額     TO 協県内家合計額
004100             MOVE 作１－請求額     TO 協県内家請求額
               ELSE
004050             MOVE 作１－件数       TO 協返戻県内家件数
004050             MOVE 作１－日数       TO 協返戻県内家日数
004080             MOVE 作１－費用額     TO 協返戻県内家合計額
004100             MOVE 作１－請求額     TO 協返戻県内家請求額
               END-IF
           WHEN 13
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 協県外本件数
004050             MOVE 作１－日数       TO 協県外本日数
004080             MOVE 作１－費用額     TO 協県外本合計額
004100             MOVE 作１－請求額     TO 協県外本請求額
               ELSE
004050             MOVE 作１－件数       TO 協返戻県外本件数
004050             MOVE 作１－日数       TO 協返戻県外本日数
004080             MOVE 作１－費用額     TO 協返戻県外本合計額
004100             MOVE 作１－請求額     TO 協返戻県外本請求額
               END-IF
           WHEN 14
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 協県外家件数
004050             MOVE 作１－日数       TO 協県外家日数
004080             MOVE 作１－費用額     TO 協県外家合計額
004100             MOVE 作１－請求額     TO 協県外家請求額
               ELSE
004050             MOVE 作１－件数       TO 協返戻県外家件数
004050             MOVE 作１－日数       TO 協返戻県外家日数
004080             MOVE 作１－費用額     TO 協返戻県外家合計額
004100             MOVE 作１－請求額     TO 協返戻県外家請求額
               END-IF
           WHEN 21
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 組県内本件数
004050             MOVE 作１－日数       TO 組県内本日数
004080             MOVE 作１－費用額     TO 組県内本合計額
004100             MOVE 作１－請求額     TO 組県内本請求額
               ELSE
004050             MOVE 作１－件数       TO 組返戻県内本件数
004050             MOVE 作１－日数       TO 組返戻県内本日数
004080             MOVE 作１－費用額     TO 組返戻県内本合計額
004100             MOVE 作１－請求額     TO 組返戻県内本請求額
               END-IF
           WHEN 22
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 組県内家件数
004050             MOVE 作１－日数       TO 組県内家日数
004080             MOVE 作１－費用額     TO 組県内家合計額
004100             MOVE 作１－請求額     TO 組県内家請求額
               ELSE
004050             MOVE 作１－件数       TO 組返戻県内家件数
004050             MOVE 作１－日数       TO 組返戻県内家日数
004080             MOVE 作１－費用額     TO 組返戻県内家合計額
004100             MOVE 作１－請求額     TO 組返戻県内家請求額
               END-IF
           WHEN 23
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 組県外本件数
004050             MOVE 作１－日数       TO 組県外本日数
004080             MOVE 作１－費用額     TO 組県外本合計額
004100             MOVE 作１－請求額     TO 組県外本請求額
               ELSE
004050             MOVE 作１－件数       TO 組返戻県外本件数
004050             MOVE 作１－日数       TO 組返戻県外本日数
004080             MOVE 作１－費用額     TO 組返戻県外本合計額
004100             MOVE 作１－請求額     TO 組返戻県外本請求額
               END-IF
           WHEN 24
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 組県外家件数
004050             MOVE 作１－日数       TO 組県外家日数
004080             MOVE 作１－費用額     TO 組県外家合計額
004100             MOVE 作１－請求額     TO 組県外家請求額
               ELSE
004050             MOVE 作１－件数       TO 組返戻県外家件数
004050             MOVE 作１－日数       TO 組返戻県外家日数
004080             MOVE 作１－費用額     TO 組返戻県外家合計額
004100             MOVE 作１－請求額     TO 組返戻県外家請求額
               END-IF
           WHEN 31
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 共本件数
004050             MOVE 作１－日数       TO 共本日数
004080             MOVE 作１－費用額     TO 共本合計額
004100             MOVE 作１－請求額     TO 共本請求額
               ELSE
004050             MOVE 作１－件数       TO 共本返戻件数
004050             MOVE 作１－日数       TO 共本返戻日数
004080             MOVE 作１－費用額     TO 共本返戻合計額
004100             MOVE 作１－請求額     TO 共本返戻請求額
               END-IF
           WHEN 32
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 共家件数
004050             MOVE 作１－日数       TO 共家日数
004080             MOVE 作１－費用額     TO 共家合計額
004100             MOVE 作１－請求額     TO 共家請求額
               ELSE
004050             MOVE 作１－件数       TO 共家返戻件数
004050             MOVE 作１－日数       TO 共家返戻日数
004080             MOVE 作１－費用額     TO 共家返戻合計額
004100             MOVE 作１－請求額     TO 共家返戻請求額
               END-IF
           WHEN 41
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 国県内件数
004050             MOVE 作１－日数       TO 国県内日数
004080             MOVE 作１－費用額     TO 国県内合計額
004100             MOVE 作１－請求額     TO 国県内請求額
               ELSE
004050             MOVE 作１－件数       TO 国返戻県内件数
004050             MOVE 作１－日数       TO 国返戻県内日数
004080             MOVE 作１－費用額     TO 国返戻県内合計額
004100             MOVE 作１－請求額     TO 国返戻県内請求額
               END-IF
           WHEN 42
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 国県外件数
004050             MOVE 作１－日数       TO 国県外日数
004080             MOVE 作１－費用額     TO 国県外合計額
004100             MOVE 作１－請求額     TO 国県外請求額
               ELSE
004050             MOVE 作１－件数       TO 国返戻県外件数
004050             MOVE 作１－日数       TO 国返戻県外日数
004080             MOVE 作１－費用額     TO 国返戻県外合計額
004100             MOVE 作１－請求額     TO 国返戻県外請求額
               END-IF
           WHEN 51
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 後県内件数
004050             MOVE 作１－日数       TO 後県内日数
004080             MOVE 作１－費用額     TO 後県内合計額
004100             MOVE 作１－請求額     TO 後県内請求額
               ELSE
004050             MOVE 作１－件数       TO 後返戻県内件数
004050             MOVE 作１－日数       TO 後返戻県内日数
004080             MOVE 作１－費用額     TO 後返戻県内合計額
004100             MOVE 作１－請求額     TO 後返戻県内請求額
               END-IF
           WHEN 52
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 後県外件数
004050             MOVE 作１－日数       TO 後県外日数
004080             MOVE 作１－費用額     TO 後県外合計額
004100             MOVE 作１－請求額     TO 後県外請求額
               ELSE
004050             MOVE 作１－件数       TO 後返戻県外件数
004050             MOVE 作１－日数       TO 後返戻県外日数
004080             MOVE 作１－費用額     TO 後返戻県外合計額
004100             MOVE 作１－請求額     TO 後返戻県外請求額
               END-IF
           WHEN 61
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 助成件数
004050             MOVE 作１－日数       TO 助成日数
004080*             MOVE 作１－費用額     TO 助成合計額
004100             MOVE 作１－請求額     TO 助成請求額
               ELSE
004050             MOVE 作１－件数       TO 助成返戻件数
004050             MOVE 作１－日数       TO 助成返戻日数
004080*             MOVE 作１－費用額     TO 助成返戻合計額
004100             MOVE 作１－請求額     TO 助成返戻請求額
               END-IF
           WHEN 71
               IF 作１－区分 = ZERO
004050             MOVE 作１－件数       TO 生保件数
004050             MOVE 作１－日数       TO 生保日数
004080             MOVE 作１－費用額     TO 生保合計額
004100             MOVE 作１－請求額     TO 生保請求額
               ELSE
004050             MOVE 作１－件数       TO 生保返戻件数
004050             MOVE 作１－日数       TO 生保返戻日数
004080             MOVE 作１－費用額     TO 生保返戻合計額
004100             MOVE 作１－請求額     TO 生保返戻請求額
               END-IF
005057     END-EVALUATE.
      *
005078*================================================================*
005079 集計処理  SECTION.
005080*
           EVALUATE 作１－印刷順番(1:1)
           WHEN 1
               IF 作１－区分 = ZERO
                  COMPUTE 社保合計件数Ｗ   = 社保合計件数Ｗ   + 作１－件数
                  COMPUTE 社保合計日数Ｗ   = 社保合計日数Ｗ   + 作１－日数
                  COMPUTE 社保合計費用額Ｗ = 社保合計費用額Ｗ + 作１－費用額
                  COMPUTE 社保合計請求額Ｗ = 社保合計請求額Ｗ + 作１－請求額
               ELSE
                  COMPUTE 社保返戻合計件数Ｗ   = 社保返戻合計件数Ｗ   + 作１－件数
                  COMPUTE 社保返戻合計日数Ｗ   = 社保返戻合計日数Ｗ   + 作１－日数
                  COMPUTE 社保返戻合計費用額Ｗ = 社保返戻合計費用額Ｗ + 作１－費用額
                  COMPUTE 社保返戻合計請求額Ｗ = 社保返戻合計請求額Ｗ + 作１－請求額
               END-IF
           WHEN 2
               IF 作１－区分 = ZERO
                  COMPUTE 組合合計件数Ｗ   = 組合合計件数Ｗ   + 作１－件数
                  COMPUTE 組合合計日数Ｗ   = 組合合計日数Ｗ   + 作１－日数
                  COMPUTE 組合合計費用額Ｗ = 組合合計費用額Ｗ + 作１－費用額
                  COMPUTE 組合合計請求額Ｗ = 組合合計請求額Ｗ + 作１－請求額
               ELSE
                  COMPUTE 組合返戻合計件数Ｗ   = 組合返戻合計件数Ｗ   + 作１－件数
                  COMPUTE 組合返戻合計日数Ｗ   = 組合返戻合計日数Ｗ   + 作１－日数
                  COMPUTE 組合返戻合計費用額Ｗ = 組合返戻合計費用額Ｗ + 作１－費用額
                  COMPUTE 組合返戻合計請求額Ｗ = 組合返戻合計請求額Ｗ + 作１－請求額
               END-IF
           WHEN 3
               IF 作１－区分 = ZERO
                  COMPUTE 共済合計件数Ｗ   = 共済合計件数Ｗ   + 作１－件数
                  COMPUTE 共済合計日数Ｗ   = 共済合計日数Ｗ   + 作１－日数
                  COMPUTE 共済合計費用額Ｗ = 共済合計費用額Ｗ + 作１－費用額
                  COMPUTE 共済合計請求額Ｗ = 共済合計請求額Ｗ + 作１－請求額
               ELSE
                  COMPUTE 共済返戻合計件数Ｗ   = 共済返戻合計件数Ｗ   + 作１－件数
                  COMPUTE 共済返戻合計日数Ｗ   = 共済返戻合計日数Ｗ   + 作１－日数
                  COMPUTE 共済返戻合計費用額Ｗ = 共済返戻合計費用額Ｗ + 作１－費用額
                  COMPUTE 共済返戻合計請求額Ｗ = 共済返戻合計請求額Ｗ + 作１－請求額
               END-IF
           WHEN 4
               IF 作１－区分 = ZERO
                  COMPUTE 国保合計件数Ｗ   = 国保合計件数Ｗ   + 作１－件数
                  COMPUTE 国保合計日数Ｗ   = 国保合計日数Ｗ   + 作１－日数
                  COMPUTE 国保合計費用額Ｗ = 国保合計費用額Ｗ + 作１－費用額
                  COMPUTE 国保合計請求額Ｗ = 国保合計請求額Ｗ + 作１－請求額
               ELSE
                  COMPUTE 国保返戻合計件数Ｗ   = 国保返戻合計件数Ｗ   + 作１－件数
                  COMPUTE 国保返戻合計日数Ｗ   = 国保返戻合計日数Ｗ   + 作１－日数
                  COMPUTE 国保返戻合計費用額Ｗ = 国保返戻合計費用額Ｗ + 作１－費用額
                  COMPUTE 国保返戻合計請求額Ｗ = 国保返戻合計請求額Ｗ + 作１－請求額
               END-IF
           WHEN 5
               IF 作１－区分 = ZERO
                  COMPUTE 後高合計件数Ｗ   = 後高合計件数Ｗ   + 作１－件数
                  COMPUTE 後高合計日数Ｗ   = 後高合計日数Ｗ   + 作１－日数
                  COMPUTE 後高合計費用額Ｗ = 後高合計費用額Ｗ + 作１－費用額
                  COMPUTE 後高合計請求額Ｗ = 後高合計請求額Ｗ + 作１－請求額
               ELSE
                  COMPUTE 後高返戻合計件数Ｗ   = 後高返戻合計件数Ｗ   + 作１－件数
                  COMPUTE 後高返戻合計日数Ｗ   = 後高返戻合計日数Ｗ   + 作１－日数
                  COMPUTE 後高返戻合計費用額Ｗ = 後高返戻合計費用額Ｗ + 作１－費用額
                  COMPUTE 後高返戻合計請求額Ｗ = 後高返戻合計請求額Ｗ + 作１－請求額
               END-IF
           END-EVALUATE.
      *
005078*================================================================*
005079 合計セット  SECTION.
005080*
004050     MOVE 社保合計件数Ｗ         TO 協合計件数.
004050     MOVE 社保合計日数Ｗ         TO 協合計日数.
004080     MOVE 社保合計費用額Ｗ       TO 協合計合計額.
004100     MOVE 社保合計請求額Ｗ       TO 協合計請求額.
004050     MOVE 社保返戻合計件数Ｗ     TO 協返戻合計件数.
004050     MOVE 社保返戻合計日数Ｗ     TO 協返戻合計日数.
004080     MOVE 社保返戻合計費用額Ｗ   TO 協返戻合計合計額.
004100     MOVE 社保返戻合計請求額Ｗ   TO 協返戻合計請求額.
004050     MOVE 組合合計件数Ｗ         TO 組合計件数.
004050     MOVE 組合合計日数Ｗ         TO 組合計日数.
004080     MOVE 組合合計費用額Ｗ       TO 組合計合計額.
004100     MOVE 組合合計請求額Ｗ       TO 組合計請求額.
004050     MOVE 組合返戻合計件数Ｗ     TO 組返戻合計件数.
004050     MOVE 組合返戻合計日数Ｗ     TO 組返戻合計日数.
004080     MOVE 組合返戻合計費用額Ｗ   TO 組返戻合計合計額.
004100     MOVE 組合返戻合計請求額Ｗ   TO 組返戻合計請求額.
004050     MOVE 共済合計件数Ｗ         TO 共合計件数.
004050     MOVE 共済合計日数Ｗ         TO 共合計日数.
004080     MOVE 共済合計費用額Ｗ       TO 共合計合計額.
004100     MOVE 共済合計請求額Ｗ       TO 共合計請求額.
004050     MOVE 共済返戻合計件数Ｗ     TO 共返戻合計件数.
004050     MOVE 共済返戻合計日数Ｗ     TO 共返戻合計日数.
004080     MOVE 共済返戻合計費用額Ｗ   TO 共返戻合計合計額.
004100     MOVE 共済返戻合計請求額Ｗ   TO 共返戻合計請求額.
004050     MOVE 国保合計件数Ｗ         TO 国合計件数.
004050     MOVE 国保合計日数Ｗ         TO 国合計日数.
004080     MOVE 国保合計費用額Ｗ       TO 国合計合計額.
004100     MOVE 国保合計請求額Ｗ       TO 国合計請求額.
004050     MOVE 国保返戻合計件数Ｗ     TO 国返戻合計件数.
004050     MOVE 国保返戻合計日数Ｗ     TO 国返戻合計日数.
004080     MOVE 国保返戻合計費用額Ｗ   TO 国返戻合計合計額.
004100     MOVE 国保返戻合計請求額Ｗ   TO 国返戻合計請求額.
004050     MOVE 後高合計件数Ｗ         TO 後合計件数.
004050     MOVE 後高合計日数Ｗ         TO 後合計日数.
004080     MOVE 後高合計費用額Ｗ       TO 後合計合計額.
004100     MOVE 後高合計請求額Ｗ       TO 後合計請求額.
004050     MOVE 後高返戻合計件数Ｗ     TO 後返戻合計件数.
004050     MOVE 後高返戻合計日数Ｗ     TO 後返戻合計日数.
004080     MOVE 後高返戻合計費用額Ｗ   TO 後返戻合計合計額.
004100     MOVE 後高返戻合計請求額Ｗ   TO 後返戻合計請求額.
005080*
004050     MOVE 連印－小計１件数       TO 小計１件数.
004050     MOVE 連印－小計１日数       TO 小計１日数.
004080     MOVE 連印－小計１合計額     TO 小計１合計額.
004100     MOVE 連印－小計１請求額     TO 小計１請求額.
004050     MOVE 連印－返戻小計１件数   TO 小計１返戻件数.
004050     MOVE 連印－返戻小計１日数   TO 小計１返戻日数.
004080     MOVE 連印－返戻小計１合計額 TO 小計１返戻合計額.
004100     MOVE 連印－返戻小計１請求額 TO 小計１返戻請求額.
004050     MOVE 連印－小計２件数       TO 小計２件数.
004050     MOVE 連印－小計２日数       TO 小計２日数.
004080     MOVE 連印－小計２合計額     TO 小計２合計額.
004100     MOVE 連印－小計２請求額     TO 小計２請求額.
004050     MOVE 連印－返戻小計２件数   TO 小計２返戻件数.
004050     MOVE 連印－返戻小計２日数   TO 小計２返戻日数.
004080     MOVE 連印－返戻小計２合計額 TO 小計２返戻合計額.
004100     MOVE 連印－返戻小計２請求額 TO 小計２返戻請求額.
004050     MOVE 連印－合計件数         TO 合計件数.
004050     MOVE 連印－合計日数         TO 合計日数.
004080     MOVE 連印－合計合計額       TO 合計合計額.
004100     MOVE 連印－合計請求額       TO 合計請求額.
004050     MOVE 連印－返戻合計件数     TO 合計返戻件数.
004050     MOVE 連印－返戻合計日数     TO 合計返戻日数.
004080     MOVE 連印－返戻合計合計額   TO 合計返戻合計額.
004100     MOVE 連印－返戻合計請求額   TO 合計返戻請求額.
005059*
005078*================================================================*
005079 明細印字  SECTION.
005080*
006050     IF ( オープンフラグ NOT = "YES" )
006060        MOVE "YES" TO オープンフラグ
006070        OPEN I-O  印刷ファイル
006080        PERFORM エラー処理Ｐ
006090     END-IF.
005081     MOVE "YGN594P"  TO  定義体名Ｐ.
005082     MOVE SPACE     TO  処理種別Ｐ.
005090     MOVE "SCREEN"  TO  項目群名Ｐ.
005100     WRITE YGN594P.
005110     PERFORM エラー処理Ｐ.
005120     INITIALIZE YGN594P.
005130*================================================================*
005140 作業ファイル１読込 SECTION.
005150*
005160     READ 作業ファイル１ NEXT
005170     AT END
005180         MOVE "YES"  TO 終了フラグ
005190     END-READ.
005200*================================================================*
005210 ヘッダ印刷処理 SECTION.
005220*
005320     MOVE 連入－施術和暦    TO 元－元号区分.
005330     READ 元号マスタ
005340     INVALID KEY
005350         DISPLAY NC"現在元号が登録されていません" UPON MSGBOX
005360         MOVE SPACE         TO 請求和暦
005370     NOT INVALID KEY
005380         MOVE 元－元号名称  TO 請求和暦
005390     END-READ.
005400     MOVE 連入－施術年      TO 請求年.  
005410     MOVE 連入－施術月      TO 請求月.  
005310*
005320     MOVE 連入－請求和暦    TO 元－元号区分.
005330     READ 元号マスタ
005340     INVALID KEY
005350         DISPLAY NC"現在元号が登録されていません" UPON MSGBOX
005360         MOVE SPACE         TO 提出和暦
005370     NOT INVALID KEY
005380         MOVE 元－元号名称  TO 提出和暦
005390     END-READ.
005400     MOVE 連入－請求年      TO 提出年.  
005410     MOVE 連入－請求月      TO 提出月.  
005410     MOVE 連入－請求日      TO 提出日.  
005011*
005012     MOVE ZERO  TO 施情－施術所番号
005013     READ 施術所情報マスタ
005014     INVALID KEY
005015         MOVE  NC"施術所情報マスタに登録後、実行して下さい" TO 連メ－メッセージ
005016         CALL   "MSG001"
005017         CANCEL "MSG001"
005018         PERFORM ファイル閉鎖
005019         MOVE 99 TO PROGRAM-STATUS
005020         EXIT PROGRAM
005021     NOT INVALID KEY
005053         MOVE 施情－接骨師会会員番号   TO 会員番号
005054         MOVE 施情－代表者名           TO 代表者名
005054         MOVE 施情－接骨院名           TO 施術所名
005055     END-READ.
      *
005620*================================================================*
005630 エラー処理Ｐ SECTION.
005640*
005650     IF 通知情報Ｐ NOT = "00"
005660         DISPLAY NC"帳票エラー"              UPON CONS
005670         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
005680         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
005690         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
005700         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005710                                             UPON CONS
000410*-----------------------------------------*
000420         CALL "actcshm"  WITH C LINKAGE
000430*-----------------------------------------*
005720         ACCEPT  キー入力 FROM CONS
005730         PERFORM ファイル閉鎖
005740         EXIT PROGRAM
005750     END-IF.
005760*================================================================*
005770******************************************************************
005780 END PROGRAM YGN594.
005790******************************************************************
