000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK102.
000060 AUTHOR.                 岡田　憲和
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【FPD書込】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100* 請求年月Ver.
000110*      MED = YJK100G 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-08-19
000140 DATE-COMPILED.          2012-08-19
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  制－制御区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000330*
000350     SELECT  作業ファイル１  ASSIGN      TO           "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000351                             ORGANIZATION             IS  INDEXED
000360                             ACCESS                   IS  DYNAMIC
000370                             RECORD      KEY          IS  作１－並び順
000380                             FILE        STATUS       IS  状態キー
000390                             LOCK        MODE         IS  AUTOMATIC.
000400*
000410     SELECT 会提出ファイル   ASSIGN      TO     FD-NAME
000420                             ORGANIZATION             IS  LINE SEQUENTIAL
000430                             ACCESS MODE              IS  SEQUENTIAL
000440                             FILE STATUS              IS  状態キー
000450                             LOCK      MODE           IS  AUTOMATIC.
000460*
000470     SELECT 会提出ファイル２   ASSIGN      TO     FD-NAME2
000480                             ORGANIZATION             IS  LINE SEQUENTIAL
000490                             ACCESS MODE              IS  SEQUENTIAL
000500                             FILE STATUS              IS  状態キー
000510                             LOCK      MODE           IS  AUTOMATIC.
000520******************************************************************
000530*                      DATA DIVISION                             *
000540******************************************************************
000550 DATA                    DIVISION.
000560 FILE                    SECTION.
000570*                           ［ＲＬ＝  ２５６］
000580 FD  制御情報マスタ      BLOCK   CONTAINS   1   RECORDS.
000590     COPY SEIGYO         OF  XFDLIB  JOINING   制   AS  PREFIX.
000600*
000610 FD  作業ファイル１ RECORD  CONTAINS 256 CHARACTERS.
000620 01  作１－レコード.
000630     03  作１－レコードキー.
000640         05  作１－並び順                  PIC X(4).
000650     03  作１－レコードデータ.
000660         05  作１－患者コード.
000670             07 作１－患者番号１           PIC X(1).
000680             07 作１－患者番号             PIC X(5).
000690             07 作１－枝番                 PIC X(1).
000700         05  作１－患者氏名                PIC X(20).
000710         05  作１－被保険者氏名            PIC X(20).
000720         05  作１－本人家族区分            PIC X(2).
000730         05  作１－受益者番号              PIC X(7).
000740         05  作１－保険者番号              PIC X(8).
000750         05  作１－部位数                  PIC 9.
000760         05  作１－実日数                  PIC X(2).
000770         05  作１－費用額                  PIC 9(6).
000780         05  作１－負担額                  PIC 9(6).
000790         05  作１－請求額                  PIC 9(6).
000800         05  作１－施術和暦年月.
000810             07  作１－施術年              PIC 9(2).
000820             07  作１－施術月              PIC 9(2).
000830         05  作１－国保種別                PIC X(2).
000840         05  作１－柔整師番号              PIC X(20).
000850         05  作１－代表者名                PIC X(20).
000860         05  作１－患者カナ                PIC X(20).
000870         05  作１－患者生年月日.
000880             07  作１－患者和暦            PIC 9.
000890             07  作１－患者年              PIC 9(2).
000900             07  作１－患者月              PIC 9(2).
000910             07  作１－患者日              PIC 9(2).
000920         05  作１－被保険者カナ            PIC X(20).
000930         05  作１－被保険者生年月日.
000940             07  作１－被保険者和暦        PIC 9.
000950             07  作１－被保険者年          PIC 9(2).
000960             07  作１－被保険者月          PIC 9(2).
000970             07  作１－被保険者日          PIC 9(2).
000980         05  作１－記号                    PIC X(24).
000990         05  作１－番号                    PIC X(30).
001000         05  FILLER                        PIC X(13).
001010*
001020 FD  会提出ファイル RECORD  CONTAINS 286 CHARACTERS.
001030 01  会提－レコード.
001040     03  会提－レコードデータ.
001050         05  会提－並び順                PIC X(4).
001060         05  会提－コンマ１              PIC X.
001070         05  会提－患者コード            PIC X(5).
001080         05  会提－コンマ２              PIC X.
001090         05  会提－患者氏名              PIC X(20).
001100         05  会提－コンマ３              PIC X.
001110         05  会提－被保険者氏名          PIC X(20).
001120         05  会提－コンマ４              PIC X.
001130         05  会提－本人家族区分          PIC X(2).
001140         05  会提－コンマ５              PIC X.
001150         05  会提－受益者番号            PIC X(7).
001160         05  会提－コンマ６              PIC X.
001170         05  会提－保険者番号            PIC X(8).
001180         05  会提－コンマ７              PIC X.
001190         05  会提－空白１                PIC X.
001200         05  会提－コンマ８              PIC X.
001210         05  会提－部位数                PIC 9(2).
001220         05  会提－コンマ９              PIC X.
001230         05  会提－実日数                PIC X(2).
001240         05  会提－コンマ１０            PIC X.
001250         05  会提－空白２                PIC X(2).
001260         05  会提－費用額                PIC 9(6).
001270         05  会提－コンマ１１            PIC X.
001280         05  会提－空白３                PIC X(2).
001290         05  会提－負担額                PIC 9(6).
001300         05  会提－コンマ１２            PIC X.
001310         05  会提－空白４                PIC X(2).
001320         05  会提－請求額                PIC 9(6).
001330         05  会提－コンマ１３            PIC X.
001340         05  会提－空白５                PIC X(3).
001350         05  会提－施術和暦年月.
001360             07  会提－施術年            PIC 9(2).
001370             07  会提－施術月            PIC 9(2).
001380         05  会提－コンマ１４            PIC X.
001390         05  会提－国保種別              PIC X(2).
001400         05  会提－コンマ１５            PIC X.
001410         05  会提－柔整師番号            PIC X(20).
001420         05  会提－コンマ１６            PIC X.
001430         05  会提－代表者名              PIC X(20).
001440         05  会提－コンマ１７            PIC X.
001450         05  会提－患者カナ              PIC X(20).
001460         05  会提－コンマ１８            PIC X.
001470         05  会提－空白６                PIC X(13).
001480         05  会提－患者生年月日.
001490             07  会提－患者和暦          PIC 9.
001500             07  会提－患者年            PIC 9(2).
001510             07  会提－患者月            PIC 9(2).
001520             07  会提－患者日            PIC 9(2).
001530         05  会提－コンマ１９            PIC X.
001540         05  会提－被保険者カナ          PIC X(20).
001550         05  会提－コンマ２０            PIC X.
001560         05  新会提－空白７              PIC X(13).
001570         05  会提－被保険者生年月日.
001580             07  会提－被保険者和暦      PIC 9.
001590             07  会提－被保険者年        PIC 9(2).
001600             07  会提－被保険者月        PIC 9(2).
001610             07  会提－被保険者日        PIC 9(2).
001620         05  会提－コンマ２１            PIC X.
001630         05  会提－記号                  PIC X(20).
001640         05  会提－コンマ２２            PIC X.
001650         05  会提－番号                  PIC X(20).
001660*
001670 FD  会提出ファイル２ RECORD  CONTAINS 286 CHARACTERS.
001680 01  会提２－レコード.
001690     03  会提２－レコードデータ.
001700         05  会提２－並び順                PIC X(4).
001710         05  会提２－コンマ１              PIC X.
001720         05  会提２－患者コード            PIC X(5).
001730         05  会提２－コンマ２              PIC X.
001740         05  会提２－患者氏名              PIC X(20).
001750         05  会提２－コンマ３              PIC X.
001760         05  会提２－被保険者氏名          PIC X(20).
001770         05  会提２－コンマ４              PIC X.
001780         05  会提２－本人家族区分          PIC X(2).
001790         05  会提２－コンマ５              PIC X.
001800         05  会提２－受益者番号            PIC X(7).
001810         05  会提２－コンマ６              PIC X.
001820         05  会提２－保険者番号            PIC X(8).
001830         05  会提２－コンマ７              PIC X.
001840         05  会提２－空白１                PIC X.
001850         05  会提２－コンマ８              PIC X.
001860         05  会提２－部位数                PIC 9(2).
001870         05  会提２－コンマ９              PIC X.
001880         05  会提２－実日数                PIC X(2).
001890         05  会提２－コンマ１０            PIC X.
001900         05  会提２－空白２                PIC X(2).
001910         05  会提２－費用額                PIC 9(6).
001920         05  会提２－コンマ１１            PIC X.
001930         05  会提２－空白３                PIC X(2).
001940         05  会提２－負担額                PIC 9(6).
001950         05  会提２－コンマ１２            PIC X.
001960         05  会提２－空白４                PIC X(2).
001970         05  会提２－請求額                PIC 9(6).
001980         05  会提２－コンマ１３            PIC X.
001990         05  会提２－空白５                PIC X(3).
002000         05  会提２－施術和暦年月.
002010             07  会提２－施術年            PIC 9(2).
002020             07  会提２－施術月            PIC 9(2).
002030         05  会提２－コンマ１４            PIC X.
002040         05  会提２－国保種別              PIC X(2).
002050         05  会提２－コンマ１５            PIC X.
002060         05  会提２－柔整師番号            PIC X(20).
002070         05  会提２－コンマ１６            PIC X.
002080         05  会提２－代表者名              PIC X(20).
002090         05  会提２－コンマ１７            PIC X.
002100         05  会提２－患者カナ              PIC X(20).
002110         05  会提２－コンマ１８            PIC X.
002120         05  会提２－空白６                PIC X(13).
002130         05  会提２－患者生年月日.
002140             07  会提２－患者和暦          PIC 9.
002150             07  会提２－患者年            PIC 9(2).
002160             07  会提２－患者月            PIC 9(2).
002170             07  会提２－患者日            PIC 9(2).
002180         05  会提２－コンマ１９            PIC X.
002190         05  会提２－被保険者カナ          PIC X(20).
002200         05  会提２－コンマ２０            PIC X.
002210         05  新会提２－空白７              PIC X(13).
002220         05  会提２－被保険者生年月日.
002230             07  会提２－被保険者和暦      PIC 9.
002240             07  会提２－被保険者年        PIC 9(2).
002250             07  会提２－被保険者月        PIC 9(2).
002260             07  会提２－被保険者日        PIC 9(2).
002270         05  会提２－コンマ２１            PIC X.
002280         05  会提２－記号                  PIC X(20).
002290         05  会提２－コンマ２２            PIC X.
002300         05  会提２－番号                  PIC X(20).
002310*
002320*----------------------------------------------------------------*
002330******************************************************************
002340*                WORKING-STORAGE SECTION                         *
002350******************************************************************
002360 WORKING-STORAGE         SECTION.
002370 01 キー入力                           PIC X    VALUE SPACE.
002380 01 状態キー                           PIC X(2) VALUE SPACE.
002390 01 終了フラグ                         PIC X(3) VALUE SPACE.
002400 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002410 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002420 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002430 01 ファイル名                         PIC N(8) VALUE SPACE.
002440**
002450** エラーメッセージ用
002460 01 エラーメッセージＷ.
002470    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002480    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002490    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002500    03 FILLER                          PIC X(10) VALUE SPACE.
002510*
002520* フロッピーパス用
002530 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002540 01 FD-NAME                            PIC X(30) VALUE SPACE.
002550 01 FD-NAME2                           PIC X(30) VALUE SPACE.
002560*
002570******************************************************************
002580*                          連結項目                              *
002590******************************************************************
002600*
002610 01 連入－画面情報ＹＪＫ１００ IS EXTERNAL GLOBAL.
002611    03 連入－ドライブ                  PIC X(1).
      *
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
002612*
002613********************
002620* メッセージ表示キー *
002630********************
002640 01 連メ－キー IS EXTERNAL.
002650    03  連メ－メッセージ               PIC N(20).
002660*
002670 01 連メ３－キー IS EXTERNAL.
002680    03  連メ３－メッセージ             PIC N(20).
002690    03  連メ３－メッセージ１           PIC X(20).
002700*
002710 01 連メ７－キー IS EXTERNAL.
002711    03  連メ７－メッセージ１           PIC X(40).
002712    03  連メ７－メッセージ２           PIC X(40).
002713******************************************************************
002720*                      PROCEDURE  DIVISION                       *
002730******************************************************************
002740 PROCEDURE               DIVISION.
002750************
002760*           *
002770* 初期処理   *
002780*           *
002790************
002800     PERFORM 初期化.
002810************
002820*           *
002830* 主処理     *
002840*           *
002850************
002860     PERFORM 提出ファイル作成.
002870************
002880*           *
002890* 終了処理   *
002900*           *
002910************
002920     PERFORM 終了処理.
002930     MOVE ZERO TO PROGRAM-STATUS.
002940     EXIT PROGRAM.
002950*
002960*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002970*================================================================*
002980 初期化 SECTION.
002990*
003000     PERFORM ファイルオープン.
003010*
003020*================================================================*
003030 ファイルオープン SECTION.
003040*
003050** フロッピーパス設定
003060*     OPEN INPUT 制御情報マスタ.
003070*             MOVE NC"制御" TO ファイル名.
003080*             PERFORM オープンチェック.
003090*     MOVE ZERO TO 制－制御区分.
003100*     READ 制御情報マスタ
003110*     NOT INVALID KEY
003120*         MOVE 制－定期修正ＦＤ TO 定期修正ＦＤＷ
003130*     END-READ.
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\DaiCHO.txt" TO FD-NAME
002890        MOVE "C:\makishisys\DaiCho-cp.txt" TO FD-NAME2
           ELSE
003140        MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003141        IF 定期修正ＦＤＷ = SPACE
003150           MOVE "A" TO 定期修正ＦＤＷ
003160        END-IF
003170        STRING 定期修正ＦＤＷ   DELIMITED BY SIZE
003180               ":\DaiCHO.txt"   DELIMITED BY SIZE
003190              INTO FD-NAME
003200        END-STRING
003210        STRING 定期修正ＦＤＷ   DELIMITED BY SIZE
003220               ":\DaiCho-cp.txt"  DELIMITED BY SIZE
003230              INTO FD-NAME2
003240        END-STRING
           END-IF.
003250**
003260     OPEN OUTPUT 会提出ファイル.
003270     IF 状態キー  NOT =  "00"
003271         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
003272         MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
003273         CALL   "MSG007"
003274         CANCEL "MSG007"
003275         MOVE 99 TO PROGRAM-STATUS
003276         EXIT PROGRAM
003330     ELSE
003340         MOVE NC"会提出ファイル" TO ファイル名
003350         PERFORM オープンチェック
003360     END-IF.
003370     OPEN OUTPUT 会提出ファイル２.
003380         MOVE NC"会提出ファイル２" TO ファイル名.
003390         PERFORM オープンチェック.
003400*
003410     OPEN INPUT 作業ファイル１.
003420         MOVE NC"作１" TO ファイル名.
003430         PERFORM オープンチェック.
003440*================================================================*
003450 オープンチェック SECTION.
003460*
003470     IF 状態キー  NOT =  "00"
003480         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003490         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003500         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003510                                                 UPON CONS
003520         ACCEPT  キー入力 FROM CONS
003530         PERFORM ファイル閉鎖
003540         MOVE 99 TO PROGRAM-STATUS
003550         EXIT PROGRAM.
003560*================================================================*
003570 ファイル閉鎖 SECTION.
003580*
003590     CLOSE  会提出ファイル 会提出ファイル２ 作業ファイル１ 制御情報マスタ.
003600*================================================================*
003610 終了処理 SECTION.
003620*
003630     PERFORM ファイル閉鎖.
003640*================================================================*
003650 エラー表示 SECTION.
003660*
003670     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003680     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003690     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003700     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003710     ACCEPT  キー入力 FROM CONS.
003720     PERFORM ファイル閉鎖.
003730     MOVE 99 TO PROGRAM-STATUS.
003740     EXIT PROGRAM.
003750*================================================================*
003760 提出ファイル作成 SECTION.
003770*
003780     MOVE SPACE   TO 終了フラグ.
003790     PERFORM 作業ファイル１読込.
003800     IF  終了フラグ = "YES"
003810         MOVE  NC"　　データが０件です。確認して下さい" TO 連メ－メッセージ
003820         CALL   "MSG001"
003830         CANCEL "MSG001"
003840         PERFORM ファイル閉鎖
003850         MOVE 99 TO PROGRAM-STATUS
003860         EXIT PROGRAM
003870     END-IF.
003880*
003890     PERFORM UNTIL 終了フラグ = "YES"
003900              PERFORM レコードセット
003910              PERFORM ファイル書込
003920         PERFORM 作業ファイル１読込
003930     END-PERFORM.
003940*
003950*================================================================*
003960 レコードセット SECTION.
003970*
003980     MOVE SPACE TO 会提－レコード 会提２－レコード.
003990     INITIALIZE    会提－レコード 会提２－レコード.
004000*
004010     MOVE 作１－並び順          TO  会提－並び順 会提２－並び順.
004020*     MOVE 作１－患者コード      TO  会提－患者コード 会提２－患者コード.
004030     MOVE 作１－患者番号        TO 会提－患者コード 会提２－患者コード.
004040     MOVE 作１－患者氏名        TO  会提－患者氏名 会提２－患者氏名.
004050     MOVE 作１－被保険者氏名    TO  会提－被保険者氏名 会提２－被保険者氏名.
004060     MOVE 作１－本人家族区分    TO  会提－本人家族区分 会提２－本人家族区分.
004070     MOVE 作１－受益者番号      TO  会提－受益者番号 会提２－受益者番号.
004080     MOVE 作１－保険者番号      TO  会提－保険者番号 会提２－保険者番号.
004090     MOVE 作１－部位数          TO  会提－部位数 会提２－部位数.
004100     MOVE 作１－実日数          TO  会提－実日数 会提２－実日数.
004110     MOVE 作１－費用額          TO  会提－費用額 会提２－費用額.
004120     MOVE 作１－負担額          TO  会提－負担額 会提２－負担額.
004130     MOVE 作１－請求額          TO  会提－請求額 会提２－請求額.
004140     MOVE 作１－施術和暦年月    TO  会提－施術和暦年月 会提２－施術和暦年月.
004150     MOVE 作１－国保種別        TO  会提－国保種別 会提２－国保種別.
004160     MOVE 作１－柔整師番号      TO  会提－柔整師番号 会提２－柔整師番号.
004170     MOVE 作１－代表者名        TO  会提－代表者名 会提２－代表者名.
004180     MOVE 作１－患者カナ        TO  会提－患者カナ 会提２－患者カナ.
004190     MOVE 作１－患者生年月日    TO  会提－患者生年月日 会提２－患者生年月日.
004200     MOVE 作１－被保険者カナ    TO  会提－被保険者カナ 会提２－被保険者カナ.
004210     MOVE 作１－被保険者生年月日  TO  会提－被保険者生年月日 会提２－被保険者生年月日.
004220     MOVE 作１－記号            TO  会提－記号 会提２－記号.
004230     MOVE 作１－番号            TO  会提－番号 会提２－番号.
004240* 空白
004250     MOVE ALL X"20"  TO  会提－空白１ 会提－空白２ 会提－空白３ 会提－空白４
004260                         会提２－空白１ 会提２－空白２ 会提２－空白３ 会提２－空白４.
004270* コンマ
004280     MOVE "," TO 会提－コンマ１ 会提－コンマ２ 会提－コンマ３ 会提－コンマ４
004290                 会提－コンマ５ 会提－コンマ６ 会提－コンマ７ 会提－コンマ８
004300                 会提－コンマ９ 会提－コンマ１０ 会提－コンマ１１ 会提－コンマ１２
004310                 会提－コンマ１３ 会提－コンマ１４ 会提－コンマ１５ 会提－コンマ１６
004320                 会提－コンマ１７ 会提－コンマ１８ 会提－コンマ１９ 会提－コンマ２０
004330                 会提－コンマ２１ 会提－コンマ２２.
004340     MOVE "," TO 会提２－コンマ１ 会提２－コンマ２ 会提２－コンマ３ 会提２－コンマ４
004350                 会提２－コンマ５ 会提２－コンマ６ 会提２－コンマ７ 会提２－コンマ８
004360                 会提２－コンマ９ 会提２－コンマ１０ 会提２－コンマ１１ 会提２－コンマ１２
004370                 会提２－コンマ１３ 会提２－コンマ１４ 会提２－コンマ１５ 会提２－コンマ１６
004380                 会提２－コンマ１７ 会提２－コンマ１８ 会提２－コンマ１９ 会提２－コンマ２０
004390                 会提２－コンマ２１ 会提２－コンマ２２.
004400*
004410*================================================================*
004420 作業ファイル１読込 SECTION.
004430*
004440     READ 作業ファイル１ NEXT
004450     AT END
004460         MOVE "YES" TO 終了フラグ
004470     END-READ.
004480*
004490*================================================================*
004500 ファイル書込 SECTION.
004510*
004520     WRITE 会提－レコード.
004530     IF 状態キー  NOT =  "00"
004540         MOVE NC"会提出ファイル" TO ファイル名
004550         PERFORM エラー表示
004560     END-IF.
004570*
004580     WRITE 会提２－レコード.
004590     IF 状態キー  NOT =  "00"
004600         MOVE NC"会提出ファイル２" TO ファイル名
004610         PERFORM エラー表示
004620     END-IF.
004630*================================================================*
004640******************************************************************
004650 END PROGRAM YJK102.
004660******************************************************************
