000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK432.
000060 AUTHOR.                 岡田 憲和
000070*
000080*----------------------------------------------------------------*
000090*  日本柔整共済会用 6,7号請求書指定【ﾃﾞｰﾀ作成】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100*         MED = YJK430G
000110*
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-09-06
000140 DATE-COMPILED.          2012-09-06
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  制－制御区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000330     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS 受－施術和暦年月
000370                                                          受－患者コード
000380                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000390                                                          受－患者カナ
000400                                                          受－患者コード
000410                             ALTERNATE RECORD KEY     IS  受－患者コード
000420                                                         受－施術和暦年月
000430                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000440                                                          受－保険種別
000450                                                          受－保険者番号
000460                                                          受－患者コード
000470                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000480                                                          受－公費種別
000490                                                     受－費用負担者番号
000500                                                          受－患者コード
000510                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000520                                                          受－助成種別
000530                                                  受－費用負担者番号助成
000540                                                          受－患者コード
000550                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000560                                                      受－施術和暦年月
000570                                                      受－患者コード
000580                             FILE STATUS              IS  状態キー
000590                             LOCK        MODE         IS  AUTOMATIC.
000780     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000790                             ORGANIZATION             IS  INDEXED
000800                             ACCESS MODE              IS  DYNAMIC
000810                             RECORD KEY               IS  請先－保険種別
000820                                                          請先－保険者番号
000830                             FILE STATUS              IS  状態キー
000840                             LOCK    MODE             IS  AUTOMATIC.
000960     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000961                             ORGANIZATION             IS  INDEXED
000962                             ACCESS MODE              IS  DYNAMIC
000963                             RECORD KEY               IS  レセ－施術和暦年月
000964                                                          レセ－患者コード
000965                                                          レセ－レセ種別
000966                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000967                                                          レセ－施術和暦年月
000968                                                          レセ－レセ種別
000969                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000970                                                          レセ－施術和暦年月
000971                                                          レセ－患者コード
000972                                                          レセ－レセ種別
000973                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000974                                                          レセ－レセ種別
000975                                                          レセ－請求保険者番号
000976                                                          レセ－患者コード
000977                                                          レセ－施術和暦年月
000978                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000979                                                          レセ－請求保険者番号
000980                                                          レセ－患者コード
000981                                                          レセ－レセ種別
000982                                                          レセ－施術和暦年月
000983                             FILE STATUS              IS  状態キー
000984                             LOCK        MODE         IS  AUTOMATIC.
000985     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
000986                             ORGANIZATION             IS  INDEXED
000987                             ACCESS                   IS  DYNAMIC
000988                             RECORD      KEY          IS  作１－請求和暦年月
000990                                                          作１－保険種別
001000                                                          作１－保険者番号
001010                                                          作１－記号
001020                                                          作１－番号
001030                                                          作１－被保険者カナ
001040                                                          作１－患者コード
001050                                                          作１－施術和暦年月
001060                             FILE        STATUS       IS  状態キー
001070                             LOCK        MODE         IS  AUTOMATIC.
001090     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4322L.DAT"
001091                             ORGANIZATION             IS  INDEXED
001100                             ACCESS                   IS  DYNAMIC
001110                             RECORD      KEY          IS  作２－請求和暦年月
001120                                                          作２－保険種別
001130                                                          作２－保険者番号
001140                             ALTERNATE RECORD KEY     IS  作２－印刷区分
001150                                                          作２－請求和暦年月
001160                                                          作２－保険種別
001170                                                          作２－保険者番号
001180                             FILE        STATUS       IS  状態キー
001190                             LOCK        MODE         IS  AUTOMATIC.
001213******************************************************************
001214*                      DATA DIVISION                             *
001220******************************************************************
001230 DATA                    DIVISION.
001240 FILE                    SECTION.
001250*                           ［ＲＬ＝  ２５６］
001260 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001270     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001280*                           ［ＲＬ＝  ３２０］
001290 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001300     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001370*                           ［ＲＬ＝  １２８］
001380 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
001390     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
001430*
001440 FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
001450     COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001460*
001740 FD  作業ファイル１ RECORD  CONTAINS 288 CHARACTERS.
001741 01  作１－レコード.
001742     03  作１－レコードキー.
001743         05  作１－請求和暦年月.
001744             07  作１－請求和暦              PIC 9.
001745             07  作１－請求年                PIC 9(2).
001746             07  作１－請求月                PIC 9(2).
001747         05  作１－保険種別                  PIC 9(2).
001748         05  作１－保険者番号                PIC X(10).
001749         05  作１－記号                      PIC X(24).
001750         05  作１－番号                      PIC X(30).
001751         05  作１－被保険者カナ              PIC X(50).
001752         05  作１－患者コード.
001753             07 作１－患者番号               PIC 9(6).
001754             07 作１－枝番                   PIC X(1).
001755         05  作１－施術和暦年月.
001756             07  作１－施術和暦              PIC 9.
001757             07  作１－施術年                PIC 9(2).
001758             07  作１－施術月                PIC 9(2).
001759     03  作１－レコードデータ.
001760         05  作１－被保険者氏名              PIC X(50).
001761         05  作１－患者氏名                  PIC X(50).
001762         05  作１－保険者番号２              PIC X(10).
001763         05  作１－費用額                    PIC 9(7).
001764         05  作１－負担額                    PIC 9(7).
001765         05  作１－請求額                    PIC 9(7).
001766         05  作１－本人家族区分              PIC 9.
001767         05  作１－県                        PIC X(2).
001768         05  FILLER                          PIC X(21).
001769*
001770*                           ［ＲＬ＝  ６４］
001771 FD  作業ファイル２ RECORD  CONTAINS 64 CHARACTERS.
001772 01  作２－レコード.
001773     03  作２－レコードキー.
001780         05  作２－請求和暦年月.
001790             07  作２－請求和暦              PIC 9.
001800             07  作２－請求年                PIC 9(2).
001810             07  作２－請求月                PIC 9(2).
001820         05  作２－保険種別                  PIC 9(2).
001830         05  作２－保険者番号                PIC X(10).
001840         05  作２－印刷区分                  PIC 9.
001850     03  作２－レコードデータ.
001860         05  作２－保険者番号２              PIC X(10).
001870         05  作２－件数                      PIC 9(4).
001880         05  作２－費用額                    PIC 9(9).
001890         05  作２－負担額                    PIC 9(9).
001900         05  作２－請求額                    PIC 9(9).
001910         05  FILLER                          PIC X(5).
001924*----------------------------------------------------------------*
001930******************************************************************
001940*                WORKING-STORAGE SECTION                         *
001950******************************************************************
001960 WORKING-STORAGE         SECTION.
001970 01 キー入力                           PIC X     VALUE SPACE.
001980 01 状態キー                           PIC X(2)  VALUE SPACE.
001990 01 終了フラグ                         PIC X(3)  VALUE SPACE.
002000 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
002010 01 作成フラグ                         PIC X(3)  VALUE SPACE.
002020 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002030 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
002040*
002050 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
002060 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
002070 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002080 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
002090 01 請求和暦年月ＷＲ.
002100    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
002110    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
002120    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
002130*
002140 01 請求年月Ｗ.
002150    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002160    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
002170    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
002180 01 施術年月Ｗ.
002190    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002200    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
002210    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
002220 01 集計作業用Ｗ.
002230    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
002240    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
002250    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
002260    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
002270    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
002280    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
002290 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
002300 01 ファイル名                         PIC N(2)  VALUE SPACE.
002310 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002320 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
002330 01 保険者番号２Ｗ                     PIC X(10) VALUE SPACE.
002340 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
002350*
002360* 県内県外用
002370 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
002380 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
002390 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
002400 01 県内県外チェック                   PIC 9     VALUE ZERO.
002410 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
002420 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
002430 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
002440 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
002450*
002460* エラーメッセージ用
002470 01 エラーメッセージＷ.
002480    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002490    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002500    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002510    03 FILLER                          PIC X(10) VALUE SPACE.
002520* 順序用
002530 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
002540 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
002550*
002560** 助成レセまとめ用
002570 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
002580*
002590* 例外用
002600 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
002610*
002611 01 複合プログラム名Ｗ                 PIC X(8) VALUE "MOJI2".
002612*
002620******************************************************************
002630*                          連結項目                              *
002640******************************************************************
002650*
002660****************
002670* 画面入力情報 *
002680****************
002690**
002880 01 連入－画面情報ＹＪＫ４３０   IS EXTERNAL GLOBAL.
002890    03 連入－請求年月.
002900       05 連入－請求和暦               PIC 9.
002910       05 連入－請求年                 PIC 9(2).
002920       05 連入－請求月                 PIC 9(2).
002930    03 連入－提出年月日.
002940       05 連入－提出和暦               PIC 9.
002950       05 連入－提出年                 PIC 9(2).
002960       05 連入－提出月                 PIC 9(2).
002970       05 連入－提出日                 PIC 9(2).
002980    03 連入－レセプト種類              PIC X(4).
002990    03 連入－保険種別                  PIC 9(2).
003000    03 連入－印刷種類                  PIC 9.
003010    03 連入－本人家族                  PIC 9.
003020    03 連入－用紙種類                  PIC 9.
003030    03 連入－県内県外                  PIC 9.
003040    03 連入－県ＪＩＳ                  PIC X(2).
003050    03 連入－政管ＪＩＳ                PIC X(2).
003060*
003220********************
003230* メッセージ表示キー *
003240********************
003250 01 連メ３－キー IS EXTERNAL.
003260    03  連メ３－メッセージ             PIC N(20).
003270    03  連メ３－メッセージ１           PIC X(20).
003280*
003290************************
003300* 助成レセまとめ
003310************************
003320 01 連レセまとめ－キー IS EXTERNAL.
003330    03 連レセまとめ－施術和暦年月.
003340       05 連レセまとめ－施術和暦               PIC 9.
003350       05 連レセまとめ－施術年月.
003360          07 連レセまとめ－施術年              PIC 9(2).
003370          07 連レセまとめ－施術月              PIC 9(2).
003380    03 連レセまとめ－患者コード.
003390       05 連レセまとめ－患者番号               PIC 9(6).
003400       05 連レセまとめ－枝番                   PIC X(1).
003410**-------------------------------------------------------**
003420*   1:助成レセプトなしの本体まとめの判定
003430*   2:横浜・川崎用の社保助成レセかの判定
003440    03 連レセまとめ－判定区分                  PIC 9.
003450**-------------------------------------------------------**
003460*  / OUT /　 0:対象外、1:対象
003470    03 連レセまとめ－判定結果                  PIC 9.
003480**
003490*
003500 01 連保険者番号変換－キー IS EXTERNAL.
003510    03 連保険者番号変換－施術和暦年月.
003520       05 連保険者番号変換－施術和暦               PIC 9.
003530       05 連保険者番号変換－施術年月.
003540          07 連保険者番号変換－施術年              PIC 9(2).
003550          07 連保険者番号変換－施術月              PIC 9(2).
003560    03 連保険者番号変換－保険種別                  PIC 9(2).
003570    03 連保険者番号変換－元保険者番号              PIC X(10).
003580* 0:通常（施術年月関係なし）
003590    03 連保険者番号変換－呼出区分                  PIC 9(2).
003600*  / OUT /
003610    03 連保険者番号変換－後保険者番号              PIC X(10).
003630*
003631* 暗号複合用
003632 01 連暗号複合－暗号情報 IS EXTERNAL.
003633    03 連暗号複合－入力情報.
003634       05 連暗号複合－記号               PIC X(24).
003635       05 連暗号複合－番号               PIC X(30).
003636       05 連暗号複合－暗号化項目.
003637          07 連暗号複合－暗号患者番号    PIC X(6).
003638          07 連暗号複合－暗号判定記号    PIC X.
003639          07 連暗号複合－暗号判定番号    PIC X.
003640          07 連暗号複合－暗号記号        PIC X(24).
003641          07 連暗号複合－暗号番号        PIC X(30).
003642    03 連暗号複合－出力情報.
003643       05 連暗号複合－複合した記号       PIC X(24).
003644       05 連暗号複合－複合した番号       PIC X(30).
003645*
003646******************************************************************
003647*                      PROCEDURE  DIVISION                       *
003650******************************************************************
003660 PROCEDURE               DIVISION.
003670************
003680*           *
003690* 初期処理   *
003700*           *
003710************
003720     PERFORM ファイルオープン.
003730     PERFORM 連結項目待避.
003740     PERFORM 制御情報取得.
003750************
003760*           *
003770* 主処理     *
003780*           *
003790************
003800     PERFORM 作業ファイル１作成.
003810     PERFORM 作業ファイル２作成.
003820************
003830*           *
003840* 終了処理   *
003850*           *
003860************
003870     PERFORM 終了処理.
003880     MOVE ZERO TO PROGRAM-STATUS.
003890     EXIT PROGRAM.
003900*
003910*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
003920*================================================================*
003930 連結項目待避 SECTION.
003940*
003950* 連結項目の待避
003960     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
003970     MOVE 連入－請求年        TO 請求年ＷＲ.
003980     MOVE 連入－請求月        TO 請求月ＷＲ.
003990     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
004000     MOVE 連入－保険種別      TO 保険種別ＷＲ.
004010     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
004020     MOVE 連入－県内県外      TO 県内県外ＷＲ.
004030     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
004040     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
004050*
004060*================================================================*
004070 ファイルオープン SECTION.
004080*
004090     OPEN INPUT 制御情報マスタ.
004100         MOVE NC"制御情報" TO ファイル名.
004110         PERFORM オープンチェック.
004120     OPEN INPUT 受診者情報Ｆ.
004130         MOVE NC"受診者情報Ｆ" TO ファイル名.
004140         PERFORM オープンチェック.
004210     OPEN INPUT 請求先マスタ.
004220         MOVE NC"請求先" TO ファイル名.
004230         PERFORM オープンチェック.
004270     OPEN INPUT レセプトＦ.
004271         MOVE NC"レセプトＦ" TO ファイル名.
004272         PERFORM オープンチェック.
004274
004275*================================================================*
004280 オープンチェック SECTION.
004290*
004300     IF 状態キー  NOT =  "00"
004310         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004320         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004330         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004340                                                 UPON CONS
004350         ACCEPT  キー入力 FROM CONS
004360         PERFORM ファイル閉鎖
004370         MOVE 99 TO PROGRAM-STATUS
004380         EXIT PROGRAM.
004390*================================================================*
004400 制御情報取得 SECTION.
004410*
004420     MOVE ZEROS TO 制－制御区分.
004430     READ 制御情報マスタ
004440     NOT INVALID KEY
004450         MOVE 制－協会コード   TO 協会コードＷ
004460     END-READ.
004470*
004480*================================================================*
004490 エラー表示 SECTION.
004500*
004510     DISPLAY NC"状態キー" 状態キー  UPON CONS.
004520     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
004530     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
004540     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004550     ACCEPT  キー入力 FROM CONS.
004560     PERFORM ファイル閉鎖.
004570     MOVE 99 TO PROGRAM-STATUS.
004580     EXIT PROGRAM.
004590*================================================================*
004600 作業ファイル１作成 SECTION.
004610*
004620     OPEN OUTPUT 作業ファイル１.
004630         MOVE NC"作業" TO ファイル名.
004640         PERFORM オープンチェック.
004650*
004660     EVALUATE レセプト種類ＷＲ
004670*        **********************************
004680*        * 国保・退職・組合・共済・自衛官
004690*        **********************************
004700         WHEN "KOKU"
004710         WHEN "KUMI"
004720         WHEN "KYOU"
004730         WHEN "TAIS"
004740         WHEN "JIEI"
004750             PERFORM 作業ファイル１作成１
004760*        **********************************
004770*        * 社保（日雇・船員含む）
004780*        **********************************
004790         WHEN "SYAH"
004800             PERFORM 作業ファイル１作成２
004810*        *************
004820*        * 老人 *
004830*        *************
004840         WHEN "ROUJ"
004850             PERFORM 作業ファイル１作成３
004860*        *************
004870*        * 助成 *
004880*        *************
004890         WHEN "JYOS"
004900             PERFORM 作業ファイル１作成４
004910*        *************
004920*        * 全印刷    *
004930*        *************
004940         WHEN "ALL "
004950             PERFORM 作業ファイル１作成５
004960     END-EVALUATE.
004970*
004980     CLOSE 作業ファイル１.
004990*
005000*================================================================*
005010 作業ファイル１作成１ SECTION.
005020*
005030**********************************
005040* 国保・退職・組合・共済・自衛官
005050**********************************
005250     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005251     MOVE 請求年ＷＲ    TO レセ－請求年.
005252     MOVE 請求月ＷＲ    TO レセ－請求月.
005253     MOVE 1             TO レセ－レセ種別.
005254     MOVE SPACE         TO レセ－請求保険者番号.
005255     MOVE ZERO          TO レセ－患者番号.
005256     MOVE SPACE         TO レセ－枝番.
005257     START レセプトＦ   KEY IS >= レセ－請求和暦年月
005258                                  レセ－レセ種別
005259                                  レセ－請求保険者番号
005260                                  レセ－患者コード
005261     END-START.
005262     IF 状態キー = "00"
005263         MOVE SPACE  TO 終了フラグ
005264         PERFORM レセプトＦ読込
005265         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005266                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005267                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005268                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
005269                       ( レセ－レセ種別 NOT = 1 )
005270             PERFORM データチェック
005271             IF 実行キーＷ = "YES"
005272*             ******************
005273*             * 健保 老人含まず*
005274*             ******************
005280               IF 受－保険種別  = 保険種別ＷＲ
005290** 本人家族区分ありか
005300                    MOVE SPACE  TO  作成フラグ
005310                    IF 本人家族区分ＷＲ NOT = ZERO
005320                       IF 本人家族区分ＷＲ = 受－本人家族区分
005330                           MOVE "YES"  TO  作成フラグ
005340                       END-IF
005350                    ELSE
005360                       MOVE "YES"  TO  作成フラグ
005370                    END-IF
005380** 県内県外か
005390                    IF 作成フラグ  = "YES"
005400                       MOVE SPACE  TO  作成フラグ
005410                       MOVE 受－保険種別 TO 保険種別県用ＷＫ
005420                       PERFORM 県内県外取得
005430*                     (県内1、県外2、両方0)
005440                       IF 県内県外ＷＲ NOT = ZERO
005450                          IF 県内県外ＷＲ = 1
005460                             IF 県内県外チェック = 1
005470                                MOVE "YES"  TO  作成フラグ
005480                             END-IF
005490                          ELSE
005500                             IF 県内県外チェック = ZERO
005510                                MOVE "YES"  TO  作成フラグ
005520                             END-IF
005530                          END-IF
005540                       ELSE
005550                          MOVE "YES"  TO  作成フラグ
005560                       END-IF
005570                    END-IF
005580*
005590*                 / 例外除く /
005600                    PERFORM 例外処理
005610*
005620                    IF 作成フラグ  = "YES"
005630                       IF ( 受－公費種別       = ZERO  ) AND
005640                          ( 受－費用負担者番号 = SPACE )
005670                              MOVE SPACE TO 作１－レコード
005680                              INITIALIZE 作１－レコード
005690                              MOVE 受－保険種別    TO 作１－保険種別
005700                              MOVE 受－保険者番号  TO 作１－保険者番号
005710                              PERFORM レコードセット
005720****                              PERFORM 健保料金計算
005730                              PERFORM ファイル書込
005750                       END-IF
005760                    END-IF
005770               END-IF
005771             END-IF
005780             PERFORM レセプトＦ読込
005790         END-PERFORM
005800     END-IF.
005810*================================================================*
005820 作業ファイル１作成２ SECTION.
005830*
005840**********************************
005850* 社保（日雇・船員含む）
005860**********************************
006060     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
006061     MOVE 請求年ＷＲ    TO レセ－請求年.
006062     MOVE 請求月ＷＲ    TO レセ－請求月.
006063     MOVE 1             TO レセ－レセ種別.
006064     MOVE SPACE         TO レセ－請求保険者番号.
006065     MOVE ZERO          TO レセ－患者番号.
006066     MOVE SPACE         TO レセ－枝番.
006067     START レセプトＦ   KEY IS >= レセ－請求和暦年月
006068                                  レセ－レセ種別
006069                                  レセ－請求保険者番号
006070                                  レセ－患者コード
006071     END-START.
006072     IF 状態キー = "00"
006073         MOVE SPACE  TO 終了フラグ
006074         PERFORM レセプトＦ読込
006075         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
006076                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
006077                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
006078                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
006079                       ( レセ－レセ種別 NOT = 1 )
006080             PERFORM データチェック
006081             IF 実行キーＷ = "YES"
006082*             ******************
006083*             * 老人含まず*
006084*             ******************
006090               IF 受－保険種別  = 02 OR 06 OR 07
006100** 本人家族区分ありか
006110                    MOVE SPACE  TO  作成フラグ
006120                    IF 本人家族区分ＷＲ NOT = ZERO
006130                       IF 本人家族区分ＷＲ = 受－本人家族区分
006140                           MOVE "YES"  TO  作成フラグ
006150                       END-IF
006160                    ELSE
006170                       MOVE "YES"  TO  作成フラグ
006180                    END-IF
006190** 県内県外か
006200                    IF 作成フラグ  = "YES"
006210                       MOVE SPACE  TO  作成フラグ
006220                       MOVE 受－保険種別 TO 保険種別県用ＷＫ
006230                       PERFORM 県内県外取得
006240*                     (県内1、県外2、両方0)
006250                       IF 県内県外ＷＲ NOT = ZERO
006260                          IF 県内県外ＷＲ = 1
006270                             IF 県内県外チェック = 1
006280                                MOVE "YES"  TO  作成フラグ
006290                             END-IF
006300                          ELSE
006310                             IF 県内県外チェック = ZERO
006320                                MOVE "YES"  TO  作成フラグ
006330                             END-IF
006340                          END-IF
006350                       ELSE
006360                          MOVE "YES"  TO  作成フラグ
006370                       END-IF
006380                    END-IF
006390*
006400*                 / 例外除く /
006410                    PERFORM 例外処理
006420*
006430                    IF 作成フラグ  = "YES"
006440                       IF ( 受－公費種別       = ZERO  ) AND
006450                          ( 受－費用負担者番号 = SPACE )
006480                              MOVE SPACE TO 作１－レコード
006490                              INITIALIZE 作１－レコード
006500                              MOVE 受－保険種別    TO 作１－保険種別
006510                              MOVE 受－保険者番号  TO 作１－保険者番号
006520                              PERFORM レコードセット
006530****                              PERFORM 健保料金計算
006540                              PERFORM ファイル書込
006560                       END-IF
006570                    END-IF
006580               END-IF
006590             END-IF
006591             PERFORM レセプトＦ読込
006600         END-PERFORM
006610     END-IF.
006620*================================================================*
006630 作業ファイル１作成３ SECTION.
006640*
006650**********************************
006660*  老人
006670**********************************
006870     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
006871     MOVE 請求年ＷＲ    TO レセ－請求年.
006872     MOVE 請求月ＷＲ    TO レセ－請求月.
006873     MOVE 2             TO レセ－レセ種別.
006874     MOVE SPACE         TO レセ－請求保険者番号.
006875     MOVE ZERO          TO レセ－患者番号.
006876     MOVE SPACE         TO レセ－枝番.
006877     START レセプトＦ   KEY IS >= レセ－請求和暦年月
006878                                  レセ－レセ種別
006879                                  レセ－請求保険者番号
006880                                  レセ－患者コード
006881     END-START.
006882     IF 状態キー = "00"
006883         MOVE SPACE  TO 終了フラグ
006884         PERFORM レセプトＦ読込
006885         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
006886                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
006887                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
006888                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
006889                       ( レセ－レセ種別 NOT = 2 )
006890             PERFORM データチェック
006891             IF 実行キーＷ = "YES"
006892*
006900** 本人家族区分ありか
006910                  MOVE SPACE  TO  作成フラグ
006920                  IF 本人家族区分ＷＲ NOT = ZERO
006930                     IF 本人家族区分ＷＲ = 受－本人家族区分
006940                         MOVE "YES"  TO  作成フラグ
006950                     END-IF
006960                  ELSE
006970                     MOVE "YES"  TO  作成フラグ
006980                  END-IF
006990** 県内県外か
007000                  IF 作成フラグ  = "YES"
007010                     MOVE SPACE  TO  作成フラグ
007020                     MOVE 受－公費種別 TO 保険種別県用ＷＫ
007030                     PERFORM 県内県外取得
007040*                   (県内1、県外2、両方0)
007050                     IF 県内県外ＷＲ NOT = ZERO
007060                        IF 県内県外ＷＲ = 1
007070                           IF 県内県外チェック = 1
007080                              MOVE "YES"  TO  作成フラグ
007090                           END-IF
007100                        ELSE
007110                           IF 県内県外チェック = ZERO
007120                              MOVE "YES"  TO  作成フラグ
007130                           END-IF
007140                        END-IF
007150                     ELSE
007160                        MOVE "YES"  TO  作成フラグ
007170                     END-IF
007180                  END-IF
007190*
007200                  IF 作成フラグ  = "YES"
007230                           MOVE SPACE TO 作１－レコード
007240                           INITIALIZE 作１－レコード
007250                           MOVE 受－公費種別           TO 作１－保険種別
007260                           MOVE 受－費用負担者番号     TO 作１－保険者番号
007270                           PERFORM レコードセット
007280                           PERFORM 老人料金計算
007290* 請求額が ZERO の時は、書き込まない。
007300                           IF  作１－請求額 NOT = ZERO
007310                               PERFORM ファイル書込
007320                           END-IF
007340                  END-IF
007351             END-IF
007360             PERFORM レセプトＦ読込
007370         END-PERFORM
007380     END-IF.
007390*================================================================*
007400 作業ファイル１作成４ SECTION.
007410*
007420**********************************
007430*  助成
007440**********************************
007640     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
007641     MOVE 請求年ＷＲ    TO レセ－請求年.
007642     MOVE 請求月ＷＲ    TO レセ－請求月.
007643     MOVE 3             TO レセ－レセ種別.
007644     MOVE SPACE         TO レセ－請求保険者番号.
007645     MOVE ZERO          TO レセ－患者番号.
007646     MOVE SPACE         TO レセ－枝番.
007647     START レセプトＦ   KEY IS >= レセ－請求和暦年月
007648                                  レセ－レセ種別
007649                                  レセ－請求保険者番号
007650                                  レセ－患者コード
007651     END-START.
007652     IF 状態キー = "00"
007653         MOVE SPACE  TO 終了フラグ
007654         PERFORM レセプトＦ読込
007655         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
007656                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
007657                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
007658                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
007659                       ( レセ－レセ種別 NOT = 3 )
007660             PERFORM データチェック
007661             IF 実行キーＷ = "YES"
007670* 生活保護は対象外とする
007680                 IF 受－助成種別           NOT = 50
007690
007700** 本人家族区分ありか
007710                     MOVE SPACE  TO  作成フラグ
007720                     IF 本人家族区分ＷＲ NOT = ZERO
007730                         IF 本人家族区分ＷＲ = 受－本人家族区分
007740                             MOVE "YES"  TO  作成フラグ
007750                         END-IF
007760                     ELSE
007770                         MOVE "YES"  TO  作成フラグ
007780                     END-IF
007790** 県内県外か
007800                     IF 作成フラグ  = "YES"
007810                         MOVE SPACE  TO  作成フラグ
007820                         MOVE 受－助成種別 TO 保険種別県用ＷＫ
007830                         PERFORM 県内県外取得
007840*                   (県内1、県外2、両方0)
007850                         IF 県内県外ＷＲ NOT = ZERO
007860                             IF 県内県外ＷＲ = 1
007870                                 IF 県内県外チェック = 1
007880                                     MOVE "YES"  TO  作成フラグ
007890                                 END-IF
007900                             ELSE
007910                                 IF 県内県外チェック = ZERO
007920                                     MOVE "YES"  TO  作成フラグ
007930                                 END-IF
007940                             END-IF
007950                         ELSE
007960                             MOVE "YES"  TO  作成フラグ
007970                         END-IF
007980                     END-IF
007990*
008000                     IF 作成フラグ  = "YES"
008040                             MOVE SPACE TO 作１－レコード
008050                             INITIALIZE 作１－レコード
008060                             MOVE 受－助成種別           TO 作１－保険種別
008070                             MOVE 受－費用負担者番号助成 TO 作１－保険者番号
008080                             PERFORM レコードセット
008090                             PERFORM 助成料金計算
008100* 生保単独 (請求額は 請求額+請求額助成)
008110* 対象外                     IF ( 受－保険種別    = ZERO ) AND
008120*                               ( 受－保険者番号  = SPACE )
008130*                                COMPUTE 作１－請求額 = 連計－請求額助成  + 連計－請求額
008140*                            END-IF
008150*
008160* 請求額が ZERO の時は、書き込まない。
008170                             IF  作１－請求額 NOT = ZERO
008180                                 PERFORM ファイル書込
008190                             END-IF
008210                     END-IF
008220                 END-IF
008230             END-IF
008240             PERFORM レセプトＦ読込
008250         END-PERFORM
008260     END-IF.
008270*================================================================*
008280 作業ファイル１作成５ SECTION.
008290*
008300*********************
008310* 全出力 *
008320*********************
008542     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
008543     MOVE 請求年ＷＲ    TO レセ－請求年.
008544     MOVE 請求月ＷＲ    TO レセ－請求月.
008545     MOVE ZERO          TO レセ－レセ種別.
008546     MOVE ZERO          TO レセ－施術和暦.
008547     MOVE ZERO          TO レセ－施術年.
008548     MOVE ZERO          TO レセ－施術月.
008549     MOVE ZERO          TO レセ－患者番号.
008550     MOVE SPACE         TO レセ－枝番.
008551     START レセプトＦ   KEY IS >= レセ－請求和暦年月
008552                                  レセ－施術和暦年月
008553                                  レセ－患者コード
008554                                  レセ－レセ種別
008555     END-START.
008556     IF 状態キー = "00"
008557         MOVE SPACE  TO 終了フラグ
008558         PERFORM レセプトＦ読込
008559         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008560                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
008561                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
008562                       ( レセ－請求月   NOT = 請求月ＷＲ   )
008563             PERFORM データチェック
008564** 労災・自賠責・自費・生保単独　除く
008565             IF  受－保険種別 = 70 OR 80 OR 90 OR ZERO
008566                 MOVE SPACE  TO 実行キーＷ
008567             END-IF
008568***
008569             IF 実行キーＷ = "YES"
008570** 本人家族区分ありか
008571                 MOVE SPACE  TO  作成フラグ
008572                 IF 本人家族区分ＷＲ NOT = ZERO
008573                     IF 本人家族区分ＷＲ = 受－本人家族区分
008574                         MOVE "YES"  TO  作成フラグ
008575                     END-IF
008580                 ELSE
008590                     MOVE "YES"  TO  作成フラグ
008600                 END-IF
008610                 IF 作成フラグ  = "YES"
008620
008680* 本体＋生活保護の場合も除く
008690                    IF 受－助成種別 = 50
008700                        MOVE SPACE  TO 実行キーＷ
008710                    END-IF
008720
008730***
008740                    IF 実行キーＷ = "YES"
008760                        EVALUATE TRUE
008761*                ******************
008770*                * 健保 老人含まず*
008780*                ******************
008810                        WHEN レセ－レセ種別   = 1
008811                            IF ( 受－公費種別       = ZERO  ) AND
008820                           ( 受－費用負担者番号 = SPACE )
008830**                 / 県内県外か /
008840                                MOVE SPACE  TO  作成フラグ
008850                                MOVE 受－保険種別 TO 保険種別県用ＷＫ
008860                                PERFORM 県内県外取得
008870*                               (県内1、県外2、両方0)
008880                                IF 県内県外ＷＲ NOT = ZERO
008890                                    IF 県内県外ＷＲ = 1
008900                                        IF 県内県外チェック = 1
008910                                            MOVE "YES"  TO  作成フラグ
008920                                        END-IF
008930                                    ELSE
008940                                        IF 県内県外チェック = ZERO
008950                                            MOVE "YES"  TO  作成フラグ
008960                                        END-IF
008970                                    END-IF
008980                                ELSE
008990                                    MOVE "YES"  TO  作成フラグ
009000                                END-IF
009010*
009020*                               / 例外除く /
009030                                PERFORM 例外処理
009040**
009050                                IF 作成フラグ  = "YES"
009060                                    MOVE SPACE TO 作１－レコード
009070                                    INITIALIZE 作１－レコード
009080                                    MOVE 受－保険種別    TO 作１－保険種別
009090                                    MOVE 受－保険者番号  TO 作１－保険者番号
009100                                    PERFORM レコードセット
009110****                               PERFORM 健保料金計算
009121                                    PERFORM ファイル書込
009130                                END-IF
009140                            END-IF
009160*                ********
009170*                * 老人 *
009180*                ********
009210                        WHEN レセ－レセ種別   = 2
009211**                 / 県内県外か /
009220                            MOVE SPACE  TO  作成フラグ
009230                            MOVE 受－公費種別 TO 保険種別県用ＷＫ
009240                            PERFORM 県内県外取得
009250*                           (県内1、県外2、両方0)
009260                            IF 県内県外ＷＲ NOT = ZERO
009270                                IF 県内県外ＷＲ = 1
009280                                    IF 県内県外チェック = 1
009290                                        MOVE "YES"  TO  作成フラグ
009300                                    END-IF
009310                                ELSE
009320                                    IF 県内県外チェック = ZERO
009330                                        MOVE "YES"  TO  作成フラグ
009340                                    END-IF
009350                                END-IF
009360                            ELSE
009370                                MOVE "YES"  TO  作成フラグ
009380                            END-IF
009390*                           / 例外除く(老人＋生活保護) /
009400                            PERFORM 例外処理
009410**
009420                            IF 作成フラグ  = "YES"
009430                                MOVE SPACE TO 作１－レコード
009440                                INITIALIZE 作１－レコード
009450                                MOVE 受－公費種別           TO 作１－保険種別
009460                                MOVE 受－費用負担者番号     TO 作１－保険者番号
009470                                PERFORM レコードセット
009480                                PERFORM 老人料金計算
009490* 請求額が ZERO の時は、書き込まない。
009500                                IF  作１－請求額 NOT = ZERO
009511                                    PERFORM ファイル書込
009520                                END-IF
009530                            END-IF
009550*                ********
009560*                * 助成 *
009570*                ********
009600                        WHEN レセ－レセ種別   = 3
009601* 生活保護は対象外とする
009610                            IF 受－助成種別           NOT = 50
009620**                 / 県内県外か /
009630                                MOVE SPACE  TO  作成フラグ
009640                                MOVE 受－助成種別 TO 保険種別県用ＷＫ
009650                                PERFORM 県内県外取得
009660*                               (県内1、県外2、両方0)
009670                                IF 県内県外ＷＲ NOT = ZERO
009680                                    IF 県内県外ＷＲ = 1
009690                                        IF 県内県外チェック = 1
009700                                            MOVE "YES"  TO  作成フラグ
009710                                        END-IF
009720                                    ELSE
009730                                        IF 県内県外チェック = ZERO
009740                                            MOVE "YES"  TO  作成フラグ
009750                                        END-IF
009760                                    END-IF
009770                                ELSE
009780                                    MOVE "YES"  TO  作成フラグ
009790                                END-IF
009800**
009810                                IF 作成フラグ  = "YES"
009820                                    MOVE SPACE TO 作１－レコード
009830                                    INITIALIZE 作１－レコード
009840                                    MOVE 受－助成種別           TO 作１－保険種別
009850                                    MOVE 受－費用負担者番号助成 TO 作１－保険者番号
009860                                    PERFORM レコードセット
009870                                    PERFORM 助成料金計算
009880*** 生保単独 (請求額は 請求額+請求額助成)
009890* 対象外                    IF ( 受－保険種別    = ZERO ) AND
009900*                              ( 受－保険者番号  = SPACE )
009910*                               COMPUTE 作１－請求額 = 連計－請求額助成  + 連計－請求額
009920*                           END-IF
009930*
009940* 請求額が ZERO の時は、書き込まない。
009950                                    IF  作１－請求額 NOT = ZERO
009961                                        PERFORM ファイル書込
009970                                    END-IF
009982                                END-IF
009990                            END-IF
010000                        END-EVALUATE
010010                    END-IF
010020                END-IF
010021             END-IF
010031             PERFORM レセプトＦ読込
010040         END-PERFORM
010050     END-IF.
010740*================================================================*
010741 レセプトＦ読込 SECTION.
010742*
010743     READ レセプトＦ NEXT
010744     AT END
010745         MOVE "YES" TO 終了フラグ
010746     END-READ.
010747*
010748*================================================================*
010749 データチェック SECTION.
010750*
010751     MOVE SPACE          TO 実行キーＷ.
010752     IF ( レセ－レセ印刷対象区分 NOT = 1 )
010753        MOVE "YES"  TO 実行キーＷ
010754     END-IF.
010755* *****************************************************************
010756* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
010757* *****************************************************************
010758     IF 実行キーＷ  = "YES"
010759*      (再度、実行キーＷ SPACE)
010760        MOVE SPACE  TO 実行キーＷ
010761        IF レセ－請求対象区分 NOT = ZERO
010762           MOVE レセ－施術和暦  TO 受－施術和暦
010763           MOVE レセ－施術年    TO 受－施術年
010764           MOVE レセ－施術月    TO 受－施術月
010765           MOVE レセ－患者番号  TO 受－患者番号
010766           MOVE レセ－枝番      TO 受－枝番
010767           READ 受診者情報Ｆ
010768           NOT INVALID KEY
010769              MOVE "YES"  TO 実行キーＷ
010770*
010771*/協会健保の対応、旧保険者番号でも新保険者番号とまとめて請求する/081016
010772              INITIALIZE 連保険者番号変換－キー
010773              MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
010774              MOVE  受－保険種別      TO 連保険者番号変換－保険種別
010775              MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
010776              MOVE  ZERO              TO 連保険者番号変換－呼出区分
010777              CALL   "CHGHOKNO"
010778              CANCEL "CHGHOKNO"
010779*   / 置換え /
010780              MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号
010781*
010782           END-READ
010783        ELSE
010784           MOVE SPACE  TO 実行キーＷ
010785        END-IF
010786     END-IF.
010787*
010810*================================================================*
010820 レコードセット SECTION.
010830*
010840     MOVE レセ－請求和暦    TO 作１－請求和暦.
010850     MOVE レセ－請求年      TO 作１－請求年.
010860     MOVE レセ－請求月      TO 作１－請求月.
010870     MOVE 受－施術和暦      TO 作１－施術和暦.
010880     MOVE 受－施術年        TO 作１－施術年.
010890     MOVE 受－施術月        TO 作１－施術月.
010900     MOVE 受－被保険者カナ  TO 作１－被保険者カナ.
010910     MOVE 受－患者コード    TO 作１－患者コード.
010920     MOVE 受－患者氏名      TO 作１－患者氏名.
010930     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
010960*     MOVE 受－記号          TO 作１－記号.
010961*     MOVE 受－番号          TO 作１－番号.
010962*
010963     MOVE SPACE TO 連暗号複合－暗号情報.
010964*
010965*    / 連暗号複合－入力情報セット /
010966     MOVE 受－記号       TO 連暗号複合－記号.
010967     MOVE 受－番号       TO 連暗号複合－番号.
010968     MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
010969*
010970     CALL   複合プログラム名Ｗ.
010971     CANCEL 複合プログラム名Ｗ.
010972*
010973     MOVE 連暗号複合－複合した記号 TO 作１－記号.
010974     MOVE 連暗号複合－複合した番号 TO 作１－番号.
010976*
010977* / 助成は、本人とする /
010980     EVALUATE  作１－保険種別
010990****     WHEN 05
011000     WHEN 50 THRU 60
011010         MOVE 1                 TO 作１－本人家族区分
011020     WHEN OTHER
011030         MOVE 受－本人家族区分  TO 作１－本人家族区分
011040     END-EVALUATE.
011050*
011060*
011070     MOVE 県ＷＫ TO 作１－県.
011080*
011090*************************************************************************************
011100*  請求先マスタを読んで、データがある時は、請求先市町村コードを保険者番号に転記する。
011110*************************************************************************************
011120     MOVE 作１－保険種別    TO 請先－保険種別.
011130     MOVE 作１－保険者番号  TO 請先－保険者番号.
011140     READ 請求先マスタ
011150     INVALID KEY
011160         MOVE 作１－保険者番号     TO 作１－保険者番号２
011170     NOT INVALID KEY
011180         MOVE 請先－請求先市町村   TO 作１－保険者番号２
011190     END-READ.
011200*
012010*================================================================*
012011 健保料金計算 SECTION.
012012*
012013     MOVE レセ－合計         TO 作１－費用額.
012014     MOVE レセ－一部負担金   TO 作１－負担額.
012015     MOVE レセ－請求金額     TO 作１－請求額.
012016*
012017* 特別
012018*    PERFORM 助成レセ判定.
012019*    IF 助成レセまとめフラグ = "YES"
012020*        MOVE レセ－受給者負担額  TO 作１－負担額
012021*        COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012022*    END-IF.
012023*
012024*================================================================*
012025 老人料金計算 SECTION.
012026*
012027     MOVE レセ－合計        TO 作１－費用額.
012028     MOVE レセ－一部負担金  TO 作１－負担額.
012029     MOVE レセ－請求金額    TO 作１－請求額.
012030*
012031* 特別
012032*    PERFORM 助成レセ判定.
012033*    IF 助成レセまとめフラグ = "YES"
012034*        MOVE レセ－受給者負担額  TO 作１－負担額
012035*        COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012036*    END-IF.
012037*
012038*================================================================*
012039 助成料金計算 SECTION.
012040*
012041     MOVE レセ－合計         TO 作１－費用額.
012042     MOVE レセ－受給者負担額 TO 作１－負担額.
012043     MOVE レセ－助成請求金額 TO 作１－請求額.
012044*
012045* 特別
012046*    PERFORM 助成レセ判定.
012047*    IF 助成レセまとめフラグ = "YES"
012048*   / 書き込まないように請求額ゼロにする /
012049*       MOVE ZERO TO 作１－請求額
012050*    END-IF.
012051*
012052*================================================================*
012053 ファイル書込 SECTION.
012054*
012059     WRITE 作１－レコード
012060     INVALID KEY
012061         DISPLAY 作１－レコード UPON CONSOLE
012062         MOVE NC"作１"  TO ファイル名
012070         PERFORM エラー表示
012080     END-WRITE.
012093*
012094*================================================================*
012100 作業ファイル２作成 SECTION.
012110*
012120     OPEN INPUT  作業ファイル１.
012130     OPEN OUTPUT 作業ファイル２.
012140*
012150     PERFORM 作業ファイル２作成処理.
012160*
012170     CLOSE 作業ファイル２.
012180     CLOSE 作業ファイル１.
012190*================================================================*
012200 作業ファイル２作成処理 SECTION.
012210*
012220     MOVE ZERO       TO 作１－請求和暦     請求和暦Ｗ.
012230     MOVE ZERO       TO 作１－請求年       請求年Ｗ.
012240     MOVE ZERO       TO 作１－請求月       請求月Ｗ.
012250     MOVE ZERO       TO 作１－保険種別     保険種別Ｗ.
012260     MOVE LOW-VALUE  TO 作１－保険者番号   保険者番号Ｗ.
012270     MOVE LOW-VALUE  TO 作１－記号.
012280     MOVE LOW-VALUE  TO 作１－番号.
012290     MOVE LOW-VALUE  TO 作１－被保険者カナ.
012300     MOVE ZERO       TO 作１－患者番号.
012310     MOVE LOW-VALUE  TO 作１－枝番.
012320     MOVE ZERO       TO 作１－施術和暦.
012330     MOVE ZERO       TO 作１－施術年.
012340     MOVE ZERO       TO 作１－施術月.
012350     START 作業ファイル１ KEY IS >=  作１－請求和暦年月
012360                                     作１－保険種別
012370                                     作１－保険者番号
012380                                     作１－記号
012390                                     作１－番号
012400                                     作１－被保険者カナ
012410                                     作１－患者コード
012420                                     作１－施術和暦年月
012430     END-START.
012440     IF 状態キー = "00"
012450*
012460         MOVE SPACE TO 終了フラグ
012470         MOVE ZERO  TO 件数Ｗ
012480         MOVE ZERO  TO 費用額Ｗ
012490         MOVE ZERO  TO 負担額Ｗ
012500         MOVE ZERO  TO 請求額Ｗ
012510*
012520         PERFORM 作業ファイル１読込
012530         MOVE 作１－請求和暦     TO 請求和暦Ｗ
012540         MOVE 作１－請求年       TO 請求年Ｗ
012550         MOVE 作１－請求月       TO 請求月Ｗ
012560         MOVE 作１－保険種別     TO 保険種別Ｗ
012570         MOVE 作１－保険者番号   TO 保険者番号Ｗ
012580         MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
012590         PERFORM UNTIL 終了フラグ = "YES"
012600*
012610             MOVE SPACE TO 作２－レコード
012620             INITIALIZE 作２－レコード
012630             PERFORM 作業レコード２累計
012640*
012650             MOVE 作１－請求和暦     TO 請求和暦Ｗ
012660             MOVE 作１－請求年       TO 請求年Ｗ
012670             MOVE 作１－請求月       TO 請求月Ｗ
012680             MOVE 作１－保険種別     TO 保険種別Ｗ
012690             MOVE 作１－保険者番号   TO 保険者番号Ｗ
012700             MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
012710             PERFORM 作業ファイル１読込
012720         END-PERFORM
012730         PERFORM 作業レコード２セット
012740         PERFORM 作業ファイル２書込
012750     END-IF.
012760*================================================================*
012770 作業ファイル１読込 SECTION.
012780*
012790     READ 作業ファイル１ NEXT
012800     AT END
012810         MOVE "YES" TO 終了フラグ
012820     END-READ.
012830*================================================================*
012840 作業レコード２累計 SECTION.
012850*
012860     IF ( 作１－請求和暦 NOT = 請求和暦Ｗ ) OR
012870        ( 作１－請求年   NOT = 請求年Ｗ   ) OR
012880        ( 作１－請求月   NOT = 請求月Ｗ   ) OR
012890        ( 作１－保険種別 NOT = 保険種別Ｗ ) OR
012900        ( 作１－保険者番号 NOT = 保険者番号Ｗ )
012910         PERFORM 作業レコード２セット
012920         PERFORM 作業ファイル２書込
012930         MOVE ZERO  TO 件数Ｗ
012940         MOVE ZERO  TO 費用額Ｗ
012950         MOVE ZERO  TO 負担額Ｗ
012960         MOVE ZERO  TO 請求額Ｗ
012970         PERFORM 作業レコード２加算
012980     ELSE
012990         PERFORM 作業レコード２加算
013000     END-IF.
013010*================================================================*
013020 作業レコード２加算 SECTION.
013030*
013040     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
013050***     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
013060***     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
013070***     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
013080*===============================================================*
013090 作業レコード２セット SECTION.
013100*
013110     MOVE 請求和暦Ｗ     TO 作２－請求和暦.
013120     MOVE 請求年Ｗ       TO 作２－請求年.
013130     MOVE 請求月Ｗ       TO 作２－請求月.
013140     MOVE 保険種別Ｗ     TO 作２－保険種別.
013150     MOVE 保険者番号Ｗ   TO 作２－保険者番号.
013160     MOVE 保険者番号２Ｗ TO 作２－保険者番号２.
013170     MOVE 件数Ｗ         TO 作２－件数.
013180***     MOVE 費用額Ｗ       TO 作２－費用額.
013190***     MOVE 負担額Ｗ       TO 作２－負担額.
013200***     MOVE 請求額Ｗ       TO 作２－請求額.
013210*===============================================================*
013220 作業ファイル２書込 SECTION.
013230*
013240     WRITE 作２－レコード
013250     INVALID KEY
013260**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
013270         DISPLAY 作２－レコード UPON CONSOLE
013271         MOVE NC"作２" TO ファイル名
013280         PERFORM エラー表示
013290         PERFORM ファイル閉鎖
013300         MOVE 99 TO PROGRAM-STATUS
013310         EXIT PROGRAM.
013320*================================================================*
013330 ファイル閉鎖 SECTION.
013340*
013350     CLOSE 制御情報マスタ 受診者情報Ｆ
013360           請求先マスタ レセプトＦ.
013370*================================================================*
013380 終了処理 SECTION.
013390*
013400     PERFORM ファイル閉鎖.
013410*================================================================*
013420*================================================================*
013430 県内県外取得 SECTION.
013440*
013450      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
013460      EVALUATE  保険種別県用ＷＫ
013470* 国保
013480      WHEN  01
013490         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
013500            MOVE  1  TO  県内県外チェック
013510         END-IF
013520         MOVE 受－保険者番号(1:2) TO 県ＷＫ
013530* 社保
013540      WHEN  02
013550*/協会健保の対応/081015
013560         IF 受－保険者番号(5:5) = SPACE
013570             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
013580                MOVE  1  TO  県内県外チェック
013590             END-IF
013600             MOVE 受－保険者番号(1:2) TO 県ＷＫ
013610             PERFORM 県統一
013620             MOVE 県統一ＷＫ TO 県ＷＫ
013630         ELSE
013640             IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
013650                MOVE  1  TO  県内県外チェック
013660             END-IF
013670             MOVE 受－保険者番号(3:2) TO 県ＷＫ
013680         END-IF
013690* 船員
013700* 日雇
013710* 組合
013720* 共済
013730* 自衛官
013740* 退職国保
013750      WHEN  06
013760      WHEN  07
013770      WHEN  08
013780      WHEN  09
013790      WHEN  04
013800      WHEN  03
013810         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
013820            MOVE  1  TO  県内県外チェック
013830         END-IF
013840         MOVE 受－保険者番号(3:2) TO 県ＷＫ
013850* 助成
013860      WHEN 50 THRU 60
013870         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
013880            MOVE  1  TO  県内県外チェック
013890         END-IF
013900         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
013910* 老人
013920      WHEN  05
013930         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
013940            MOVE  1  TO  県内県外チェック
013950         END-IF
013960         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
013970* 労災、自賠責・自費・生保単独は除外
013980      WHEN  70
013990      WHEN  80
014000      WHEN  90
014010      WHEN  ZERO
014020         CONTINUE
014030*
014040     WHEN OTHER
014050         MOVE SPACE                TO エラーメッセージＷ
014060         MOVE 受－患者コード       TO エラー患者コードＷ
014070         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
014080         MOVE "-"                  TO エラー区切りＷ
014090         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
014100         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
014110         CALL   "MSG003"
014120         CANCEL "MSG003"
014130     END-EVALUATE.
014140*
014150*================================================================*
014160 県統一 SECTION.
014170*
014180     MOVE ZERO  TO  県統一ＷＫ.
014190     EVALUATE  県ＷＫ
014200*北海道
014210      WHEN  01
014220         MOVE 01 TO 県統一ＷＫ
014230*青森
014240      WHEN  02
014250         MOVE 02 TO 県統一ＷＫ
014260*岩手
014270      WHEN  03
014280         MOVE 03 TO 県統一ＷＫ
014290*宮城
014300      WHEN  04
014310         MOVE 04 TO 県統一ＷＫ
014320*秋田
014330      WHEN  05
014340         MOVE 05 TO 県統一ＷＫ
014350*山形
014360      WHEN  06
014370         MOVE 06 TO 県統一ＷＫ
014380*福島
014390      WHEN  07
014400         MOVE 07 TO 県統一ＷＫ
014410*茨城
014420      WHEN  08
014430         MOVE 08 TO 県統一ＷＫ
014440*栃木
014450      WHEN  09
014460         MOVE 09 TO 県統一ＷＫ
014470*群馬
014480      WHEN  10
014490         MOVE 10 TO 県統一ＷＫ
014500*埼玉
014510      WHEN  11
014520         MOVE 11 TO 県統一ＷＫ
014530*千葉
014540      WHEN  12
014550         MOVE 12 TO 県統一ＷＫ
014560*東京
014570      WHEN  21
014580         MOVE 13 TO 県統一ＷＫ
014590*神奈川
014600      WHEN  31
014610         MOVE 14 TO 県統一ＷＫ
014620*新潟
014630      WHEN  32
014640         MOVE 15 TO 県統一ＷＫ
014650*富山
014660      WHEN  33
014670         MOVE 16 TO 県統一ＷＫ
014680*石川
014690      WHEN  34
014700         MOVE 17 TO 県統一ＷＫ
014710*福井
014720      WHEN  35
014730         MOVE 18 TO 県統一ＷＫ
014740*山梨
014750      WHEN  36
014760         MOVE 19 TO 県統一ＷＫ
014770*長野
014780      WHEN  37
014790         MOVE 20 TO 県統一ＷＫ
014800*岐阜
014810      WHEN  38
014820         MOVE 21 TO 県統一ＷＫ
014830*静岡
014840      WHEN  39
014850         MOVE 22 TO 県統一ＷＫ
014860*愛知
014870      WHEN  51
014880         MOVE 23 TO 県統一ＷＫ
014890*三重
014900      WHEN  52
014910         MOVE 24 TO 県統一ＷＫ
014920*滋賀
014930      WHEN  53
014940         MOVE 25 TO 県統一ＷＫ
014950*京都
014960      WHEN  54
014970         MOVE 26 TO 県統一ＷＫ
014980*大阪
014990      WHEN  41
015000         MOVE 27 TO 県統一ＷＫ
015010*兵庫
015020      WHEN  42
015030         MOVE 28 TO 県統一ＷＫ
015040*奈良
015050      WHEN  55
015060         MOVE 29 TO 県統一ＷＫ
015070*和歌山
015080      WHEN  56
015090         MOVE 30 TO 県統一ＷＫ
015100*鳥取
015110      WHEN  57
015120         MOVE 31 TO 県統一ＷＫ
015130*島根
015140      WHEN  58
015150         MOVE 32 TO 県統一ＷＫ
015160*岡山
015170      WHEN  59
015180         MOVE 33 TO 県統一ＷＫ
015190*広島
015200      WHEN  60
015210         MOVE 34 TO 県統一ＷＫ
015220*山口
015230      WHEN  61
015240         MOVE 35 TO 県統一ＷＫ
015250*徳島
015260      WHEN  71
015270         MOVE 36 TO 県統一ＷＫ
015280*香川
015290      WHEN  72
015300         MOVE 37 TO 県統一ＷＫ
015310*愛媛
015320      WHEN  73
015330         MOVE 38 TO 県統一ＷＫ
015340*高知
015350      WHEN  74
015360         MOVE 39 TO 県統一ＷＫ
015370*福岡
015380      WHEN  75
015390         MOVE 40 TO 県統一ＷＫ
015400*佐賀
015410      WHEN  76
015420         MOVE 41 TO 県統一ＷＫ
015430*長崎
015440      WHEN  77
015450         MOVE 42 TO 県統一ＷＫ
015460*熊本
015470      WHEN  78
015480         MOVE 43 TO 県統一ＷＫ
015490*大分
015500      WHEN  79
015510         MOVE 44 TO 県統一ＷＫ
015520*宮崎
015530      WHEN  80
015540         MOVE 45 TO 県統一ＷＫ
015550*鹿児島
015560      WHEN  81
015570         MOVE 46 TO 県統一ＷＫ
015580*沖縄
015590      WHEN  82
015600         MOVE 47 TO 県統一ＷＫ
015610*その他
015620      WHEN  OTHER
015630         CONTINUE
015640     END-EVALUATE.
015650*
015660*================================================================*
015670*================================================================*
015790 助成レセ判定 SECTION.
015791* 特別処理（助成レセまとめ）
015792     MOVE SPACE TO 助成レセまとめフラグ.
015793*
015794     IF 受－助成種別 NOT = ZERO
015795            IF ( 受－保険種別 = 01 OR 08 )
015796                PERFORM 助成レセまとめ判定
015797            END-IF
015798     END-IF.
015799**================================================================*
015800*================================================================*
016200 助成レセまとめ判定 SECTION.
016201*
016202     MOVE SPACE TO 助成レセまとめフラグ.
016203*
016204     IF ( レセ－本体まとめ区分 = 1 )
016205           MOVE "YES" TO 助成レセまとめフラグ
016206     END-IF.
016207*
016208*================================================================*
016210*================================================================*
016220 例外処理  SECTION.
016230*
016240* 印刷対象の例外の定義
016250*
016260* ①中部柔整 27 → 社保(02,06,07)、組合(03)、共済(04,09)、
016270*                　国保(中央建設133264,全国土木133033) は返戻分を除く
016280*
016290*      IF 協会コードＷ = 27
016300*          IF ( 受－請求区分 = 2 ) AND ( 受－公費種別  = ZERO  )
016310*             IF  ( 受－保険種別  = 02 OR 03 OR 04 OR 06 OR 07 OR 09 ) OR
016320*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133264")) OR
016330*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133033"))
016340*                  MOVE SPACE  TO  作成フラグ
016350*             END-IF
016360*          END-IF
016370*      END-IF.
016380
016390* 生活保護は除く
016400     IF 受－助成種別 = 50
016410         MOVE SPACE  TO  作成フラグ
016420     END-IF.
016430
016440*
016450*================================================================*
016460*================================================================*
016470******************************************************************
016480 END PROGRAM YJK432.
016490******************************************************************
