000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK438.
000060 AUTHOR.                 岡田 憲和
000070*
000080*----------------------------------------------------------------*
000090*  日本柔整共済会用  東京都 総括表ⅠⅡ
000100*  請求年月バージョン 
000110*         MED = YJK430G 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-09-03
000140 DATE-COMPILED.          2012-09-03
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000880     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000881                             ORGANIZATION             IS  INDEXED
000882                             ACCESS MODE              IS  DYNAMIC
000883                             RECORD KEY               IS  制－制御区分
000884                             FILE STATUS              IS  状態キー
000885                             LOCK        MODE         IS  AUTOMATIC.
000886     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000887                             ORGANIZATION             IS  INDEXED
000888                             ACCESS MODE              IS  DYNAMIC
000889                             RECORD KEY               IS  受－施術和暦年月
000890                                                          受－患者コード
000891                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000892                                                          受－患者カナ
000893                                                          受－患者コード
000894                             ALTERNATE RECORD KEY     IS  受－患者コード
000895                                                          受－施術和暦年月
000896                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000897                                                          受－保険種別
000898                                                          受－保険者番号
000899                                                          受－患者コード
000900                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000901                                                          受－公費種別
000902                                                          受－費用負担者番号
000903                                                          受－患者コード
000904                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000905                                                          受－助成種別
000906                                                          受－費用負担者番号助成
000907                                                          受－患者コード
000908                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000909                                                      受－施術和暦年月
000910                                                      受－患者コード
000911                             FILE STATUS              IS  状態キー
000912                             LOCK        MODE         IS  AUTOMATIC.
000920     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000921                             ORGANIZATION             IS  INDEXED
000922                             ACCESS MODE              IS  DYNAMIC
000923                             RECORD KEY               IS  レセ－施術和暦年月
000924                                                          レセ－患者コード
000925                                                          レセ－レセ種別
000926                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000927                                                          レセ－施術和暦年月
000928                                                          レセ－レセ種別
000929                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000930                                                          レセ－施術和暦年月
000931                                                          レセ－患者コード
000932                                                          レセ－レセ種別
000933                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000934                                                          レセ－レセ種別
000935                                                          レセ－請求保険者番号
000936                                                          レセ－患者コード
000937                                                          レセ－施術和暦年月
000938                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000939                                                          レセ－請求保険者番号
000940                                                          レセ－患者コード
000941                                                          レセ－レセ種別
000942                                                          レセ－施術和暦年月
000943                             FILE STATUS              IS  状態キー
000944                             LOCK        MODE         IS  AUTOMATIC.
000980     SELECT  保険者マスタ    ASSIGN      TO        HOKENSL
000981                             ORGANIZATION             IS  INDEXED
000982                             ACCESS MODE              IS  DYNAMIC
000983                             RECORD KEY               IS  保－保険種別
000984                                                          保－保険者番号
000985                             ALTERNATE RECORD KEY     IS  保－保険種別
000986                                                          保－保険者名称
000987                                                          保－保険者番号
000988                             FILE STATUS              IS  状態キー
000989                             LOCK        MODE         IS  AUTOMATIC.
000990     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000991                             ORGANIZATION             IS  INDEXED
000992                             ACCESS MODE              IS  DYNAMIC
000993                             RECORD KEY               IS  市－公費種別
000994                                                          市－市町村番号
000995                             ALTERNATE RECORD KEY     IS  市－公費種別
000996                                                          市－市町村名称
000997                                                          市－市町村番号
000998                             FILE STATUS              IS  状態キー
000999                             LOCK        MODE         IS  AUTOMATIC.
001000     SELECT  施術所情報マスタ ASSIGN      TO        SEJOHOL
001001                             ORGANIZATION             IS  INDEXED
001002                             ACCESS MODE              IS  DYNAMIC
001010                             RECORD KEY               IS 施情－施術所番号
001020                             FILE STATUS              IS  状態キー
001030                             LOCK        MODE         IS  AUTOMATIC.
001040     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
001050                             ORGANIZATION             IS  INDEXED
001060                             ACCESS MODE              IS  DYNAMIC
001070                             RECORD KEY               IS  元－元号区分
001080                             FILE STATUS              IS  状態キー
001090                             LOCK        MODE         IS  AUTOMATIC.
001100     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W438.DAT"
001110                             ORGANIZATION             IS  INDEXED
001120                             ACCESS                   IS  DYNAMIC
001130                             RECORD      KEY          IS  作１－印刷順序
001140                                                          作１－保険者番号
001150                                                          作１－保険種別
001160                                                          作１－患者コード
001170                                                          作１－施術和暦年月
001180                             FILE        STATUS       IS  状態キー
001190                             LOCK        MODE         IS  AUTOMATIC.
001200     SELECT  印刷ファイル    ASSIGN      TO         GS-PRTF001
001210                             SYMBOLIC    DESTINATION  IS "PRT"
001220                             FORMAT                   IS  定義体名Ｐ
001230                             GROUP                    IS  項目群名Ｐ
001240                             PROCESSING  MODE         IS  処理種別Ｐ
001250                             UNIT        CONTROL      IS  拡張制御Ｐ
001260                             FILE        STATUS       IS  通知情報Ｐ.
001270     SELECT  印刷ファイル２  ASSIGN      TO         GS-PRTF001
001280                             SYMBOLIC    DESTINATION  IS "PRT"
001290                             FORMAT                   IS  定義体名Ｐ
001300                             GROUP                    IS  項目群名Ｐ
001310                             PROCESSING  MODE         IS  処理種別Ｐ
001320                             UNIT        CONTROL      IS  拡張制御Ｐ
001330                             FILE        STATUS       IS  通知情報Ｐ.
001340******************************************************************
001350*                      DATA DIVISION                             *
001360******************************************************************
001370 DATA                    DIVISION.
001380 FILE                    SECTION.
001540*                           ［ＲＬ＝  ２５６］
001541 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001542     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001543*                           ［ＲＬ＝  ３２０］
001544 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001545     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001549*
001550 FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
001551     COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001570*                           ［ＲＬ＝  ３２０］
001571 FD  保険者マスタ        BLOCK   CONTAINS   1   RECORDS.
001572     COPY HOKENS          OF  XFDLIB  JOINING   保   AS  PREFIX.
001573*                           ［ＲＬ＝  ２５６］
001574 FD  市町村マスタ        BLOCK   CONTAINS   1   RECORDS.
001575     COPY SITYOSN         OF  XFDLIB  JOINING   市   AS  PREFIX.
001576*                           ［ＲＬ＝  １２８］
001580 FD  施術所情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001590     COPY SEJOHO          OF  XFDLIB  JOINING   施情   AS  PREFIX.
001600*                           ［ＲＬ＝  １２８］
001610 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001620     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001630* 
001640 FD  作業ファイル１ RECORD  CONTAINS 200 CHARACTERS.
001650 01  作１－レコード.
001660     03  作１－レコードキー.
001670         05  作１－印刷順序                  PIC 9(2).
001680         05  作１－保険者番号                PIC X(10).
001690         05  作１－保険種別                  PIC 9(2).
001700         05  作１－患者コード.
001710             07 作１－患者番号               PIC 9(6).
001720             07 作１－枝番                   PIC X(1).
001730         05  作１－施術和暦年月.
001740             07  作１－施術和暦              PIC 9.
001750             07  作１－施術年                PIC 9(2).
001760             07  作１－施術月                PIC 9(2).
001770     03  作１－レコードデータ.
001780         05  作１－費用額                    PIC 9(7).
001790         05  作１－負担額                    PIC 9(7).
001800         05  作１－請求額                    PIC 9(7).
001810*
001820 FD  印刷ファイル.
001830     COPY YJK4371P         OF  XMDLIB.
001840*
001850 FD  印刷ファイル２.
001860     COPY YJK4362P         OF  XMDLIB JOINING ７号 AS  PREFIX.
001870*----------------------------------------------------------------*
001880******************************************************************
001890*                WORKING-STORAGE SECTION                         *
001900******************************************************************
001910 WORKING-STORAGE         SECTION.
001920 01 キー入力                           PIC X     VALUE SPACE.
001930 01 状態キー                           PIC X(2)  VALUE SPACE.
001940 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001950 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001960 01 作成フラグ                         PIC X(3)  VALUE SPACE.
001970 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
001980 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
001990*
002000 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
002010 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
002020 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002030 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
002040 01 請求和暦年月ＷＲ.
002050    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
002060    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
002070    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
002080*
002090 01 請求年月Ｗ.
002100    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002110    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
002120    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
002130 01 施術年月Ｗ.
002140    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002150    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
002160    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
002170 01 集計作業用Ｗ.
002180    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
002190    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
002200    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
002210    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
002220    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
002230    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
002240 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
002250 01 ファイル名                         PIC N(2)  VALUE SPACE.
002260 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002270 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
002280 01 保険者番号２Ｗ                     PIC X(10) VALUE SPACE.
002290 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
002300*
002310* 本人/家族集計用
002320 01 本人家族集計用Ｗ.
002330    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
002340    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
002350    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
002360    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
002370    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
002380    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
002390    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
002400    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
002410*
002420* 県内県外用
002430 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
002440 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
002450 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
002460 01 県内県外チェック                   PIC 9     VALUE ZERO.
002470 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
002480 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
002490 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
002500 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
002510*
002520* エラーメッセージ用
002530 01 エラーメッセージＷ.
002540    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002550    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002560    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002570    03 FILLER                          PIC X(10) VALUE SPACE.
002580* 順序用
002590 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
002600 01 印刷順序Ｗ                         PIC 9(2)  VALUE ZERO.
002610*
002620** 助成レセまとめ用
002630 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
002640*
002650* 例外用
002660 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
002670*
002680 01 後高代表番号Ｗ                     PIC X(10) VALUE SPACE.
002690 01 請求先名称Ｗ.
002700    05 請求先名称１Ｗ                  PIC X(20) VALUE SPACE.
002710    05 請求先名称２Ｗ                  PIC X(20) VALUE SPACE.
002720    05 請求先名称３Ｗ                  PIC X(20) VALUE SPACE.
002730 01 頁Ｗ                               PIC 9(2) VALUE ZERO.
002740 01 行カウンタ                         PIC 9(2) VALUE ZERO.
002750
002751 01 オープンフラグ                     PIC X(3)  VALUE SPACE.
002752 01 オープンフラグ２                   PIC X(3)  VALUE SPACE.
002753*
002760 01 合計Ｗ.
002770    03 国保件数合計Ｗ                  PIC 9(4) VALUE ZERO.
002780    03 国保費用額合計Ｗ                PIC 9(8) VALUE ZERO.
002790    03 退職件数合計Ｗ                  PIC 9(4) VALUE ZERO.
002800    03 退職費用額合計Ｗ                PIC 9(8) VALUE ZERO.
002810    03 老健件数合計Ｗ                  PIC 9(4) VALUE ZERO.
002820    03 老健費用額合計Ｗ                PIC 9(8) VALUE ZERO.
002830    03 後期件数合計Ｗ                  PIC 9(4) VALUE ZERO.
002840    03 後期費用額合計Ｗ                PIC 9(8) VALUE ZERO.
002850    03 保険者宛名Ｗ.
002860       05 保険者宛名１Ｗ               PIC X(40) VALUE SPACE.
002870       05 保険者宛名２Ｗ               PIC X(40) VALUE SPACE.
002880**************
002890* 施術所情報 *
002900**************
002910 01 施術所情報Ｗ.
002920    03 代表者名Ｗ                      PIC X(50)  VALUE SPACE.
002930    03 接骨院名Ｗ                      PIC X(50)  VALUE SPACE.
002940    03 柔整師番号Ｗ                    PIC X(20)  VALUE SPACE.
002950    03 施術所住所Ｗ.
002960       05 施術所住所１Ｗ               PIC X(40)  VALUE SPACE.
002970       05 施術所住所２Ｗ               PIC X(40)  VALUE SPACE.
002980    03 施術所郵便番号Ｗ.
002990       05 施術所郵便番号１Ｗ           PIC X(3)   VALUE SPACE.
003000       05 施術所郵便番号区切Ｗ         PIC X(1)   VALUE SPACE.
003010       05 施術所郵便番号２Ｗ           PIC X(4)   VALUE SPACE.
003020    03 施術所電話番号Ｗ                PIC X(15)  VALUE SPACE.
003030    03 取引先情報Ｗ.
003040        05 取引先銀行名Ｗ              PIC X(40)  VALUE SPACE.
003050        05 取引先銀行支店名Ｗ          PIC X(40)  VALUE SPACE.
003060        05 預金種別Ｗ                  PIC 9(1)   VALUE ZERO.
003070        05 銀行番号Ｗ                  PIC X(4)   VALUE SPACE.
003080        05 店番号Ｗ                    PIC X(3)   VALUE SPACE.
003090        05 口座番号Ｗ                  PIC X(10)  VALUE SPACE.
003100        05 口座名義人カナＷ            PIC X(40)  VALUE SPACE.
003110        05 口座名義人Ｗ                PIC X(40)  VALUE SPACE.
003120 01 銀行名支店名Ｗ                     PIC X(40)  VALUE SPACE.
003130 01 預金種別コメントＷ                 PIC N(2)   VALUE SPACE.
003140*
003150 01 印刷制御.
003160     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
003170     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
003180     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
003190     03 拡張制御Ｐ.
003200         05 端末制御Ｐ.
003210             07 移動方向Ｐ             PIC X(1) VALUE SPACE.
003220             07 移動行数Ｐ             PIC 9(3) VALUE ZERO.
003230         05 詳細制御Ｐ                 PIC X(2) VALUE SPACE.
003240     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
003250     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
003260******************************************************************
003270*                          連結項目                              *
003280******************************************************************
003290*
003300****************
003310* 画面入力情報 *
003320****************
003330**
003340 01 連入－画面情報ＹＪＫ４３０   IS EXTERNAL.
003350    03 連入－請求年月.
003360       05 連入－請求和暦               PIC 9.
003370       05 連入－請求年                 PIC 9(2).
003380       05 連入－請求月                 PIC 9(2).
003390    03 連入－提出年月日.
003400       05 連入－提出和暦               PIC 9.
003410       05 連入－提出年                 PIC 9(2).
003420       05 連入－提出月                 PIC 9(2).
003430       05 連入－提出日                 PIC 9(2).
003440    03 連入－レセプト種類              PIC X(4).
003450    03 連入－保険種別                  PIC 9(2).
003460    03 連入－印刷種類                  PIC 9.
003470    03 連入－本人家族                  PIC 9.
003480    03 連入－用紙種類                  PIC 9.
003490    03 連入－県内県外                  PIC 9.
003500    03 連入－県ＪＩＳ                  PIC X(2).
003510    03 連入－政管ＪＩＳ                PIC X(2).
003520*
003521 01 連入－画面情報ＹＪＫ４３０追加   IS EXTERNAL.
003522    03 連入－一括区分                  PIC 9.
003523    03 連入－プレビュー区分            PIC 9.
003524*
003525*
003530********************
003540* メッセージ表示キー *
003550********************
003560 01 連メ－キー IS EXTERNAL.
003570    03  連メ－メッセージ                 PIC N(20).
003580*
003920********************
003930* メッセージ表示キー *
003940********************
003950 01 連メ３－キー IS EXTERNAL.
003960    03  連メ３－メッセージ             PIC N(20).
003970    03  連メ３－メッセージ１           PIC X(20).
003980*
003990************************
004000* 助成レセまとめ
004010************************
004020 01 連レセまとめ－キー IS EXTERNAL.
004030    03 連レセまとめ－施術和暦年月.
004040       05 連レセまとめ－施術和暦               PIC 9.
004050       05 連レセまとめ－施術年月.
004060          07 連レセまとめ－施術年              PIC 9(2).
004070          07 連レセまとめ－施術月              PIC 9(2).
004080    03 連レセまとめ－患者コード.
004090       05 連レセまとめ－患者番号               PIC 9(6).
004100       05 連レセまとめ－枝番                   PIC X(1).
004110**-------------------------------------------------------**
004120*   1:助成レセプトなしの本体まとめの判定
004130*   2:横浜・川崎用の社保助成レセかの判定
004140    03 連レセまとめ－判定区分                  PIC 9.
004150**-------------------------------------------------------**
004160*  / OUT /　 0:対象外、1:対象
004170    03 連レセまとめ－判定結果                  PIC 9.
004180**
004195************************************
004196* プリンタファイル作成用           *
004197************************************
004198 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
004199     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
004200     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
004201     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
004202     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
004203*
004205 01 連保険者番号変換－キー IS EXTERNAL.
004206    03 連保険者番号変換－施術和暦年月.
004207       05 連保険者番号変換－施術和暦               PIC 9.
004208       05 連保険者番号変換－施術年月.
004209          07 連保険者番号変換－施術年              PIC 9(2).
004210          07 連保険者番号変換－施術月              PIC 9(2).
004211    03 連保険者番号変換－保険種別                  PIC 9(2).
004212    03 連保険者番号変換－元保険者番号              PIC X(10).
004213* 0:通常（施術年月関係なし）
004214    03 連保険者番号変換－呼出区分                  PIC 9(2).
004215*  / OUT /
004216    03 連保険者番号変換－後保険者番号              PIC X(10).
004217*
004218******************************************************************
004219*                      PROCEDURE  DIVISION                       *
004220******************************************************************
004221 PROCEDURE               DIVISION.
004230************
004240*           *
004250* 初期処理   *
004260*           *
004270************
004280     PERFORM プリンタファイル作成.
004281     PERFORM プリンタファイル作成２.
004282     PERFORM ファイルオープン.
004290     PERFORM 連結項目待避.
004300     PERFORM 制御情報取得.
004310************
004320*           *
004330* 主処理     *
004340*           *
004350************
004360     PERFORM 作業ファイル作成.
004370     PERFORM ６号印刷処理.
004380     PERFORM ７号印刷処理.
004390************
004400*           *
004410* 終了処理   *
004420*           *
004430************
004440     PERFORM 終了処理.
004450     MOVE ZERO TO PROGRAM-STATUS.
004460     EXIT PROGRAM.
004470*
004480*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004490*================================================================*
004491 プリンタファイル作成 SECTION.
004492*================================================================*
004493*   / 初期化 /
004494     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
004495     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
004496*
004497*
004498*--↓↓ 変更箇所 ↓↓--------------------------------------*
004499*   使用するプリンタファイル名セット
004500     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
004501*
004502*   使用する帳票プログラム名セット
004503     MOVE "YJK4371P"              TO Ｈ連ＰＲＴＦ－帳票プログラム名.
004504*
004505*--↑↑-----------------------------------------------------*
004506*
004507*   / プレビュー区分セット /
004508     MOVE 連入－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
004509*
004510     CALL   "CRTPRTF".
004511     CANCEL "CRTPRTF".
004512*
004513*================================================================*
004514 プリンタファイル作成２ SECTION.
004515*================================================================*
004516*   / 初期化 /
004517     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
004518     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
004519*
004520*
004521*--↓↓ 変更箇所 ↓↓--------------------------------------*
004522*   使用するプリンタファイル名セット
004523     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
004524*
004525*   使用する帳票プログラム名セット
004526     MOVE "YJK4362"             TO Ｈ連ＰＲＴＦ－帳票プログラム名.
004527*
004528*--↑↑-----------------------------------------------------*
004529*
004530*   / プレビュー区分セット /
004531     MOVE 連入－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
004532*
004533     CALL   "CRTPRTF".
004534     CANCEL "CRTPRTF".
004535*
004536*================================================================*
004537 連結項目待避 SECTION.
004538*
004539* 連結項目の待避
004540     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
004541     MOVE 連入－請求年        TO 請求年ＷＲ.
004550     MOVE 連入－請求月        TO 請求月ＷＲ.
004560     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
004570     MOVE 連入－保険種別      TO 保険種別ＷＲ.
004580     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
004590     MOVE 連入－県内県外      TO 県内県外ＷＲ.
004600     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
004610     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
004620*
004630*================================================================*
004640 ファイルオープン SECTION.
004650*
004660     OPEN INPUT 制御情報マスタ.
004670         MOVE NC"制御情報" TO ファイル名.
004680         PERFORM オープンチェック.
004690     OPEN INPUT 受診者情報Ｆ.
004700         MOVE NC"受診者情報Ｆ" TO ファイル名.
004710         PERFORM オープンチェック.
004840     OPEN INPUT レセプトＦ.
004841         MOVE NC"レセプトＦ" TO ファイル名.
004842         PERFORM オープンチェック.
004843     OPEN INPUT 保険者マスタ
004844         MOVE NC"保険" TO ファイル名.
004845         PERFORM オープンチェック.
004846     OPEN INPUT 市町村マスタ
004847         MOVE NC"市町" TO ファイル名.
004848         PERFORM オープンチェック.
004849     OPEN INPUT 施術所情報マスタ
004850         MOVE NC"施情" TO ファイル名.
004860         PERFORM オープンチェック.
004870     OPEN INPUT 元号マスタ.
004880         MOVE NC"元号" TO ファイル名.
004890         PERFORM オープンチェック.
004903     PERFORM 施術所情報取得.
004910*================================================================*
004920 オープンチェック SECTION.
004930*
004940     IF 状態キー  NOT =  "00"
004950         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004960         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004970         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004980                                                 UPON CONS
004990         ACCEPT  キー入力 FROM CONS
005000         PERFORM ファイル閉鎖
005010         MOVE 99 TO PROGRAM-STATUS
005020         EXIT PROGRAM.
005030*================================================================*
005040 制御情報取得 SECTION.
005050*
005060     MOVE ZEROS TO 制－制御区分.
005070     READ 制御情報マスタ
005080     NOT INVALID KEY
005090         MOVE 制－協会コード   TO 協会コードＷ
005100     END-READ.
005110*
005120*================================================================*
005130 エラー表示 SECTION.
005140*
005150     DISPLAY NC"状態キー" 状態キー  UPON CONS.
005160     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
005170     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005180     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
005190     ACCEPT  キー入力 FROM CONS.
005200     PERFORM ファイル閉鎖.
005210     MOVE 99 TO PROGRAM-STATUS.
005220     EXIT PROGRAM.
005230*================================================================*
005240 受診者情報Ｆ読込 SECTION.
005250*
005260     READ 受診者情報Ｆ NEXT
005270     AT END
005280         MOVE "YES" TO 終了フラグ
005290     END-READ.
005300*================================================================*
005310 レセプトＦ読込 SECTION.
005320*
005330     READ レセプトＦ NEXT
005340     AT END
005350         MOVE "YES" TO 終了フラグ
005360     END-READ.
005370*
005380*================================================================*
005790 データチェック SECTION.
005791*
005792     MOVE SPACE          TO 実行キーＷ.
005793     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005794        MOVE "YES"  TO 実行キーＷ
005795     END-IF.
005796* *****************************************************************
005797* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
005798* *****************************************************************
005799     IF 実行キーＷ  = "YES"
005800*      (再度、実行キーＷ SPACE)
005801        MOVE SPACE  TO 実行キーＷ
005802        IF レセ－請求対象区分 NOT = ZERO
005803           MOVE レセ－施術和暦  TO 受－施術和暦
005804           MOVE レセ－施術年    TO 受－施術年
005805           MOVE レセ－施術月    TO 受－施術月
005806           MOVE レセ－患者番号  TO 受－患者番号
005807           MOVE レセ－枝番      TO 受－枝番
005808           READ 受診者情報Ｆ
005809           NOT INVALID KEY
005810              MOVE "YES"  TO 実行キーＷ
005811*
005812*/協会健保の対応、旧保険者番号でも新保険者番号とまとめて請求する/081016
005813              INITIALIZE 連保険者番号変換－キー
005814              MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
005815              MOVE  受－保険種別      TO 連保険者番号変換－保険種別
005816              MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
005817              MOVE  ZERO              TO 連保険者番号変換－呼出区分
005818              CALL   "CHGHOKNO"
005819              CANCEL "CHGHOKNO"
005820*   / 置換え /
005821              MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号
005822*
005823           END-READ
005824        ELSE
005825           MOVE SPACE  TO 実行キーＷ
005826        END-IF
005827     END-IF.
005828*
006670*================================================================*
006671 健保料金計算 SECTION.
006672*
006673     MOVE レセ－合計         TO 作１－費用額.
006674     MOVE レセ－一部負担金   TO 作１－負担額.
006675     MOVE レセ－請求金額     TO 作１－請求額.
006676*
006677* 特別
006678*     PERFORM 助成レセ判定.
006679*     IF 助成レセまとめフラグ = "YES"
006680*         MOVE レセ－受給者負担額  TO 作１－負担額
006681*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
006682*     END-IF.
006683*
006684*================================================================*
006685 老人料金計算 SECTION.
006686*
006687     MOVE レセ－合計        TO 作１－費用額.
006688     MOVE レセ－一部負担金  TO 作１－負担額.
006689     MOVE レセ－請求金額    TO 作１－請求額.
006690*
006691* 特別
006692*     PERFORM 助成レセ判定.
006693*     IF 助成レセまとめフラグ = "YES"
006694*         MOVE レセ－受給者負担額  TO 作１－負担額
006695*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
006696*     END-IF.
006697*
006698*================================================================*
006699 助成料金計算 SECTION.
006700*
006701     MOVE レセ－合計         TO 作１－費用額.
006702     MOVE レセ－受給者負担額 TO 作１－負担額.
006703     MOVE レセ－助成請求金額 TO 作１－請求額.
006704*
006705* 特別
006706*     PERFORM 助成レセ判定.
006707*     IF 助成レセまとめフラグ = "YES"
006708*   / 書き込まないように請求額ゼロにする /
006709*        MOVE ZERO TO 作１－請求額
006710*     END-IF.
006711*
006712*================================================================*
006713 ファイル書込 SECTION.
006714*
006715     WRITE 作１－レコード
006716     INVALID KEY
006720         MOVE NC"作業"  TO ファイル名
006730         PERFORM エラー表示
006740     END-WRITE.
006750*================================================================*
006760 作業ファイル１読込 SECTION.
006770*
006780     READ 作業ファイル１ NEXT
006790     AT END
006800         MOVE "YES" TO 終了フラグ
006810     END-READ.
006820*================================================================*
006830 ファイル閉鎖 SECTION.
006840*
006850     IF ( オープンフラグ = "YES" )
006851         CLOSE 印刷ファイル
006852     END-IF.
006853     IF ( オープンフラグ２ = "YES" )
006854         CLOSE 印刷ファイル２
006855     END-IF.
006856     CLOSE 制御情報マスタ 受診者情報Ｆ 保険者マスタ 市町村マスタ
006860           施術所情報マスタ 元号マスタ.
006870*================================================================*
006880 終了処理 SECTION.
006890*
006900     PERFORM ファイル閉鎖.
006910*================================================================*
006920 県内県外取得 SECTION.
006930*
006940      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
006950      EVALUATE  保険種別県用ＷＫ
006960* 国保
006970      WHEN  01
006980         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
006990            MOVE  1  TO  県内県外チェック
007000         END-IF
007010         MOVE 受－保険者番号(1:2) TO 県ＷＫ
007020* 社保
007030      WHEN  02
007040         IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
007050            MOVE  1  TO  県内県外チェック
007060         END-IF
007070         MOVE 受－保険者番号(1:2) TO 県ＷＫ
007080         PERFORM 県統一
007090         MOVE 県統一ＷＫ TO 県ＷＫ
007100* 船員
007110* 日雇
007120* 組合
007130* 共済
007140* 自衛官
007150* 退職国保
007160      WHEN  06
007170      WHEN  07
007180      WHEN  08
007190      WHEN  09
007200      WHEN  04
007210      WHEN  03
007220         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
007230            MOVE  1  TO  県内県外チェック
007240         END-IF
007250         MOVE 受－保険者番号(3:2) TO 県ＷＫ
007260* 助成
007270      WHEN 50 THRU 60
007280         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
007290            MOVE  1  TO  県内県外チェック
007300         END-IF
007310         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
007320* 老人
007330      WHEN  05
007340         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
007350            MOVE  1  TO  県内県外チェック
007360         END-IF
007370         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
007380* 労災、自賠責・自費・生保単独は除外
007390      WHEN  70
007400      WHEN  80
007410      WHEN  90
007420      WHEN  ZERO
007430         CONTINUE
007440*
007450     WHEN OTHER
007460         MOVE SPACE                TO エラーメッセージＷ
007470         MOVE 受－患者コード       TO エラー患者コードＷ
007480         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
007490         MOVE "-"                  TO エラー区切りＷ
007500         MOVE  NC"県内県外取得エラー。患者番号" TO 連メ３－メッセージ
007510         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
007520         CALL   "MSG003"
007530         CANCEL "MSG003"
007540     END-EVALUATE.
007550*
007560*================================================================*
007570 県統一 SECTION.
007580*
007590     MOVE ZERO  TO  県統一ＷＫ.
007600     EVALUATE  県ＷＫ
007610*北海道
007620      WHEN  01
007630         MOVE 01 TO 県統一ＷＫ
007640*青森
007650      WHEN  02
007660         MOVE 02 TO 県統一ＷＫ
007670*岩手
007680      WHEN  03
007690         MOVE 03 TO 県統一ＷＫ
007700*宮城
007710      WHEN  04
007720         MOVE 04 TO 県統一ＷＫ
007730*秋田
007740      WHEN  05
007750         MOVE 05 TO 県統一ＷＫ
007760*山形
007770      WHEN  06
007780         MOVE 06 TO 県統一ＷＫ
007790*福島
007800      WHEN  07
007810         MOVE 07 TO 県統一ＷＫ
007820*茨城
007830      WHEN  08
007840         MOVE 08 TO 県統一ＷＫ
007850*栃木
007860      WHEN  09
007870         MOVE 09 TO 県統一ＷＫ
007880*群馬
007890      WHEN  10
007900         MOVE 10 TO 県統一ＷＫ
007910*埼玉
007920      WHEN  11
007930         MOVE 11 TO 県統一ＷＫ
007940*千葉
007950      WHEN  12
007960         MOVE 12 TO 県統一ＷＫ
007970*東京
007980      WHEN  21
007990         MOVE 13 TO 県統一ＷＫ
008000*神奈川
008010      WHEN  31
008020         MOVE 14 TO 県統一ＷＫ
008030*新潟
008040      WHEN  32
008050         MOVE 15 TO 県統一ＷＫ
008060*富山
008070      WHEN  33
008080         MOVE 16 TO 県統一ＷＫ
008090*石川
008100      WHEN  34
008110         MOVE 17 TO 県統一ＷＫ
008120*福井
008130      WHEN  35
008140         MOVE 18 TO 県統一ＷＫ
008150*山梨
008160      WHEN  36
008170         MOVE 19 TO 県統一ＷＫ
008180*長野
008190      WHEN  37
008200         MOVE 20 TO 県統一ＷＫ
008210*岐阜
008220      WHEN  38
008230         MOVE 21 TO 県統一ＷＫ
008240*静岡
008250      WHEN  39
008260         MOVE 22 TO 県統一ＷＫ
008270*愛知
008280      WHEN  51
008290         MOVE 23 TO 県統一ＷＫ
008300*三重
008310      WHEN  52
008320         MOVE 24 TO 県統一ＷＫ
008330*滋賀
008340      WHEN  53
008350         MOVE 25 TO 県統一ＷＫ
008360*京都
008370      WHEN  54
008380         MOVE 26 TO 県統一ＷＫ
008390*大阪
008400      WHEN  41
008410         MOVE 27 TO 県統一ＷＫ
008420*兵庫
008430      WHEN  42
008440         MOVE 28 TO 県統一ＷＫ
008450*奈良
008460      WHEN  55
008470         MOVE 29 TO 県統一ＷＫ
008480*和歌山
008490      WHEN  56
008500         MOVE 30 TO 県統一ＷＫ
008510*鳥取
008520      WHEN  57
008530         MOVE 31 TO 県統一ＷＫ
008540*島根
008550      WHEN  58
008560         MOVE 32 TO 県統一ＷＫ
008570*岡山
008580      WHEN  59
008590         MOVE 33 TO 県統一ＷＫ
008600*広島
008610      WHEN  60
008620         MOVE 34 TO 県統一ＷＫ
008630*山口
008640      WHEN  61
008650         MOVE 35 TO 県統一ＷＫ
008660*徳島
008670      WHEN  71
008680         MOVE 36 TO 県統一ＷＫ
008690*香川
008700      WHEN  72
008710         MOVE 37 TO 県統一ＷＫ
008720*愛媛
008730      WHEN  73
008740         MOVE 38 TO 県統一ＷＫ
008750*高知
008760      WHEN  74
008770         MOVE 39 TO 県統一ＷＫ
008780*福岡
008790      WHEN  75
008800         MOVE 40 TO 県統一ＷＫ
008810*佐賀
008820      WHEN  76
008830         MOVE 41 TO 県統一ＷＫ
008840*長崎
008850      WHEN  77
008860         MOVE 42 TO 県統一ＷＫ
008870*熊本
008880      WHEN  78
008890         MOVE 43 TO 県統一ＷＫ
008900*大分
008910      WHEN  79
008920         MOVE 44 TO 県統一ＷＫ
008930*宮崎
008940      WHEN  80
008950         MOVE 45 TO 県統一ＷＫ
008960*鹿児島
008970      WHEN  81
008980         MOVE 46 TO 県統一ＷＫ
008990*沖縄
009000      WHEN  82
009010         MOVE 47 TO 県統一ＷＫ
009020*その他
009030      WHEN  OTHER
009040         CONTINUE
009050     END-EVALUATE.
009060*
009580*================================================================*
009581 助成レセ判定 SECTION.
009582* 特別処理（助成レセまとめ）
009583     MOVE SPACE TO 助成レセまとめフラグ.
009584*
009585     IF 受－助成種別 NOT = ZERO  
009586*/後期高齢を追加/111007
009587            IF ( 受－保険種別 = 01 OR 08 OR 05)
009588                PERFORM 助成レセまとめ判定
009589            END-IF
009590     END-IF.
009591*
009592*================================================================*
009593*================================================================*
009594 助成レセまとめ判定 SECTION.
009595* 特別処理（助成レセまとめ）
009596     MOVE SPACE TO 助成レセまとめフラグ.
009597*
009603     IF ( レセ－本体まとめ区分 = 1 )
009604           MOVE "YES" TO 助成レセまとめフラグ
009605     END-IF.
009606*
009607*================================================================*
009608*================================================================*
009609 例外処理  SECTION.
009610*
009620* 印刷対象の例外の定義
009630*
009640* ①中部柔整 27 → 社保(02,06,07)、組合(03)、共済(04,09)、
009650*                　国保(中央建設133264,全国土木133033) は返戻分を除く
009660*
009670*      IF 協会コードＷ = 27
009680*          IF ( 受－請求区分 = 2 ) AND ( 受－公費種別  = ZERO  )
009690*             IF  ( 受－保険種別  = 02 OR 03 OR 04 OR 06 OR 07 OR 09 ) OR
009700*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133264")) OR
009710*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133033")) 
009720*                  MOVE SPACE  TO  作成フラグ
009730*             END-IF
009740*          END-IF
009750*      END-IF.
009760
009770* 生活保護は除く
009780     IF 受－助成種別 = 50
009790         MOVE SPACE  TO  作成フラグ
009800     END-IF.
009810
009820*
009830*================================================================*
009840*================================================================*
009850 後高代表番号セット SECTION.
009860*
009870     EVALUATE 後高代表番号Ｗ(3:2)
009880     WHEN "01"
009890         MOVE "39010004" TO 後高代表番号Ｗ
009900     WHEN "02"
009910         MOVE "39020003" TO 後高代表番号Ｗ
009920     WHEN "03"
009930         MOVE "39030002" TO 後高代表番号Ｗ
009940     WHEN "04"
009950         MOVE "39040001" TO 後高代表番号Ｗ
009960     WHEN "05"
009970         MOVE "39050000" TO 後高代表番号Ｗ
009980     WHEN "06"
009990         MOVE "39060009" TO 後高代表番号Ｗ
010000     WHEN "07"
010010         MOVE "39070008" TO 後高代表番号Ｗ
010020     WHEN "08"
010030         MOVE "39080007" TO 後高代表番号Ｗ
010040     WHEN "09"
010050         MOVE "39090006" TO 後高代表番号Ｗ
010060     WHEN "10"
010070         MOVE "39100003" TO 後高代表番号Ｗ
010080     WHEN "11"
010090         MOVE "39110002" TO 後高代表番号Ｗ
010100     WHEN "12"
010110         MOVE "39120001" TO 後高代表番号Ｗ
010120     WHEN "13"
010130         MOVE "39130000" TO 後高代表番号Ｗ
010140     WHEN "14"
010150         MOVE "39140009" TO 後高代表番号Ｗ
010160     WHEN "15"
010170         MOVE "39150008" TO 後高代表番号Ｗ
010180     WHEN "16"
010190         MOVE "39160007" TO 後高代表番号Ｗ
010200     WHEN "17"
010210         MOVE "39170006" TO 後高代表番号Ｗ
010220     WHEN "18"
010230         MOVE "39180005" TO 後高代表番号Ｗ
010240     WHEN "19"
010250         MOVE "39190004" TO 後高代表番号Ｗ
010260     WHEN "20"
010270         MOVE "39200001" TO 後高代表番号Ｗ
010280     WHEN "21"
010290         MOVE "39210000" TO 後高代表番号Ｗ
010300     WHEN "22"
010310         MOVE "39220009" TO 後高代表番号Ｗ
010320     WHEN "23"
010330         MOVE "39230008" TO 後高代表番号Ｗ
010340     WHEN "24"
010350         MOVE "39240007" TO 後高代表番号Ｗ
010360     WHEN "25"
010370         MOVE "39250006" TO 後高代表番号Ｗ
010380     WHEN "26"
010390         MOVE "39260008" TO 後高代表番号Ｗ
010400     WHEN "27"
010410         MOVE "39270004" TO 後高代表番号Ｗ
010420     WHEN "28"
010430         MOVE "39280003" TO 後高代表番号Ｗ
010440     WHEN "29"
010450         MOVE "39290002" TO 後高代表番号Ｗ
010460     WHEN "30"
010470         MOVE "39300009" TO 後高代表番号Ｗ
010480     WHEN "31"
010490         MOVE "39310008" TO 後高代表番号Ｗ
010500     WHEN "32"
010510         MOVE "39320007" TO 後高代表番号Ｗ
010520     WHEN "33"
010530         MOVE "39330006" TO 後高代表番号Ｗ
010540     WHEN "34"
010550         MOVE "39340005" TO 後高代表番号Ｗ
010560     WHEN "35"
010570         MOVE "39350004" TO 後高代表番号Ｗ
010580     WHEN "36"
010590         MOVE "39360003" TO 後高代表番号Ｗ
010600     WHEN "37"
010610         MOVE "39370002" TO 後高代表番号Ｗ
010620     WHEN "38"
010630         MOVE "39380001" TO 後高代表番号Ｗ
010640     WHEN "39"
010650         MOVE "39390000" TO 後高代表番号Ｗ
010660     WHEN "40"
010670         MOVE "39400007" TO 後高代表番号Ｗ
010680     WHEN "41"
010690         MOVE "39410006" TO 後高代表番号Ｗ
010700     WHEN "42"
010710         MOVE "39420005" TO 後高代表番号Ｗ
010720     WHEN "43"
010730         MOVE "39430004" TO 後高代表番号Ｗ
010740     WHEN "44"
010750         MOVE "39440003" TO 後高代表番号Ｗ
010760     WHEN "45"
010770         MOVE "39450002" TO 後高代表番号Ｗ
010780     WHEN "46"
010790         MOVE "39460001" TO 後高代表番号Ｗ
010800     WHEN "47"
010810         MOVE "39470000" TO 後高代表番号Ｗ
010820     END-EVALUATE.
010830*================================================================*
010840*================================================================*
010850 作業ファイル作成 SECTION.
010860*
010870     OPEN OUTPUT 作業ファイル１.
010880         MOVE NC"作業" TO ファイル名.
010890         PERFORM オープンチェック.
010900**********************************
010910* 国保・退職・老人
010920**********************************
010930     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
010931     MOVE 請求年ＷＲ    TO レセ－請求年.  
010932     MOVE 請求月ＷＲ    TO レセ－請求月.  
010933     MOVE 1             TO レセ－レセ種別.
010934     MOVE SPACE         TO レセ－請求保険者番号.
010935     MOVE ZERO          TO レセ－患者番号.
010936     MOVE SPACE         TO レセ－枝番.    
010937     START レセプトＦ   KEY IS >= レセ－請求和暦年月
010938                                  レセ－レセ種別
010939                                  レセ－請求保険者番号
010940                                  レセ－患者コード
010941     END-START.
010942     IF 状態キー = "00"
010943         MOVE SPACE  TO 終了フラグ
010944         PERFORM レセプトＦ読込
010945         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
010946                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
010947                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
010948                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
      */助成を除く/140402
                             ( レセ－レセ種別 NOT = 1 AND 2)
010958             PERFORM データチェック
010968             IF 実行キーＷ = "YES"
010978                 IF (受－保険種別 = 01      ) AND (受－保険者番号(1:2)     = "13") OR
011130                    (受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2)     = "13") OR
011140                    (受－公費種別 = 05      ) AND (受－費用負担者番号(3:2) = "13")
011170                     PERFORM 健保料金計算
011180                     PERFORM レコードセット
011190                     PERFORM ファイル書込
011200                 END-IF
011210             END-IF
011220             PERFORM レセプトＦ読込
011230         END-PERFORM
011240     END-IF.
011250     CLOSE 作業ファイル１.
011260*================================================================*
011270 レコードセット SECTION.
011280*
011290     MOVE SPACE TO 作１－レコード
011300     INITIALIZE 作１－レコード
011310     PERFORM 印刷順序セット.
011320     MOVE 印刷順序Ｗ   TO 作１－印刷順序.
011330     IF 受－公費種別 = 05
011340         MOVE 受－公費種別 TO 作１－保険種別
011350     ELSE
011360         MOVE 受－保険種別 TO 作１－保険種別
011370     END-IF
011380     EVALUATE TRUE
011390     WHEN 受－保険種別 = 01
011400         MOVE 受－保険者番号      TO 作１－保険者番号
011410     WHEN 受－保険種別 = 08
011420         MOVE 受－保険者番号(3:8) TO 作１－保険者番号
011430     WHEN 受－保険種別 = 05
011440         MOVE 受－保険者番号      TO 後高代表番号Ｗ
011450         PERFORM 後高代表番号セット
011460         MOVE 後高代表番号Ｗ      TO 作１－保険者番号
011470     WHEN 受－公費種別 = 05
011480         PERFORM 市町村情報取得
011490         MOVE 市－保険者番号      TO 作１－保険者番号
011500     END-EVALUATE.
011510     MOVE 受－患者コード          TO 作１－患者コード.
011520     MOVE 受－施術和暦年月        TO 作１－施術和暦年月.
011530     IF 受－公費種別 = 05
011540*         MOVE 連計－費用額老人    TO 作１－費用額
011550*         MOVE 連計－負担額老人    TO 作１－負担額
011560*         MOVE 連計－請求額老人    TO 作１－請求額
011570         MOVE レセ－合計          TO 作１－費用額
011571         MOVE レセ－一部負担金    TO 作１－負担額
011572         MOVE レセ－請求金額      TO 作１－請求額
011573     ELSE
011580*         MOVE 連計－費用額        TO 作１－費用額
011590*         MOVE 連計－負担額        TO 作１－負担額
011600*         MOVE 連計－請求額        TO 作１－請求額
011610         MOVE レセ－合計          TO 作１－費用額
011611         MOVE レセ－一部負担金    TO 作１－負担額
011612         MOVE レセ－請求金額      TO 作１－請求額
011613     END-IF.
011620*================================================================*
011630 印刷順序セット SECTION.
011640*
011650**///  印刷順序の変更はこのSECTIONで   ////**
011660*
011670*************************************************************************
011680*  印刷順序:保険名称(保険種別コード)                                    *
011690*  10：市町村国保、退職、老人                                           *
011700*  20：国保組合                                                         *
011710*  30：後期高齢                                                         *
011720**************************************************************************
011730     EVALUATE TRUE
011740     WHEN (受－保険種別 = 01) AND (受－保険者番号(3:1) = "3")
011750         MOVE 20 TO 印刷順序Ｗ
011760     WHEN (受－保険種別 = 05) AND (受－保険者番号(1:2) = "39")
011770         MOVE 30 TO 印刷順序Ｗ
011780     WHEN (受－保険種別 = 01 OR 08) OR (受－公費種別 = 05)
011790         MOVE 10 TO 印刷順序Ｗ
011800     END-EVALUATE.
011810*
011820*================================================================*
011830 市町村情報取得 SECTION.
011840*
011850     MOVE 受－公費種別       TO 市－公費種別.
011860     MOVE 受－費用負担者番号 TO 市－市町村番号.
011870     READ 市町村マスタ
011880     INVALID KEY
011890         MOVE SPACE TO 市－レコード
011900     END-READ.
011910*================================================================*
011920*================================================================*
011930 ６号印刷処理 SECTION.
011940*
011950     OPEN INPUT 作業ファイル１.
011960         MOVE NC"作業" TO ファイル名.
011970         PERFORM オープンチェック.
012000     MOVE SPACE TO YJK4371P.
012010     INITIALIZE    YJK4371P.
012020
012030     MOVE 1     TO 頁Ｗ.
012040*
012050     MOVE 1     TO 行カウンタ.
012060     MOVE SPACE TO 保険者番号Ｗ.
012070     MOVE SPACE TO 終了フラグ.
012080     PERFORM 作業ファイル読込
012090     IF  終了フラグ = "YES"
012100         MOVE  NC"　該当データなしです。確認して下さい。" TO 連メ－メッセージ
012110         CALL   "MSG001"
012120         CANCEL "MSG001"
012130         PERFORM ファイル閉鎖
012140         MOVE 99 TO PROGRAM-STATUS
012150         EXIT PROGRAM
012160     END-IF.
012170     MOVE 作１－保険者番号 TO 保険者番号Ｗ.
012180     PERFORM UNTIL 終了フラグ = "YES"
012190         PERFORM 明細行セット
012200         PERFORM 作業ファイル読込
012210         IF 作１－保険者番号 NOT = 保険者番号Ｗ
012220             MOVE 作１－保険者番号 TO 保険者番号Ｗ
012230             ADD 1 TO 行カウンタ
012240         END-IF
012250         IF 行カウンタ > 12
012260             PERFORM ヘッダセット
012270             PERFORM 印字処理
012280             PERFORM 改頁処理
012290             COMPUTE 頁Ｗ = 頁Ｗ + 1
012300             MOVE 1 TO 行カウンタ
012310             MOVE SPACE TO YJK4371P
012320             INITIALIZE    YJK4371P
012330         END-IF
012340     END-PERFORM.
012350     PERFORM ヘッダセット.
012360     MOVE 国保件数合計Ｗ   TO 国保件数合計.
012370     MOVE 国保費用額合計Ｗ TO 国保費用額合計.
012380     MOVE 退職件数合計Ｗ   TO 退職件数合計.
012390     MOVE 退職費用額合計Ｗ TO 退職費用額合計.
012400     MOVE 老健件数合計Ｗ   TO 老健件数合計.
012410     MOVE 老健費用額合計Ｗ TO 老健費用額合計.
012420     MOVE 後期件数合計Ｗ   TO 後期件数合計.
012430     MOVE 後期費用額合計Ｗ TO 後期費用額合計.
012440*
012450     COMPUTE 計件数合計   = 国保件数合計Ｗ   + 退職件数合計Ｗ   +
012460                            老健件数合計Ｗ   + 後期件数合計Ｗ
012470     COMPUTE 計費用額合計 = 国保費用額合計Ｗ + 退職費用額合計Ｗ +
012480                            老健費用額合計Ｗ + 後期費用額合計Ｗ
012490     PERFORM 印字処理.
012500     PERFORM 改頁処理
012510     CLOSE 作業ファイル１.
012520     CLOSE 印刷ファイル.
012530*================================================================*
012540 明細行セット SECTION.
012550*
012560     IF 保険者名称１(行カウンタ) = SPACE
012570         IF (作１－保険種別 = 05) AND (作１－保険者番号(1:2) = "39")
012580             PERFORM 後期高齢情報取得
012590         ELSE
012600             PERFORM 保険者情報取得
012610         END-IF
012620         MOVE 請求先名称１Ｗ TO 保険者名称１(行カウンタ)
012630         MOVE 請求先名称２Ｗ TO 保険者名称２(行カウンタ)
012640     END-IF.
012650     EVALUATE 作１－保険種別
012660     WHEN 01
012670         ADD 1            TO 国保件数  (行カウンタ) 計件数    (行カウンタ)
012680                             国保件数合計Ｗ
012690         ADD 作１－費用額 TO 国保費用額(行カウンタ) 計費用額  (行カウンタ)
012700                             国保費用額合計Ｗ
012710     WHEN 08
012720         ADD 1            TO 退職件数  (行カウンタ) 計件数    (行カウンタ)
012730                             退職件数合計Ｗ
012740         ADD 作１－費用額 TO 退職費用額(行カウンタ) 計費用額  (行カウンタ)
012750                             退職費用額合計Ｗ
012760     WHEN 05
012770         IF 作１－保険者番号(1:2) = "39"
012780             ADD 1            TO 後期件数  (行カウンタ) 計件数    (行カウンタ)
012790                                 後期件数合計Ｗ
012800             ADD 作１－費用額 TO 後期費用額(行カウンタ) 計費用額  (行カウンタ)
012810                                 後期費用額合計Ｗ
012820         ELSE
012830             ADD 1            TO 老健件数  (行カウンタ) 計件数    (行カウンタ)
012840                                 老健件数合計Ｗ
012850             ADD 作１－費用額 TO 老健費用額(行カウンタ) 計費用額  (行カウンタ)
012860                                 老健費用額合計Ｗ
012870         END-IF
012880     END-EVALUATE.
012890*================================================================*
012900 保険者情報取得 SECTION.
012910*
012920     MOVE  SPACE             TO 請求先名称Ｗ.
012930*
012940     MOVE 01                 TO 保－保険種別.
012950     MOVE 作１－保険者番号   TO 保－保険者番号.
012960     READ 保険者マスタ
012970     NOT INVALID KEY
012980         MOVE 保－保険者名称 TO 請求先名称Ｗ
012990     END-READ.
013000*================================================================*
013010 後期高齢情報取得 SECTION.
013020*
013030     MOVE SPACE            TO 請求先名称Ｗ.
013040     MOVE 05               TO 市－公費種別.
013050     MOVE 作１－保険者番号 TO 市－市町村番号.
013060     START 市町村マスタ KEY IS >= 市－公費種別 市－市町村番号
013070     END-START.
013080     IF 状態キー = "00"
013090         READ 市町村マスタ NEXT
013100         AT END
013110             MOVE SPACE              TO 請求先名称Ｗ
013120         NOT AT END
013130             IF (市－公費種別        = 05 ) AND
013140                (市－市町村番号(1:4) = 作１－保険者番号(1:4))
013150                 MOVE 市－市町村名称 TO 請求先名称Ｗ
013160             END-IF
013170         END-READ
013180     END-IF.
013190*================================================================*
013200 ヘッダセット SECTION.
013210*
013220     MOVE 頁Ｗ               TO 頁.
013230* 当月の和暦を取得
013240     MOVE 請求和暦ＷＲ       TO 元－元号区分.
013250     READ 元号マスタ
013260     INVALID KEY
013270         MOVE SPACE          TO 請求和暦名称
013280     NOT INVALID KEY
013290         MOVE 元－元号名称   TO 請求和暦名称
013300     END-READ.
013310*
013320     MOVE 請求年ＷＲ         TO 請求年.
013330     MOVE 請求月ＷＲ         TO 請求月.
013340*
013350     MOVE 代表者名Ｗ         TO 代表者名.
013360     MOVE 接骨院名Ｗ         TO 接骨院名.
013370     MOVE 柔整師番号Ｗ(3:7)  TO 柔整師番号１.
013380     MOVE 柔整師番号Ｗ(11:1) TO 柔整師番号２.
013390     MOVE 柔整師番号Ｗ(13:1) TO 柔整師番号３.
013400     MOVE NC"東京都"         TO 都道府県名.
013410     MOVE NC"国民保険"       TO 保険種別名.
013420*================================================================*
013430 印字処理  SECTION.
013440*
013441     IF ( オープンフラグ NOT = "YES" )
013442        MOVE "YES" TO オープンフラグ
013443        OPEN I-O  印刷ファイル
013444        PERFORM エラー処理Ｐ
013445     END-IF.
013446*
013450     MOVE "YJK4371P" TO  定義体名Ｐ.
013460     MOVE SPACE      TO  処理種別Ｐ.
013470     MOVE "SCREEN"   TO  項目群名Ｐ.
013480     WRITE YJK4371P.
013490     PERFORM エラー処理Ｐ.
013500*================================================================*
013510 改頁処理  SECTION.
013520
013530     MOVE "YJK4371P" TO  定義体名Ｐ.
013540     MOVE "CT"       TO  処理種別Ｐ.
013550     MOVE "PAGE"     TO  拡張制御Ｐ.
013560     MOVE SPACE      TO  項目群名Ｐ.
013570     WRITE YJK4371P.
013580     PERFORM エラー処理Ｐ.
013590     MOVE SPACE     TO  拡張制御Ｐ.
013600*
013610*================================================================*
013620 作業ファイル読込 SECTION.
013630*
013640     READ 作業ファイル１ NEXT
013650     AT END
013660         MOVE "YES" TO 終了フラグ
013670     END-READ.
013680*================================================================*
013690 エラー処理Ｐ SECTION.
013700*
013710     IF 通知情報Ｐ NOT = "00"
013720         DISPLAY NC"帳票エラー"              UPON CONS
013730         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
013740         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
013750         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
013760         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS
013770         ACCEPT  キー入力 FROM CONS
013780         PERFORM ファイル閉鎖
013790         MOVE 99  TO PROGRAM-STATUS
013800         EXIT PROGRAM
013810     END-IF.
013820*================================================================*
013830 施術所情報取得 SECTION.
013840*
013850     MOVE ZERO  TO 施情－施術所番号.
013860     READ 施術所情報マスタ
013870     INVALID KEY
013880         CONTINUE
013890     NOT INVALID KEY
013900*
013910         MOVE 施情－郵便番号１       TO 施術所郵便番号１Ｗ
013920         MOVE "-"                    TO 施術所郵便番号区切Ｗ
013930         MOVE 施情－郵便番号２       TO 施術所郵便番号２Ｗ
013940         MOVE 施情－代表者名         TO 代表者名Ｗ
013950         MOVE 施情－接骨院名         TO 接骨院名Ｗ
013960         STRING 施情－住所１  DELIMITED BY SPACE
013970                施情－住所２  DELIMITED BY SPACE
013980           INTO 施術所住所Ｗ
013990         END-STRING
014000         MOVE 施情－電話番号         TO 施術所電話番号Ｗ
014010         MOVE 施情－新柔整師番号     TO 柔整師番号Ｗ
014020*
014030         MOVE 施情－取引先銀行名     TO 取引先銀行名Ｗ
014040         MOVE 施情－取引先銀行支店名 TO 取引先銀行支店名Ｗ
014050         MOVE 施情－預金種別         TO 預金種別Ｗ
014060         MOVE 施情－銀行番号         TO 銀行番号Ｗ
014070         MOVE 施情－店番号           TO 店番号Ｗ
014080         MOVE 施情－口座番号         TO 口座番号Ｗ
014090         MOVE 施情－口座名義人カナ   TO 口座名義人カナＷ
014100         MOVE 施情－口座名義人       TO 口座名義人Ｗ
014110         STRING 取引先銀行名Ｗ     DELIMITED BY SPACE
014120                " "                DELIMITED BY SIZE
014130                取引先銀行支店名Ｗ DELIMITED BY SPACE
014140                INTO 銀行名支店名Ｗ
014150         END-STRING
014160         EVALUATE 預金種別Ｗ
014170         WHEN 1
014180             MOVE NC"普通" TO 預金種別コメントＷ
014190         WHEN 2
014200             MOVE NC"当座" TO 預金種別コメントＷ
014210         WHEN OTHER
014220             MOVE SPACE    TO 預金種別コメントＷ
014230         END-EVALUATE
014240
014250     END-READ.
014260*================================================================*
014270 ７号印刷処理 SECTION.
014280*
014290*
014300     OPEN INPUT 作業ファイル１.
014310         MOVE NC"作業" TO ファイル名.
014320         PERFORM オープンチェック.
014350     MOVE SPACE TO YJK4362P.
014360     INITIALIZE    YJK4362P.
014370     MOVE 30    TO 作１－印刷順序.
014380     MOVE SPACE TO 作１－保険者番号.
014390     MOVE ZERO  TO 作１－保険種別.
014400     MOVE SPACE TO 作１－患者コード.
014410     MOVE ZERO  TO 作１－施術和暦年月.
014420     START 作業ファイル１ KEY IS >=  作１－印刷順序
014430                                     作１－保険者番号
014440                                     作１－保険種別
014450                                     作１－患者コード
014460                                     作１－施術和暦年月
014470     END-START.
014480     IF 状態キー = "00"
014490         MOVE SPACE TO 終了フラグ
014500         PERFORM 作業ファイル読込
014510         IF  終了フラグ = "YES"
014520             MOVE  NC"　該当データなしです。確認して下さい。" TO 連メ－メッセージ
014530             CALL   "MSG001"
014540             CANCEL "MSG001"
014550             PERFORM ファイル閉鎖
014560             MOVE 99 TO PROGRAM-STATUS
014570             EXIT PROGRAM
014580         END-IF
014590         PERFORM UNTIL 終了フラグ = "YES"
014600             PERFORM 印刷レコードセット
014610             PERFORM 作業ファイル読込
014620         END-PERFORM
014630         PERFORM ヘッダセット２
014640         PERFORM 印字処理２
014650         PERFORM 改頁処理２
014660     END-IF.
014670
014700     CLOSE 作業ファイル１.
014710     CLOSE 印刷ファイル２.
014720*================================================================*
014730 印刷レコードセット SECTION.
014740*
014750     ADD 1            TO ７号－本人件数.
014760     ADD 作１－費用額 TO ７号－本人費用額
014770     ADD 作１－負担額 TO ７号－本人負担額.
014780     ADD 作１－請求額 TO ７号－本人請求額.
014790*================================================================*
014800 ヘッダセット２ SECTION.
014810*
014820* 当月の和暦を取得
014830     MOVE 請求和暦ＷＲ       TO 元－元号区分.
014840     READ 元号マスタ
014850     INVALID KEY
014860         MOVE SPACE          TO ７号－請求和暦名称
014870     NOT INVALID KEY
014880         MOVE 元－元号名称   TO ７号－請求和暦名称
014890     END-READ.
014900*
014910     MOVE 請求年ＷＲ         TO ７号－請求年.
014920     MOVE 請求月ＷＲ         TO ７号－請求月.
014930     MOVE 代表者名Ｗ         TO ７号－代表者名.
014940     MOVE 接骨院名Ｗ         TO ７号－接骨院名.
014950     MOVE 柔整師番号Ｗ       TO ７号－柔整師番号.
014960*
014970* / 保険者/
014980     MOVE 作１－保険種別     TO 保険種別Ｗ.
014990     IF (作１－保険種別 = 05) AND (作１－保険者番号(1:2) = "39")
015000         MOVE 作１－保険者番号(1:4) TO ７号－保険者番号
015010     ELSE
015020         MOVE 作１－保険者番号      TO ７号－保険者番号
015030     END-IF.
015040*     PERFORM 県名セット.
015050*     PERFORM 保険種別名セット.
015060     MOVE NC"東京都" TO ７号－都道府県名.
015070     MOVE NC"後期"   TO ７号－保険種別名.
015080     PERFORM 後期高齢情報取得.
015090*
015100     STRING  請求先名称Ｗ  DELIMITED BY SPACE
015110             "  殿"        DELIMITED BY SIZE
015120            INTO 保険者宛名Ｗ
015130     END-STRING.
015140     MOVE 保険者宛名Ｗ  TO ７号－保険者名称.
015150*
015160*================================================================*
015170 印字処理２  SECTION.
015180*
015190     IF ( オープンフラグ２ NOT = "YES" )
015191        MOVE "YES" TO オープンフラグ２
015192        OPEN I-O  印刷ファイル２
015193        PERFORM エラー処理Ｐ
015194     END-IF.
015195*
015196     MOVE "YJK4362P" TO  定義体名Ｐ.
015200     MOVE SPACE      TO  処理種別Ｐ.
015210     MOVE "SCREEN"   TO  項目群名Ｐ.
015220     WRITE YJK4362P.
015230     PERFORM エラー処理Ｐ.
015240*================================================================*
015250 改頁処理２  SECTION.
015260
015270     MOVE "YJK4362P" TO  定義体名Ｐ.
015280     MOVE "CT"       TO  処理種別Ｐ.
015290     MOVE "PAGE"     TO  拡張制御Ｐ.
015300     MOVE SPACE      TO  項目群名Ｐ.
015310     WRITE YJK4362P.
015320     PERFORM エラー処理Ｐ.
015330     MOVE SPACE     TO  拡張制御Ｐ.
015340*
015350*================================================================*
015360******************************************************************
015370 END PROGRAM YJK438.
015380******************************************************************
