000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK431.
000060 AUTHOR.                 岡田　憲和
000070*
000080*----------------------------------------------------------------*
000090*  日本柔整共済会用  6,7号請求書一括【ﾃﾞｰﾀ作成】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100*  請求年月バージョン 
000110*         MED = YJK430G 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-09-06
000140 DATE-COMPILED.          2012-09-06
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  制－制御区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000950     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000951                             ORGANIZATION             IS  INDEXED
000952                             ACCESS MODE              IS  DYNAMIC
000953                             RECORD KEY               IS  受－施術和暦年月
000954                                                          受－患者コード
000955                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000956                                                          受－患者カナ
000957                                                          受－患者コード
000958                             ALTERNATE RECORD KEY     IS  受－患者コード
000959                                                          受－施術和暦年月
000960                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000961                                                          受－保険種別
000962                                                          受－保険者番号
000963                                                          受－患者コード
000964                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000965                                                          受－公費種別
000966                                                          受－費用負担者番号
000967                                                          受－患者コード
000968                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000969                                                          受－助成種別
000970                                                          受－費用負担者番号助成
000971                                                          受－患者コード
000972                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000973                                                      受－施術和暦年月
000974                                                      受－患者コード
000975                             FILE STATUS              IS  状態キー
000976                             LOCK        MODE         IS  AUTOMATIC.
000977     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000978                             ORGANIZATION             IS  INDEXED
000979                             ACCESS MODE              IS  DYNAMIC
000980                             RECORD KEY               IS  請先－保険種別
000981                                                          請先－保険者番号
000982                             FILE STATUS              IS  状態キー
000983                             LOCK    MODE             IS  AUTOMATIC.
000984     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000985                             ORGANIZATION             IS  INDEXED
000986                             ACCESS MODE              IS  DYNAMIC
000987                             RECORD KEY               IS  レセ－施術和暦年月
000988                                                          レセ－患者コード
000989                                                          レセ－レセ種別
000990                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000991                                                          レセ－施術和暦年月
000992                                                          レセ－レセ種別
000993                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000994                                                          レセ－施術和暦年月
000995                                                          レセ－患者コード
000996                                                          レセ－レセ種別
000997                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000998                                                          レセ－レセ種別
000999                                                          レセ－請求保険者番号
001000                                                          レセ－患者コード
001001                                                          レセ－施術和暦年月
001002                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
001003                                                          レセ－請求保険者番号
001004                                                          レセ－患者コード
001005                                                          レセ－レセ種別
001006                                                          レセ－施術和暦年月
001007                             FILE STATUS              IS  状態キー
001008                             LOCK        MODE         IS  AUTOMATIC.
001009     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
001010                             ORGANIZATION             IS  INDEXED
001011                             ACCESS                   IS  DYNAMIC
001012                             RECORD      KEY          IS  作１－請求和暦年月
001013                                                          作１－保険種別
001014                                                          作１－保険者番号
001015                                                          作１－記号
001020                                                          作１－番号
001030                                                          作１－被保険者カナ
001040                                                          作１－患者コード
001050                                                          作１－施術和暦年月
001060                             FILE        STATUS       IS  状態キー
001070                             LOCK        MODE         IS  AUTOMATIC.
001080     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4312L.DAT"
001090                             ORGANIZATION             IS  INDEXED
001100                             ACCESS                   IS  DYNAMIC
001110                             RECORD      KEY          IS  作２－請求和暦年月
001120                                                          作２－保険種別
001130                                                          作２－保険者番号
001140                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001150                                                          作２－県
001160                                                          作２－印刷順序
001170                                                          作２－保険種別
001180                                                          作２－保険者番号
001190                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001200                                                          作２－印刷順序
001210                                                          作２－保険種別
001220                                                          作２－保険者番号
001230*                                                          作２－県
001240*/県別、社保日雇いをまとめ、船員を別に集計/081021
001250                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001260                                                          作２－県２
001270                                                          作２－印刷順序
001280                                                          作２－保険種別
001290                                                          作２－保険者番号
001300                             FILE        STATUS       IS  状態キー
001310                             LOCK        MODE         IS  AUTOMATIC.
001320******************************************************************
001330*                      DATA DIVISION                             *
001340******************************************************************
001350 DATA                    DIVISION.
001360 FILE                    SECTION.
001560*                           ［ＲＬ＝  ２５６］
001561 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001562     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001563*                           ［ＲＬ＝  ３２０］
001564 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001565     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001566*                           ［ＲＬ＝  １２８］
001567 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
001568     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
001569*
001570 FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
001571     COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001572* 
001573 FD  作業ファイル１ RECORD  CONTAINS 288 CHARACTERS.
001574 01  作１－レコード.
001580     03  作１－レコードキー.
001590         05  作１－請求和暦年月.
001600             07  作１－請求和暦              PIC 9.
001610             07  作１－請求年                PIC 9(2).
001620             07  作１－請求月                PIC 9(2).
001630         05  作１－保険種別                  PIC 9(2).
001640         05  作１－保険者番号                PIC X(10).
001650         05  作１－記号                      PIC X(24).
001660         05  作１－番号                      PIC X(30).
001670         05  作１－被保険者カナ              PIC X(50).
001680         05  作１－患者コード.
001690             07 作１－患者番号               PIC 9(6).
001700             07 作１－枝番                   PIC X(1).
001710         05  作１－施術和暦年月.
001720             07  作１－施術和暦              PIC 9.
001730             07  作１－施術年                PIC 9(2).
001740             07  作１－施術月                PIC 9(2).
001750     03  作１－レコードデータ.
001760         05  作１－被保険者氏名              PIC X(50).
001770         05  作１－患者氏名                  PIC X(50).
001780         05  作１－保険者番号２              PIC X(10).
001790         05  作１－費用額                    PIC 9(7).
001800         05  作１－負担額                    PIC 9(7).
001810         05  作１－請求額                    PIC 9(7).
001820         05  作１－本人家族区分              PIC 9.
001830         05  作１－県                        PIC X(2).
001840         05  FILLER                          PIC X(21).
001850*
001860*                           ［ＲＬ＝  １２８］
001870 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
001880 01  作２－レコード.
001890     03  作２－レコードキー.
001900         05  作２－請求和暦年月.
001910             07  作２－請求和暦              PIC 9.
001920             07  作２－請求年                PIC 9(2).
001930             07  作２－請求月                PIC 9(2).
001940         05  作２－保険種別                  PIC 9(2).
001950         05  作２－保険者番号                PIC X(10).
001960         05  作２－県                        PIC X(2).
001970         05  作２－印刷順序.
001980             07  作２－印刷順序１            PIC 9(2).
001990             07  作２－印刷順序２            PIC 9.
002000     03  作２－レコードデータ.
002010         05  作２－保険者番号２              PIC X(10).
002020         05  作２－件数                      PIC 9(4).
002030         05  作２－費用額                    PIC 9(9).
002040         05  作２－負担額                    PIC 9(9).
002050         05  作２－請求額                    PIC 9(9).
002060         05  作２－本人件数                  PIC 9(3).
002070         05  作２－本人費用額                PIC 9(7).
002080         05  作２－本人負担額                PIC 9(7).
002090         05  作２－本人請求額                PIC 9(7).
002100         05  作２－家族件数                  PIC 9(3).
002110         05  作２－家族費用額                PIC 9(7).
002120         05  作２－家族負担額                PIC 9(7).
002130         05  作２－家族請求額                PIC 9(7).
002140         05  作２－県２                      PIC X(2).
002150         05  FILLER                          PIC X(15).
002160*         05  FILLER                          PIC X(17).
002170*----------------------------------------------------------------*
002180******************************************************************
002190*                WORKING-STORAGE SECTION                         *
002200******************************************************************
002210 WORKING-STORAGE         SECTION.
002220 01 キー入力                           PIC X     VALUE SPACE.
002230 01 状態キー                           PIC X(2)  VALUE SPACE.
002240 01 終了フラグ                         PIC X(3)  VALUE SPACE.
002250 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
002260 01 作成フラグ                         PIC X(3)  VALUE SPACE.
002270 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002280 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
002290*
002300 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
002310 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
002320 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002330 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
002340 01 請求和暦年月ＷＲ.
002350    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
002360    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
002370    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
002380*
002390 01 請求年月Ｗ.
002400    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002410    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
002420    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
002430 01 施術年月Ｗ.
002440    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002450    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
002460    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
002470 01 集計作業用Ｗ.
002480    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
002490    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
002500    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
002510    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
002520    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
002530    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
002540 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
002550 01 ファイル名                         PIC N(2)  VALUE SPACE.
002560 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002570 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
002580 01 保険者番号２Ｗ                     PIC X(10) VALUE SPACE.
002590 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
002600*
002610* 本人/家族集計用
002620 01 本人家族集計用Ｗ.
002630    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
002640    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
002650    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
002660    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
002670    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
002680    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
002690    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
002700    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
002710*
002720* 県内県外用
002730 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
002740 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
002750 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
002760 01 県内県外チェック                   PIC 9     VALUE ZERO.
002770 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
002780 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
002790 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
002800 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
002810*
002820* エラーメッセージ用
002830 01 エラーメッセージＷ.
002840    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002850    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002860    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002870    03 FILLER                          PIC X(10) VALUE SPACE.
002880* 順序用
002890 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
002900 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
002910*
002920** 助成レセまとめ用
002930 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
002940*
002950* 例外用
002960 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
002970*
002980 01 後高代表番号Ｗ                     PIC X(10) VALUE SPACE.
002981
002982 01 複合プログラム名Ｗ                 PIC X(8) VALUE "MOJI2".
002983
002990******************************************************************
003000*                          連結項目                              *
003010******************************************************************
003020*
003030****************
003040* 画面入力情報 *
003050****************
003060**
003070 01 連入－画面情報ＹＪＫ４３０   IS EXTERNAL.
003080    03 連入－請求年月.
003090       05 連入－請求和暦               PIC 9.
003100       05 連入－請求年                 PIC 9(2).
003110       05 連入－請求月                 PIC 9(2).
003120    03 連入－提出年月日.
003130       05 連入－提出和暦               PIC 9.
003140       05 連入－提出年                 PIC 9(2).
003150       05 連入－提出月                 PIC 9(2).
003160       05 連入－提出日                 PIC 9(2).
003170    03 連入－レセプト種類              PIC X(4).
003180    03 連入－保険種別                  PIC 9(2).
003190    03 連入－印刷種類                  PIC 9.
003200    03 連入－本人家族                  PIC 9.
003210    03 連入－用紙種類                  PIC 9.
003220    03 連入－県内県外                  PIC 9.
003230    03 連入－県ＪＩＳ                  PIC X(2).
003240    03 連入－政管ＪＩＳ                PIC X(2).
003250*
003590********************
003600* メッセージ表示キー *
003610********************
003620 01 連メ３－キー IS EXTERNAL.
003630    03  連メ３－メッセージ             PIC N(20).
003640    03  連メ３－メッセージ１           PIC X(20).
003650*
003660************************
003670* 助成レセまとめ
003680************************
003690 01 連レセまとめ－キー IS EXTERNAL.
003700    03 連レセまとめ－施術和暦年月.
003710       05 連レセまとめ－施術和暦               PIC 9.
003720       05 連レセまとめ－施術年月.
003730          07 連レセまとめ－施術年              PIC 9(2).
003740          07 連レセまとめ－施術月              PIC 9(2).
003750    03 連レセまとめ－患者コード.
003760       05 連レセまとめ－患者番号               PIC 9(6).
003770       05 連レセまとめ－枝番                   PIC X(1).
003780**-------------------------------------------------------**
003790*   1:助成レセプトなしの本体まとめの判定
003800*   2:横浜・川崎用の社保助成レセかの判定
003810    03 連レセまとめ－判定区分                  PIC 9.
003820**-------------------------------------------------------**
003830*  / OUT /　 0:対象外、1:対象
003840    03 連レセまとめ－判定結果                  PIC 9.
003850**
003860*
003870 01 連保険者番号変換－キー IS EXTERNAL.
003880    03 連保険者番号変換－施術和暦年月.
003890       05 連保険者番号変換－施術和暦               PIC 9.
003900       05 連保険者番号変換－施術年月.
003910          07 連保険者番号変換－施術年              PIC 9(2).
003920          07 連保険者番号変換－施術月              PIC 9(2).
003930    03 連保険者番号変換－保険種別                  PIC 9(2).
003940    03 連保険者番号変換－元保険者番号              PIC X(10).
003950* 0:通常（施術年月関係なし）
003960    03 連保険者番号変換－呼出区分                  PIC 9(2).
003970*  / OUT /
003980    03 連保険者番号変換－後保険者番号              PIC X(10).
003990*
004001* 暗号複合用
004002 01 連暗号複合－暗号情報 IS EXTERNAL.
004003    03 連暗号複合－入力情報.
004004       05 連暗号複合－記号               PIC X(24).
004005       05 連暗号複合－番号               PIC X(30).
004006       05 連暗号複合－暗号化項目.
004007          07 連暗号複合－暗号患者番号    PIC X(6).
004008          07 連暗号複合－暗号判定記号    PIC X.
004009          07 連暗号複合－暗号判定番号    PIC X.
004010          07 連暗号複合－暗号記号        PIC X(24).
004011          07 連暗号複合－暗号番号        PIC X(30).
004012    03 連暗号複合－出力情報.
004013       05 連暗号複合－複合した記号       PIC X(24).
004014       05 連暗号複合－複合した番号       PIC X(30).
004015*
004016******************************************************************
004017*                      PROCEDURE  DIVISION                       *
004020******************************************************************
004030 PROCEDURE               DIVISION.
004040************
004050*           *
004060* 初期処理   *
004070*           *
004080************
004090     PERFORM ファイルオープン.
004100     PERFORM 連結項目待避.
004110     PERFORM 制御情報取得.
004120************
004130*           *
004140* 主処理     *
004150*           *
004160************
004170     PERFORM 作業ファイル１作成.
004180     PERFORM 作業ファイル２作成.
004190************
004200*           *
004210* 終了処理   *
004220*           *
004230************
004240     PERFORM 終了処理.
004250     MOVE ZERO TO PROGRAM-STATUS.
004260     EXIT PROGRAM.
004270*
004280*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004290*================================================================*
004300 連結項目待避 SECTION.
004310*
004320* 連結項目の待避
004330     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
004340     MOVE 連入－請求年        TO 請求年ＷＲ.
004350     MOVE 連入－請求月        TO 請求月ＷＲ.
004360     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
004370     MOVE 連入－保険種別      TO 保険種別ＷＲ.
004380     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
004390     MOVE 連入－県内県外      TO 県内県外ＷＲ.
004400     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
004410     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
004420*
004430*================================================================*
004440 ファイルオープン SECTION.
004450*
004460     OPEN INPUT 制御情報マスタ.
004470         MOVE NC"制御情報" TO ファイル名.
004480         PERFORM オープンチェック.
004490     OPEN INPUT 受診者情報Ｆ.
004500         MOVE NC"受診者情報Ｆ" TO ファイル名.
004510         PERFORM オープンチェック.
004640     OPEN INPUT 請求先マスタ.
004641         MOVE NC"請求先" TO ファイル名.
004642         PERFORM オープンチェック.
004643     OPEN INPUT レセプトＦ.
004644         MOVE NC"レセプトＦ" TO ファイル名.
004645         PERFORM オープンチェック.
004646*================================================================*
004650 オープンチェック SECTION.
004660*
004670     IF 状態キー  NOT =  "00"
004680         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004690         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004700         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004710                                                 UPON CONS
004720         ACCEPT  キー入力 FROM CONS
004730         PERFORM ファイル閉鎖
004740         MOVE 99 TO PROGRAM-STATUS
004750         EXIT PROGRAM.
004760*================================================================*
004770 制御情報取得 SECTION.
004780*
004790     MOVE ZEROS TO 制－制御区分.
004800     READ 制御情報マスタ
004810     NOT INVALID KEY
004820         MOVE 制－協会コード   TO 協会コードＷ
004830     END-READ.
004840*
004850*================================================================*
004860 エラー表示 SECTION.
004870*
004880     DISPLAY NC"状態キー" 状態キー  UPON CONS.
004890     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
004900     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
004910     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004920     ACCEPT  キー入力 FROM CONS.
004930     PERFORM ファイル閉鎖.
004940     MOVE 99 TO PROGRAM-STATUS.
004950     EXIT PROGRAM.
004960*================================================================*
004970 作業ファイル１作成 SECTION.
004980*
004990     OPEN OUTPUT 作業ファイル１.
005000         MOVE NC"作業" TO ファイル名.
005010         PERFORM オープンチェック.
005020*
005030     EVALUATE レセプト種類ＷＲ
005040*        **********************************
005050*        * 国保・退職・組合・共済・自衛官
005060*        **********************************
005070         WHEN "KOKU"
005080         WHEN "KUMI"
005090         WHEN "KYOU"
005100         WHEN "TAIS"
005110         WHEN "JIEI"
005120             PERFORM 作業ファイル１作成１
005130*        **********************************
005140*        * 社保（日雇・船員含む）
005150*        **********************************
005160         WHEN "SYAH"
005170             PERFORM 作業ファイル１作成２
005180*        *************
005190*        * 老人 *
005200*        *************
005210         WHEN "ROUJ"
005220             PERFORM 作業ファイル１作成３
005230*        *************
005240*        * 助成 *
005250*        *************
005260         WHEN "JYOS"
005270             PERFORM 作業ファイル１作成４
005280*        *************
005290*        * 全印刷    *
005300*        *************
005310         WHEN "ALL "
005320             PERFORM 作業ファイル１作成５
005330     END-EVALUATE.
005340*
005350     CLOSE 作業ファイル１.
005360*
005370*================================================================*
005380 作業ファイル１作成１ SECTION.
005390*
005400**********************************
005410* 国保・退職・組合・共済・自衛官
005420**********************************
005550     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005551     MOVE 請求年ＷＲ    TO レセ－請求年.  
005552     MOVE 請求月ＷＲ    TO レセ－請求月.  
005553     MOVE 1             TO レセ－レセ種別.
005554     MOVE SPACE         TO レセ－請求保険者番号.
005555     MOVE ZERO          TO レセ－患者番号.
005556     MOVE SPACE         TO レセ－枝番.    
005557     START レセプトＦ   KEY IS >= レセ－請求和暦年月
005558                                  レセ－レセ種別
005559                                  レセ－請求保険者番号
005560                                  レセ－患者コード
005561     END-START.
005562     IF 状態キー = "00"
005620         MOVE SPACE  TO 終了フラグ
005621         PERFORM レセプトＦ読込
005622         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005623                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005624                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005625                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
005626                       ( レセ－レセ種別 NOT = 1 )
005628             PERFORM データチェック
005629             IF 実行キーＷ = "YES"
005630*             ******************
005631*             * 健保 老人含まず*
005640*             ******************
005650                  IF 受－保険種別  = 保険種別ＷＲ
005660**                              本人家族区分ありか
005670                      MOVE SPACE  TO  作成フラグ
005680                      IF 本人家族区分ＷＲ NOT = ZERO
005690                         IF 本人家族区分ＷＲ = 受－本人家族区分
005700                             MOVE "YES"  TO  作成フラグ
005710                         END-IF
005720                      ELSE
005730                         MOVE "YES"  TO  作成フラグ
005740                      END-IF 
005750**                                          県内県外か
005760                      IF 作成フラグ  = "YES"
005770                         MOVE SPACE  TO  作成フラグ
005780                         MOVE 受－保険種別 TO 保険種別県用ＷＫ
005790                         PERFORM 県内県外取得
005800*                       (県内1、県外2、両方0)
005810                         IF 県内県外ＷＲ NOT = ZERO
005820                            IF 県内県外ＷＲ = 1
005830                               IF 県内県外チェック = 1
005840                                  MOVE "YES"  TO  作成フラグ
005850                               END-IF
005860                            ELSE
005870                               IF 県内県外チェック = ZERO
005880                                  MOVE "YES"  TO  作成フラグ
005890                               END-IF
005900                            END-IF
005910                         ELSE
005920                            MOVE "YES"  TO  作成フラグ
005930                         END-IF 
005940                      END-IF 
005950*        
005960*                   / 例外除く /
005970                      PERFORM 例外処理
005980*
005990                      IF 作成フラグ  = "YES"
006000                         IF ( 受－公費種別       = ZERO  ) AND
006010                            ( 受－費用負担者番号 = SPACE )
006040                              MOVE SPACE TO 作１－レコード
006050                              INITIALIZE 作１－レコード
006060                              MOVE 受－保険種別    TO 作１－保険種別
006070                              MOVE 受－保険者番号  TO 作１－保険者番号
006080                              PERFORM レコードセット
006090                              PERFORM 健保料金計算
006100                              PERFORM ファイル書込
006120                         END-IF 
006121                      END-IF 
006130                  END-IF 
006150             END-IF 
006161             PERFORM レセプトＦ読込
006171         END-PERFORM
006180     END-IF.
006181*================================================================*
006190 作業ファイル１作成２ SECTION.
006200*
006210**********************************
006220* 社保（日雇・船員含む）
006230**********************************
006430     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
006431     MOVE 請求年ＷＲ    TO レセ－請求年.  
006432     MOVE 請求月ＷＲ    TO レセ－請求月.  
006433     MOVE 1             TO レセ－レセ種別.
006434     MOVE SPACE         TO レセ－請求保険者番号.
006435     MOVE ZERO          TO レセ－患者番号.
006436     MOVE SPACE         TO レセ－枝番.    
006437     START レセプトＦ   KEY IS >= レセ－請求和暦年月
006438                                  レセ－レセ種別
006439                                  レセ－請求保険者番号
006440                                  レセ－患者コード
006441     END-START.
006442     IF 状態キー = "00"
006443         MOVE SPACE  TO 終了フラグ
006444         PERFORM レセプトＦ読込
006445         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
006446                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
006447                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
006448                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
006449                       ( レセ－レセ種別 NOT = 1 )
006450             PERFORM データチェック
006451             IF 実行キーＷ = "YES"
006452*             ******************
006453*             * 老人含まず*
006454*             ******************
006460                 IF 受－保険種別  = 02 OR 06 OR 07
006470** 本人家族区分ありか
006480                      MOVE SPACE  TO  作成フラグ
006490                      IF 本人家族区分ＷＲ NOT = ZERO
006500                         IF 本人家族区分ＷＲ = 受－本人家族区分
006510                             MOVE "YES"  TO  作成フラグ
006520                         END-IF
006530                      ELSE
006540                         MOVE "YES"  TO  作成フラグ
006550                      END-IF 
006560** 県内県外か
006570                      IF 作成フラグ  = "YES"
006580                         MOVE SPACE  TO  作成フラグ
006590                         MOVE 受－保険種別 TO 保険種別県用ＷＫ
006600                         PERFORM 県内県外取得
006610*                       (県内1、県外2、両方0)
006620                         IF 県内県外ＷＲ NOT = ZERO
006630                            IF 県内県外ＷＲ = 1
006640                               IF 県内県外チェック = 1
006650                                  MOVE "YES"  TO  作成フラグ
006660                               END-IF
006670                            ELSE
006680                               IF 県内県外チェック = ZERO
006690                                  MOVE "YES"  TO  作成フラグ
006700                               END-IF
006710                            END-IF
006720                         ELSE
006730                            MOVE "YES"  TO  作成フラグ
006740                         END-IF 
006750                      END-IF 
006760*
006770*                   / 例外除く /
006780                      PERFORM 例外処理
006790*
006800                      IF 作成フラグ  = "YES"
006810                         IF ( 受－公費種別       = ZERO  ) AND
006820                            ( 受－費用負担者番号 = SPACE )
006850                              MOVE SPACE TO 作１－レコード
006860                              INITIALIZE 作１－レコード
006870                              MOVE 受－保険種別    TO 作１－保険種別
006880                              MOVE 受－保険者番号  TO 作１－保険者番号
006890                              PERFORM レコードセット
006900                              PERFORM 健保料金計算
006910                              PERFORM ファイル書込
006930                         END-IF 
006940                      END-IF 
006950                 END-IF
006970             END-IF
006980             PERFORM レセプトＦ読込
006981         END-PERFORM
006990     END-IF.
006991*================================================================*
007000 作業ファイル１作成３ SECTION.
007010*
007020**********************************
007030*  老人
007040**********************************
007270     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
007271     MOVE 請求年ＷＲ    TO レセ－請求年.  
007272     MOVE 請求月ＷＲ    TO レセ－請求月.  
007273     MOVE 2             TO レセ－レセ種別.
007274     MOVE SPACE         TO レセ－請求保険者番号.
007275     MOVE ZERO          TO レセ－患者番号.
007276     MOVE SPACE         TO レセ－枝番.    
007277     START レセプトＦ   KEY IS >= レセ－請求和暦年月
007278                                  レセ－レセ種別
007279                                  レセ－請求保険者番号
007280                                  レセ－患者コード
007281     END-START.
007282     IF 状態キー = "00"
007283         MOVE SPACE  TO 終了フラグ
007284         PERFORM レセプトＦ読込
007285         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
007286                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
007287                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
007288                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
007289                       ( レセ－レセ種別 NOT = 2 )
007290*
007291             PERFORM データチェック
007292             IF 実行キーＷ = "YES"
007293*
007294** 本人家族区分ありか
007295                  MOVE SPACE  TO  作成フラグ
007296                  IF 本人家族区分ＷＲ NOT = ZERO
007300                     IF 本人家族区分ＷＲ = 受－本人家族区分
007310                         MOVE "YES"  TO  作成フラグ
007320                     END-IF
007330                  ELSE
007340                     MOVE "YES"  TO  作成フラグ
007350                  END-IF 
007360** 県内県外か
007370                  IF 作成フラグ  = "YES"
007380                     MOVE SPACE  TO  作成フラグ
007390                     MOVE 受－公費種別 TO 保険種別県用ＷＫ
007400                     PERFORM 県内県外取得
007410*                   (県内1、県外2、両方0)
007420                     IF 県内県外ＷＲ NOT = ZERO
007430                        IF 県内県外ＷＲ = 1
007440                           IF 県内県外チェック = 1
007450                              MOVE "YES"  TO  作成フラグ
007460                           END-IF
007470                        ELSE
007480                           IF 県内県外チェック = ZERO
007490                              MOVE "YES"  TO  作成フラグ
007500                           END-IF
007510                        END-IF
007520                     ELSE
007530                        MOVE "YES"  TO  作成フラグ
007540                     END-IF 
007550                  END-IF 
007560*      / 例外除く(老人＋生活保護) /
007570                  PERFORM 例外処理
007580*
007590                  IF 作成フラグ  = "YES"
007620                       MOVE SPACE TO 作１－レコード
007630                       INITIALIZE 作１－レコード
007640                       MOVE 受－公費種別           TO 作１－保険種別
007650                       MOVE 受－費用負担者番号     TO 作１－保険者番号
007660                       PERFORM レコードセット
007670                       PERFORM 老人料金計算
007680* 請求額が ZERO の時は、書き込まない。
007690                       IF  作１－請求額 NOT = ZERO
007700                           PERFORM ファイル書込
007710                       END-IF
007730                  END-IF 
007740             END-IF
007750             PERFORM レセプトＦ読込
007760         END-PERFORM
007770     END-IF.
007780*================================================================*
007790 作業ファイル１作成４ SECTION.
007800*
007810**********************************
007820*  助成
007830**********************************
008060     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
008061     MOVE 請求年ＷＲ    TO レセ－請求年.  
008062     MOVE 請求月ＷＲ    TO レセ－請求月.  
008063     MOVE 3             TO レセ－レセ種別.
008064     MOVE SPACE         TO レセ－請求保険者番号.
008065     MOVE ZERO          TO レセ－患者番号.
008066     MOVE SPACE         TO レセ－枝番.    
008067     START レセプトＦ   KEY IS >= レセ－請求和暦年月
008068                                  レセ－レセ種別
008069                                  レセ－請求保険者番号
008070                                  レセ－患者コード
008071     END-START.
008072     IF 状態キー = "00"
008073         MOVE SPACE  TO 終了フラグ
008074         PERFORM レセプトＦ読込
008075         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008076                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
008077                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
008078                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
008079                       ( レセ－レセ種別 NOT = 3 )
008080             PERFORM データチェック
008081             IF 実行キーＷ = "YES"
008082* 生活保護は対象外とする
008083                 IF 受－助成種別           NOT = 50
008084** 本人家族区分ありか
008090                     MOVE SPACE  TO  作成フラグ
008100                     IF 本人家族区分ＷＲ NOT = ZERO
008110                         IF 本人家族区分ＷＲ = 受－本人家族区分
008120                             MOVE "YES"  TO  作成フラグ
008130                         END-IF
008140                     ELSE
008150                         MOVE "YES"  TO  作成フラグ
008160                     END-IF 
008170** 県内県外か
008180                     IF 作成フラグ  = "YES"
008190                         MOVE SPACE  TO  作成フラグ
008200                         MOVE 受－助成種別 TO 保険種別県用ＷＫ
008210                         PERFORM 県内県外取得
008220*                   (県内1、県外2、両方0)
008230                         IF 県内県外ＷＲ NOT = ZERO
008240                             IF 県内県外ＷＲ = 1
008250                                 IF 県内県外チェック = 1
008260                                     MOVE "YES"  TO  作成フラグ
008270                                 END-IF
008280                             ELSE
008290                                 IF 県内県外チェック = ZERO
008300                                     MOVE "YES"  TO  作成フラグ
008310                                 END-IF
008320                             END-IF
008330                         ELSE
008340                             MOVE "YES"  TO  作成フラグ
008350                         END-IF 
008360                     END-IF 
008370*
008380                     IF 作成フラグ  = "YES"
008420                         MOVE SPACE TO 作１－レコード
008430                         INITIALIZE 作１－レコード
008440                         MOVE 受－助成種別           TO 作１－保険種別
008450                         MOVE 受－費用負担者番号助成 TO 作１－保険者番号
008460                         PERFORM レコードセット
008470                         PERFORM 助成料金計算
008480*** 生保単独 (請求額は 請求額+請求額助成)
008490* 対象外                     IF ( 受－保険種別    = ZERO ) AND
008500*                               ( 受－保険者番号  = SPACE )
008510*                                COMPUTE 作１－請求額 = 連計－請求額助成  + 連計－請求額
008520*                            END-IF
008530*
008540* 請求額が ZERO の時は、書き込まない。
008550                         IF  作１－請求額 NOT = ZERO
008560                             PERFORM ファイル書込
008570                         END-IF
008590                     END-IF
008600                 END-IF
008610             END-IF
008620             PERFORM レセプトＦ読込
008630         END-PERFORM
008640     END-IF.
008650*================================================================*
008660 作業ファイル１作成５ SECTION.
008670*
008680*********************
008690* 全出力 *
008700*********************
008900     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
008901     MOVE 請求年ＷＲ    TO レセ－請求年.  
008902     MOVE 請求月ＷＲ    TO レセ－請求月.  
008903     MOVE ZERO          TO レセ－レセ種別.
008904     MOVE ZERO          TO レセ－施術和暦.
008905     MOVE ZERO          TO レセ－施術年.  
008906     MOVE ZERO          TO レセ－施術月.  
008907     MOVE ZERO          TO レセ－患者番号.
008908     MOVE SPACE         TO レセ－枝番.    
008909     START レセプトＦ   KEY IS >= レセ－請求和暦年月
008910                                  レセ－施術和暦年月
008911                                  レセ－患者コード
008912                                  レセ－レセ種別
008913     END-START.
008914     IF 状態キー = "00"
008915         MOVE SPACE  TO 終了フラグ
008916         PERFORM レセプトＦ読込
008917         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008918                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
008919                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
008920                       ( レセ－請求月   NOT = 請求月ＷＲ   )
008921             PERFORM データチェック
008922** 労災・自賠責・自費・生保単独　除く
008923             IF  受－保険種別 = 70 OR 80 OR 90 OR ZERO
008924                 MOVE SPACE  TO 実行キーＷ
008925             END-IF
008926***
008927             IF 実行キーＷ = "YES"
008928** 本人家族区分ありか
008929                 MOVE SPACE  TO  作成フラグ
008930                 IF 本人家族区分ＷＲ NOT = ZERO
008931                    IF 本人家族区分ＷＲ = 受－本人家族区分
008940                         MOVE "YES"  TO  作成フラグ
008950                    END-IF
008960                 ELSE
008970                    MOVE "YES"  TO  作成フラグ
008980                 END-IF 
008990                 IF 作成フラグ  = "YES"
009021** 労災・自賠責・自費・生保単独　除く
009030                    IF  受－保険種別 = 70 OR 80 OR 90 OR ZERO
009040                        MOVE SPACE  TO 実行キーＷ
009050                    END-IF
009060* 本体＋生活保護の場合も除く
009070                    IF 受－助成種別 = 50
009080                        MOVE SPACE  TO 実行キーＷ
009090                    END-IF
009100***
009110                    IF 実行キーＷ = "YES"
009130                       EVALUATE TRUE
009131*                ******************
009140*                * 健保 老人含まず*
009150*                ******************
009200                       WHEN レセ－レセ種別   = 1
009201**                 / 県内県外か /
009210                           MOVE SPACE  TO  作成フラグ
009220                           MOVE 受－保険種別 TO 保険種別県用ＷＫ
009230                           PERFORM 県内県外取得
009240*                         (県内1、県外2、両方0)
009250                           IF 県内県外ＷＲ NOT = ZERO
009260                               IF 県内県外ＷＲ = 1
009270                                  IF 県内県外チェック = 1
009280                                      MOVE "YES"  TO  作成フラグ
009290                                  END-IF
009300                               ELSE
009310                                  IF 県内県外チェック = ZERO
009320                                      MOVE "YES"  TO  作成フラグ
009330                                   END-IF
009340                               END-IF
009350                           ELSE
009360                               MOVE "YES"  TO  作成フラグ
009370                           END-IF 
009380*
009390*                          / 例外除く /
009400                           PERFORM 例外処理
009410*
009420                           IF 作成フラグ  = "YES"
009430                               MOVE SPACE TO 作１－レコード
009440                               INITIALIZE 作１－レコード
009450                               MOVE 受－保険種別    TO 作１－保険種別
009460                               MOVE 受－保険者番号  TO 作１－保険者番号
009470                               PERFORM レコードセット
009480                               PERFORM 健保料金計算
009490                               PERFORM ファイル書込
009500                           END-IF
009530*                    ********
009540*                    * 老人 *
009550*                    ********
009580                       WHEN レセ－レセ種別   = 2 
009581**                     / 県内県外か /
009590                           MOVE SPACE  TO  作成フラグ
009600                           MOVE 受－公費種別 TO 保険種別県用ＷＫ
009610                           PERFORM 県内県外取得
009620*                          (県内1、県外2、両方0)
009630                           IF 県内県外ＷＲ NOT = ZERO
009640                               IF 県内県外ＷＲ = 1
009650                                  IF 県内県外チェック = 1
009660                                     MOVE "YES"  TO  作成フラグ
009670                                  END-IF
009680                               ELSE
009690                                  IF 県内県外チェック = ZERO
009700                                     MOVE "YES"  TO  作成フラグ
009710                                  END-IF
009720                               END-IF
009730                           ELSE
009740                               MOVE "YES"  TO  作成フラグ
009750                           END-IF 
009760          
009770*                          / 例外除く(老人＋生活保護) /
009780                           PERFORM 例外処理
009790**        
009800                           IF 作成フラグ  = "YES"
009810                               MOVE SPACE TO 作１－レコード
009820                               INITIALIZE 作１－レコード
009830                               MOVE 受－公費種別           TO 作１－保険種別
009840                               MOVE 受－費用負担者番号     TO 作１－保険者番号
009850                               PERFORM レコードセット
009860                               PERFORM 老人料金計算
009870* 請求額が ZERO の時は、書き込まない。
009880                               IF  作１－請求額 NOT = ZERO
009890                                   PERFORM ファイル書込
009900                               END-IF
009910                           END-IF
009930*                    ********
009940*                    * 助成 *
009950*                    ********
009980                     WHEN レセ－レセ種別   = 3
009981* 生活保護は対象外とする
009990                         IF 受－助成種別           NOT = 50
010000**                       / 県内県外か /
010010                             MOVE SPACE  TO  作成フラグ
010020                             MOVE 受－助成種別 TO 保険種別県用ＷＫ
010030                             PERFORM 県内県外取得
010040*                            (県内1、県外2、両方0)
010050                             IF 県内県外ＷＲ NOT = ZERO
010060                                 IF 県内県外ＷＲ = 1
010070                                     IF 県内県外チェック = 1
010080                                         MOVE "YES"  TO  作成フラグ
010090                                     END-IF
010100                                 ELSE
010110                                     IF 県内県外チェック = ZERO
010120                                         MOVE "YES"  TO  作成フラグ
010130                                     END-IF
010140                                 END-IF
010150                             ELSE
010160                                 MOVE "YES"  TO  作成フラグ
010170                             END-IF 
010180**            
010190                             IF 作成フラグ  = "YES"
010200                                 MOVE SPACE TO 作１－レコード
010210                                 INITIALIZE 作１－レコード
010220                                 MOVE 受－助成種別           TO 作１－保険種別
010230                                 MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010240                                 PERFORM レコードセット
010250                                 PERFORM 助成料金計算
010260*** 生保単独 (請求額は 請求額+請求額助成)
010270* 対象外                    IF ( 受－保険種別    = ZERO ) AND
010280*                              ( 受－保険者番号  = SPACE )
010290*                               COMPUTE 作１－請求額 = 連計－請求額助成  + 連計－請求額
010300*                           END-IF
010310*
010320* 請求額が ZERO の時は、書き込まない。
010330                                IF  作１－請求額 NOT = ZERO
010340                                    PERFORM ファイル書込
010350                                END-IF
010440                             END-IF
010441                          END-IF
010442                       END-EVALUATE
010443                     END-IF
010444                 END-IF
010445             END-IF
010446             PERFORM レセプトＦ読込
010447         END-PERFORM
010448     END-IF.
010449*================================================================*
010450 レセプトＦ読込 SECTION.
010451*
010452     READ レセプトＦ NEXT
010453     AT END
010454         MOVE "YES" TO 終了フラグ
010455     END-READ.
010456*
010457*================================================================*
010458 データチェック SECTION.
010459*
010460     MOVE SPACE          TO 実行キーＷ.
010461     IF ( レセ－レセ印刷対象区分 NOT = 1 )
010462        MOVE "YES"  TO 実行キーＷ
010463     END-IF.
010464* *****************************************************************
010465* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
010466* *****************************************************************
010467     IF 実行キーＷ  = "YES"
010468*      (再度、実行キーＷ SPACE)
010469        MOVE SPACE  TO 実行キーＷ
010470        IF レセ－請求対象区分 NOT = ZERO
010471           MOVE レセ－施術和暦  TO 受－施術和暦
010472           MOVE レセ－施術年    TO 受－施術年
010473           MOVE レセ－施術月    TO 受－施術月
010474           MOVE レセ－患者番号  TO 受－患者番号
010475           MOVE レセ－枝番      TO 受－枝番
010476           READ 受診者情報Ｆ
010477           NOT INVALID KEY
010478              MOVE "YES"  TO 実行キーＷ
010479*
010480*/協会健保の対応、旧保険者番号でも新保険者番号とまとめて請求する/081016
010481              INITIALIZE 連保険者番号変換－キー
010482              MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
010483              MOVE  受－保険種別      TO 連保険者番号変換－保険種別
010484              MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
010485              MOVE  ZERO              TO 連保険者番号変換－呼出区分
010486              CALL   "CHGHOKNO"
010487              CANCEL "CHGHOKNO"
010488*   / 置換え /
010489              MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号
010490*
010491           END-READ
010492        ELSE
010493           MOVE SPACE  TO 実行キーＷ
010494        END-IF
010495     END-IF.
010496*
011191*================================================================*
011200 レコードセット SECTION.
011210*
011220     MOVE レセ－請求和暦    TO 作１－請求和暦.
011230     MOVE レセ－請求年      TO 作１－請求年.
011240     MOVE レセ－請求月      TO 作１－請求月.
011250     MOVE 受－施術和暦      TO 作１－施術和暦.
011260     MOVE 受－施術年        TO 作１－施術年.
011270     MOVE 受－施術月        TO 作１－施術月.
011280     MOVE 受－被保険者カナ  TO 作１－被保険者カナ.
011290     MOVE 受－患者コード    TO 作１－患者コード.
011300     MOVE 受－患者氏名      TO 作１－患者氏名.
011310     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
011340*     MOVE 受－記号          TO 作１－記号.
011341*     MOVE 受－番号          TO 作１－番号.
011342*                                          
011343     MOVE SPACE TO 連暗号複合－暗号情報.
011344*
011345*    / 連暗号複合－入力情報セット /
011346     MOVE 受－記号       TO 連暗号複合－記号.
011347     MOVE 受－番号       TO 連暗号複合－番号.
011348     MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
011349*     
011350     CALL   複合プログラム名Ｗ.
011351     CANCEL 複合プログラム名Ｗ.
011352*
011353     MOVE 連暗号複合－複合した記号 TO 作１－記号.
011354     MOVE 連暗号複合－複合した番号 TO 作１－番号.
011355*
011356*
011357* / 助成は、本人とする /
011360     EVALUATE  作１－保険種別 
011370***     WHEN 05
011380     WHEN 50 THRU 60
011390         MOVE 1                 TO 作１－本人家族区分
011400     WHEN OTHER
011410         MOVE 受－本人家族区分  TO 作１－本人家族区分
011420     END-EVALUATE.
011430*
011440*
011450     MOVE 県ＷＫ TO 作１－県.
011460*
011470*************************************************************************************
011480*  請求先マスタを読んで、データがある時は、請求先市町村コードを保険者番号に転記する。
011490*************************************************************************************
011500     MOVE 作１－保険種別    TO 請先－保険種別.
011510     MOVE 作１－保険者番号  TO 請先－保険者番号.
011520     READ 請求先マスタ
011530     INVALID KEY
011540         MOVE 作１－保険者番号     TO 作１－保険者番号２
011550     NOT INVALID KEY
011560         MOVE 請先－請求先市町村   TO 作１－保険者番号２
011570     END-READ.
011580*
011590*/後期高齢者を代表番号でまとめる/080516
011600*/後高助成時の不具合の修正/080918
011610*     IF 受－保険種別 = 05
011620     IF (作１－保険種別 = 05) AND (作１－保険者番号(1:2) = "39")
011630         MOVE 受－保険者番号 TO 後高代表番号Ｗ
011640         PERFORM 後高代表番号セット
011650         MOVE 後高代表番号Ｗ TO 作１－保険者番号
011660     END-IF.
011670*
012470*================================================================*
012471 健保料金計算 SECTION.
012472*
012473     MOVE レセ－合計         TO 作１－費用額.
012474     MOVE レセ－一部負担金   TO 作１－負担額.
012475     MOVE レセ－請求金額     TO 作１－請求額.
012476*
012477* 特別
012478*     PERFORM 助成レセ判定.
012479*     IF 助成レセまとめフラグ = "YES"
012480*         MOVE レセ－受給者負担額  TO 作１－負担額
012481*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012482*     END-IF.
012483*
012484*================================================================*
012485 老人料金計算 SECTION.
012486*
012487     MOVE レセ－合計        TO 作１－費用額.
012488     MOVE レセ－一部負担金  TO 作１－負担額.
012489     MOVE レセ－請求金額    TO 作１－請求額.
012490*
012491* 特別
012492*     PERFORM 助成レセ判定.
012493*     IF 助成レセまとめフラグ = "YES"
012494*         MOVE レセ－受給者負担額  TO 作１－負担額
012495*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012496*     END-IF.
012497*
012498*================================================================*
012499 助成料金計算 SECTION.
012500*
012501     MOVE レセ－合計         TO 作１－費用額.
012502     MOVE レセ－受給者負担額 TO 作１－負担額.
012503     MOVE レセ－助成請求金額 TO 作１－請求額.
012504*
012505* 特別
012506*     PERFORM 助成レセ判定.
012507*     IF 助成レセまとめフラグ = "YES"
012508**   / 書き込まないように請求額ゼロにする /
012509*        MOVE ZERO TO 作１－請求額
012510*     END-IF.
012511*
012512*================================================================*
012513 ファイル書込 SECTION.
012514*
012515     WRITE 作１－レコード
012516     INVALID KEY
012521         MOVE NC"作１"  TO ファイル名
012530         PERFORM エラー表示
012540     END-WRITE.
012550*================================================================*
012560 作業ファイル２作成 SECTION.
012570*
012580     OPEN INPUT  作業ファイル１.
012590     OPEN OUTPUT 作業ファイル２.
012600*
012610     PERFORM 作業ファイル２作成処理.
012620*
012630     CLOSE 作業ファイル２.
012640     CLOSE 作業ファイル１.
012650*================================================================*
012660 作業ファイル２作成処理 SECTION.
012670*
012680     MOVE ZERO       TO 作１－請求和暦     請求和暦Ｗ.
012690     MOVE ZERO       TO 作１－請求年       請求年Ｗ.
012700     MOVE ZERO       TO 作１－請求月       請求月Ｗ.
012710     MOVE ZERO       TO 作１－保険種別     保険種別Ｗ.
012720     MOVE LOW-VALUE  TO 作１－保険者番号   保険者番号Ｗ.
012730     MOVE LOW-VALUE  TO 作１－記号.
012740     MOVE LOW-VALUE  TO 作１－番号.
012750     MOVE LOW-VALUE  TO 作１－被保険者カナ.
012760     MOVE ZERO       TO 作１－患者番号.
012770     MOVE LOW-VALUE  TO 作１－枝番.
012780     MOVE ZERO       TO 作１－施術和暦.
012790     MOVE ZERO       TO 作１－施術年.
012800     MOVE ZERO       TO 作１－施術月.
012810     START 作業ファイル１ KEY IS >=  作１－請求和暦年月
012820                                     作１－保険種別
012830                                     作１－保険者番号
012840                                     作１－記号
012850                                     作１－番号
012860                                     作１－被保険者カナ
012870                                     作１－患者コード
012880                                     作１－施術和暦年月
012890     END-START.
012900     IF 状態キー = "00"
012910*
012920         MOVE SPACE TO 終了フラグ
012930         MOVE ZERO  TO 件数Ｗ
012940         MOVE ZERO  TO 費用額Ｗ
012950         MOVE ZERO  TO 負担額Ｗ
012960         MOVE ZERO  TO 請求額Ｗ
012970         INITIALIZE 本人家族集計用Ｗ
012980*
012990         PERFORM 作業ファイル１読込
013000         MOVE 作１－請求和暦     TO 請求和暦Ｗ
013010         MOVE 作１－請求年       TO 請求年Ｗ
013020         MOVE 作１－請求月       TO 請求月Ｗ
013030         MOVE 作１－保険種別     TO 保険種別Ｗ
013040         MOVE 作１－保険者番号   TO 保険者番号Ｗ
013050         MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
013060         MOVE 作１－県           TO 県ＷＫ２
013070         PERFORM UNTIL 終了フラグ = "YES"
013080*
013090             MOVE SPACE TO 作２－レコード
013100             INITIALIZE 作２－レコード
013110             PERFORM 作業レコード２累計
013120*
013130             MOVE 作１－請求和暦     TO 請求和暦Ｗ
013140             MOVE 作１－請求年       TO 請求年Ｗ
013150             MOVE 作１－請求月       TO 請求月Ｗ
013160             MOVE 作１－保険種別     TO 保険種別Ｗ
013170             MOVE 作１－保険者番号   TO 保険者番号Ｗ
013180             MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
013190             MOVE 作１－県           TO 県ＷＫ２
013200             PERFORM 作業ファイル１読込
013210         END-PERFORM
013220         PERFORM 作業レコード２セット
013230         PERFORM 作業ファイル２書込
013240     END-IF.
013250*================================================================*
013260 作業ファイル１読込 SECTION.
013270*
013280     READ 作業ファイル１ NEXT
013290     AT END
013300         MOVE "YES" TO 終了フラグ
013310     END-READ.
013320*================================================================*
013330 作業レコード２累計 SECTION.
013340*
013350     IF ( 作１－請求和暦 NOT = 請求和暦Ｗ ) OR
013360        ( 作１－請求年   NOT = 請求年Ｗ   ) OR
013370        ( 作１－請求月   NOT = 請求月Ｗ   ) OR
013380        ( 作１－保険種別 NOT = 保険種別Ｗ ) OR
013390        ( 作１－保険者番号 NOT = 保険者番号Ｗ ) 
013400         PERFORM 作業レコード２セット
013410         PERFORM 作業ファイル２書込
013420         MOVE ZERO  TO 件数Ｗ
013430         MOVE ZERO  TO 費用額Ｗ
013440         MOVE ZERO  TO 負担額Ｗ
013450         MOVE ZERO  TO 請求額Ｗ
013460         INITIALIZE 本人家族集計用Ｗ
013470         PERFORM 作業レコード２加算
013480     ELSE
013490         PERFORM 作業レコード２加算
013500     END-IF.
013510*================================================================*
013520 作業レコード２加算 SECTION.
013530*
013540     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
013550     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
013560     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
013570     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
013580*
013590     IF 作１－本人家族区分 = 1
013600        COMPUTE 本人件数Ｗ   = 本人件数Ｗ   + 1
013610        COMPUTE 本人費用額Ｗ = 本人費用額Ｗ + 作１－費用額
013620        COMPUTE 本人負担額Ｗ = 本人負担額Ｗ + 作１－負担額
013630        COMPUTE 本人請求額Ｗ = 本人請求額Ｗ + 作１－請求額
013640     ELSE
013650        COMPUTE 家族件数Ｗ   = 家族件数Ｗ   + 1
013660        COMPUTE 家族費用額Ｗ = 家族費用額Ｗ + 作１－費用額
013670        COMPUTE 家族負担額Ｗ = 家族負担額Ｗ + 作１－負担額
013680        COMPUTE 家族請求額Ｗ = 家族請求額Ｗ + 作１－請求額
013690     END-IF.
013700*
013710*===============================================================*
013720 作業レコード２セット SECTION.
013730*
013740     MOVE 請求和暦Ｗ     TO 作２－請求和暦.
013750     MOVE 請求年Ｗ       TO 作２－請求年.
013760     MOVE 請求月Ｗ       TO 作２－請求月.
013770     MOVE 保険種別Ｗ     TO 作２－保険種別.
013780     MOVE 保険者番号Ｗ   TO 作２－保険者番号.
013790     MOVE 保険者番号２Ｗ TO 作２－保険者番号２.
013800     MOVE 件数Ｗ         TO 作２－件数.
013810     MOVE 費用額Ｗ       TO 作２－費用額.
013820     MOVE 負担額Ｗ       TO 作２－負担額.
013830     MOVE 請求額Ｗ       TO 作２－請求額.
013840*
013850     MOVE 本人件数Ｗ     TO 作２－本人件数.
013860     MOVE 本人費用額Ｗ   TO 作２－本人費用額.
013870     MOVE 本人負担額Ｗ   TO 作２－本人負担額.
013880     MOVE 本人請求額Ｗ   TO 作２－本人請求額.
013890     MOVE 家族件数Ｗ     TO 作２－家族件数.
013900     MOVE 家族費用額Ｗ   TO 作２－家族費用額.
013910     MOVE 家族負担額Ｗ   TO 作２－家族負担額.
013920     MOVE 家族請求額Ｗ   TO 作２－家族請求額.
013930*
013940     MOVE 県ＷＫ２       TO 作２－県.
013950*/県別、社保日雇いをまとめ、船員を別に集計/081021
013960     IF 作２－保険種別 = 02 OR 06
013970         MOVE 県ＷＫ２   TO 作２－県２
013980     ELSE
013990         MOVE 50         TO 作２－県２
014000     END-IF.
014010*
014020     PERFORM 印刷順序セット.
014030     MOVE    印刷順序Ｗ  TO 作２－印刷順序.
014040     MOVE ZERO TO 印刷順序Ｗ.
014050*
014060*===============================================================*
014070 作業ファイル２書込 SECTION.
014080*
014090     WRITE 作２－レコード
014100     INVALID KEY
014110**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
014120         MOVE NC"作２" TO ファイル名
014130         PERFORM エラー表示
014140         PERFORM ファイル閉鎖
014150         MOVE 99 TO PROGRAM-STATUS
014160         EXIT PROGRAM.
014170*================================================================*
014180 ファイル閉鎖 SECTION.
014190*
014200     CLOSE 制御情報マスタ 受診者情報Ｆ
014210           請求先マスタ レセプトＦ.
014220*================================================================*
014230 終了処理 SECTION.
014240*
014250     PERFORM ファイル閉鎖.
014260*================================================================*
014270*================================================================*
014280 県内県外取得 SECTION.
014290*
014300      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
014310      EVALUATE  保険種別県用ＷＫ
014320* 国保
014330      WHEN  01
014340         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
014350            MOVE  1  TO  県内県外チェック
014360         END-IF
014370         MOVE 受－保険者番号(1:2) TO 県ＷＫ
014380* 社保
014390      WHEN  02
014400*/協会健保の対応/081015
014410         IF 受－保険者番号(5:5) = SPACE
014420             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
014430                MOVE  1  TO  県内県外チェック
014440             END-IF
014450             MOVE 受－保険者番号(1:2) TO 県ＷＫ
014460             PERFORM 県統一
014470             MOVE 県統一ＷＫ TO 県ＷＫ
014480         ELSE
014490             IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
014500                MOVE  1  TO  県内県外チェック
014510             END-IF
014520             MOVE 受－保険者番号(3:2) TO 県ＷＫ
014530         END-IF
014540* 船員
014550* 日雇
014560* 組合
014570* 共済
014580* 自衛官
014590* 退職国保
014600      WHEN  06
014610      WHEN  07
014620      WHEN  08
014630      WHEN  09
014640      WHEN  04
014650      WHEN  03
014660         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
014670            MOVE  1  TO  県内県外チェック
014680         END-IF
014690         MOVE 受－保険者番号(3:2) TO 県ＷＫ
014700* 助成
014710      WHEN 50 THRU 60
014720         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
014730            MOVE  1  TO  県内県外チェック
014740         END-IF
014750         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
014760* 老人
014770      WHEN  05
014780         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
014790            MOVE  1  TO  県内県外チェック
014800         END-IF
014810         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
014820* 労災、自賠責・自費・生保単独は除外
014830      WHEN  70
014840      WHEN  80
014850      WHEN  90
014860      WHEN  ZERO
014870         CONTINUE
014880*
014890     WHEN OTHER
014900         MOVE SPACE                TO エラーメッセージＷ
014910         MOVE 受－患者コード       TO エラー患者コードＷ
014920         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
014930         MOVE "-"                  TO エラー区切りＷ
014940         MOVE  NC"県内県外取得エラー。患者番号" TO 連メ３－メッセージ
014950         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
014960         CALL   "MSG003"
014970         CANCEL "MSG003"
014980     END-EVALUATE.
014990*
015000*================================================================*
015010 県統一 SECTION.
015020*
015030     MOVE ZERO  TO  県統一ＷＫ.
015040     EVALUATE  県ＷＫ
015050*北海道
015060      WHEN  01
015070         MOVE 01 TO 県統一ＷＫ
015080*青森
015090      WHEN  02
015100         MOVE 02 TO 県統一ＷＫ
015110*岩手
015120      WHEN  03
015130         MOVE 03 TO 県統一ＷＫ
015140*宮城
015150      WHEN  04
015160         MOVE 04 TO 県統一ＷＫ
015170*秋田
015180      WHEN  05
015190         MOVE 05 TO 県統一ＷＫ
015200*山形
015210      WHEN  06
015220         MOVE 06 TO 県統一ＷＫ
015230*福島
015240      WHEN  07
015250         MOVE 07 TO 県統一ＷＫ
015260*茨城
015270      WHEN  08
015280         MOVE 08 TO 県統一ＷＫ
015290*栃木
015300      WHEN  09
015310         MOVE 09 TO 県統一ＷＫ
015320*群馬
015330      WHEN  10
015340         MOVE 10 TO 県統一ＷＫ
015350*埼玉
015360      WHEN  11
015370         MOVE 11 TO 県統一ＷＫ
015380*千葉
015390      WHEN  12
015400         MOVE 12 TO 県統一ＷＫ
015410*東京
015420      WHEN  21
015430         MOVE 13 TO 県統一ＷＫ
015440*神奈川
015450      WHEN  31
015460         MOVE 14 TO 県統一ＷＫ
015470*新潟
015480      WHEN  32
015490         MOVE 15 TO 県統一ＷＫ
015500*富山
015510      WHEN  33
015520         MOVE 16 TO 県統一ＷＫ
015530*石川
015540      WHEN  34
015550         MOVE 17 TO 県統一ＷＫ
015560*福井
015570      WHEN  35
015580         MOVE 18 TO 県統一ＷＫ
015590*山梨
015600      WHEN  36
015610         MOVE 19 TO 県統一ＷＫ
015620*長野
015630      WHEN  37
015640         MOVE 20 TO 県統一ＷＫ
015650*岐阜
015660      WHEN  38
015670         MOVE 21 TO 県統一ＷＫ
015680*静岡
015690      WHEN  39
015700         MOVE 22 TO 県統一ＷＫ
015710*愛知
015720      WHEN  51
015730         MOVE 23 TO 県統一ＷＫ
015740*三重
015750      WHEN  52
015760         MOVE 24 TO 県統一ＷＫ
015770*滋賀
015780      WHEN  53
015790         MOVE 25 TO 県統一ＷＫ
015800*京都
015810      WHEN  54
015820         MOVE 26 TO 県統一ＷＫ
015830*大阪
015840      WHEN  41
015850         MOVE 27 TO 県統一ＷＫ
015860*兵庫
015870      WHEN  42
015880         MOVE 28 TO 県統一ＷＫ
015890*奈良
015900      WHEN  55
015910         MOVE 29 TO 県統一ＷＫ
015920*和歌山
015930      WHEN  56
015940         MOVE 30 TO 県統一ＷＫ
015950*鳥取
015960      WHEN  57
015970         MOVE 31 TO 県統一ＷＫ
015980*島根
015990      WHEN  58
016000         MOVE 32 TO 県統一ＷＫ
016010*岡山
016020      WHEN  59
016030         MOVE 33 TO 県統一ＷＫ
016040*広島
016050      WHEN  60
016060         MOVE 34 TO 県統一ＷＫ
016070*山口
016080      WHEN  61
016090         MOVE 35 TO 県統一ＷＫ
016100*徳島
016110      WHEN  71
016120         MOVE 36 TO 県統一ＷＫ
016130*香川
016140      WHEN  72
016150         MOVE 37 TO 県統一ＷＫ
016160*愛媛
016170      WHEN  73
016180         MOVE 38 TO 県統一ＷＫ
016190*高知
016200      WHEN  74
016210         MOVE 39 TO 県統一ＷＫ
016220*福岡
016230      WHEN  75
016240         MOVE 40 TO 県統一ＷＫ
016250*佐賀
016260      WHEN  76
016270         MOVE 41 TO 県統一ＷＫ
016280*長崎
016290      WHEN  77
016300         MOVE 42 TO 県統一ＷＫ
016310*熊本
016320      WHEN  78
016330         MOVE 43 TO 県統一ＷＫ
016340*大分
016350      WHEN  79
016360         MOVE 44 TO 県統一ＷＫ
016370*宮崎
016380      WHEN  80
016390         MOVE 45 TO 県統一ＷＫ
016400*鹿児島
016410      WHEN  81
016420         MOVE 46 TO 県統一ＷＫ
016430*沖縄
016440      WHEN  82
016450         MOVE 47 TO 県統一ＷＫ
016460*その他
016470      WHEN  OTHER
016480         CONTINUE
016490     END-EVALUATE.
016500*
016510*================================================================*
016520*================================================================*
016530 印刷順序セット SECTION.
016540*
016550**///  印刷順序の変更はこのSECTIONで   ////**
016560*
016570*************************************************************************
016580*  印刷順序:保険名称(保険種別コード)                                    *
016590*                                                                       *
016600*    10:社保(2)                                                         *
016610*    11:船員(7)                                                         *
016620*    12:日雇(6)                                                         *
016630*    50:国保(1)                                                         *
016640*    51:国保組合(1)                                                     *
016650*    52:退職(8)                                                         *
016660*    53:老人(5)                                                         *
016670*    60:４１老人(51)                                                    *
016680*    61:母子(52)                                                        *
016690*    62:乳幼児(55)                                                      *
016700*    63:障害(53)                                                        *
016710*    64:被爆(54)                                                        *
016720*    65:その他(60)                                                      *
016730*    80:組合(3)                                                         *
016740*    90:共済(4)                                                         *
016750*    91:自衛官(9)                                                       *
016760*                                                                       *
016770*   労災、自賠責、自費はのぞく                                          *
016780*                                                                       *
016790* ※ 国保系を 6号用紙でまとめて印字する為に、50番台とする。             *
016800* ※ 社保系を 6号用紙でまとめて印字する為に、10番台とする。             *
016810* ※ 共済、自衛官を 6号用紙でまとめて印字する為に、90番台とする。       *
016820*                                                                       *
016830**************************************************************************
016840*
016850*
016860      EVALUATE  保険種別Ｗ
016870* 国保
016880      WHEN  01
016890* 国保組合条件
016900            IF 保険者番号Ｗ(3:1) = "3"
016910                MOVE  51  TO  印刷順序Ｗ
016920            ELSE
016930                MOVE  50  TO  印刷順序Ｗ
016940            END-IF
016950* 社保
016960      WHEN  02
016970            MOVE  10  TO  印刷順序Ｗ
016980* 船員
016990      WHEN  07
017000*/船員を別に集計する/081020
017010*            MOVE  11  TO  印刷順序Ｗ
017020            MOVE  20  TO  印刷順序Ｗ
017030* 日雇
017040      WHEN  06
017050            MOVE  12  TO  印刷順序Ｗ
017060* 組合
017070      WHEN  03
017080            MOVE  80  TO  印刷順序Ｗ
017090* 共済
017100      WHEN  04
017110            MOVE  90  TO  印刷順序Ｗ
017120* 自衛官
017130      WHEN  09
017140            MOVE  91  TO  印刷順序Ｗ
017150* 老人
017160      WHEN  05
017170            MOVE  53  TO  印刷順序Ｗ
017180* 退職国保
017190      WHEN  08
017200            MOVE  52  TO  印刷順序Ｗ
017210* ４１老人
017220      WHEN  51
017230            MOVE  60  TO  印刷順序Ｗ
017240* 母子
017250      WHEN  52
017260            MOVE  61  TO  印刷順序Ｗ
017270* 乳幼児
017280      WHEN  55
017290            MOVE  62  TO  印刷順序Ｗ
017300* 障害
017310      WHEN  53
017320            MOVE  63  TO  印刷順序Ｗ
017330* 被爆
017340      WHEN  54
017350            MOVE  64  TO  印刷順序Ｗ
017360* その他
017370      WHEN  60
017380            MOVE  65  TO  印刷順序Ｗ
017390* 労災、自賠責・自費・生保単独は除外
017400      WHEN  70
017410      WHEN  80
017420      WHEN  90
017430      WHEN  ZERO
017440         CONTINUE
017450*
017460     WHEN OTHER
017470         MOVE SPACE                TO エラーメッセージＷ
017480         MOVE 作１－患者コード     TO エラー患者コードＷ
017490         MOVE 保険種別Ｗ           TO エラー保険種別Ｗ
017500         MOVE "-"                  TO エラー区切りＷ
017510         MOVE  NC"印刷順序が異常です。患者－保険種別" TO 連メ３－メッセージ
017520         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
017530         CALL   "MSG003"
017540         CANCEL "MSG003"
017550     END-EVALUATE.
017560*
017570*================================================================*
017580*================================================================*
017590 助成レセ判定 SECTION.
017600* 特別処理（助成レセまとめ）
017610     MOVE SPACE TO 助成レセまとめフラグ.
017620*
017630     IF 受－助成種別 NOT = ZERO  
017640*/後期高齢を追加/111007
017650            IF ( 受－保険種別 = 01 OR 08 OR 05)
017660                PERFORM 助成レセまとめ判定
017670            END-IF
017680     END-IF.
017690*
017700*================================================================*
017710*================================================================*
017720 助成レセまとめ判定 SECTION.
018100* 特別処理（助成レセまとめ）
018101     MOVE SPACE TO 助成レセまとめフラグ.
018114*
018115     IF ( レセ－本体まとめ区分 = 1 )
018116           MOVE "YES" TO 助成レセまとめフラグ
018117     END-IF.
018118*
018120*================================================================*
018121*================================================================*
018130 例外処理  SECTION.
018140*
018150* 印刷対象の例外の定義
018160*
018170* ①中部柔整 27 → 社保(02,06,07)、組合(03)、共済(04,09)、
018180*                　国保(中央建設133264,全国土木133033) は返戻分を除く
018190*
018200*      IF 協会コードＷ = 27
018210*          IF ( 受－請求区分 = 2 ) AND ( 受－公費種別  = ZERO  )
018220*             IF  ( 受－保険種別  = 02 OR 03 OR 04 OR 06 OR 07 OR 09 ) OR
018230*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133264")) OR
018240*                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133033")) 
018250*                  MOVE SPACE  TO  作成フラグ
018260*             END-IF
018270*          END-IF
018280*      END-IF.
018290
018300* 生活保護は除く
018310     IF 受－助成種別 = 50
018320         MOVE SPACE  TO  作成フラグ
018330     END-IF.
018340
018350*
018360*================================================================*
018370*================================================================*
018380 後高代表番号セット SECTION.
018390*
018400     EVALUATE 後高代表番号Ｗ(3:2)
018410     WHEN "01"
018420         MOVE "39010004" TO 後高代表番号Ｗ
018430     WHEN "02"
018440         MOVE "39020003" TO 後高代表番号Ｗ
018450     WHEN "03"
018460         MOVE "39030002" TO 後高代表番号Ｗ
018470     WHEN "04"
018480         MOVE "39040001" TO 後高代表番号Ｗ
018490     WHEN "05"
018500         MOVE "39050000" TO 後高代表番号Ｗ
018510     WHEN "06"
018520         MOVE "39060009" TO 後高代表番号Ｗ
018530     WHEN "07"
018540         MOVE "39070008" TO 後高代表番号Ｗ
018550     WHEN "08"
018560         MOVE "39080007" TO 後高代表番号Ｗ
018570     WHEN "09"
018580         MOVE "39090006" TO 後高代表番号Ｗ
018590     WHEN "10"
018600         MOVE "39100003" TO 後高代表番号Ｗ
018610     WHEN "11"
018620         MOVE "39110002" TO 後高代表番号Ｗ
018630     WHEN "12"
018640         MOVE "39120001" TO 後高代表番号Ｗ
018650     WHEN "13"
018660         MOVE "39130000" TO 後高代表番号Ｗ
018670     WHEN "14"
018680         MOVE "39140009" TO 後高代表番号Ｗ
018690     WHEN "15"
018700         MOVE "39150008" TO 後高代表番号Ｗ
018710     WHEN "16"
018720         MOVE "39160007" TO 後高代表番号Ｗ
018730     WHEN "17"
018740         MOVE "39170006" TO 後高代表番号Ｗ
018750     WHEN "18"
018760         MOVE "39180005" TO 後高代表番号Ｗ
018770     WHEN "19"
018780         MOVE "39190004" TO 後高代表番号Ｗ
018790     WHEN "20"
018800         MOVE "39200001" TO 後高代表番号Ｗ
018810     WHEN "21"
018820         MOVE "39210000" TO 後高代表番号Ｗ
018830     WHEN "22"
018840         MOVE "39220009" TO 後高代表番号Ｗ
018850     WHEN "23"
018860         MOVE "39230008" TO 後高代表番号Ｗ
018870     WHEN "24"
018880         MOVE "39240007" TO 後高代表番号Ｗ
018890     WHEN "25"
018900         MOVE "39250006" TO 後高代表番号Ｗ
018910     WHEN "26"
018920         MOVE "39260008" TO 後高代表番号Ｗ
018930     WHEN "27"
018940         MOVE "39270004" TO 後高代表番号Ｗ
018950     WHEN "28"
018960         MOVE "39280003" TO 後高代表番号Ｗ
018970     WHEN "29"
018980         MOVE "39290002" TO 後高代表番号Ｗ
018990     WHEN "30"
019000         MOVE "39300009" TO 後高代表番号Ｗ
019010     WHEN "31"
019020         MOVE "39310008" TO 後高代表番号Ｗ
019030     WHEN "32"
019040         MOVE "39320007" TO 後高代表番号Ｗ
019050     WHEN "33"
019060         MOVE "39330006" TO 後高代表番号Ｗ
019070     WHEN "34"
019080         MOVE "39340005" TO 後高代表番号Ｗ
019090     WHEN "35"
019100         MOVE "39350004" TO 後高代表番号Ｗ
019110     WHEN "36"
019120         MOVE "39360003" TO 後高代表番号Ｗ
019130     WHEN "37"
019140         MOVE "39370002" TO 後高代表番号Ｗ
019150     WHEN "38"
019160         MOVE "39380001" TO 後高代表番号Ｗ
019170     WHEN "39"
019180         MOVE "39390000" TO 後高代表番号Ｗ
019190     WHEN "40"
019200         MOVE "39400007" TO 後高代表番号Ｗ
019210     WHEN "41"
019220         MOVE "39410006" TO 後高代表番号Ｗ
019230     WHEN "42"
019240         MOVE "39420005" TO 後高代表番号Ｗ
019250     WHEN "43"
019260         MOVE "39430004" TO 後高代表番号Ｗ
019270     WHEN "44"
019280         MOVE "39440003" TO 後高代表番号Ｗ
019290     WHEN "45"
019300         MOVE "39450002" TO 後高代表番号Ｗ
019310     WHEN "46"
019320         MOVE "39460001" TO 後高代表番号Ｗ
019330     WHEN "47"
019340         MOVE "39470000" TO 後高代表番号Ｗ
019350     END-EVALUATE.
019360*================================================================*
019370******************************************************************
019380 END PROGRAM YJK431.
019390******************************************************************
