000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK434.
000060 AUTHOR.                 岡田　憲和
000070*
000080*----------------------------------------------------------------*
000090*  日本柔整共済会用 6,7号請求書指定【ﾃﾞｰﾀ作成】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100*         MED = YJK433G
000110*
      */同じ保険者のデータが２件に分かれる↓↓↓/150801
      */後期の対象から助成レコードを除く/160904
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-09-06
000140 DATE-COMPILED.          2012-09-06
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  制－制御区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000330     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS 受－施術和暦年月
000370                                                         受－患者コード
000380                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000390                                                         受－患者カナ
000400                                                         受－患者コード
000410                             ALTERNATE RECORD KEY     IS 受－患者コード
000420                                                         受－施術和暦年月
000430                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000440                                                         受－保険種別
000450                                                         受－保険者番号
000460                                                         受－患者コード
000470                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000480                                                         受－公費種別
000490                                                         受－費用負担者番号
000500                                                         受－患者コード
000510                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000520                                                         受－助成種別
000530                                                         受－費用負担者番号助成
000540                                                         受－患者コード
000550                             ALTERNATE RECORD KEY     IS 受－請求和暦年月
000560                                                         受－施術和暦年月
000570                                                         受－患者コード
000580                             FILE STATUS              IS  状態キー
000590                             LOCK        MODE         IS  AUTOMATIC.
000600     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000610                             ORGANIZATION             IS  INDEXED
000620                             ACCESS MODE              IS  DYNAMIC
000630                             RECORD KEY               IS  請先－保険種別
000640                                                          請先－保険者番号
000650                             FILE STATUS              IS  状態キー
000660                             LOCK    MODE             IS  AUTOMATIC.
000670     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000680                             ORGANIZATION             IS  INDEXED
000690                             ACCESS MODE              IS  DYNAMIC
000700                             RECORD KEY               IS  レセ－施術和暦年月
000710                                                          レセ－患者コード
000720                                                          レセ－レセ種別
000730                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000740                                                          レセ－施術和暦年月
000750                                                          レセ－レセ種別
000760                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000770                                                          レセ－施術和暦年月
000780                                                          レセ－患者コード
000790                                                          レセ－レセ種別
000800                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000810                                                          レセ－レセ種別
000820                                                          レセ－請求保険者番号
000830                                                          レセ－患者コード
000840                                                          レセ－施術和暦年月
000850                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000860                                                          レセ－請求保険者番号
000870                                                          レセ－患者コード
000880                                                          レセ－レセ種別
000890                                                          レセ－施術和暦年月
000900                             FILE STATUS              IS  状態キー
000910                             LOCK        MODE         IS  AUTOMATIC.
000920     SELECT  作業受診者ファイル  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4341L.DAT"
000930                             ORGANIZATION             IS  INDEXED
000940                             ACCESS                   IS  DYNAMIC
000950                             RECORD      KEY          IS  作受－請求和暦年月
000960                                                          作受－施術和暦年月
000970                                                          作受－患者コード
000980                                                          作受－助成種別
000990                             ALTERNATE RECORD KEY     IS  作受－請求和暦年月
001000                                                          作受－保険種別
001010                                                          作受－保険者番号
001020                                                          作受－助成種別
001030                                                          作受－患者コード
001040                                                          作受－施術和暦年月
001050                             ALTERNATE RECORD KEY     IS  作受－請求和暦年月
001060                                                          作受－公費種別
001070                                                          作受－費用負担者番号
001080                                                          作受－助成種別
001090                                                          作受－患者コード
001100                                                          作受－施術和暦年月
001110                             ALTERNATE RECORD KEY     IS  作受－請求和暦年月
001120                                                          作受－助成種別
001130                                                          作受－費用負担者番号助成
001140                                                          作受－患者コード
001150                                                          作受－施術和暦年月
001160                             FILE        STATUS       IS  状態キー
001170                             LOCK        MODE         IS  AUTOMATIC.
001180*
001190     SELECT  作業請求先マスタ    ASSIGN      TO     "C:\MAKISHISYS\YAWOBJ\TEMP\W4342L.DAT"
001200                             ORGANIZATION             IS  INDEXED
001210                             ACCESS MODE              IS  DYNAMIC
001220                             RECORD KEY               IS  作請先－請求先市町村
001230                                                          作請先－保険種別
001240                                                          作請先－保険者番号
001250                             FILE STATUS              IS  状態キー
001260                             LOCK    MODE             IS  AUTOMATIC.
001270*
001280*** 指定印刷 YJK432,433で使用した作業ファイル２を 作業ファイル３ の名前で使用する．
001290     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4322L.DAT"
001300                             ORGANIZATION             IS  INDEXED
001310                             ACCESS                   IS  DYNAMIC
001320                             RECORD      KEY          IS  作３－請求和暦年月
001330                                                          作３－保険種別
001340                                                          作３－保険者番号
001350                             ALTERNATE RECORD KEY     IS  作３－印刷区分
001360                                                          作３－請求和暦年月
001370                                                          作３－保険種別
001380                                                          作３－保険者番号
001390                             FILE        STATUS       IS  状態キー
001400                             LOCK        MODE         IS  AUTOMATIC.
001410*
001420     SELECT  作業ファイル４  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4343L.DAT"
001430                             ORGANIZATION             IS  INDEXED
001440                             ACCESS                   IS  DYNAMIC
001450                             RECORD      KEY          IS  作４－請求和暦年月
001460                                                          作４－保険種別
001470                                                          作４－保険者番号
001480                             FILE        STATUS       IS  状態キー
001490                             LOCK        MODE         IS  AUTOMATIC.
001500***
001510*** 作業ファイル４から、一括印刷のデータ作成(YJK431S)と同じ作業ファイル１，２を作成する。
001520     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
001530                             ORGANIZATION             IS  INDEXED
001540                             ACCESS                   IS  DYNAMIC
001550                             RECORD      KEY          IS  作１－請求和暦年月
001560                                                          作１－保険種別
001570                                                          作１－保険者番号
001580                                                          作１－記号
001590                                                          作１－番号
001600                                                          作１－被保険者カナ
001610                                                          作１－患者コード
001620                                                          作１－施術和暦年月
001630                             FILE        STATUS       IS  状態キー
001640                             LOCK        MODE         IS  AUTOMATIC.
001650     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4312L.DAT"
001660                             ORGANIZATION             IS  INDEXED
001670                             ACCESS                   IS  DYNAMIC
001680                             RECORD      KEY          IS  作２－請求和暦年月
001690                                                          作２－保険種別
001700                                                          作２－保険者番号
001710                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001720                                                          作２－県
001730                                                          作２－印刷順序
001740                                                          作２－保険種別
001750                                                          作２－保険者番号
001760                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001770                                                          作２－印刷順序
001780                                                          作２－保険種別
001790                                                          作２－保険者番号
001800*/県別、社保日雇いをまとめ、船員を別に集計/081021
001810                             ALTERNATE RECORD KEY     IS  作２－請求和暦年月
001820                                                          作２－県２
001830                                                          作２－印刷順序
001840                                                          作２－保険種別
001850                                                          作２－保険者番号
001860                             FILE        STATUS       IS  状態キー
001870                             LOCK        MODE         IS  AUTOMATIC.
001880******************************************************************
001890*                      DATA DIVISION                             *
001900******************************************************************
001910 DATA                    DIVISION.
001920 FILE                    SECTION.
001930*                           ［ＲＬ＝  ２５６］
001940 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001950     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001960*                           ［ＲＬ＝  ３２０］
001970 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001980     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001990*                           ［ＲＬ＝  １２８］
002000 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
002010     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
002020*
002030 FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
002040     COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
002050*
002060 FD  作業受診者ファイル   BLOCK   CONTAINS   1   RECORDS.
002070     COPY JUSINJ          OF  XFDLIB  JOINING   作受 AS  PREFIX.
002080*                           ［ＲＬ＝  １２８］
002090 FD  作業請求先マスタ      BLOCK   CONTAINS   1   RECORDS.
002100     COPY SEIKYUS         OF  XFDLIB  JOINING   作請先   AS  PREFIX.
002110*
002120*                           ［ＲＬ＝  ６４］
002130 FD  作業ファイル３ RECORD  CONTAINS 64 CHARACTERS.
002140 01  作３－レコード.
002150     03  作３－レコードキー.
002160         05  作３－請求和暦年月.
002170             07  作３－請求和暦              PIC 9.
002180             07  作３－請求年                PIC 9(2).
002190             07  作３－請求月                PIC 9(2).
002200         05  作３－保険種別                  PIC 9(2).
002210         05  作３－保険者番号                PIC X(10).
002220         05  作３－印刷区分                  PIC 9.
002230     03  作３－レコードデータ.
002240         05  作３－保険者番号２              PIC X(10).
002250         05  作３－件数                      PIC 9(4).
002260         05  作３－費用額                    PIC 9(9).
002270         05  作３－負担額                    PIC 9(9).
002280         05  作３－請求額                    PIC 9(9).
002290         05  FILLER                          PIC X(5).
002300*
002310*                           ［ＲＬ＝  ６４］
002320 FD  作業ファイル４ RECORD  CONTAINS 64 CHARACTERS.
002330 01  作４－レコード.
002340     03  作４－レコードキー.
002350         05  作４－請求和暦年月.
002360             07  作４－請求和暦              PIC 9.
002370             07  作４－請求年                PIC 9(2).
002380             07  作４－請求月                PIC 9(2).
002390         05  作４－保険種別                  PIC 9(2).
002400         05  作４－保険者番号                PIC X(10).
002410         05  作４－印刷区分                  PIC 9.
002420     03  作４－レコードデータ.
002430         05  作４－保険者番号２              PIC X(10).
002440         05  作４－件数                      PIC 9(4).
002450         05  作４－費用額                    PIC 9(9).
002460         05  作４－負担額                    PIC 9(9).
002470         05  作４－請求額                    PIC 9(9).
002480         05  FILLER                          PIC X(5).
002490***
002500*
002510 FD  作業ファイル１ RECORD  CONTAINS 288 CHARACTERS.
002520 01  作１－レコード.
002530     03  作１－レコードキー.
002540         05  作１－請求和暦年月.
002550             07  作１－請求和暦              PIC 9.
002560             07  作１－請求年                PIC 9(2).
002570             07  作１－請求月                PIC 9(2).
002580         05  作１－保険種別                  PIC 9(2).
002590         05  作１－保険者番号                PIC X(10).
002600         05  作１－記号                      PIC X(24).
002610         05  作１－番号                      PIC X(30).
002620         05  作１－被保険者カナ              PIC X(50).
002630         05  作１－患者コード.
002640             07 作１－患者番号               PIC 9(6).
002650             07 作１－枝番                   PIC X(1).
002660         05  作１－施術和暦年月.
002670             07  作１－施術和暦              PIC 9.
002680             07  作１－施術年                PIC 9(2).
002690             07  作１－施術月                PIC 9(2).
002700     03  作１－レコードデータ.
002710         05  作１－被保険者氏名              PIC X(50).
002720         05  作１－患者氏名                  PIC X(50).
002730         05  作１－保険者番号２              PIC X(10).
002740         05  作１－費用額                    PIC 9(7).
002750         05  作１－負担額                    PIC 9(7).
002760         05  作１－請求額                    PIC 9(7).
002770         05  作１－本人家族区分              PIC 9.
002780         05  作１－県                        PIC X(2).
002790         05  FILLER                          PIC X(21).
002800*                           ［ＲＬ＝  １２８］
002810 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
002820 01  作２－レコード.
002830     03  作２－レコードキー.
002840         05  作２－請求和暦年月.
002850             07  作２－請求和暦              PIC 9.
002860             07  作２－請求年                PIC 9(2).
002870             07  作２－請求月                PIC 9(2).
002880         05  作２－保険種別                  PIC 9(2).
002890         05  作２－保険者番号                PIC X(10).
002900         05  作２－県                        PIC X(2).
002910         05  作２－印刷順序.
002920             07  作２－印刷順序１            PIC 9(2).
002930             07  作２－印刷順序２            PIC 9.
002940     03  作２－レコードデータ.
002950         05  作２－保険者番号２              PIC X(10).
002960         05  作２－件数                      PIC 9(4).
002970         05  作２－費用額                    PIC 9(9).
002980         05  作２－負担額                    PIC 9(9).
002990         05  作２－請求額                    PIC 9(9).
003000         05  作２－本人件数                  PIC 9(3).
003010         05  作２－本人費用額                PIC 9(7).
003020         05  作２－本人負担額                PIC 9(7).
003030         05  作２－本人請求額                PIC 9(7).
003040         05  作２－家族件数                  PIC 9(3).
003050         05  作２－家族費用額                PIC 9(7).
003060         05  作２－家族負担額                PIC 9(7).
003070         05  作２－家族請求額                PIC 9(7).
003080         05  作２－県２                      PIC X(2).
003090         05  FILLER                          PIC X(15).
003100*         05  FILLER                          PIC X(17).
003110*----------------------------------------------------------------*
003120*----------------------------------------------------------------*
003130******************************************************************
003140*                WORKING-STORAGE SECTION                         *
003150******************************************************************
003160 WORKING-STORAGE         SECTION.
003170 01 キー入力                           PIC X     VALUE SPACE.
003180 01 状態キー                           PIC X(2)  VALUE SPACE.
003190 01 終了フラグ                         PIC X(3)  VALUE SPACE.
003200 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
003210 01 終了フラグ３                       PIC X(3)  VALUE SPACE.
003220 01 作成フラグ                         PIC X(3)  VALUE SPACE.
003230 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
003240 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
003250*
003260 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
003270 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
003280 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
003290 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
003300 01 請求和暦年月ＷＲ.
003310    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
003320    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
003330    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
003340*
003350 01 請求年月Ｗ.
003360    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
003370    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
003380    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
003390 01 施術年月Ｗ.
003400    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
003410    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
003420    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
003430 01 集計作業用Ｗ.
003440    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
003450    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
003460    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
003470    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
003480    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
003490    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
003500 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
003510 01 ファイル名                         PIC N(2)  VALUE SPACE.
003520 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
003530 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
003540 01 保険者番号２Ｗ                     PIC X(10) VALUE SPACE.
003550 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
003560* エラーメッセージ用
003570 01 エラーメッセージＷ.
003580    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
003590    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
003600    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
003610    03 FILLER                          PIC X(10) VALUE SPACE.
003620*
003630* 本人/家族集計用
003640 01 本人家族集計用Ｗ.
003650    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
003660    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
003670    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
003680    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
003690    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
003700    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
003710    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
003720    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
003730*
003740* 県内県外用
003750 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
003760 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
003770 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
003780 01 県内県外チェック                   PIC 9     VALUE ZERO.
003790 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
003800 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
003810 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
003820 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
003830*
003840* 順序用
003850 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
003860 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
003870*
003880** 助成レセまとめ用
003890 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
003900*
003910* 例外用
003920 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
003930*
003940 01 後高代表番号Ｗ                     PIC X(10) VALUE SPACE.
003950*
003960 01 複合プログラム名Ｗ               PIC X(8) VALUE "MOJI2".
003970*
003980******************************************************************
003990*                          連結項目                              *
004000******************************************************************
004010*
004020****************
004030* 画面入力情報 *
004040****************
004050**
004060 01 連入－画面情報ＹＪＫ４３０   IS EXTERNAL.
004070    03 連入－請求年月.
004080       05 連入－請求和暦               PIC 9.
004090       05 連入－請求年                 PIC 9(2).
004100       05 連入－請求月                 PIC 9(2).
004110    03 連入－提出年月日.
004120       05 連入－提出和暦               PIC 9.
004130       05 連入－提出年                 PIC 9(2).
004140       05 連入－提出月                 PIC 9(2).
004150       05 連入－提出日                 PIC 9(2).
004160    03 連入－レセプト種類              PIC X(4).
004170    03 連入－保険種別                  PIC 9(2).
004180    03 連入－印刷種類                  PIC 9.
004190    03 連入－本人家族                  PIC 9.
004200    03 連入－用紙種類                  PIC 9.
004210    03 連入－県内県外                  PIC 9.
004220    03 連入－県ＪＩＳ                  PIC X(2).
004230    03 連入－政管ＪＩＳ                PIC X(2).
004240*
004250********************
004260* メッセージ表示キー *
004270********************
004280 01 連メ３－キー IS EXTERNAL.
004290    03  連メ３－メッセージ             PIC N(20).
004300    03  連メ３－メッセージ１           PIC X(20).
004310*
004320************************
004330* 助成レセまとめ
004340************************
004350 01 連レセまとめ－キー IS EXTERNAL.
004360    03 連レセまとめ－施術和暦年月.
004370       05 連レセまとめ－施術和暦               PIC 9.
004380       05 連レセまとめ－施術年月.
004390          07 連レセまとめ－施術年              PIC 9(2).
004400          07 連レセまとめ－施術月              PIC 9(2).
004410    03 連レセまとめ－患者コード.
004420       05 連レセまとめ－患者番号               PIC 9(6).
004430       05 連レセまとめ－枝番                   PIC X(1).
004440**-------------------------------------------------------**
004450*   1:助成レセプトなしの本体まとめの判定
004460*   2:横浜・川崎用の社保助成レセかの判定
004470    03 連レセまとめ－判定区分                  PIC 9.
004480**-------------------------------------------------------**
004490*  / OUT /　 0:対象外、1:対象
004500    03 連レセまとめ－判定結果                  PIC 9.
004510**
004520*
004530 01 連保険者番号変換－キー IS EXTERNAL.
004540    03 連保険者番号変換－施術和暦年月.
004550       05 連保険者番号変換－施術和暦               PIC 9.
004560       05 連保険者番号変換－施術年月.
004570          07 連保険者番号変換－施術年              PIC 9(2).
004580          07 連保険者番号変換－施術月              PIC 9(2).
004590    03 連保険者番号変換－保険種別                  PIC 9(2).
004600    03 連保険者番号変換－元保険者番号              PIC X(10).
004610* 0:通常（施術年月関係なし）
004620    03 連保険者番号変換－呼出区分                  PIC 9(2).
004630*  / OUT /
004640    03 連保険者番号変換－後保険者番号              PIC X(10).
004650*
004660*
004670* 暗号複合用
004680 01 連暗号複合－暗号情報 IS EXTERNAL.
004690    03 連暗号複合－入力情報.
004700       05 連暗号複合－記号               PIC X(24).
004710       05 連暗号複合－番号               PIC X(30).
004720       05 連暗号複合－暗号化項目.
004730          07 連暗号複合－暗号患者番号    PIC X(6).
004740          07 連暗号複合－暗号判定記号    PIC X.
004750          07 連暗号複合－暗号判定番号    PIC X.
004760          07 連暗号複合－暗号記号        PIC X(24).
004770          07 連暗号複合－暗号番号        PIC X(30).
004780    03 連暗号複合－出力情報.
004790       05 連暗号複合－複合した記号       PIC X(24).
004800       05 連暗号複合－複合した番号       PIC X(30).
004810*
004820******************************************************************
004830*                      PROCEDURE  DIVISION                       *
004840******************************************************************
004850 PROCEDURE               DIVISION.
004860************
004870*           *
004880* 初期処理   *
004890*           *
004900************
004910     PERFORM ファイルオープン.
004920     PERFORM 連結項目待避.
004930     PERFORM 制御情報取得.
004940************
004950*           *
004960* 主処理     *
004970*           *
004980************
004990     PERFORM 作業請求先マスタ作成.
005000*     PERFORM 作業ファイル４作成.
005010     PERFORM 作業ファイル１作成.
005020     PERFORM 作業ファイル２作成.
005030************
005040*           *
005050* 終了処理   *
005060*           *
005070************
005080     PERFORM 終了処理.
005090     MOVE ZERO TO PROGRAM-STATUS.
005100     EXIT PROGRAM.
005110*
005120*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
005130*================================================================*
005140 連結項目待避 SECTION.
005150*
005160* 連結項目の待避
005170     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
005180     MOVE 連入－請求年        TO 請求年ＷＲ.
005190     MOVE 連入－請求月        TO 請求月ＷＲ.
005200     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
005210     MOVE 連入－保険種別      TO 保険種別ＷＲ.
005220     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
005230     MOVE 連入－県内県外      TO 県内県外ＷＲ.
005240     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
005250     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
005260*
005270*================================================================*
005280 ファイルオープン SECTION.
005290*
005300     OPEN INPUT 制御情報マスタ.
005310         MOVE NC"制御情報" TO ファイル名.
005320         PERFORM オープンチェック.
005330     OPEN INPUT 受診者情報Ｆ.
005340         MOVE NC"受診者情報Ｆ" TO ファイル名.
005350         PERFORM オープンチェック.
005360     OPEN INPUT 請求先マスタ.
005370         MOVE NC"請求先" TO ファイル名.
005380         PERFORM オープンチェック.
005390     OPEN INPUT レセプトＦ.
005400         MOVE NC"レセプトＦ" TO ファイル名.
005410         PERFORM オープンチェック.
005420*================================================================*
005430 オープンチェック SECTION.
005440*
005450     IF 状態キー  NOT =  "00"
005460         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
005470         DISPLAY NC"状態キー：" 状態キー         UPON CONS
005480         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005490                                                 UPON CONS
005500         ACCEPT  キー入力 FROM CONS
005510         PERFORM ファイル閉鎖
005520         MOVE 99 TO PROGRAM-STATUS
005530         EXIT PROGRAM.
005540*================================================================*
005550 制御情報取得 SECTION.
005560*
005570     MOVE ZEROS TO 制－制御区分.
005580     READ 制御情報マスタ
005590     NOT INVALID KEY
005600         MOVE 制－協会コード   TO 協会コードＷ
005610     END-READ.
005620*
005630*================================================================*
005640 エラー表示 SECTION.
005650*
005660     DISPLAY NC"状態キー" 状態キー  UPON CONS.
005670     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
005680     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005690     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
005700     ACCEPT  キー入力 FROM CONS.
005710     PERFORM ファイル閉鎖.
005720     MOVE 99 TO PROGRAM-STATUS.
005730     EXIT PROGRAM.
005740*================================================================*
005750 エラー表示Ｒ SECTION.
005760*
005770     DISPLAY NC"ファイル読込エラー" ファイル名     UPON CONS.
005780     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
005790     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
005800     ACCEPT  キー入力 FROM CONS.
005810     PERFORM ファイル閉鎖.
005820     MOVE 99 TO PROGRAM-STATUS.
005830     EXIT PROGRAM.
005840*================================================================*
005850 作業請求先マスタ作成 SECTION.
005860****************************************************************************
005870** 請求先マスタを作業ファイルへ出力する。（キー作成）
005880****************************************************************************
005890     OPEN OUTPUT 作業請求先マスタ.
005900         MOVE NC"作業請求先" TO ファイル名.
005910         PERFORM オープンチェック.
005920*
005930     MOVE SPACE  TO 終了フラグ.
005940     PERFORM 請求先マスタ読込.
005950     PERFORM UNTIL  終了フラグ = "YES"
005960*
005970        MOVE SPACE TO 作請先－レコード
005980        INITIALIZE 作請先－レコード
005990        MOVE 請先－レコード  TO  作請先－レコード
006000        WRITE 作請先－レコード
006010        INVALID KEY
006020           MOVE NC"作業請求先"  TO ファイル名
006030           PERFORM エラー表示
006040        END-WRITE
006050        PERFORM 請求先マスタ読込
006060     END-PERFORM.
006070*
006080     CLOSE 作業請求先マスタ.
006090*
006100*================================================================*
006110 請求先マスタ読込 SECTION.
006120*
006130     READ 請求先マスタ NEXT
006140     AT END
006150         MOVE "YES" TO 終了フラグ
006160     END-READ.
006170*================================================================*
006180 作業ファイル４作成 SECTION.
006190****************************************************************************
006200** 指定一覧画面YJK433より選択した保険者（作業ファイル３の印刷区分１のﾚｺｰﾄﾞ）
006210** を読んで、請求先同一で、保険者番号が違うﾃﾞｰﾀがある時、１レコードずつ書き出す。
006220****************************************************************************
006230     OPEN INPUT  作業ファイル３.
006240         MOVE NC"作３" TO ファイル名.
006250         PERFORM オープンチェック.
006260     OPEN OUTPUT 作業ファイル４.
006270         MOVE NC"作４" TO ファイル名.
006280         PERFORM オープンチェック.
006290     OPEN INPUT  作業請求先マスタ.
006300         MOVE NC"作業請求先" TO ファイル名.
006310         PERFORM オープンチェック.
006320*
006330**** 印刷対象レコードには、印刷区分=1
006340     MOVE  1             TO 作３－印刷区分.
006350     MOVE  ZERO          TO 作３－請求和暦.
006360     MOVE  ZERO          TO 作３－請求年.
006370     MOVE  ZERO          TO 作３－請求月.
006380     MOVE  ZERO          TO 作３－保険種別.
006390     MOVE  LOW-VALUE     TO 作３－保険者番号.
006400*
006410     START 作業ファイル３  KEY IS >=  作３－印刷区分
006420                                      作３－請求和暦年月
006430                                      作３－保険種別
006440                                      作３－保険者番号
006450     END-START.
006460*
006470     IF 状態キー = "00"
006480        MOVE SPACE  TO 終了フラグ
006490        PERFORM 作業ファイル３読込
006500        PERFORM UNTIL ( 終了フラグ = "YES" ) OR ( 作３－印刷区分 NOT = 1 )
006510*
006520             MOVE 作３－保険者番号   TO  作請先－請求先市町村
006530             MOVE  ZERO              TO  作請先－保険種別
006540             MOVE  LOW-VALUE         TO  作請先－保険者番号
006550             START 作業請求先マスタ  KEY IS >=  作請先－請求先市町村
006560                                                作請先－保険種別
006570                                                作請先－保険者番号
006580             END-START
006590             IF 状態キー = "00"
006600                 MOVE SPACE  TO 終了フラグ２
006610                 PERFORM 作業請求先マスタ読込
006620                 IF ( 終了フラグ２  = "YES" ) OR
006630                    ( 作請先－請求先市町村 NOT = 作３－保険者番号 )
006640                     MOVE SPACE TO 作４－レコード
006650                     INITIALIZE 作４－レコード
006660                     MOVE 作３－レコード  TO  作４－レコード
006670                     PERFORM 作業ファイル４書込
006680                 ELSE
006690                     PERFORM UNTIL ( 終了フラグ２ = "YES" ) OR
006700                                   ( 作請先－請求先市町村 NOT = 作３－保険者番号 )
006710                         MOVE SPACE TO 作４－レコード
006720                         INITIALIZE 作４－レコード
006730                         MOVE 作３－レコード      TO 作４－レコード
006740                         MOVE 作請先－保険種別    TO 作４－保険種別
006750                         MOVE 作請先－保険者番号  TO 作４－保険者番号
006760                         PERFORM 作業ファイル４書込
006770                         PERFORM 作業請求先マスタ読込
006780                     END-PERFORM
006790                 END-IF
006800             ELSE
006810                 MOVE SPACE TO 作４－レコード
006820                 INITIALIZE 作４－レコード
006830                 MOVE 作３－レコード  TO  作４－レコード
006840                 PERFORM 作業ファイル４書込
006850             END-IF
006860*
006870             PERFORM 作業ファイル３読込
006880        END-PERFORM
006890     END-IF.
006900*
006910     CLOSE 作業ファイル３ 作業ファイル４ 作業請求先マスタ.
006920*
006930*================================================================*
006940 作業ファイル３読込 SECTION.
006950*
006960     READ 作業ファイル３ NEXT
006970     AT END
006980         MOVE "YES" TO 終了フラグ
006990     END-READ.
007000*================================================================*
007010 作業請求先マスタ読込 SECTION.
007020*
007030     READ 作業請求先マスタ NEXT
007040     AT END
007050         MOVE "YES" TO 終了フラグ２
007060     END-READ.
007070*================================================================*
007080 作業ファイル４書込 SECTION.
007090*
007100     WRITE 作４－レコード
007110     INVALID KEY
007120         MOVE NC"作業４"  TO ファイル名
007130         PERFORM エラー表示
007140     END-WRITE.
007150*================================================================*
007160 作業ファイル１作成 SECTION.
007170****************************************************************************
007180** 作業ファイル３を読んで、該当保険者の受診者明細ファイル（作業ファイル１）
007190** を作成する。
007200****************************************************************************
007210*
007220     PERFORM 作業受診者ファイル作成.
007230*
007240     OPEN INPUT 作業受診者ファイル.
007250         MOVE NC"作受" TO ファイル名.
007260         PERFORM オープンチェック.
007270     OPEN OUTPUT 作業ファイル１.
007280         MOVE NC"作１" TO ファイル名.
007290         PERFORM オープンチェック.
007300     OPEN INPUT  作業ファイル３.
007310         MOVE NC"作３" TO ファイル名.
007320         PERFORM オープンチェック.
007330*
007340     MOVE SPACE  TO 終了フラグ.
007350     PERFORM 作業ファイル３読込.
007360     PERFORM UNTIL  終了フラグ = "YES"
007370*
007380        IF 作３－印刷区分 = 1
007390*
007400            EVALUATE 作３－保険種別
007410*        ***************************************************
007420*        * 国保・社保・組合・共済・日雇・船員・退職・自衛官
007430*        ***************************************************
007440              WHEN  01
007450              WHEN  02
007460              WHEN  03
007470              WHEN  04
007480              WHEN  06
007490              WHEN  07
007500              WHEN  08
007510              WHEN  09
007520                  PERFORM 作業ファイル１作成１
007530*        *************
007540*        * 老人 *
007550*        *************
007560              WHEN  05
007570                  PERFORM 作業ファイル１作成２
007580*        *************
007590*        * 助成 *
007600*        *************
007610              WHEN  50 THRU 60
007620                  PERFORM 作業ファイル１作成３
007630* 上記以外（労災・自賠責はﾃﾞｰﾀ作成 YJK431,432の対象外の為、ここにはこない）
007640              WHEN OTHER
007650                 MOVE SPACE                TO エラーメッセージＷ
007660                 MOVE 作３－保険種別       TO エラー保険種別Ｗ
007670                 MOVE  NC"保険種別が異常です。保険種別" TO 連メ３－メッセージ
007680                 MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
007690                 CALL   "MSG003"
007700                 CANCEL "MSG003"
007710            END-EVALUATE
007720*
007730        END-IF
007740            PERFORM 作業ファイル３読込
007750     END-PERFORM.
007760*
007770     CLOSE 作業ファイル３ 作業ファイル１ 作業受診者ファイル.
007780*
007790*================================================================*
007800 作業受診者ファイル作成  SECTION.
007810*
007820** 受診者情報Ｆから、請求年月のデータのみを抽出し、作業ファイルに書き出す.
007830*
007840     OPEN OUTPUT 作業受診者ファイル.
007850         MOVE NC"作受" TO ファイル名.
007860         PERFORM オープンチェック.
007870*
007880     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
007890     MOVE 請求年ＷＲ    TO レセ－請求年.
007900     MOVE 請求月ＷＲ    TO レセ－請求月.
007910     MOVE ZERO          TO レセ－レセ種別.
007920     MOVE ZERO          TO レセ－施術和暦.
007930     MOVE ZERO          TO レセ－施術年.
007940     MOVE ZERO          TO レセ－施術月.
007950     MOVE ZERO          TO レセ－患者番号.
007960     MOVE SPACE         TO レセ－枝番.
007970     START レセプトＦ   KEY IS >= レセ－請求和暦年月
007980                                  レセ－施術和暦年月
007990                                  レセ－患者コード
008000                                  レセ－レセ種別
008010     END-START.
008020     IF 状態キー = "00"
008030         MOVE SPACE  TO 終了フラグ
008040         PERFORM レセプトＦ読込
008050
008060         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008070                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
008080                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
008090                       ( レセ－請求月   NOT = 請求月ＷＲ   )
008100             PERFORM データチェック
008110             IF 実行キーＷ = "YES"
008120*
008130                 MOVE SPACE TO 作受－レコード
008140                 INITIALIZE    作受－レコード
008150                 MOVE 受－レコード  TO  作受－レコード
008160                 IF レセ－レセ種別 = 1 OR 2
008170                    MOVE ZERO      TO 作受－助成種別
008180                 END-IF
008190*                受診者の請求区分/請求和暦年月は未セットなのでレセ値をセットする
008191                 MOVE レセ－請求区分     TO 作受－請求区分
008200                 MOVE レセ－請求和暦年月 TO 作受－請求和暦年月
008210                 WRITE 作受－レコード
008220                 INVALID KEY
008230                    MOVE NC"作受作成"  TO ファイル名
008240                 PERFORM エラー表示
008250                 END-WRITE
008260*
008270             END-IF
008280             PERFORM レセプトＦ読込
008290         END-PERFORM
008300     END-IF.
008310*
008320     CLOSE 作業受診者ファイル.
008330*
008340*================================================================*
008350 作業ファイル４読込 SECTION.
008360*
008370     READ 作業ファイル４ NEXT
008380     AT END
008390         MOVE "YES" TO 終了フラグ
008400     END-READ.
008410*================================================================*
008420 作業ファイル１作成１ SECTION.
008430*
008440****************************************************
008450* 国保・社保・組合・共済・日雇・船員・退職・自衛官
008460****************************************************
008470     MOVE 作３－請求和暦    TO 作受－請求和暦.
008480     MOVE 作３－請求年      TO 作受－請求年.
008490     MOVE 作３－請求月      TO 作受－請求月.
008500     MOVE 作３－保険種別    TO 作受－保険種別.
008510     MOVE 作３－保険者番号  TO 作受－保険者番号.
008520     MOVE ZERO              TO 作受－患者番号.
008530     MOVE LOW-VALUE         TO 作受－枝番.
008540     MOVE 1                 TO 作受－施術和暦.
008550     MOVE ZERO              TO 作受－施術年.
008560     MOVE ZERO              TO 作受－施術月.
008570     MOVE ZERO              TO 作受－助成種別.
008580     START 作業受診者ファイル  KEY IS >= 作受－請求和暦年月
008590                                         作受－保険種別
008600                                         作受－保険者番号
008610                                         作受－助成種別
008620                                         作受－患者コード
008630                                         作受－施術和暦年月
008640     END-START.
008650     IF 状態キー = "00"
008660         MOVE SPACE  TO 終了フラグ３
008670         PERFORM 作業受診者ファイル読込
008680         PERFORM UNTIL ( 終了フラグ３         = "YES" ) OR
008690                       ( 作受－請求和暦   NOT = 作３－請求和暦 ) OR
008700                       ( 作受－請求年     NOT = 作３－請求年   ) OR
008710                       ( 作受－請求月     NOT = 作３－請求月   ) OR
008720                       ( 作受－保険種別   NOT = 作３－保険種別 ) OR
008730                       ( 作受－保険者番号 NOT = 作３－保険者番号 ) OR
008740                       ( 作受－助成種別   NOT = ZERO )
008750*
008760** 本人家族区分ありか
008770             MOVE SPACE  TO  作成フラグ
008780             IF 本人家族区分ＷＲ NOT = ZERO
008790                IF 本人家族区分ＷＲ = 受－本人家族区分
008800                    MOVE "YES"  TO  作成フラグ
008810                END-IF
008820             ELSE
008830                MOVE "YES"  TO  作成フラグ
008840             END-IF
008850** 県内県外か
008860             IF 作成フラグ  = "YES"
008870                     MOVE SPACE  TO  作成フラグ
008880                     MOVE 受－保険種別 TO 保険種別県用ＷＫ
008890                     PERFORM 県内県外取得
008900*                   (県内1、県外2、両方0)
008910                     IF 県内県外ＷＲ NOT = ZERO
008920                        IF 県内県外ＷＲ = 1
008930                           IF 県内県外チェック = 1
008940                              MOVE "YES"  TO  作成フラグ
008950                           END-IF
008960                        ELSE
008970                           IF 県内県外チェック = ZERO
008980                              MOVE "YES"  TO  作成フラグ
008990                           END-IF
009000                        END-IF
009010                     ELSE
009020                        MOVE "YES"  TO  作成フラグ
009030                     END-IF
009040             END-IF
009050*
009060*           / 例外除く /
009070             PERFORM 例外処理
009080*
009090             IF 作成フラグ  = "YES"
009100**  老人含まず
009110                IF ( 受－公費種別       = ZERO  ) AND
009120                   ( 受－費用負担者番号 = SPACE )
009130                     MOVE SPACE TO 作１－レコード
009140                     INITIALIZE 作１－レコード
009150                     MOVE 受－保険種別    TO 作１－保険種別
009160                     MOVE 受－保険者番号  TO 作１－保険者番号
009170                     PERFORM レコードセット
009180                     PERFORM 健保料金計算
009190                     PERFORM ファイル書込
009200                END-IF
009210             END-IF
009220             PERFORM 作業受診者ファイル読込
009230         END-PERFORM
009240     END-IF.
009250*================================================================*
009260 作業ファイル１作成２ SECTION.
009270*
009280**********************************
009290*  老人
009300**********************************
009310     MOVE 作３－請求和暦    TO 作受－請求和暦.
009320     MOVE 作３－請求年      TO 作受－請求年.
009330     MOVE 作３－請求月      TO 作受－請求月.
009340     MOVE 作３－保険種別    TO 作受－公費種別.
009350     MOVE 作３－保険者番号  TO 作受－費用負担者番号.
009360     MOVE ZERO              TO 作受－患者番号.
009370     MOVE LOW-VALUE         TO 作受－枝番.
009380     MOVE 1                 TO 作受－施術和暦.
009390     MOVE ZERO              TO 作受－施術年.
009400     MOVE ZERO              TO 作受－施術月.
009410     MOVE ZERO              TO 作受－助成種別.
009420     START 作業受診者ファイル  KEY IS >= 作受－請求和暦年月
009430                                         作受－公費種別
009440                                         作受－費用負担者番号
009450                                         作受－助成種別
009460                                         作受－患者コード
009470                                         作受－施術和暦年月
009480     END-START.
009490     IF 状態キー = "00"
009500         MOVE SPACE  TO 終了フラグ３
009510         PERFORM 作業受診者ファイル読込
009520         PERFORM UNTIL ( 終了フラグ３         = "YES" ) OR
009530                       ( 作受－請求和暦   NOT = 作３－請求和暦 ) OR
009540                       ( 作受－請求年     NOT = 作３－請求年   ) OR
009550                       ( 作受－請求月     NOT = 作３－請求月   ) OR
009560                       ( 作受－公費種別   NOT = 作３－保険種別 ) OR
009570                       ( 作受－費用負担者番号 NOT = 作３－保険者番号 )
      */後期の対象から助成レコードを除く/160904
                          OR ( 作受－助成種別   NOT = ZERO )
009580*
009590             IF ( 受－公費種別       NOT = ZERO ) AND
009600                ( 受－費用負担者番号 NOT = SPACE )
009610** 本人家族区分ありか
009620                  MOVE SPACE  TO  作成フラグ
009630                  IF 本人家族区分ＷＲ NOT = ZERO
009640                     IF 本人家族区分ＷＲ = 受－本人家族区分
009650                         MOVE "YES"  TO  作成フラグ
009660                     END-IF
009670                  ELSE
009680                     MOVE "YES"  TO  作成フラグ
009690                  END-IF
009700** 県内県外か
009710                  IF 作成フラグ  = "YES"
009720                     MOVE SPACE  TO  作成フラグ
009730                     MOVE 受－公費種別 TO 保険種別県用ＷＫ
009740                     PERFORM 県内県外取得
009750*                   (県内1、県外2、両方0)
009760                     IF 県内県外ＷＲ NOT = ZERO
009770                        IF 県内県外ＷＲ = 1
009780                           IF 県内県外チェック = 1
009790                              MOVE "YES"  TO  作成フラグ
009800                           END-IF
009810                        ELSE
009820                           IF 県内県外チェック = ZERO
009830                              MOVE "YES"  TO  作成フラグ
009840                           END-IF
009850                        END-IF
009860                     ELSE
009870                        MOVE "YES"  TO  作成フラグ
009880                     END-IF
009890                  END-IF
009900*
009910                  IF 作成フラグ  = "YES"
009920                       MOVE SPACE TO 作１－レコード
009930                       INITIALIZE 作１－レコード
009940                       MOVE 受－公費種別           TO 作１－保険種別
009950                       MOVE 受－費用負担者番号     TO 作１－保険者番号
009960                       PERFORM レコードセット
009970                       PERFORM 老人料金計算
009980* 請求額が ZERO の時は、書き込まない。
009990                       IF  作１－請求額 NOT = ZERO
010000                           PERFORM ファイル書込
010010                       END-IF
010020                  END-IF
010030             END-IF
010040             PERFORM 作業受診者ファイル読込
010050         END-PERFORM
010060     END-IF.
010070*================================================================*
010080 作業ファイル１作成３ SECTION.
010090*
010100**********************************
010110*  助成
010120**********************************
010130     MOVE 作３－請求和暦    TO 作受－請求和暦.
010140     MOVE 作３－請求年      TO 作受－請求年.
010150     MOVE 作３－請求月      TO 作受－請求月.
010160     MOVE 作３－保険種別    TO 作受－助成種別.
010170     MOVE 作３－保険者番号  TO 作受－費用負担者番号助成.
010180     MOVE ZERO              TO 作受－患者番号.
010190     MOVE LOW-VALUE         TO 作受－枝番.
010200     MOVE 1                 TO 作受－施術和暦.
010210     MOVE ZERO              TO 作受－施術年.
010220     MOVE ZERO              TO 作受－施術月.
010230     START 作業受診者ファイル  KEY IS >= 作受－請求和暦年月
010240                                         作受－助成種別
010250                                         作受－費用負担者番号助成
010260                                         作受－患者コード
010270                                         作受－施術和暦年月
010280     END-START.
010290     IF 状態キー = "00"
010300         MOVE SPACE  TO 終了フラグ３
010310         PERFORM 作業受診者ファイル読込
010320         PERFORM UNTIL ( 終了フラグ３         = "YES" ) OR
010330                       ( 作受－請求和暦   NOT = 作３－請求和暦 ) OR
010340                       ( 作受－請求年     NOT = 作３－請求年   ) OR
010350                       ( 作受－請求月     NOT = 作３－請求月   ) OR
010360                       ( 作受－助成種別   NOT = 作３－保険種別 ) OR
010370                       ( 作受－費用負担者番号助成 NOT = 作３－保険者番号 )
010380*
010390             IF ( 受－助成種別           NOT = ZERO ) AND
010400                ( 受－費用負担者番号助成 NOT = SPACE)
010410** 本人家族区分ありか
010420                  MOVE SPACE  TO  作成フラグ
010430                  IF 本人家族区分ＷＲ NOT = ZERO
010440                     IF 本人家族区分ＷＲ = 受－本人家族区分
010450                         MOVE "YES"  TO  作成フラグ
010460                     END-IF
010470                  ELSE
010480                     MOVE "YES"  TO  作成フラグ
010490                  END-IF
010500** 県内県外か
010510                  IF 作成フラグ  = "YES"
010520                     MOVE SPACE  TO  作成フラグ
010530                     MOVE 受－助成種別 TO 保険種別県用ＷＫ
010540                     PERFORM 県内県外取得
010550*                   (県内1、県外2、両方0)
010560                     IF 県内県外ＷＲ NOT = ZERO
010570                        IF 県内県外ＷＲ = 1
010580                           IF 県内県外チェック = 1
010590                              MOVE "YES"  TO  作成フラグ
010600                           END-IF
010610                        ELSE
010620                           IF 県内県外チェック = ZERO
010630                              MOVE "YES"  TO  作成フラグ
010640                           END-IF
010650                        END-IF
010660                     ELSE
010670                        MOVE "YES"  TO  作成フラグ
010680                     END-IF
010690                  END-IF
010700*
010710                  IF 作成フラグ  = "YES"
010720                        MOVE SPACE TO 作１－レコード
010730                        INITIALIZE 作１－レコード
010740                        MOVE 受－助成種別           TO 作１－保険種別
010750                        MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010760                        PERFORM レコードセット
010770                        PERFORM 助成料金計算
010780*** 生保単独 (請求額は 請求額+請求額助成)
010790                        IF ( 受－保険種別    = ZERO ) AND
010800                           ( 受－保険者番号  = SPACE )
010810                            COMPUTE 作１－請求額 = レセ－助成請求金額  + レセ－請求金額
010820                        END-IF
010830*
010840* 請求額が ZERO の時は、書き込まない。
010850                        IF  作１－請求額 NOT = ZERO
010860                            PERFORM ファイル書込
010870                        END-IF
010880                  END-IF
010890             END-IF
010900             PERFORM 作業受診者ファイル読込
010910         END-PERFORM
010920     END-IF.
010930*================================================================*
010940 レセプトＦ読込 SECTION.
010950*
010960     READ レセプトＦ NEXT
010970     AT END
010980         MOVE "YES" TO 終了フラグ
010990     END-READ.
011000*
011010*================================================================*
011020 作業受診者ファイル読込 SECTION.
011030*
011040     READ 作業受診者ファイル NEXT
011050     AT END
011060         MOVE "YES" TO 終了フラグ３
011070     NOT AT END
011080         MOVE 作受－施術和暦    TO 受－施術和暦
011090         MOVE 作受－施術年      TO 受－施術年
011100         MOVE 作受－施術月      TO 受－施術月
011110         MOVE 作受－患者番号    TO 受－患者番号
011120         MOVE 作受－枝番        TO 受－枝番
011130         READ 受診者情報Ｆ
011140         INVALID KEY
011150              MOVE NC"受診者"  TO ファイル名
011160              PERFORM エラー表示Ｒ
011170         END-READ
011180*
011190         INITIALIZE 連保険者番号変換－キー
011200         MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
011210         MOVE  受－保険種別      TO 連保険者番号変換－保険種別
011220         MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
011230         MOVE  ZERO              TO 連保険者番号変換－呼出区分
011240         CALL   "CHGHOKNO"
011250         CANCEL "CHGHOKNO"
011260*       / 置換え /
011270         MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号 作受－保険者番号
011280*
011290     END-READ.
011300*
011310*================================================================*
011320 データチェック SECTION.
011330*
011340     MOVE SPACE          TO 実行キーＷ.
011350     IF ( レセ－レセ印刷対象区分 NOT = 1 )
011360        MOVE "YES"  TO 実行キーＷ
011370     END-IF.
011380* *****************************************************************
011390* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
011400* *****************************************************************
011410     IF 実行キーＷ  = "YES"
011420*      (再度、実行キーＷ SPACE)
011430        MOVE SPACE  TO 実行キーＷ
011440        IF レセ－請求対象区分 NOT = ZERO
011450           MOVE レセ－施術和暦  TO 受－施術和暦
011460           MOVE レセ－施術年    TO 受－施術年
011470           MOVE レセ－施術月    TO 受－施術月
011480           MOVE レセ－患者番号  TO 受－患者番号
011490           MOVE レセ－枝番      TO 受－枝番
011500           READ 受診者情報Ｆ
011510           NOT INVALID KEY
011520              MOVE "YES"  TO 実行キーＷ
011530*
011540*/協会健保の対応、旧保険者番号でも新保険者番号とまとめて請求する/081016
011550              INITIALIZE 連保険者番号変換－キー
011560              MOVE  受－施術和暦年月  TO 連保険者番号変換－施術和暦年月
011570              MOVE  受－保険種別      TO 連保険者番号変換－保険種別
011580              MOVE  受－保険者番号    TO 連保険者番号変換－元保険者番号
011590              MOVE  ZERO              TO 連保険者番号変換－呼出区分
011600              CALL   "CHGHOKNO"
011610              CANCEL "CHGHOKNO"
011620*   / 置換え /
011630              MOVE 連保険者番号変換－後保険者番号  TO  受－保険者番号
011640*
011650           END-READ
011660        ELSE
011670           MOVE SPACE  TO 実行キーＷ
011680        END-IF
011690     END-IF.
011700*
011710*================================================================*
011720 レコードセット SECTION.
011730*
      */同じ保険者のデータが２件に分かれる↓↓↓/150801
      */この時点で該当受診者のレセファイルをリードしておらず作受Ｆ作成時リードしていた翌月がセットされる
011740*     MOVE レセ－請求和暦    TO 作１－請求和暦 レセ－請求和暦.
011750*     MOVE レセ－請求年      TO 作１－請求年   レセ－請求年.
011760*     MOVE レセ－請求月      TO 作１－請求月   レセ－請求月.
      */請求和暦年月が正しく保存されない？/161120
011740*     MOVE 受－請求和暦    TO 作１－請求和暦 レセ－請求和暦.
011750*     MOVE 受－請求年      TO 作１－請求年   レセ－請求年.
011760*     MOVE 受－請求月      TO 作１－請求月   レセ－請求月.
      */同じ保険者のデータが２件に分かれる↑↑↑/150801
011770     MOVE 受－施術和暦      TO 作１－施術和暦 レセ－施術和暦.
011780     MOVE 受－施術年        TO 作１－施術年   レセ－施術年.
011790     MOVE 受－施術月        TO 作１－施術月   レセ－施術月.
011800     MOVE 受－被保険者カナ  TO 作１－被保険者カナ.
011810     MOVE 受－患者コード    TO 作１－患者コード レセ－患者コード.
011820     MOVE 受－患者氏名      TO 作１－患者氏名.
011830     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
011840*     MOVE 受－記号          TO 作１－記号.
011850*     MOVE 受－番号          TO 作１－番号.
011860*
011870     MOVE SPACE TO 連暗号複合－暗号情報.
011880*
011890*    / 連暗号複合－入力情報セット /
011900     MOVE 受－記号       TO 連暗号複合－記号.
011910     MOVE 受－番号       TO 連暗号複合－番号.
011920     MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
011930*
011940     CALL   複合プログラム名Ｗ.
011950     CANCEL 複合プログラム名Ｗ.
011960*
011970     MOVE 連暗号複合－複合した記号 TO 作１－記号.
011980     MOVE 連暗号複合－複合した番号 TO 作１－番号.
011990*
012000*
012010     IF 作受－助成種別 NOT = ZERO
012020        MOVE 3              TO レセ－レセ種別
012030     ELSE
012040        IF 作受－公費種別 NOT = ZERO
012050           MOVE 2           TO レセ－レセ種別
012060        ELSE
012070           IF 作受－保険種別 = 85
012080              MOVE 7        TO レセ－レセ種別
012090           ELSE
012100              MOVE 1        TO レセ－レセ種別
012110           END-IF
012120        END-IF
012130     END-IF.
012140     READ レセプトＦ
012150     INVALID KEY
012160         MOVE SPACE   TO レセ－レコード
012170     END-READ.
      */レセプトＦの請求和暦年月を転記する↓↓↓/161120
011740     MOVE レセ－請求和暦    TO 作１－請求和暦.
011750     MOVE レセ－請求年      TO 作１－請求年  .
011760     MOVE レセ－請求月      TO 作１－請求月  .
      */レセプトＦの請求和暦年月を転記する↑↑↑/161120
012180*
012190* / 助成は、本人とする /
012200     EVALUATE  作１－保険種別
012210****    WHEN 05
012220     WHEN 50 THRU 60
012230         MOVE 1                 TO 作１－本人家族区分
012240     WHEN OTHER
012250         MOVE 受－本人家族区分  TO 作１－本人家族区分
012260     END-EVALUATE.
012270*
012280*
012290     MOVE 県ＷＫ TO 作１－県.
012300
012310     MOVE 作３－保険者番号２ TO 作１－保険者番号２.
012320*
012330*************************************************************************************
012340*  請求先マスタを読んで、データがある時は、請求先市町村コードを保険者番号に転記する。
012350*************************************************************************************
012360*     MOVE 作１－保険種別    TO 請先－保険種別.
012370*     MOVE 作１－保険者番号  TO 請先－保険者番号.
012380*     READ 請求先マスタ
012390*     NOT INVALID KEY
012400*         MOVE 請先－請求先市町村   TO 作１－保険者番号
012410*     END-READ.
012420*
012430*/後期高齢者を代表番号でまとめる/080516
012440*/後高助成時の不具合の修正/080918
012450*     IF 受－保険種別 = 05
012460     IF (作１－保険種別 = 05) AND (作１－保険者番号(1:2) = "39")
012470         MOVE 受－保険者番号 TO 後高代表番号Ｗ
012480         PERFORM 後高代表番号セット
012490         MOVE 後高代表番号Ｗ TO 作１－保険者番号
012500     END-IF.
012510*================================================================*
012520 健保料金計算 SECTION.
012530*
012540     MOVE レセ－合計        TO 作１－費用額.
012550     MOVE レセ－一部負担金  TO 作１－負担額.
012560     MOVE レセ－請求金額    TO 作１－請求額.
012570*
012580* 特別
012590*     PERFORM 助成レセ判定.
012600*     IF 助成レセまとめフラグ = "YES"
012610*         MOVE レセ－受給者負担額  TO 作１－負担額
012620*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012630*     END-IF.
012640*
012650*================================================================*
012660 老人料金計算 SECTION.
012670*
012680     MOVE レセ－合計         TO 作１－費用額.
012690     MOVE レセ－一部負担金   TO 作１－負担額.
012700     MOVE レセ－請求金額     TO 作１－請求額.
012710*
012720*
012730* 特別
012740*     PERFORM 助成レセ判定.
012750*     IF 助成レセまとめフラグ = "YES"
012760*         MOVE レセ－受給者負担額  TO 作１－負担額
012770*         COMPUTE 作１－請求額 = 作１－費用額 - 作１－負担額
012780*     END-IF.
012790*
012800*================================================================*
012810 助成料金計算 SECTION.
012820*
012830     MOVE レセ－合計         TO 作１－費用額.
012840     MOVE レセ－受給者負担額 TO 作１－負担額.
012850     MOVE レセ－助成請求金額 TO 作１－請求額.
012860*
012870* 特別
012880*     PERFORM 助成レセ判定.
012890*     IF 助成レセまとめフラグ = "YES"
012900*   / 書き込まないように請求額ゼロにする /
012910*        MOVE ZERO TO 作１－請求額
012920*     END-IF.
012930*
012940*================================================================*
012950 ファイル書込 SECTION.
012960*
012970     WRITE 作１－レコード
012980     INVALID KEY
012990         MOVE NC"作業"  TO ファイル名
013000         PERFORM エラー表示
013010     END-WRITE.
013020*================================================================*
013030 作業ファイル２作成 SECTION.
013040*
013050     OPEN INPUT  作業ファイル１.
013060     OPEN OUTPUT 作業ファイル２.
013070*
013080     PERFORM 作業ファイル２作成処理.
013090*
013100     CLOSE 作業ファイル１.
013110     CLOSE 作業ファイル２.
013120*================================================================*
013130 作業ファイル２作成処理 SECTION.
013140*
013150     MOVE ZERO       TO 作１－請求和暦     請求和暦Ｗ.
013160     MOVE ZERO       TO 作１－請求年       請求年Ｗ.
013170     MOVE ZERO       TO 作１－請求月       請求月Ｗ.
013180     MOVE ZERO       TO 作１－保険種別     保険種別Ｗ.
013190     MOVE LOW-VALUE  TO 作１－保険者番号   保険者番号Ｗ.
013200     MOVE LOW-VALUE  TO 作１－記号.
013210     MOVE LOW-VALUE  TO 作１－番号.
013220     MOVE LOW-VALUE  TO 作１－被保険者カナ.
013230     MOVE ZERO       TO 作１－患者番号.
013240     MOVE LOW-VALUE  TO 作１－枝番.
013250     MOVE ZERO       TO 作１－施術和暦.
013260     MOVE ZERO       TO 作１－施術年.
013270     MOVE ZERO       TO 作１－施術月.
013280     START 作業ファイル１ KEY IS >=  作１－請求和暦年月
013290                                     作１－保険種別
013300                                     作１－保険者番号
013310                                     作１－記号
013320                                     作１－番号
013330                                     作１－被保険者カナ
013340                                     作１－患者コード
013350                                     作１－施術和暦年月
013360     END-START.
013370     IF 状態キー = "00"
013380*
013390         MOVE SPACE TO 終了フラグ
013400         MOVE ZERO  TO 件数Ｗ
013410         MOVE ZERO  TO 費用額Ｗ
013420         MOVE ZERO  TO 負担額Ｗ
013430         MOVE ZERO  TO 請求額Ｗ
013440         INITIALIZE 本人家族集計用Ｗ
013450*
013460         PERFORM 作業ファイル１読込
013470         MOVE 作１－請求和暦     TO 請求和暦Ｗ
013480         MOVE 作１－請求年       TO 請求年Ｗ
013490         MOVE 作１－請求月       TO 請求月Ｗ
013500         MOVE 作１－保険種別     TO 保険種別Ｗ
013510         MOVE 作１－保険者番号   TO 保険者番号Ｗ
013520         MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
013530         MOVE 作１－県           TO 県ＷＫ２
013540         PERFORM UNTIL 終了フラグ = "YES"
013550*
013560             MOVE SPACE TO 作２－レコード
013570             INITIALIZE 作２－レコード
013580             PERFORM 作業レコード２累計
013590*
013600             MOVE 作１－請求和暦     TO 請求和暦Ｗ
013610             MOVE 作１－請求年       TO 請求年Ｗ
013620             MOVE 作１－請求月       TO 請求月Ｗ
013630             MOVE 作１－保険種別     TO 保険種別Ｗ
013640             MOVE 作１－保険者番号   TO 保険者番号Ｗ
013650             MOVE 作１－保険者番号２ TO 保険者番号２Ｗ
013660             MOVE 作１－県           TO 県ＷＫ２
013670             PERFORM 作業ファイル１読込
013680         END-PERFORM
013690         PERFORM 作業レコード２セット
013700         PERFORM 作業ファイル２書込
013710     END-IF.
013720*================================================================*
013730 作業ファイル１読込 SECTION.
013740*
013750     READ 作業ファイル１ NEXT
013760     AT END
013770         MOVE "YES" TO 終了フラグ
013780     END-READ.
013790*================================================================*
013800 作業レコード２累計 SECTION.
013810*
013820     IF ( 作１－請求和暦 NOT = 請求和暦Ｗ ) OR
013830        ( 作１－請求年   NOT = 請求年Ｗ   ) OR
013840        ( 作１－請求月   NOT = 請求月Ｗ   ) OR
013850        ( 作１－保険種別 NOT = 保険種別Ｗ ) OR
013860        ( 作１－保険者番号 NOT = 保険者番号Ｗ )
013870         PERFORM 作業レコード２セット
013880         PERFORM 作業ファイル２書込
013890         MOVE ZERO  TO 件数Ｗ
013900         MOVE ZERO  TO 費用額Ｗ
013910         MOVE ZERO  TO 負担額Ｗ
013920         MOVE ZERO  TO 請求額Ｗ
013930         INITIALIZE 本人家族集計用Ｗ
013940         PERFORM 作業レコード２加算
013950     ELSE
013960         PERFORM 作業レコード２加算
013970     END-IF.
013980*================================================================*
013990 作業レコード２加算 SECTION.
014000*
014010     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
014020     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
014030     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
014040     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
014050*
014060     IF 作１－本人家族区分 = 1
014070        COMPUTE 本人件数Ｗ   = 本人件数Ｗ   + 1
014080        COMPUTE 本人費用額Ｗ = 本人費用額Ｗ + 作１－費用額
014090        COMPUTE 本人負担額Ｗ = 本人負担額Ｗ + 作１－負担額
014100        COMPUTE 本人請求額Ｗ = 本人請求額Ｗ + 作１－請求額
014110     ELSE
014120        COMPUTE 家族件数Ｗ   = 家族件数Ｗ   + 1
014130        COMPUTE 家族費用額Ｗ = 家族費用額Ｗ + 作１－費用額
014140        COMPUTE 家族負担額Ｗ = 家族負担額Ｗ + 作１－負担額
014150        COMPUTE 家族請求額Ｗ = 家族請求額Ｗ + 作１－請求額
014160     END-IF.
014170*
014180*===============================================================*
014190 作業レコード２セット SECTION.
014200*
014210     MOVE 請求和暦Ｗ     TO 作２－請求和暦.
014220     MOVE 請求年Ｗ       TO 作２－請求年.
014230     MOVE 請求月Ｗ       TO 作２－請求月.
014240     MOVE 保険種別Ｗ     TO 作２－保険種別.
014250     MOVE 保険者番号Ｗ   TO 作２－保険者番号.
014260     MOVE 保険者番号２Ｗ TO 作２－保険者番号２.
014270     MOVE 件数Ｗ         TO 作２－件数.
014280     MOVE 費用額Ｗ       TO 作２－費用額.
014290     MOVE 負担額Ｗ       TO 作２－負担額.
014300     MOVE 請求額Ｗ       TO 作２－請求額.
014310*
014320     MOVE 本人件数Ｗ     TO 作２－本人件数.
014330     MOVE 本人費用額Ｗ   TO 作２－本人費用額.
014340     MOVE 本人負担額Ｗ   TO 作２－本人負担額.
014350     MOVE 本人請求額Ｗ   TO 作２－本人請求額.
014360     MOVE 家族件数Ｗ     TO 作２－家族件数.
014370     MOVE 家族費用額Ｗ   TO 作２－家族費用額.
014380     MOVE 家族負担額Ｗ   TO 作２－家族負担額.
014390     MOVE 家族請求額Ｗ   TO 作２－家族請求額.
014400*
014410     MOVE 県ＷＫ２       TO 作２－県.
014420*/県別、社保日雇いをまとめ、船員を別に集計/081021
014430     IF 作２－保険種別 = 02 OR 06
014440         MOVE 県ＷＫ２   TO 作２－県２
014450     ELSE
014460         MOVE ZERO       TO 作２－県２
014470     END-IF.
014480*
014490     PERFORM 印刷順序セット.
014500     MOVE    印刷順序Ｗ  TO 作２－印刷順序.
014510*
014520*===============================================================*
014530 作業ファイル２書込 SECTION.
014540*
014550     WRITE 作２－レコード
014560     INVALID KEY
014570**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
014580         MOVE NC"作２" TO ファイル名
014590         PERFORM エラー表示
014600         PERFORM ファイル閉鎖
014610         MOVE 99 TO PROGRAM-STATUS
014620         EXIT PROGRAM.
014630*================================================================*
014640 ファイル閉鎖 SECTION.
014650*
014660     CLOSE 制御情報マスタ 受診者情報Ｆ
014670           請求先マスタ レセプトＦ.
014680*================================================================*
014690 終了処理 SECTION.
014700*
014710     PERFORM ファイル閉鎖.
014720*================================================================*
014730*================================================================*
014740 県内県外取得 SECTION.
014750*
014760      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
014770      EVALUATE  保険種別県用ＷＫ
014780* 国保
014790      WHEN  01
014800         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
014810            MOVE  1  TO  県内県外チェック
014820         END-IF
014830         MOVE 受－保険者番号(1:2) TO 県ＷＫ
014840* 社保
014850      WHEN  02
014860*/協会健保の対応/081015
014870         IF 受－保険者番号(5:5) = SPACE
014880             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
014890                MOVE  1  TO  県内県外チェック
014900             END-IF
014910             MOVE 受－保険者番号(1:2) TO 県ＷＫ
014920             PERFORM 県統一
014930             MOVE 県統一ＷＫ TO 県ＷＫ
014940         ELSE
014950             IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
014960                MOVE  1  TO  県内県外チェック
014970             END-IF
014980             MOVE 受－保険者番号(3:2) TO 県ＷＫ
014990         END-IF
015000* 船員
015010* 日雇
015020* 組合
015030* 共済
015040* 自衛官
015050* 退職国保
015060      WHEN  06
015070      WHEN  07
015080      WHEN  08
015090      WHEN  09
015100      WHEN  04
015110      WHEN  03
015120         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
015130            MOVE  1  TO  県内県外チェック
015140         END-IF
015150         MOVE 受－保険者番号(3:2) TO 県ＷＫ
015160* 助成
015170      WHEN 50 THRU 60
015180         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
015190            MOVE  1  TO  県内県外チェック
015200         END-IF
015210         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
015220* 老人
015230      WHEN  05
015240         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
015250            MOVE  1  TO  県内県外チェック
015260         END-IF
015270         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
015280* 労災、自賠責は除外
015290      WHEN  70
015300      WHEN  80
015310      WHEN  90
015320         CONTINUE
015330*
015340     WHEN OTHER
015350         MOVE SPACE                TO エラーメッセージＷ
015360         MOVE 受－患者コード       TO エラー患者コードＷ
015370         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
015380         MOVE "-"                  TO エラー区切りＷ
015390         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
015400         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
015410         CALL   "MSG003"
015420         CANCEL "MSG003"
015430     END-EVALUATE.
015440*
015450*================================================================*
015460 県統一 SECTION.
015470*
015480     MOVE ZERO  TO  県統一ＷＫ.
015490     EVALUATE  県ＷＫ
015500*北海道
015510      WHEN  01
015520         MOVE 01 TO 県統一ＷＫ
015530*青森
015540      WHEN  02
015550         MOVE 02 TO 県統一ＷＫ
015560*岩手
015570      WHEN  03
015580         MOVE 03 TO 県統一ＷＫ
015590*宮城
015600      WHEN  04
015610         MOVE 04 TO 県統一ＷＫ
015620*秋田
015630      WHEN  05
015640         MOVE 05 TO 県統一ＷＫ
015650*山形
015660      WHEN  06
015670         MOVE 06 TO 県統一ＷＫ
015680*福島
015690      WHEN  07
015700         MOVE 07 TO 県統一ＷＫ
015710*茨城
015720      WHEN  08
015730         MOVE 08 TO 県統一ＷＫ
015740*栃木
015750      WHEN  09
015760         MOVE 09 TO 県統一ＷＫ
015770*群馬
015780      WHEN  10
015790         MOVE 10 TO 県統一ＷＫ
015800*埼玉
015810      WHEN  11
015820         MOVE 11 TO 県統一ＷＫ
015830*千葉
015840      WHEN  12
015850         MOVE 12 TO 県統一ＷＫ
015860*東京
015870      WHEN  21
015880         MOVE 13 TO 県統一ＷＫ
015890*神奈川
015900      WHEN  31
015910         MOVE 14 TO 県統一ＷＫ
015920*新潟
015930      WHEN  32
015940         MOVE 15 TO 県統一ＷＫ
015950*富山
015960      WHEN  33
015970         MOVE 16 TO 県統一ＷＫ
015980*石川
015990      WHEN  34
016000         MOVE 17 TO 県統一ＷＫ
016010*福井
016020      WHEN  35
016030         MOVE 18 TO 県統一ＷＫ
016040*山梨
016050      WHEN  36
016060         MOVE 19 TO 県統一ＷＫ
016070*長野
016080      WHEN  37
016090         MOVE 20 TO 県統一ＷＫ
016100*岐阜
016110      WHEN  38
016120         MOVE 21 TO 県統一ＷＫ
016130*静岡
016140      WHEN  39
016150         MOVE 22 TO 県統一ＷＫ
016160*愛知
016170      WHEN  51
016180         MOVE 23 TO 県統一ＷＫ
016190*三重
016200      WHEN  52
016210         MOVE 24 TO 県統一ＷＫ
016220*滋賀
016230      WHEN  53
016240         MOVE 25 TO 県統一ＷＫ
016250*京都
016260      WHEN  54
016270         MOVE 26 TO 県統一ＷＫ
016280*大阪
016290      WHEN  41
016300         MOVE 27 TO 県統一ＷＫ
016310*兵庫
016320      WHEN  42
016330         MOVE 28 TO 県統一ＷＫ
016340*奈良
016350      WHEN  55
016360         MOVE 29 TO 県統一ＷＫ
016370*和歌山
016380      WHEN  56
016390         MOVE 30 TO 県統一ＷＫ
016400*鳥取
016410      WHEN  57
016420         MOVE 31 TO 県統一ＷＫ
016430*島根
016440      WHEN  58
016450         MOVE 32 TO 県統一ＷＫ
016460*岡山
016470      WHEN  59
016480         MOVE 33 TO 県統一ＷＫ
016490*広島
016500      WHEN  60
016510         MOVE 34 TO 県統一ＷＫ
016520*山口
016530      WHEN  61
016540         MOVE 35 TO 県統一ＷＫ
016550*徳島
016560      WHEN  71
016570         MOVE 36 TO 県統一ＷＫ
016580*香川
016590      WHEN  72
016600         MOVE 37 TO 県統一ＷＫ
016610*愛媛
016620      WHEN  73
016630         MOVE 38 TO 県統一ＷＫ
016640*高知
016650      WHEN  74
016660         MOVE 39 TO 県統一ＷＫ
016670*福岡
016680      WHEN  75
016690         MOVE 40 TO 県統一ＷＫ
016700*佐賀
016710      WHEN  76
016720         MOVE 41 TO 県統一ＷＫ
016730*長崎
016740      WHEN  77
016750         MOVE 42 TO 県統一ＷＫ
016760*熊本
016770      WHEN  78
016780         MOVE 43 TO 県統一ＷＫ
016790*大分
016800      WHEN  79
016810         MOVE 44 TO 県統一ＷＫ
016820*宮崎
016830      WHEN  80
016840         MOVE 45 TO 県統一ＷＫ
016850*鹿児島
016860      WHEN  81
016870         MOVE 46 TO 県統一ＷＫ
016880*沖縄
016890      WHEN  82
016900         MOVE 47 TO 県統一ＷＫ
016910*その他
016920      WHEN  OTHER
016930         CONTINUE
016940     END-EVALUATE.
016950*
016960*================================================================*
016970*================================================================*
016980 印刷順序セット SECTION.
016990*
017000**///  印刷順序の変更はこのSECTIONで   ////**
017010*
017020*************************************************************************
017030*  印刷順序:保険名称(保険種別コード)                                    *
017040*                                                                       *
017050*    10:社保(2)                                                         *
017060*    11:船員(7)                                                         *
017070*    12:日雇(6)                                                         *
017080*    50:国保(1)                                                         *
017090*    51:国保組合(1)                                                     *
017100*    52:退職(8)                                                         *
017110*    53:老人(5)                                                         *
017120*    60:４１老人(51)                                                    *
017130*    61:母子(52)                                                        *
017140*    62:乳幼児(55)                                                      *
017150*    63:障害(53)                                                        *
017160*    64:被爆(54)                                                        *
017170*    65:その他(60)                                                      *
017180*    80:組合(3)                                                         *
017190*    90:共済(4)                                                         *
017200*    91:自衛官(9)                                                       *
017210*                                                                       *
017220*   労災、自賠責、自費はのぞく                                          *
017230*                                                                       *
017240* ※ 国保系を 6号用紙でまとめて印字する為に、50番台とする。             *
017250* ※ 社保系を 6号用紙でまとめて印字する為に、10番台とする。             *
017260* ※ 共済、自衛官を 6号用紙でまとめて印字する為に、90番台とする。       *
017270*                                                                       *
017280**************************************************************************
017290*
017300*
017310      EVALUATE  保険種別Ｗ
017320* 国保
017330      WHEN  01
017340* 国保組合条件
017350            IF 保険者番号Ｗ(3:1) = "3"
017360                MOVE  51  TO  印刷順序Ｗ
017370            ELSE
017380                MOVE  50  TO  印刷順序Ｗ
017390            END-IF
017400* 社保
017410      WHEN  02
017420            MOVE  10  TO  印刷順序Ｗ
017430* 船員
017440      WHEN  07
017450*/船員を別に集計する/081020
017460*            MOVE  11  TO  印刷順序Ｗ
017470            MOVE  20  TO  印刷順序Ｗ
017480* 日雇
017490      WHEN  06
017500            MOVE  12  TO  印刷順序Ｗ
017510* 組合
017520      WHEN  03
017530            MOVE  80  TO  印刷順序Ｗ
017540* 共済
017550      WHEN  04
017560            MOVE  90  TO  印刷順序Ｗ
017570* 自衛官
017580      WHEN  09
017590            MOVE  91  TO  印刷順序Ｗ
017600* 老人
017610      WHEN  05
017620            MOVE  53  TO  印刷順序Ｗ
017630* 退職国保
017640      WHEN  08
017650            MOVE  52  TO  印刷順序Ｗ
017660* ４１老人
017670      WHEN  51
017680            MOVE  60  TO  印刷順序Ｗ
017690* 母子
017700      WHEN  52
017710            MOVE  61  TO  印刷順序Ｗ
017720* 乳幼児
017730      WHEN  55
017740            MOVE  62  TO  印刷順序Ｗ
017750* 障害
017760      WHEN  53
017770            MOVE  63  TO  印刷順序Ｗ
017780* 被爆
017790      WHEN  54
017800            MOVE  64  TO  印刷順序Ｗ
017810* その他
017820      WHEN  60
017830            MOVE  65  TO  印刷順序Ｗ
017840* 労災、自賠責は除外
017850      WHEN  70
017860      WHEN  80
017870      WHEN  90
017880         CONTINUE
017890*
017900     WHEN OTHER
017910         MOVE SPACE                TO エラーメッセージＷ
017920         MOVE 作１－患者コード     TO エラー患者コードＷ
017930         MOVE 保険種別Ｗ           TO エラー保険種別Ｗ
017940         MOVE "-"                  TO エラー区切りＷ
017950         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
017960         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
017970         CALL   "MSG003"
017980         CANCEL "MSG003"
017990     END-EVALUATE.
018000*
018010*================================================================*
018020*================================================================*
018030 助成レセ判定 SECTION.
018040* 特別処理（助成レセまとめ）
018050     MOVE SPACE TO 助成レセまとめフラグ.
018060*
018070     IF 受－助成種別 NOT = ZERO
018080*/後期高齢を追加/111007
018090            IF ( 受－保険種別 = 01 OR 08 OR 05)
018100                PERFORM 助成レセまとめ判定
018110            END-IF
018120     END-IF.
018130*
018140*================================================================*
018150*================================================================*
018160 助成レセまとめ判定 SECTION.
018170*
018180     MOVE SPACE TO 助成レセまとめフラグ.
018190*
018200     IF ( レセ－本体まとめ区分 = 1 )
018210           MOVE "YES" TO 助成レセまとめフラグ
018220     END-IF.
018230*
018240*================================================================*
018250 例外処理  SECTION.
018260*
018270* 印刷対象の例外の定義
018280*
018290* ①中部柔整 27 → 社保(02,06,07)、組合(03)、共済(04,09)、
018300*                　国保(中央建設133264,全国土木133033) は返戻分を除く
018310*
018320      IF 協会コードＷ = 27
018340*         作業受診者の請求区分/請求和暦年月はレセ値がセット済み
018342          IF ( 作受－請求区分 = 2 ) AND ( 受－公費種別  = ZERO  )
018343             IF  ( 受－保険種別  = 02 OR 03 OR 04 OR 06 OR 07 OR 09 ) OR
018350                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133264")) OR
018360                 (( 受－保険種別  = 01 ) AND ( 受－保険者番号 = "133033"))
018370                  MOVE SPACE  TO  作成フラグ
018380             END-IF
018390          END-IF
018400      END-IF.
018410*
018420*================================================================*
018430*================================================================*
018440 後高代表番号セット SECTION.
018450*
018460     EVALUATE 後高代表番号Ｗ(3:2)
018470     WHEN "01"
018480         MOVE "39010004" TO 後高代表番号Ｗ
018490     WHEN "02"
018500         MOVE "39020003" TO 後高代表番号Ｗ
018510     WHEN "03"
018520         MOVE "39030002" TO 後高代表番号Ｗ
018530     WHEN "04"
018540         MOVE "39040001" TO 後高代表番号Ｗ
018550     WHEN "05"
018560         MOVE "39050000" TO 後高代表番号Ｗ
018570     WHEN "06"
018580         MOVE "39060009" TO 後高代表番号Ｗ
018590     WHEN "07"
018600         MOVE "39070008" TO 後高代表番号Ｗ
018610     WHEN "08"
018620         MOVE "39080007" TO 後高代表番号Ｗ
018630     WHEN "09"
018640         MOVE "39090006" TO 後高代表番号Ｗ
018650     WHEN "10"
018660         MOVE "39100003" TO 後高代表番号Ｗ
018670     WHEN "11"
018680         MOVE "39110002" TO 後高代表番号Ｗ
018690     WHEN "12"
018700         MOVE "39120001" TO 後高代表番号Ｗ
018710     WHEN "13"
018720         MOVE "39130000" TO 後高代表番号Ｗ
018730     WHEN "14"
018740         MOVE "39140009" TO 後高代表番号Ｗ
018750     WHEN "15"
018760         MOVE "39150008" TO 後高代表番号Ｗ
018770     WHEN "16"
018780         MOVE "39160007" TO 後高代表番号Ｗ
018790     WHEN "17"
018800         MOVE "39170006" TO 後高代表番号Ｗ
018810     WHEN "18"
018820         MOVE "39180005" TO 後高代表番号Ｗ
018830     WHEN "19"
018840         MOVE "39190004" TO 後高代表番号Ｗ
018850     WHEN "20"
018860         MOVE "39200001" TO 後高代表番号Ｗ
018870     WHEN "21"
018880         MOVE "39210000" TO 後高代表番号Ｗ
018890     WHEN "22"
018900         MOVE "39220009" TO 後高代表番号Ｗ
018910     WHEN "23"
018920         MOVE "39230008" TO 後高代表番号Ｗ
018930     WHEN "24"
018940         MOVE "39240007" TO 後高代表番号Ｗ
018950     WHEN "25"
018960         MOVE "39250006" TO 後高代表番号Ｗ
018970     WHEN "26"
018980         MOVE "39260008" TO 後高代表番号Ｗ
018990     WHEN "27"
019000         MOVE "39270004" TO 後高代表番号Ｗ
019010     WHEN "28"
019020         MOVE "39280003" TO 後高代表番号Ｗ
019030     WHEN "29"
019040         MOVE "39290002" TO 後高代表番号Ｗ
019050     WHEN "30"
019060         MOVE "39300009" TO 後高代表番号Ｗ
019070     WHEN "31"
019080         MOVE "39310008" TO 後高代表番号Ｗ
019090     WHEN "32"
019100         MOVE "39320007" TO 後高代表番号Ｗ
019110     WHEN "33"
019120         MOVE "39330006" TO 後高代表番号Ｗ
019130     WHEN "34"
019140         MOVE "39340005" TO 後高代表番号Ｗ
019150     WHEN "35"
019160         MOVE "39350004" TO 後高代表番号Ｗ
019170     WHEN "36"
019180         MOVE "39360003" TO 後高代表番号Ｗ
019190     WHEN "37"
019200         MOVE "39370002" TO 後高代表番号Ｗ
019210     WHEN "38"
019220         MOVE "39380001" TO 後高代表番号Ｗ
019230     WHEN "39"
019240         MOVE "39390000" TO 後高代表番号Ｗ
019250     WHEN "40"
019260         MOVE "39400007" TO 後高代表番号Ｗ
019270     WHEN "41"
019280         MOVE "39410006" TO 後高代表番号Ｗ
019290     WHEN "42"
019300         MOVE "39420005" TO 後高代表番号Ｗ
019310     WHEN "43"
019320         MOVE "39430004" TO 後高代表番号Ｗ
019330     WHEN "44"
019340         MOVE "39440003" TO 後高代表番号Ｗ
019350     WHEN "45"
019360         MOVE "39450002" TO 後高代表番号Ｗ
019370     WHEN "46"
019380         MOVE "39460001" TO 後高代表番号Ｗ
019390     WHEN "47"
019400         MOVE "39470000" TO 後高代表番号Ｗ
019410     END-EVALUATE.
019420*================================================================*
019430******************************************************************
019440 END PROGRAM YJK434.
019450******************************************************************
