000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJK582.
000060 AUTHOR.                 岡田　憲和
000070*
000080*----------------------------------------------------------------*
000090*         請求台帳印刷（柔ｳｨﾝﾄﾞｳｽﾞ95版）
000100* 請求年月Ver.
000110*         MED = YJK580G YJK582P
000120* 印刷順番降順対応 2007/6/5
000130*----------------------------------------------------------------*
000140 DATE-WRITTEN.           2012-08-08
000150 DATE-COMPILED.          2012-08-08
000160*----------------------------------------------------------------*
000170******************************************************************
000180*            ENVIRONMENT         DIVISION                        *
000190******************************************************************
000200 ENVIRONMENT             DIVISION.
000210 CONFIGURATION           SECTION.
000220 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000230 OBJECT-COMPUTER.        FMV-DESKPOWER.
000240 SPECIAL-NAMES.          CONSOLE  IS  CONS
000250                         SYSERR   IS  MSGBOX.
000260 INPUT-OUTPUT            SECTION.
000270 FILE-CONTROL.
000280     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000290                             ORGANIZATION             IS  INDEXED
000300                             ACCESS MODE              IS  DYNAMIC
000310                             RECORD KEY               IS  元－元号区分
000320                             FILE STATUS              IS  状態キー
000330                             LOCK        MODE         IS  AUTOMATIC.
000410     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000420                             ORGANIZATION             IS  INDEXED
000430                             ACCESS MODE              IS  DYNAMIC
000440                             RECORD KEY               IS  制－制御区分
000450                             FILE STATUS              IS  状態キー
000460                             LOCK        MODE         IS  AUTOMATIC.
000470     SELECT  施術所情報マスタ ASSIGN      TO        SEJOHOL
000480                             ORGANIZATION             IS  INDEXED
000490                             ACCESS MODE              IS  DYNAMIC
000500                             RECORD KEY               IS 施情－施術所番号
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  保険者マスタ    ASSIGN      TO        HOKENSL
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS MODE              IS  DYNAMIC
000560                             RECORD KEY               IS  保－保険種別
000570                                                          保－保険者番号
000580                             ALTERNATE RECORD KEY     IS  保－保険種別
000590                                                          保－保険者名称
000600                                                          保－保険者番号
000610                             FILE STATUS              IS  状態キー
000620                             LOCK        MODE         IS  AUTOMATIC.
000630     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000640                             ORGANIZATION             IS  INDEXED
000650                             ACCESS MODE              IS  DYNAMIC
000660                             RECORD KEY               IS  市－公費種別
000670                                                          市－市町村番号
000680                             ALTERNATE RECORD KEY     IS  市－公費種別
000690                                                          市－市町村名称
000700                                                          市－市町村番号
000710                             FILE STATUS              IS  状態キー
000720                             LOCK        MODE         IS  AUTOMATIC.
000742     SELECT  作業ファイル１  ASSIGN      TO           "C:\MAKISHISYS\YAWOBJ\TEMP\W5801L.DAT"
000743                             ORGANIZATION             IS  SEQUENTIAL
000750                             ACCESS                   IS  SEQUENTIAL
000760                             FILE        STATUS       IS  状態キー
000770                             LOCK        MODE         IS  AUTOMATIC.
000790     SELECT  作業ファイル２  ASSIGN      TO           "C:\MAKISHISYS\YAWOBJ\TEMP\W58211L.DAT"
000791                             ORGANIZATION             IS  INDEXED
000800                             ACCESS                   IS  DYNAMIC
000810                             RECORD      KEY          IS  作２－請求和暦年月
000820                                                          作２－印刷区分
000830                                                          作２－保険区分
000840                                                          作２－保険者番号
000850                                                          作２－本人家族区分
000860                                                          作２－被保険者カナ
000870                                                          作２－患者カナ
000880                                                          作２－当月区分
000890                                                          作２－施術和暦年月
000900                                                          作２－患者コード
000910                             FILE        STATUS       IS  状態キー
000920                             LOCK        MODE         IS  AUTOMATIC.
000940     SELECT  作業ファイル３  ASSIGN      TO           "C:\MAKISHISYS\YAWOBJ\TEMP\W58212L.DAT"
000941                             ORGANIZATION             IS  INDEXED
000950                             ACCESS                   IS  DYNAMIC
000960                             RECORD      KEY          IS  作３－請求和暦年月
000970                                                          作３－印刷区分
000980                                                          作３－保険区分
000990                                                          作３－保険者番号
001000                                                          作３－本人家族区分
001010                                                          作３－被保険者カナ
001020                                                          作３－患者カナ
001030                                                          作３－当月区分
001040                                                          作３－施術和暦年月
001050                                                          作３－患者コード
001060                             FILE        STATUS       IS  状態キー
001070                             LOCK        MODE         IS  AUTOMATIC.
001080* レセ並び順用
001100     SELECT  作業ファイル４  ASSIGN      TO           "C:\MAKISHISYS\YAWOBJ\TEMP\W5912L.DAT"
001101                             ORGANIZATION             IS  INDEXED
001110                             ACCESS                   IS  DYNAMIC
001120                             RECORD      KEY          IS  作４－施術和暦年月
001130                                                          作４－患者コード
001140                                                          作４－保険種別
001150                             FILE        STATUS       IS  状態キー
001160                             LOCK        MODE         IS  AUTOMATIC.
001170     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF001
001180                             SYMBOLIC    DESTINATION  IS "PRT"
001190                             FORMAT                   IS  定義体名Ｐ
001200                             GROUP                    IS  項目群名Ｐ
001210                             PROCESSING  MODE         IS  処理種別Ｐ
001220                             UNIT        CONTROL      IS  拡張制御Ｐ
001230                             FILE        STATUS       IS  通知情報Ｐ.
001240******************************************************************
001250*                      DATA DIVISION                             *
001260******************************************************************
001270 DATA                    DIVISION.
001280 FILE                    SECTION.
001290*                           ［ＲＬ＝  １２８］
001300 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001310     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001350*                           ［ＲＬ＝  ２５６］
001360 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001370     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001380*                           ［ＲＬ＝  ６４０］
001390 FD  施術所情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001400     COPY SEJOHO         OF  XFDLIB  JOINING   施情   AS  PREFIX.
001410*                           ［ＲＬ＝  ３２０］
001420 FD  保険者マスタ        BLOCK   CONTAINS   1   RECORDS.
001430     COPY HOKENS          OF  XFDLIB  JOINING   保   AS  PREFIX.
001440*                           ［ＲＬ＝  ２５６］
001450 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
001460     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
001470*
001480*
001490 FD  作業ファイル１ RECORD  CONTAINS 288 CHARACTERS.
001500 01  作１－レコード.
001510     03  作１－レコードデータ.
001520         05  作１－請求和暦年月.
001530             07  作１－請求和暦            PIC 9.
001540             07  作１－請求年              PIC 9(2).
001550             07  作１－請求月              PIC 9(2).
001560         05  作１－施術和暦年月.
001570             07  作１－施術和暦            PIC 9.
001580             07  作１－施術年              PIC 9(2).
001590             07  作１－施術月              PIC 9(2).
001600         05  作１－印刷区分                PIC 9(2).
001610         05  作１－保険者番号              PIC X(10).
001620         05  作１－記号                    PIC X(24).
001630         05  作１－番号                    PIC X(30).
001640         05  作１－被保険者カナ            PIC X(50).
001650         05  作１－被保険者氏名            PIC X(50).
001660         05  作１－患者カナ                PIC X(50).
001670         05  作１－本人家族区分            PIC 9.
001680         05  作１－費用額                  PIC 9(7).
001690         05  作１－負担額                  PIC 9(7).
001700         05  作１－請求額                  PIC 9(7).
001710         05  作１－患者コード.
001720             07 作１－患者番号             PIC 9(6).
001730             07 作１－枝番                 PIC X(1).
001740         05  作１－保険種別                PIC 9(2).
001750         05  作１－親保険種別              PIC 9(2).
001760         05  作１－老人レコード区分        PIC 9.
001770         05  作１－助成レコード区分        PIC 9.
001780         05  FILLER                        PIC X(27).
001790
001800 FD  作業ファイル２ RECORD  CONTAINS 288 CHARACTERS.
001810 01  作２－レコード.
001820     03  作２－レコードキー.
001830         05  作２－請求和暦年月.
001840             07  作２－請求和暦            PIC 9.
001850             07  作２－請求年              PIC 9(2).
001860             07  作２－請求月              PIC 9(2).
001870         05  作２－印刷区分                PIC 9(2).
001880         05  作２－保険区分                PIC 9.
001890         05  作２－本人家族区分            PIC 9.
001900         05  作２－保険者番号              PIC X(10).
001910         05  作２－被保険者カナ            PIC X(50).
001920         05  作２－患者カナ                PIC X(50).
001930         05  作２－当月区分                PIC 9.
001940         05  作２－施術和暦年月.
001950             07  作２－施術和暦            PIC 9.
001960             07  作２－施術年              PIC 9(2).
001970             07  作２－施術月              PIC 9(2).
001980         05  作２－患者コード.
001990             07 作２－患者番号             PIC 9(6).
002000             07 作２－枝番                 PIC X(1).
002010     03  作２－レコードデータ.
002020         05  作２－記号                    PIC X(24).
002030         05  作２－番号                    PIC X(30).
002040         05  作２－被保険者氏名            PIC X(50).
002050         05  作２－費用額                  PIC 9(7).
002060         05  作２－負担額                  PIC 9(7).
002070         05  作２－請求額                  PIC 9(7).
002080         05  作２－保険種別                PIC 9(2).
002090         05  作２－親保険種別              PIC 9(2).
002100         05  作２－老人レコード区分        PIC 9.
002110         05  作２－助成レコード区分        PIC 9.
002120         05  FILLER                        PIC X(25).
002130
002140 FD  作業ファイル３ RECORD  CONTAINS 288 CHARACTERS.
002150 01  作３－レコード.
002160     03  作３－レコードキー.
002170         05  作３－請求和暦年月.
002180             07  作３－請求和暦            PIC 9.
002190             07  作３－請求年              PIC 9(2).
002200             07  作３－請求月              PIC 9(2).
002210         05  作３－印刷区分                PIC 9(2).
002220         05  作３－保険区分                PIC 9.
002230         05  作３－本人家族区分            PIC 9.
002240         05  作３－保険者番号              PIC X(10).
002250         05  作３－被保険者カナ            PIC X(50).
002260         05  作３－患者カナ                PIC X(50).
002270         05  作３－当月区分                PIC 9.
002280         05  作３－施術和暦年月.
002290             07  作３－施術和暦            PIC 9.
002300             07  作３－施術年              PIC 9(2).
002310             07  作３－施術月              PIC 9(2).
002320         05  作３－患者コード.
002330             07 作３－患者番号             PIC 9(6).
002340             07 作３－枝番                 PIC X(1).
002350     03  作３－レコードデータ.
002360         05  作３－記号                    PIC X(24).
002370         05  作３－番号                    PIC X(30).
002380         05  作３－被保険者氏名            PIC X(50).
002390         05  作３－費用額                  PIC 9(7).
002400         05  作３－負担額                  PIC 9(7).
002410         05  作３－請求額                  PIC 9(7).
002420         05  作３－保険種別                PIC 9(2).
002430         05  作３－親保険種別              PIC 9(2).
002440         05  作３－老人レコード区分        PIC 9.
002450         05  作３－助成レコード区分        PIC 9.
002460         05  FILLER                        PIC X(25).
002470
002480* レセプト並び順ファイル
002490 FD  作業ファイル４ RECORD  CONTAINS 32 CHARACTERS.
002500 01  作４－レコード.
002510     03  作４－レコードキー.
002520         05  作４－施術和暦年月.
002530             07  作４－施術和暦            PIC 9.
002540             07  作４－施術年              PIC 9(2).
002550             07  作４－施術月              PIC 9(2).
002560         05  作４－患者コード.
002570             07 作４－患者番号             PIC 9(6).
002580             07 作４－枝番                 PIC X(1).
002590         05  作４－保険種別                PIC 9(2).
002600     03  作４－レコードデータ.
002610         05  作４－順番                    PIC 9(4).
002620         05  FILLER                        PIC X(14).
002630*
002640 FD  印刷ファイル.
002650     COPY YJK582P        OF  XMDLIB.
002660*----------------------------------------------------------------*
002670******************************************************************
002680*                WORKING-STORAGE SECTION                         *
002690******************************************************************
002700 WORKING-STORAGE         SECTION.
002710 01 キー入力                           PIC X    VALUE SPACE.
002720 01 状態キー                           PIC X(2) VALUE SPACE.
002730 01 終了フラグ                         PIC X(3) VALUE SPACE.
002740 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002750 01 終了行フラグ                       PIC X(3) VALUE SPACE.
002760 01 ファイル名                         PIC N(10).
002770 01 対象なしフラグ                     PIC X(3)  VALUE SPACE.
002780 01 オープンフラグ                     PIC X(3)  VALUE SPACE.
002781*
002790 01 印刷区分Ｗ                         PIC 9(2)  VALUE ZERO.
002800 01 印刷区分ＰＷ                       PIC 9(2)  VALUE ZERO.
002810 01 印刷区分ＰＷ２                     PIC 9(2)  VALUE ZERO.
002820 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002830 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002840 01 請求和暦年月ＰＷ.
002850    03 請求和暦ＰＷ                    PIC 9    VALUE ZERO.
002860    03 請求年ＰＷ                      PIC 9(2) VALUE ZERO.
002870    03 請求月ＰＷ                      PIC 9(2) VALUE ZERO.
002880 01 請求和暦年月ＰＷ２.
002890    03 請求和暦ＰＷ２                  PIC 9    VALUE ZERO.
002900    03 請求年ＰＷ２                    PIC 9(2) VALUE ZERO.
002910    03 請求月ＰＷ２                    PIC 9(2) VALUE ZERO.
002920*
002930 01 保険名称Ｗ                         PIC N(3) VALUE SPACE.
002940 01 備考Ｗ                             PIC X(20).
002950 01 前和暦Ｗ                           PIC 9    VALUE ZERO.
002960 01 行カウンタ                         PIC 9(2) VALUE 0.
002970 01 頁カウンタ                         PIC 9(4) VALUE 0.
002980 01 最大行数                           PIC 9(2) VALUE 0.
002990 01 ヘッダ行数                         PIC 9(2) VALUE 0.
003000 01 移動行数Ｗ                         PIC 9(2) VALUE 0.
003010 01 処理移動キー                       PIC X(4) VALUE SPACE.
003020 01 カレント元号Ｗ                     PIC 9(1) VALUE ZERO.
003030*
003040 01 会員番号Ｗ.
003050    03 会員番号ＷＰ                    PIC X(10) VALUE SPACE.
003060*
003070 01 保険種別名称Ｗ.
003080    03 保険種別名称ＷＰ                PIC X(6) VALUE SPACE.
003090 01 親保険種別名称Ｗ.
003100    03 親保険種別名称ＷＰ              PIC X(4) VALUE SPACE.
003110    03 合計文字                        PIC X(4).
003120 01 総合計Ｗ.
003130    03 総合計ＷＰ                      PIC X(6).
003140*
003150** 氏名分離用
003160 01 被保険者カナＷ.
003170    03 被保険者カナＷＰ                PIC X    OCCURS 20 VALUE SPACE.
003180 01 名字カナＷ.
003190    03 名字カナＷＰ                    PIC X    OCCURS 20 VALUE SPACE.
003200 01 名前カナＷ.
003210    03 名前カナＷＰ                    PIC X    OCCURS 20 VALUE SPACE.
003220 01 カウンタ                           PIC 9(2) VALUE ZERO.
003230 01 Ｍカウンタ                         PIC 9(2) VALUE ZERO.
003240 01 Ｎカウンタ                         PIC 9(2) VALUE ZERO.
003250 01 名字フラグ                         PIC X(3) VALUE SPACE.
003260**
003270 01 小計Ｗ.
003280    03 小計件数Ｗ                      PIC 9(4) VALUE ZERO.
003290    03 費用額小計Ｗ                    PIC 9(7) VALUE ZERO.
003300    03 負担額小計Ｗ                    PIC 9(7) VALUE ZERO.
003310    03 請求額小計Ｗ                    PIC 9(7) VALUE ZERO.
003320 01 合計Ｗ.
003330    03 合計件数Ｗ                      PIC 9(4) VALUE ZERO.
003340    03 費用額合計Ｗ                    PIC 9(8) VALUE ZERO.
003350    03 負担額合計Ｗ                    PIC 9(8) VALUE ZERO.
003360    03 請求額合計Ｗ                    PIC 9(8) VALUE ZERO.
003370*
003380 01 施術和暦年月Ｗ.
003390     03 施術和暦Ｗ                   PIC 9.
003400     03 施術年月Ｗ.
003410        05 施術年Ｗ                  PIC 9(2).
003420        05 年Ｗ                      PIC N(1).
003430        05 施術月Ｗ                  PIC 9(2).
003440        05 月Ｗ                      PIC N(1).
003450 01 現在和暦年月Ｗ.
003460    03 現在和暦Ｗ                    PIC 9.
003470    03 現在年Ｗ                      PIC 9(2).
003480    03 現在月Ｗ                      PIC 9(2).
003490*
003500 01 保険種別ＷＲ                     PIC 9(2) VALUE ZERO.
003510 01 印刷形式ＷＲ                     PIC 9    VALUE ZERO.
003520
003530 01 レセ並び順昇降Ｗ                   PIC 9    VALUE ZERO.
003540
003541 01 日本語変換Ｘ.
003542    03 日本語変換Ｎ                    PIC N(50) VALUE SPACE.
003550*******************************************************************
003560 01 印刷制御.
003570     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
003580     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
003590     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
003600     03 拡張制御Ｐ.
003610         05 端末制御Ｐ.
003620             07 移動方向Ｐ             PIC X(1).
003630             07 移動行数Ｐ             PIC 9(3).
003640         05 詳細制御Ｐ                 PIC X(2).
003650     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
003660     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
003670*
003680 01 計算機西暦年Ｗ                     PIC 9(2).
003690* 日付ＷＯＲＫ
003700 01 和暦終了年Ｗ                       PIC 9(4).
003710 01 計算機西暦.
003720    03 計算機西暦年                    PIC 9(4).
003730    03 計算機西暦月日                  PIC 9(4).
003740 01 計算機西暦Ｒ REDEFINES 計算機西暦.
003750    03 計算機世紀                      PIC 9(2).
003760    03 計算機日付                      PIC 9(6).
003770    03 計算機日付Ｒ REDEFINES 計算機日付.
003780       05 計算機年月                   PIC 9(4).
003790       05 計算機年月Ｒ REDEFINES 計算機年月.
003800         07 計算機年                   PIC 9(2).
003810         07 計算機月                   PIC 9(2).
003820       05 計算機日                     PIC 9(2).
003830******************************************************************
003840*                          連結項目                              *
003850******************************************************************
003950*
003958 01 連入－画面情報ＹＪＫ５８０ IS EXTERNAL.
003959    03 連入－印刷形式                  PIC 9.
003960    03 連入－請求和暦年月.
003961       05 連入－請求和暦               PIC 9.
003962       05 連入－請求年月.
003963         07 連入－請求年               PIC 9(2).
003964         07 連入－請求月               PIC 9(2).
003965    03 連入－保険種別                  PIC 9(2).
003967*
003971 01 連印－画面情報ＹＪＫ５８０ IS EXTERNAL GLOBAL.
003972    03 連印－開始頁                    PIC 9(3).
003973    03 連印－終了頁                    PIC 9(3).
003974    03 連印－プレビュー区分            PIC 9.
003975*
004000 01 連メ－キー IS EXTERNAL.
004010    03  連メ－メッセージ               PIC N(20).
004020*
004030************************************
004031* プリンタファイル作成用           *
004032************************************
004033 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
004034     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
004035     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
004036     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
004037     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
004038*
004039******************************************************************
004040*                      PROCEDURE  DIVISION                       *
004050******************************************************************
004060 PROCEDURE               DIVISION.
004070************
004080*           *
004090* 初期処理   *
004100*           *
004110************
004123     MOVE SPACE TO オープンフラグ.
004124     PERFORM プリンタファイル作成.
004125     PERFORM 初期化.
004130     MOVE SPACE  TO YJK582P.
004140
004150***     INITIALIZE YJK582P.
004160************
004170*           *
004180* 主処理     *
004190*           *
004200************
004210*
004220*/ 保険種別指定印刷追加 /0904
004230*
004240     EVALUATE TRUE
004250*     WHEN  印刷形式ＷＲ = ZERO 
004260     WHEN  保険種別ＷＲ = ZERO 
004270* 昇順時には、既存の処理を行う
004280         IF レセ並び順昇降Ｗ = ZERO
004290             PERFORM 印刷処理
004300         ELSE
004310             PERFORM 作業ファイル２３作成
004320             PERFORM 印刷処理２
004330         END-IF
004340
004350*          PERFORM 印刷処理
004360*     WHEN  印刷形式ＷＲ = 1 OR 2 
004370*          PERFORM 一部印刷処理
004380     WHEN OTHER
004390         PERFORM 印刷区分取得
004401         IF レセ並び順昇降Ｗ = ZERO
004412             PERFORM 保険種別ごと印刷処理
004420             IF 保険種別ＷＲ = 01
004430                 MOVE 3     TO 印刷区分Ｗ
004440                 PERFORM 保険種別ごと印刷処理
004450             END-IF
004460         ELSE
004471             PERFORM 作業ファイル２３作成
004480             PERFORM 保険種別ごと印刷処理２
004490             IF 保険種別ＷＲ = 01
004500                 MOVE 3     TO 印刷区分Ｗ
004510                 PERFORM 保険種別ごと印刷処理２
004520             END-IF
004530         END-IF
004540*          CONTINUE
004550     END-EVALUATE.
004560*
004570************
004580*           *
004590* 終了処理   *
004600*           *
004610************
004620     PERFORM 終了処理.
004630     EXIT PROGRAM.
004640*
004650*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004660*================================================================*
004661 プリンタファイル作成 SECTION.
004662*================================================================*
004663*   / 初期化 /
004664     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
004665     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
004666*
004667*
004668*--↓↓ 変更箇所 ↓↓--------------------------------------*
004669*   使用するプリンタファイル名セット
004671     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
004672*
004673*   使用する帳票プログラム名セット
004674     MOVE "YJK582"              TO Ｈ連ＰＲＴＦ－帳票プログラム名.
004675*
004676*--↑↑-----------------------------------------------------*
004677*
004678*   / プレビュー区分セット /
004679     MOVE 連印－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
004681*
004682     CALL   "CRTPRTF".
004683     CANCEL "CRTPRTF".
004684*
004685*================================================================*
004686 初期化 SECTION.
004687*
004690     PERFORM ファイルオープン.
004700*    /* 現在日付取得 */
004710     ACCEPT 計算機日付 FROM DATE.
004720*    /* 1980～2079年の間で設定 */
004730     IF 計算機年 > 80
004740         MOVE 19 TO 計算機世紀
004750     ELSE
004760         MOVE 20 TO 計算機世紀
004770     END-IF.
004780     PERFORM カレント元号取得.
004790     PERFORM 和暦終了年取得.
004800     COMPUTE 計算機西暦年Ｗ = 計算機西暦年 - 1988.
004810*
004820     MOVE カレント元号Ｗ TO 現在和暦Ｗ.
004830     MOVE 計算機西暦年Ｗ TO 現在年Ｗ.
004840     MOVE 計算機月       TO 現在月Ｗ.
004850*
004860* 連結項目の待避
004880     MOVE 連入－保険種別    TO 保険種別ＷＲ.
004890*================================================================*
004900 カレント元号取得 SECTION.
004910*
004920     MOVE ZEROS TO 制－制御区分.
004930     READ 制御情報マスタ
004940     NOT INVALID KEY
004950         MOVE 制－カレント元号 TO カレント元号Ｗ
004960         MOVE 制－レセ並び順昇降 TO レセ並び順昇降Ｗ
004970     END-READ.
004980*
004990*================================================================*
005000 和暦終了年取得 SECTION.
005010*
005020     MOVE カレント元号Ｗ TO 元－元号区分.
005030     READ 元号マスタ
005040     INVALID KEY
005050         DISPLAY NC"指定和暦が登録されていません" UPON CONS
005060         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005070                                                  UPON CONS
005080         ACCEPT  キー入力 FROM CONS
005090         PERFORM 終了処理
005100         EXIT PROGRAM
005110     NOT INVALID KEY
005120         COMPUTE 前和暦Ｗ = カレント元号Ｗ - 1
005130         MOVE 前和暦Ｗ TO 元－元号区分
005140         READ 元号マスタ
005150         INVALID KEY
005160             DISPLAY NC"指定和暦が登録されていません" UPON CONS
005170             DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005180                                                      UPON CONS
005190             ACCEPT  キー入力 FROM CONS
005200             PERFORM 終了処理
005210             EXIT PROGRAM
005220         NOT INVALID KEY
005230             MOVE 元－終了西暦年 TO 和暦終了年Ｗ
005240         END-READ
005250     END-READ.
005260*
005270*================================================================*
005280 ファイルオープン SECTION.
005290*
005300     OPEN INPUT 元号マスタ
005310         MOVE NC"元号" TO ファイル名.
005320         PERFORM オープンチェック.
005360     OPEN INPUT 制御情報マスタ
005370         MOVE NC"制御情報" TO ファイル名.
005380         PERFORM オープンチェック.
005390     OPEN INPUT 施術所情報マスタ
005400         MOVE NC"施術所情報" TO ファイル名.
005410         PERFORM オープンチェック.
005420     OPEN INPUT 保険者マスタ.
005430         MOVE NC"保険者マスタ" TO ファイル名.
005440         PERFORM オープンチェック.
005450     OPEN INPUT 市町村マスタ.
005460         MOVE NC"市町村マスタ" TO ファイル名.
005470         PERFORM オープンチェック.
005480     OPEN INPUT 作業ファイル１
005490         MOVE NC"作業１" TO ファイル名.
005500         PERFORM オープンチェック.
005510     OPEN INPUT   作業ファイル４.
005520         MOVE NC"作４" TO ファイル名.
005530         PERFORM オープンチェック.
005560*================================================================*
005570 オープンチェック SECTION.
005580*
005590     IF 状態キー  NOT =  "00"
005600         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
005610         DISPLAY NC"状態キー：" 状態キー         UPON CONS
005620         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005630                                                 UPON CONS
005640         ACCEPT  キー入力 FROM CONS
005650         PERFORM ファイル閉鎖
005660         EXIT PROGRAM.
005670*================================================================*
005680 ファイル閉鎖 SECTION.
005690*
005700     IF ( オープンフラグ = "YES" )
005701         CLOSE 印刷ファイル
005702     ELSE
005703         MOVE  NC"　　データが０件です。確認して下さい。" TO 連メ－メッセージ
005704         CALL   "MSG001"
005705         CANCEL "MSG001"
005706     END-IF.
005707*
005710     CLOSE 元号マスタ 制御情報マスタ 施術所情報マスタ
005711           保険者マスタ 市町村マスタ 作業ファイル１ 作業ファイル２
005720           作業ファイル３ 作業ファイル４.
005730*================================================================*
005740 終了処理 SECTION.
005750*
005760     PERFORM ファイル閉鎖.
005770*================================================================*
005780 エラー表示 SECTION.
005790*
005800     DISPLAY NC"状態キー" 状態キー  UPON CONS.
005810     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
005820     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005830     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
005840     ACCEPT  キー入力 FROM CONS.
005850     PERFORM ファイル閉鎖.
005860     EXIT PROGRAM.
005870
005880
005890*================================================================*
005900 印刷処理 SECTION.
005910*
005920
005930     MOVE SPACE TO 終了フラグ.
005940     INITIALIZE 小計Ｗ.
005950     INITIALIZE 合計Ｗ.
005960     MOVE 20    TO 最大行数.
005970     MOVE 1     TO 頁カウンタ.
005980     PERFORM 作業ファイル１読込.
005990     IF  終了フラグ = "YES"
006000         MOVE  NC"　　　該当するデータがありません。" TO 連メ－メッセージ
006010         CALL   "MSG001"
006020         CANCEL "MSG001"
006030         PERFORM ファイル閉鎖
006040         MOVE 99 TO PROGRAM-STATUS
006050         EXIT PROGRAM
006060     END-IF.
006070     PERFORM UNTIL 終了フラグ = "YES"
006080*
006090         MOVE 作１－請求和暦     TO 請求和暦ＰＷ
006100         MOVE 作１－請求年       TO 請求年ＰＷ
006110         MOVE 作１－請求月       TO 請求月ＰＷ
006120         MOVE 作１－印刷区分     TO 印刷区分ＰＷ
006130         PERFORM ヘッダセット
006140         PERFORM ヘッダ印字処理
006150*
006160         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
006170                       ( 行カウンタ > 最大行数 )  OR
006180                       ( 作１－請求和暦   NOT = 請求和暦ＰＷ ) OR
006190                       ( 作１－請求年     NOT = 請求年ＰＷ   ) OR
006200                       ( 作１－請求月     NOT = 請求月ＰＷ   ) OR
006210                       ( 作１－印刷区分   NOT = 印刷区分ＰＷ ) 
006225             PERFORM 明細部セット
006230             PERFORM 明細印字処理
006240             PERFORM 合計額累計
006250             PERFORM 作業ファイル１読込
006260         END-PERFORM
006270*
006280         IF ( 行カウンタ > 最大行数 )
006290             IF  ( 終了フラグ = "YES" ) OR 
006300                 ( 作１－請求和暦   NOT = 請求和暦ＰＷ ) OR
006310                 ( 作１－請求年     NOT = 請求年ＰＷ   ) OR
006320                 ( 作１－請求月     NOT = 請求月ＰＷ   ) OR
006330                 ( 作１－印刷区分   NOT = 印刷区分ＰＷ ) 
006340                 PERFORM 合計セット
006350                 PERFORM 合計印字処理
006360                 INITIALIZE 合計Ｗ
006370                 PERFORM 改頁処理
006380                 MOVE 1  TO 頁カウンタ
006390             ELSE
006400                 PERFORM 改頁処理
006410                 COMPUTE 頁カウンタ = 頁カウンタ + 1
006420             END-IF
006430         ELSE
006440             PERFORM 合計セット
006450             PERFORM 合計印字処理
006460             INITIALIZE 合計Ｗ
006470             PERFORM 改頁処理
006480             MOVE 1  TO 頁カウンタ
006490         END-IF
006500*
006510     END-PERFORM.
006520
006530*
006540*================================================================*
006550 印刷処理２ SECTION.
006560*
006570     OPEN INPUT 作業ファイル２
006580         MOVE NC"作業２" TO ファイル名.
006590         PERFORM オープンチェック.
006600
006610     OPEN INPUT 作業ファイル３
006620         MOVE NC"作業３" TO ファイル名.
006630         PERFORM オープンチェック.
006640* 降順でファイルを読み、印刷区分の先頭位置を取得し、種別毎に印刷を行う
006650
      */20190603
006660*     MOVE 4          TO  作３－請求和暦.
006660     MOVE 9          TO  作３－請求和暦.
006670     MOVE 99         TO  作３－請求年.
006680     MOVE 12         TO  作３－請求月.
006690     MOVE 99         TO  作３－印刷区分.
006700
006710     MOVE HIGH-VALUE TO  作３－保険者番号.
006720     MOVE 999999     TO  作３－患者番号
006730     MOVE HIGH-VALUE TO  作３－枝番
006740     MOVE ZERO       TO  作３－本人家族区分.
006750
006760     MOVE 9          TO  作３－保険区分.
006770     MOVE 9          TO  作３－当月区分.
006780     MOVE HIGH-VALUE TO  作３－被保険者カナ.
006790     MOVE HIGH-VALUE TO  作３－患者カナ.
      */20190603
006800*     MOVE 4          TO  作３－施術和暦.
006800     MOVE 5          TO  作３－施術和暦.
006810     MOVE 99         TO  作３－施術年.
006820     MOVE 12         TO  作３－施術月.
006830
006840     START 作業ファイル３   KEY IS <=  作３－請求和暦年月
006850                                       作３－印刷区分
006860                                       作３－保険区分
006870                                       作３－保険者番号
006880                                       作３－本人家族区分
006890                                       作３－被保険者カナ
006900                                       作３－患者カナ
006910                                       作３－当月区分
006920                                       作３－施術和暦年月
006930                                       作３－患者コード
006940                                       REVERSED
006950     END-START.
006960     IF 状態キー = "00"
006970
006980         MOVE SPACE TO 終了フラグ２
006990         PERFORM 作業ファイル３読込
007000         IF  終了フラグ２ = "YES"
007010             MOVE  NC"　　　該当するデータがありません。" TO 連メ－メッセージ
007020             CALL   "MSG001"
007030             CANCEL "MSG001"
007040             PERFORM ファイル閉鎖
007050             MOVE 99 TO PROGRAM-STATUS
007060             EXIT PROGRAM
007070         END-IF
007080
007090         PERFORM UNTIL 終了フラグ２ = "YES"
007100*
007110             MOVE 作３－請求和暦     TO 請求和暦ＰＷ２
007120             MOVE 作３－請求年       TO 請求年ＰＷ２
007130             MOVE 作３－請求月       TO 請求月ＰＷ２
007140             MOVE 作３－印刷区分     TO 印刷区分ＰＷ２
007150
007160             PERFORM UNTIL ( 終了フラグ２ = "YES" ) OR
007170                           ( 作３－請求和暦   NOT = 請求和暦ＰＷ２ ) OR
007180                           ( 作３－請求年     NOT = 請求年ＰＷ２   ) OR
007190                           ( 作３－請求月     NOT = 請求月ＰＷ２   ) OR
007200                           ( 作３－印刷区分   NOT = 印刷区分ＰＷ２ ) 
007210
007220
007230                 MOVE 作３－請求和暦     TO 請求和暦ＰＷ２
007240                 MOVE 作３－請求年       TO 請求年ＰＷ２
007250                 MOVE 作３－請求月       TO 請求月ＰＷ２
007260                 MOVE 作３－印刷区分     TO 印刷区分ＰＷ２
007270
007280                 PERFORM 作業ファイル３読込
007290             END-PERFORM
007300             PERFORM 印刷処理３
007310*
007320*
007330         END-PERFORM
007340
007350     END-IF.
007360
007370*
007380*================================================================*
007390 印刷処理３ SECTION.
007400*
007410* 印刷処理２で抽出した印刷区分に対して、印刷処理を行う
007420     MOVE 請求和暦ＰＷ２    TO  作２－請求和暦.
007430     MOVE 請求年ＰＷ２      TO  作２－請求年.
007440     MOVE 請求月ＰＷ２      TO  作２－請求月.
007450     MOVE LOW-VALUE         TO  作２－保険者番号.
007460     MOVE 印刷区分ＰＷ２    TO  作２－印刷区分.
007470     MOVE ZERO              TO  作２－保険区分.
007480     MOVE ZERO              TO  作２－当月区分.
007490     MOVE ZERO              TO  作２－本人家族区分.
007500     MOVE LOW-VALUE         TO  作２－被保険者カナ.
007510     MOVE LOW-VALUE         TO  作２－患者カナ.
007520     MOVE ZERO              TO  作２－施術和暦.
007530     MOVE ZERO              TO  作２－施術年.
007540     MOVE ZERO              TO  作２－施術月.
007550     MOVE ZERO              TO  作２－患者番号
007560     MOVE LOW-VALUE         TO  作２－枝番
007570     
007580     START 作業ファイル２   KEY IS >=  作２－請求和暦年月
007590                                       作２－印刷区分
007600                                       作２－保険区分
007610                                       作２－保険者番号
007620                                       作２－本人家族区分
007630                                       作２－被保険者カナ
007640                                       作２－患者カナ
007650                                       作２－当月区分
007660                                       作２－施術和暦年月
007670                                       作２－患者コード
007680     END-START.
007690     IF 状態キー = "00"
007700
007710         MOVE SPACE TO 終了フラグ
007720         INITIALIZE 小計Ｗ
007730         INITIALIZE 合計Ｗ
007740         MOVE 20    TO 最大行数
007750         MOVE 1     TO 頁カウンタ
007760         PERFORM 作業ファイル２読込
007770         IF  終了フラグ = "YES"
007780             MOVE  NC"　　　該当するデータがありません。" TO 連メ－メッセージ
007790             CALL   "MSG001"
007800             CANCEL "MSG001"
007810             PERFORM ファイル閉鎖
007820             MOVE 99 TO PROGRAM-STATUS
007830             EXIT PROGRAM
007840         END-IF
007850         PERFORM UNTIL 終了フラグ = "YES"
007860*
007870             MOVE 作２－請求和暦     TO 請求和暦ＰＷ
007880             MOVE 作２－請求年       TO 請求年ＰＷ
007890             MOVE 作２－請求月       TO 請求月ＰＷ
007900             MOVE 作２－印刷区分     TO 印刷区分ＰＷ
007910             PERFORM ヘッダセット２
007920             PERFORM ヘッダ印字処理
007930*
007940             PERFORM UNTIL ( 終了フラグ = "YES" ) OR
007950                           ( 行カウンタ > 最大行数 )  OR
007960                           ( 作２－請求和暦   NOT = 請求和暦ＰＷ ) OR
007970                           ( 作２－請求年     NOT = 請求年ＰＷ   ) OR
007980                           ( 作２－請求月     NOT = 請求月ＰＷ   ) OR
007990                           ( 作２－印刷区分   NOT = 印刷区分ＰＷ ) 
008000                 PERFORM 明細部セット２
008010                 PERFORM 明細印字処理
008020                 PERFORM 合計額累計２
008030                 PERFORM 作業ファイル２読込
008040             END-PERFORM
008050*
008060             IF ( 行カウンタ > 最大行数 )
008070                 IF  ( 終了フラグ = "YES" ) OR 
008080                     ( 作２－請求和暦   NOT = 請求和暦ＰＷ ) OR
008090                     ( 作２－請求年     NOT = 請求年ＰＷ   ) OR
008100                     ( 作２－請求月     NOT = 請求月ＰＷ   ) OR
008110                     ( 作２－印刷区分   NOT = 印刷区分ＰＷ ) 
008120                     PERFORM 合計セット
008130                     PERFORM 合計印字処理
008140                     INITIALIZE 合計Ｗ
008150                     PERFORM 改頁処理
008160                     MOVE 1  TO 頁カウンタ
008170                     MOVE "YES"  TO 終了フラグ
008180                 ELSE
008190                     PERFORM 改頁処理
008200                     COMPUTE 頁カウンタ = 頁カウンタ + 1
008210                 END-IF
008220             ELSE
008230                 PERFORM 合計セット
008240                 PERFORM 合計印字処理
008250                 INITIALIZE 合計Ｗ
008260                 PERFORM 改頁処理
008270                 MOVE 1  TO 頁カウンタ
008280                 MOVE "YES"  TO 終了フラグ
008290             END-IF
008300*
008310         END-PERFORM
008320
008330     END-IF.
008340*
008350*================================================================*
008360 一部印刷処理 SECTION.
008370*
008380     MOVE SPACE TO 終了フラグ.
008390     INITIALIZE 小計Ｗ.
008400     INITIALIZE 合計Ｗ.
008410     MOVE 20    TO 最大行数.
008420     MOVE 1     TO 頁カウンタ.
008430     PERFORM 作業ファイル１読込.
008440     IF  終了フラグ = "YES"
008450         MOVE "YES"  TO 対象なしフラグ
008460     END-IF.
008470     PERFORM UNTIL 終了フラグ = "YES"
008480*
008490         MOVE 作１－請求和暦     TO 請求和暦ＰＷ
008500         MOVE 作１－請求年       TO 請求年ＰＷ
008510         MOVE 作１－請求月       TO 請求月ＰＷ
008520         MOVE 作１－印刷区分     TO 印刷区分ＰＷ
008530         PERFORM ヘッダセット
008540         PERFORM ヘッダ印字処理
008550*
008560         PERFORM UNTIL ( 終了フラグ = "YES" ) OR ( 行カウンタ > 最大行数 )  OR
008570                       ( 作１－請求和暦   NOT = 請求和暦ＰＷ ) OR
008580                       ( 作１－請求年     NOT = 請求年ＰＷ   ) OR
008590                       ( 作１－請求月     NOT = 請求月ＰＷ   ) OR
008600                       ( 作１－印刷区分   NOT = 印刷区分ＰＷ ) 
008610             PERFORM 明細部セット
008620             PERFORM 明細印字処理
008630             PERFORM 合計額累計
008640             PERFORM 作業ファイル１読込
008650         END-PERFORM
008660*
008670         PERFORM 合計セット
008680         PERFORM 合計印字処理
008690         PERFORM 改頁処理
008700*
008710     END-PERFORM.
008720*
008730*================================================================*
008740 保険種別ごと印刷処理 SECTION.
008750*
008760     CLOSE 作業ファイル１.
008770     OPEN INPUT 作業ファイル１
008780         MOVE NC"作業１" TO ファイル名.
008790         PERFORM オープンチェック.
008800*
008810     MOVE SPACE TO 終了フラグ.
008820     INITIALIZE 小計Ｗ.
008830     INITIALIZE 合計Ｗ.
008840     MOVE 20    TO 最大行数.
008850     MOVE 1     TO 頁カウンタ.
008860     PERFORM 作業ファイル１読込.
008870     IF  終了フラグ = "YES"
008880         MOVE  NC"　　　該当するデータがありません。" TO 連メ－メッセージ
008890         CALL   "MSG001"
008900         CANCEL "MSG001"
008910         PERFORM ファイル閉鎖
008920         MOVE 99 TO PROGRAM-STATUS
008930         EXIT PROGRAM
008940     END-IF.
008950     PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008960                   ( 作１－印刷区分   = 印刷区分Ｗ ) 
008970         PERFORM 作業ファイル１読込
008980     END-PERFORM.
008990     PERFORM UNTIL ( 終了フラグ = "YES" ) OR
009000                   ( 作１－印刷区分   NOT = 印刷区分Ｗ ) 
009010*
009020         MOVE 作１－請求和暦     TO 請求和暦ＰＷ
009030         MOVE 作１－請求年       TO 請求年ＰＷ
009040         MOVE 作１－請求月       TO 請求月ＰＷ
009050         PERFORM ヘッダセット
009060         PERFORM ヘッダ印字処理
009070*
009080         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
009090                       ( 行カウンタ > 最大行数 )  OR
009100                       ( 作１－請求和暦   NOT = 請求和暦ＰＷ ) OR
009110                       ( 作１－請求年     NOT = 請求年ＰＷ   ) OR
009120                       ( 作１－請求月     NOT = 請求月ＰＷ   ) OR
009130                       ( 作１－印刷区分   NOT = 印刷区分Ｗ ) 
009140             PERFORM 明細部セット
009150             PERFORM 明細印字処理
009160             PERFORM 合計額累計
009170             PERFORM 作業ファイル１読込
009180         END-PERFORM
009190*
009200         IF ( 行カウンタ > 最大行数 )
009210             IF  ( 終了フラグ = "YES" ) OR 
009220                 ( 作１－請求和暦   NOT = 請求和暦ＰＷ ) OR
009230                 ( 作１－請求年     NOT = 請求年ＰＷ   ) OR
009240                 ( 作１－請求月     NOT = 請求月ＰＷ   ) OR
009250                 ( 作１－印刷区分   NOT = 印刷区分Ｗ ) 
009260                 PERFORM 合計セット
009270                 PERFORM 合計印字処理
009280                 INITIALIZE 合計Ｗ
009290                 PERFORM 改頁処理
009300                 MOVE 1  TO 頁カウンタ
009310             ELSE
009320                 PERFORM 改頁処理
009330                 COMPUTE 頁カウンタ = 頁カウンタ + 1
009340             END-IF
009350         ELSE
009360             PERFORM 合計セット
009370             PERFORM 合計印字処理
009380             INITIALIZE 合計Ｗ
009390             PERFORM 改頁処理
009400             MOVE 1  TO 頁カウンタ
009410         END-IF
009420*
009430     END-PERFORM.
009440*================================================================*
009450 保険種別ごと印刷処理２ SECTION.
009460*
009470     OPEN INPUT 作業ファイル２
009480         MOVE NC"作業２" TO ファイル名.
009490         PERFORM オープンチェック.
009500*
009510     MOVE SPACE TO 終了フラグ.
009520     INITIALIZE 小計Ｗ.
009530     INITIALIZE 合計Ｗ.
009540     MOVE 20    TO 最大行数.
009550     MOVE 1     TO 頁カウンタ.
009560*
009570     MOVE 連入－請求和暦    TO  作２－請求和暦.
009580     MOVE 連入－請求年      TO  作２－請求年.
009590     MOVE 連入－請求月      TO  作２－請求月.
009600     MOVE 印刷区分Ｗ        TO  作２－印刷区分.
009610     MOVE LOW-VALUE         TO  作２－保険者番号.
009620     MOVE ZERO              TO  作２－保険区分.
009630     MOVE ZERO              TO  作２－当月区分.
009640     MOVE ZERO              TO  作２－本人家族区分.
009650     MOVE LOW-VALUE         TO  作２－被保険者カナ.
009660     MOVE LOW-VALUE         TO  作２－患者カナ.
009670     MOVE ZERO              TO  作２－施術和暦.
009680     MOVE ZERO              TO  作２－施術年.
009690     MOVE ZERO              TO  作２－施術月.
009700     MOVE ZERO              TO  作２－患者番号
009710     MOVE LOW-VALUE         TO  作２－枝番
009720     
009730     START 作業ファイル２   KEY IS >=  作２－請求和暦年月
009740                                       作２－印刷区分
009750                                       作２－保険区分
009760                                       作２－保険者番号
009770                                       作２－本人家族区分
009780                                       作２－被保険者カナ
009790                                       作２－患者カナ
009800                                       作２－当月区分
009810                                       作２－施術和暦年月
009820                                       作２－患者コード
009830     END-START.
009840     IF 状態キー = "00"
009850
009860         MOVE SPACE TO 終了フラグ
009870         INITIALIZE 小計Ｗ
009880         INITIALIZE 合計Ｗ
009890         MOVE 20    TO 最大行数
009900         MOVE 1     TO 頁カウンタ
009910         PERFORM 作業ファイル２読込
009920         IF  終了フラグ = "YES"
009930             MOVE  NC"　　　該当するデータがありません。" TO 連メ－メッセージ
009940             CALL   "MSG001"
009950             CANCEL "MSG001"
009960             PERFORM ファイル閉鎖
009970             MOVE 99 TO PROGRAM-STATUS
009980             EXIT PROGRAM
009990         END-IF
010000         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
010010                       ( 作２－印刷区分   NOT = 印刷区分Ｗ ) 
010020*
010030             MOVE 作２－請求和暦     TO 請求和暦ＰＷ
010040             MOVE 作２－請求年       TO 請求年ＰＷ
010050             MOVE 作２－請求月       TO 請求月ＰＷ
010060             PERFORM ヘッダセット２
010070             PERFORM ヘッダ印字処理
010080*
010090             PERFORM UNTIL ( 終了フラグ = "YES" ) OR
010100                           ( 行カウンタ > 最大行数 )  OR
010110                           ( 作２－請求和暦   NOT = 請求和暦ＰＷ ) OR
010120                           ( 作２－請求年     NOT = 請求年ＰＷ   ) OR
010130                           ( 作２－請求月     NOT = 請求月ＰＷ   ) OR
010140                           ( 作２－印刷区分   NOT = 印刷区分Ｗ ) 
010150                 PERFORM 明細部セット２
010160                 PERFORM 明細印字処理
010170                 PERFORM 合計額累計２
010180                 PERFORM 作業ファイル２読込
010190             END-PERFORM
010200*
010210             IF ( 行カウンタ > 最大行数 )
010220                 IF  ( 終了フラグ = "YES" ) OR 
010230                     ( 作２－請求和暦   NOT = 請求和暦ＰＷ ) OR
010240                     ( 作２－請求年     NOT = 請求年ＰＷ   ) OR
010250                     ( 作２－請求月     NOT = 請求月ＰＷ   ) OR
010260                     ( 作２－印刷区分   NOT = 印刷区分Ｗ ) 
010270                     PERFORM 合計セット
010280                     PERFORM 合計印字処理
010290                     INITIALIZE 合計Ｗ
010300                     PERFORM 改頁処理
010310                     MOVE 1  TO 頁カウンタ
010320                     MOVE "YES"  TO 終了フラグ
010330                 ELSE
010340                     PERFORM 改頁処理
010350                     COMPUTE 頁カウンタ = 頁カウンタ + 1
010360                 END-IF
010370             ELSE
010380                 PERFORM 合計セット
010390                 PERFORM 合計印字処理
010400                 INITIALIZE 合計Ｗ
010410                 PERFORM 改頁処理
010420                 MOVE 1  TO 頁カウンタ
010430                 MOVE "YES"  TO 終了フラグ
010440             END-IF
010450*
010460         END-PERFORM
010470
010480     END-IF.
010490*
010500     CLOSE 作業ファイル２.
010510*
010520*================================================================*
010530 印刷区分取得 SECTION.
010540*
010550     EVALUATE 保険種別ＷＲ
010560     WHEN 01
010570         MOVE 2      TO 印刷区分Ｗ
010580     WHEN 02
010590     WHEN 06
010600     WHEN 07
010610         MOVE 1       TO 印刷区分Ｗ
010620     WHEN 03
010630         MOVE 12      TO 印刷区分Ｗ
010640     WHEN 04
010650         MOVE 13      TO 印刷区分Ｗ
010660     WHEN 09
010670         MOVE 13      TO 印刷区分Ｗ
010680     WHEN 08
010690         MOVE 4       TO 印刷区分Ｗ
010700     WHEN 05
010710         MOVE 5       TO 印刷区分Ｗ
010720     WHEN 51
010730         MOVE 6       TO 印刷区分Ｗ
010740     WHEN 52
010750         MOVE 7       TO 印刷区分Ｗ
010760     WHEN 53
010770         MOVE 9       TO 印刷区分Ｗ
010780     WHEN 54
010790         MOVE 10      TO 印刷区分Ｗ
010800     WHEN 55
010810         MOVE 8       TO 印刷区分Ｗ
010820     WHEN 60
010830         MOVE 11      TO 印刷区分Ｗ
010840     END-EVALUATE.
010850*
010860*================================================================*
010870 作業ファイル１読込 SECTION.
010880*
010890     READ 作業ファイル１ NEXT
010900     AT END
010910         MOVE "YES" TO 終了フラグ
010920     END-READ.
010930*
010940*================================================================*
010950 作業ファイル２読込 SECTION.
010960*
010970     READ 作業ファイル２ NEXT
010980     AT END
010990         MOVE "YES" TO 終了フラグ
011000     END-READ.
011010*
011020*================================================================*
011030 作業ファイル３読込 SECTION.
011040*
011050     READ 作業ファイル３ NEXT
011060     AT END
011070         MOVE "YES" TO 終了フラグ２
011080     END-READ.
011090*
011100*================================================================*
011110 作業ファイル２書込 SECTION.
011120*
011130     WRITE 作２－レコード
011140     INVALID KEY
011150         MOVE NC"作２"  TO ファイル名
011160         PERFORM エラー表示
011170     END-WRITE.
011180*
011190*================================================================*
011200 作業ファイル３書込 SECTION.
011210*
011220     WRITE 作３－レコード
011230     INVALID KEY
011240         MOVE NC"作３"  TO ファイル名
011250         PERFORM エラー表示
011260     END-WRITE.
011270*
011280*================================================================*
011290 ヘッダ印字処理  SECTION.
011300*
011310     IF ( オープンフラグ NOT = "YES" )
011311        MOVE "YES" TO オープンフラグ
011312        OPEN I-O  印刷ファイル
011313        PERFORM エラー処理Ｐ
011314     END-IF.
011315     MOVE "YJK582P" TO  定義体名Ｐ.
011320     MOVE SPACE     TO  処理種別Ｐ.
011330     MOVE "HEAD"    TO  項目群名Ｐ.
011340     WRITE YJK582P.
011350     PERFORM エラー処理Ｐ.
011360     MOVE SPACE TO YJK582P.
011370*================================================================*
011380 明細印字処理  SECTION.
011390*
011400     MOVE "YJK582P" TO  定義体名Ｐ.
011410     MOVE SPACE     TO  処理種別Ｐ.
011420     MOVE "GRP001"  TO  項目群名Ｐ.
011430     WRITE YJK582P.
011440     PERFORM エラー処理Ｐ.
011450     MOVE SPACE TO YJK582P.
011460*================================================================*
011470 合計印字処理  SECTION.
011480*
011490     MOVE "YJK582P" TO  定義体名Ｐ.
011500     MOVE SPACE     TO  処理種別Ｐ.
011510     MOVE "FOOT"    TO  項目群名Ｐ.
011520     WRITE YJK582P.
011530     PERFORM エラー処理Ｐ.
011540     MOVE SPACE TO YJK582P.
011550*================================================================*
011560 改頁処理  SECTION.
011570
011580     MOVE "YJK582P" TO  定義体名Ｐ.
011590     MOVE "CT"      TO  処理種別Ｐ.
011600     MOVE "PAGE"    TO  拡張制御Ｐ.
011610     MOVE SPACE     TO  項目群名Ｐ.
011620     WRITE YJK582P.
011630     PERFORM エラー処理Ｐ.
011640     MOVE SPACE     TO  拡張制御Ｐ.
011650*
011660*================================================================*
011670 ヘッダセット SECTION.
011680*
011690     MOVE 連入－請求和暦 TO 請求和暦ＰＷ.
011700     MOVE 請求和暦ＰＷ     TO 元－元号区分.
011710     READ 元号マスタ
011720     INVALID KEY
011730         MOVE SPACE         TO 請求和暦
011740     NOT INVALID KEY
011750         MOVE 元－元号名称  TO 日本語変換Ｎ
011751         MOVE 日本語変換Ｘ  TO 請求和暦
011760     END-READ.
011770     MOVE 連入－請求年   TO 請求年.
011780     MOVE 連入－請求月   TO 請求月.
011790     MOVE 頁カウンタ     TO 頁.
011800*
011810* 会員番号を取得
011820     MOVE 00         TO 施情－施術所番号.
011830     READ 施術所情報マスタ
011840     INVALID KEY
011850         MOVE SPACE       TO 会員番号
011860         MOVE SPACE       TO 代表者名
011870     NOT INVALID KEY
011880         MOVE 施情－新柔整師番号      TO 柔整師番号
011890         MOVE 施情－接骨師会会員番号  TO 会員番号
011900         MOVE 施情－接骨院名          TO 接骨院名
011910         MOVE 施情－代表者名          TO 代表者名
011920     END-READ.
011930     EVALUATE 作１－印刷区分
011940     WHEN 1
011950         MOVE "社保・船員"            TO 印刷種別
011960     WHEN 2
011970     WHEN 4
011980         MOVE "国保・退国"            TO 印刷種別
011990     WHEN 3
012000         MOVE "国保組合"              TO 印刷種別
012010     WHEN 5
012020         MOVE "老健法老人"            TO 印刷種別
012030     WHEN 6
012040         MOVE "公費老人"              TO 印刷種別
012050     WHEN 7
012060         MOVE "母子家庭"              TO 印刷種別
012070     WHEN 8
012080         MOVE "乳幼児"                TO 印刷種別
012090     WHEN 9
012100         MOVE "障害者"                TO 印刷種別
012110     WHEN 10
012120         MOVE "被爆者"                TO 印刷種別
012130     WHEN 11
012140         MOVE "その他"                TO 印刷種別
012150     WHEN 12
012160         MOVE "組合保険"              TO 印刷種別
012170     WHEN 13
012180         MOVE "共済組合"              TO 印刷種別
012190     END-EVALUATE.
012200*
012210     MOVE 1    TO 行カウンタ.
012220*
012230*================================================================*
012240 ヘッダセット２ SECTION.
012250*
012260     MOVE 連入－請求和暦 TO 請求和暦ＰＷ.
012270     MOVE 請求和暦ＰＷ     TO 元－元号区分.
012280     READ 元号マスタ
012290     INVALID KEY
012300         MOVE SPACE         TO 請求和暦
012310     NOT INVALID KEY
012320         MOVE 元－元号名称  TO 日本語変換Ｎ
012321         MOVE 日本語変換Ｘ  TO 請求和暦
012330     END-READ.
012340     MOVE 連入－請求年   TO 請求年.
012350     MOVE 連入－請求月   TO 請求月.
012360     MOVE 頁カウンタ     TO 頁.
012370*
012380* 会員番号を取得
012390     MOVE 00         TO 施情－施術所番号.
012400     READ 施術所情報マスタ
012410     INVALID KEY
012420         MOVE SPACE       TO 会員番号
012430         MOVE SPACE       TO 代表者名
012440     NOT INVALID KEY
012450         MOVE 施情－新柔整師番号      TO 柔整師番号
012460         MOVE 施情－接骨師会会員番号  TO 会員番号
012470         MOVE 施情－接骨院名          TO 接骨院名
012480         MOVE 施情－代表者名          TO 代表者名
012490     END-READ.
012500     EVALUATE 作２－印刷区分
012510     WHEN 1
012520         MOVE "社保・船員"          TO 印刷種別
012530     WHEN 2
012540     WHEN 4
012550         MOVE "国保・退国"          TO 印刷種別
012560     WHEN 3
012570         MOVE "国保組合"            TO 印刷種別
012580     WHEN 5
012590         MOVE "老健法老人"          TO 印刷種別
012600     WHEN 6
012610         MOVE "公費老人"            TO 印刷種別
012620     WHEN 7
012630         MOVE "母子家庭"            TO 印刷種別
012640     WHEN 8
012650         MOVE "乳幼児"              TO 印刷種別
012660     WHEN 9
012670         MOVE "障害者"              TO 印刷種別
012680     WHEN 10
012690         MOVE "被爆者"              TO 印刷種別
012700     WHEN 11
012710         MOVE "その他"              TO 印刷種別
012720     WHEN 12
012730         MOVE "組合保険"            TO 印刷種別
012740     WHEN 13
012750         MOVE "共済組合"            TO 印刷種別
012760     END-EVALUATE.
012770*
012780     MOVE 1    TO 行カウンタ.
012790*
012800*================================================================*
012810 明細部セット SECTION.
012820*
012830     IF ( 印刷形式ＷＲ = ZERO )
012840        PERFORM レセプト並び順セット
012850     END-IF.
012860*
012870     MOVE 作１－保険者番号   TO 保険者番号ＷＲ
012880     MOVE 作１－保険種別     TO 保険種別Ｗ
012890     IF ( 作１－老人レコード区分 = 1 ) OR
012900        ( 作１－助成レコード区分 = 1 )
012910         PERFORM 市町村情報取得
012920     ELSE
012930         PERFORM 請求先情報取得
012940     END-IF.
012950     IF 作１－保険種別 = 8
012960         MOVE "(退職)"        TO 保険種別
012970     END-IF.
012980*
012990     MOVE 作１－被保険者氏名  TO 被保険者氏名.
013000     IF 作１－本人家族区分 = 1
013010         MOVE "本人"        TO 続柄
013020     ELSE
013030         MOVE "家族"        TO 続柄
013040     END-IF.
013050**
013060     MOVE 作１－費用額       TO 合計額.
013070     MOVE 作１－請求額       TO 請求額.
013080*
013090     IF 作１－請求和暦年月 NOT = 作１－施術和暦年月
013100         MOVE 作１－施術年    TO 施術年
013110         MOVE 作１－施術月    TO 施術月
013120         MOVE "/"             TO 区切り
013130     END-IF.
013140*
013150     COMPUTE 行カウンタ = 行カウンタ + 1.
013160*
013170*================================================================*
013180 明細部セット２ SECTION.
013190*
013200     IF ( 印刷形式ＷＲ = ZERO )
013210        PERFORM レセプト並び順セット２
013220     END-IF.
013230*
013240     MOVE 作２－保険者番号   TO 保険者番号ＷＲ
013250     MOVE 作２－保険種別     TO 保険種別Ｗ
013260     IF ( 作２－老人レコード区分 = 1 ) OR
013270        ( 作２－助成レコード区分 = 1 )
013280         PERFORM 市町村情報取得
013290     ELSE
013300         PERFORM 請求先情報取得
013310     END-IF.
013320     IF 作２－保険種別 = 8
013330         MOVE "(退職)"        TO 保険種別
013340     END-IF.
013350*
013360     MOVE 作２－被保険者氏名  TO 被保険者氏名.
013370     IF 作２－本人家族区分 = 1
013380         MOVE "本人"        TO 続柄
013390     ELSE
013400         MOVE "家族"        TO 続柄
013410     END-IF.
013420**
013430     MOVE 作２－費用額       TO 合計額.
013440     MOVE 作２－請求額       TO 請求額.
013450*
013460     IF 作２－請求和暦年月 NOT = 作２－施術和暦年月
013470         MOVE 作２－施術年    TO 施術年
013480         MOVE 作２－施術月    TO 施術月
013490         MOVE "/"             TO 区切り
013500     END-IF.
013510*
013520     COMPUTE 行カウンタ = 行カウンタ + 1.
013530*
013540*================================================================*
013550 レセプト並び順セット SECTION.
013560*
013570     MOVE 作１－施術和暦     TO 作４－施術和暦.
013580     MOVE 作１－施術年       TO 作４－施術年.
013590     MOVE 作１－施術月       TO 作４－施術月.
013600     MOVE 作１－患者コード   TO 作４－患者コード.
013610     MOVE 作１－保険種別     TO 作４－保険種別.
013620     READ 作業ファイル４
013630     NOT INVALID KEY
013640          MOVE 作４－順番    TO 番号
013650     END-READ.
013660*
013670*================================================================*
013680 レセプト並び順セット２ SECTION.
013690*
013700     MOVE 作２－施術和暦     TO 作４－施術和暦.
013710     MOVE 作２－施術年       TO 作４－施術年.
013720     MOVE 作２－施術月       TO 作４－施術月.
013730     MOVE 作２－患者コード   TO 作４－患者コード.
013740     MOVE 作２－保険種別     TO 作４－保険種別.
013750     READ 作業ファイル４
013760     NOT INVALID KEY
013770          MOVE 作４－順番    TO 番号
013780     END-READ.
013790*
013800*================================================================*
013810 合計額累計 SECTION.
013820*
013830*     COMPUTE 小計件数Ｗ     = 小計件数Ｗ      + 1.
013840*     COMPUTE 費用額小計Ｗ   = 費用額小計Ｗ    + 作１－費用額.
013850*     COMPUTE 負担額小計Ｗ   = 負担額小計Ｗ    + 作１－負担額.
013860*     COMPUTE 請求額小計Ｗ   = 請求額小計Ｗ    + 作１－請求額.
013870*
013880     COMPUTE 合計件数Ｗ     = 合計件数Ｗ      + 1.
013890     COMPUTE 費用額合計Ｗ   = 費用額合計Ｗ    + 作１－費用額.
013900     COMPUTE 負担額合計Ｗ   = 負担額合計Ｗ    + 作１－負担額.
013910     COMPUTE 請求額合計Ｗ   = 請求額合計Ｗ    + 作１－請求額.
013920*
013930*================================================================*
013940 合計額累計２ SECTION.
013950*
013960*     COMPUTE 小計件数Ｗ     = 小計件数Ｗ      + 1.
013970*     COMPUTE 費用額小計Ｗ   = 費用額小計Ｗ    + 作１－費用額.
013980*     COMPUTE 負担額小計Ｗ   = 負担額小計Ｗ    + 作１－負担額.
013990*     COMPUTE 請求額小計Ｗ   = 請求額小計Ｗ    + 作１－請求額.
014000*
014010     COMPUTE 合計件数Ｗ     = 合計件数Ｗ      + 1.
014020     COMPUTE 費用額合計Ｗ   = 費用額合計Ｗ    + 作２－費用額.
014030     COMPUTE 負担額合計Ｗ   = 負担額合計Ｗ    + 作２－負担額.
014040     COMPUTE 請求額合計Ｗ   = 請求額合計Ｗ    + 作２－請求額.
014050*================================================================*
014060 合計セット SECTION.
014070*
014080     MOVE 費用額合計Ｗ TO  合計合計金額.
014090     MOVE 請求額合計Ｗ TO  合計請求額.
014100*================================================================*
014110 請求先情報取得 SECTION.
014120*
014130*********************************************************
014140* 連結データから保険者マスタより請求先を取得する。      *
014150* ● 請求先...... 請求先名称Ｗに格納                    *
014160*********************************************************
014170     MOVE 保険種別Ｗ     TO 保－保険種別.
014180     MOVE 保険者番号ＷＲ TO 保－保険者番号.
014190     READ 保険者マスタ
014200     INVALID KEY
014210         MOVE SPACE           TO 保険者名
014220     NOT INVALID KEY
014230         MOVE 保－保険者名称  TO 保険者名
014240     END-READ.
014250*================================================================*
014260 市町村情報取得 SECTION.
014270*
014280****************************************************
014290* 連結データから保険者マスタより請求先を取得する。 *
014300* ● 請求先...... 請求先名称Ｗに格納               *
014310****************************************************
014320     MOVE 保険種別Ｗ          TO 市－公費種別.
014330     MOVE 保険者番号ＷＲ      TO 市－市町村番号.
014340     READ 市町村マスタ
014350     INVALID KEY
014360         MOVE SPACE           TO 保険者名
014370     NOT INVALID KEY
014380         MOVE 市－市町村名称  TO 保険者名
014390     END-READ.
014400*================================================================*
014410 エラー処理Ｐ SECTION.
014420*
014430     IF 通知情報Ｐ NOT = "00"
014440         DISPLAY NC"帳票エラー"              UPON CONS
014450         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
014460         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
014470         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
014480         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
014490                                             UPON CONS
014500         ACCEPT  キー入力 FROM CONS
014510         PERFORM ファイル閉鎖
014520         EXIT PROGRAM
014530     END-IF.
014540
014550*================================================================*
014560 作業ファイル２３作成 SECTION.
014570
014580
014590     OPEN OUTPUT 作業ファイル２
014600         MOVE NC"作業２" TO ファイル名.
014610         PERFORM オープンチェック.
014620
014630     OPEN OUTPUT 作業ファイル３
014640         MOVE NC"作業３" TO ファイル名.
014650         PERFORM オープンチェック.
014660
014670     MOVE SPACE  TO 終了フラグ.
014680     PERFORM 作業ファイル１読込.
014690     PERFORM UNTIL 終了フラグ = "YES" 
014700         MOVE SPACE TO 作２－レコード
014710         INITIALIZE    作２－レコード
014720         MOVE 作１－印刷区分         TO 作２－印刷区分     作３－印刷区分
014730         MOVE 作１－請求和暦         TO 作２－請求和暦     作３－請求和暦
014740         MOVE 作１－請求年           TO 作２－請求年       作３－請求年
014750         MOVE 作１－請求月           TO 作２－請求月       作３－請求月
014760         MOVE 作１－施術和暦         TO 作２－施術和暦     作３－施術和暦
014770         MOVE 作１－施術年           TO 作２－施術年       作３－施術年
014780         MOVE 作１－施術月           TO 作２－施術月       作３－施術月
014790         MOVE 作１－患者カナ         TO 作２－患者カナ     作３－患者カナ
014800         MOVE 作１－患者コード       TO 作２－患者コード   作３－患者コード
014810         MOVE 作１－被保険者カナ     TO 作２－被保険者カナ 作３－被保険者カナ
014820         MOVE 作１－被保険者氏名     TO 作２－被保険者氏名 作３－被保険者氏名
014830         MOVE 作１－本人家族区分     TO 作２－本人家族区分 作３－本人家族区分
014840         MOVE 作１－記号             TO 作２－記号         作３－記号
014850         MOVE 作１－番号             TO 作２－番号         作３－番号
014860
014870         MOVE 作１－費用額           TO 作２－費用額       作３－費用額
014880         MOVE 作１－負担額           TO 作２－負担額       作３－負担額
014890         MOVE 作１－請求額           TO 作２－請求額       作３－請求額
014900         MOVE 作１－保険種別         TO 作２－保険種別     作３－保険種別
014910         MOVE 作１－保険者番号       TO 作２－保険者番号   作３－保険者番号
014920         MOVE 作１－親保険種別       TO 作２－親保険種別   作３－親保険種別
014930         MOVE 作１－老人レコード区分 TO 作２－老人レコード区分 作３－老人レコード区分
014940         MOVE 作１－助成レコード区分 TO 作２－助成レコード区分 作３－助成レコード区分
014950         
014960* 保険区分セット
014970         EVALUATE 作１－保険種別
014980* 社保＞船員＞日雇の順
014990* 日雇
015000             WHEN 06
015010                 MOVE 2       TO 作２－保険区分 作３－保険区分
015020* 船員
015030             WHEN 07
015040                 MOVE 1       TO 作２－保険区分 作３－保険区分
015050* 共済＞自衛官の順
015060* 自衛官
015070             WHEN 09
015080                 MOVE 1       TO 作２－保険区分 作３－保険区分
015090             WHEN OTHER
015100                 MOVE ZERO    TO 作２－保険区分 作３－保険区分
015110         END-EVALUATE
015120
015130* 当月区分セット
015140         IF 作１－請求和暦年月 = 作１－施術和暦年月
015150             MOVE ZERO       TO  作２－当月区分 作３－当月区分
015160         ELSE
015170             MOVE 1          TO  作２－当月区分 作３－当月区分
015180         END-IF
015190
015200         
015210         PERFORM 作業ファイル２書込
015220         PERFORM 作業ファイル３書込
015230         
015240         PERFORM 作業ファイル１読込
015250     END-PERFORM.
015260
015270     CLOSE 作業ファイル２ 作業ファイル３.
015280*
015290*================================================================*
015300******************************************************************
015310 END PROGRAM YJK582.
015320******************************************************************
