      *****************************************************************
      * ＢＡＲＫＡＮＲ：バーコード管理Ｆ［ＲＬ＝６４］
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.11.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :レセプトのバーコード整理番号と患者コードの組合せ *
      *             :を管理する                                       *
      *****************************************************************
       01  レコード.
           03  レコードキー.
             05  整理番号                  PIC 9(6).
           03  レコードデータ.
             05 施術和暦年月.
               07 施術和暦                 PIC 9.
               07 施術年月.
                 09 施術年                 PIC 9(2).
                 09 施術月                 PIC 9(2).
             05 患者コード.
               07 患者番号                 PIC 9(6).
               07 枝番                     PIC X.
             05 患者カナ                   PIC X(20).
      *****************************************************************
      * 保険種別・公費種別・助成種別のいずれかをセットする
             05 レセプト種別               PIC 9(2).
      *****************************************************************
             05  FILLER                    PIC X(24).
