000010*****************************************************************
000020* 長期継続者Ｆ　ＣＨＯＫＥＩ．ＤＡＴ ［ＲＬ＝２５６０BYTE］      *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINDOWS                                   *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1998.06.18                                       *
000070* AUTHOR      : 上田　育正                                      *
000080* PURPOSE     :長期継続者を抽出して長期症状を記録               *
000090*****************************************************************
000100 01 レコード.
000110   03 レコードキー.
000120     05 施術和暦年月.
000130       07 施術和暦                   PIC 9.
000140       07 施術年月.
000150         09 施術年                   PIC 9(2).
000160         09 施術月                   PIC 9(2).
000170     05 患者コード.
000180       07 患者番号                   PIC 9(6).
000190       07 枝番                       PIC X.
000200   03 レコードデータ.
000210     05 負傷データ      OCCURS  7.
000220       07 部位コード.
000230         09 負傷種別                 PIC 9(2).
000240         09 部位                     PIC 9(2).
000250         09 左右区分                 PIC 9.
000260         09 負傷位置番号             PIC 9(2).
000270       07 長期期間月日.
000280          09 期間月                  PIC 9(2).
000290          09 期間日                  PIC 9(2).
000300       07 理由文                     PIC X(320).
000310       07 同一理由部位番号           PIC 9.
000320       07 転帰区分                   PIC 9.
000330     05 施術月年齢                   PIC 9(3).
000340     05 更新和暦日時.
000350       07 更新和暦年月日.
000360         09 更新和暦年月.
000370           11 更新和暦               PIC 9.
000380           11 更新年月.
000390             13 更新年               PIC 9(2).
000400             13 更新月               PIC 9(2).
000410         09 更新日                   PIC 9(2).
000420       07 更新時間.
000430         09 更新時                   PIC 9(2).
000440         09 更新分                   PIC 9(2).
000450         09 更新秒                   PIC 9(4).
000460     05 理由コード全体.
000470       07 理由コード                 PIC 9(4) OCCURS  7.
000480     05 頻回データ.
000490       07 頻回区分      OCCURS  7    PIC 9(1).
000500   03 FILLER                         PIC X(164).
