000090*****************************************************************
000091* システム更新履歴Ｆ　dmkirok.dat ［RL=256BYTE］                *
000092*****************************************************************
000093* SYSYTEM NAME:共通                                             *
000094* LANGUAGE PG :NetCOBOL                                         *
000095* PRODUCT DATE:2009.11.05                                       *
000097* PURPOSE     :DM出力記録を管理                                 *
000098*****************************************************************
000099*---------------------------------------------------------------*
000100*	新規ファイル
000101*---------------------------------------------------------------*
000102*
000103*     SELECT  ＤＭ記録Ｆ          ASSIGN      TO        DMKIROKL
000104*                                 ORGANIZATION             IS  INDEXED
000105*                                 ACCESS MODE              IS  DYNAMIC
000106*                                 RECORD KEY               IS  ＤＭ－発行和暦年月日
000107*                                                              ＤＭ－発行枝番
000108*                                                              ＤＭ－患者コード
000109*                                 ALTERNATE RECORD KEY     IS  ＤＭ－患者コード
000110*                                                              ＤＭ－発行和暦年月日
000111*                                                              ＤＭ－発行枝番
000113*                                 FILE STATUS              IS  状態キー
000114*                                 LOCK        MODE         IS  AUTOMATIC.
000115*
000116* FD  ＤＭ記録Ｆ    BLOCK   CONTAINS   1   RECORDS.
000117*     COPY DMKIROK          OF  XFDLIB  JOINING   ＤＭ   AS  PREFIX.
000118*
000119*****************************************************************
000120*****************************************************************
000121*****************************************************************
000122 01 レコード.
000123   03 レコードキー.
000132     05 発行和暦年月日.
000133       07 発行和暦年月.
000134         09 発行和暦                   PIC 9.
000135         09 発行年月.
000136           11 発行年                   PIC 9(2).
000137           11 発行月                   PIC 9(2).
000138       07 発行日                       PIC 9(2).
000139     05 発行枝番                       PIC 9(2).
000144     05 患者コード.
000145       07 患者番号                     PIC 9(6).
000146       07 枝番                         PIC X.
000161   03 レコードデータ.
000162*     / 1:はがき、2:メール
000163     05 媒体区分                       PIC 9.
000164*     / UMEISYOより /
000166     05 出力分類                       PIC 9(3).
000167     05 出力分類名称                   PIC X(50).
000168     05 個別出力分類                   PIC 9(3).
000169     05 個別出力分類名称               PIC X(50).
000170*
000171*     / 効果あり1
000172     05 効果                           PIC X.
000173     05 効果和暦年月日.
000174       07 効果和暦年月.
000175         09 効果和暦                   PIC 9.
000176         09 効果年月.
000177           11 効果年                   PIC 9(2).
000178           11 効果月                   PIC 9(2).
000179       07 効果日                       PIC 9(2).
000180*
000181      05 FILLER                        PIC X(125).
000182*
