000010*****************************************************************
000020* Ｈ計画書ファイル H_KEKAKU.DAT ［ＲＬ＝2560BYTE］               *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2021.05.27                                       *
000070* AUTHOR      :山田 浩之                                        *
000080* PURPOSE     :施術計画書                                       *
000090*                                                               *
000100*   用紙区分　帳票名                                            *
000110*      1      施術計画書(鍼灸)                                  *
000120*      2      施術計画書(マッサージ)                            *
000150*                                                               *
000160*****************************************************************
000170*---------------------------------------------------------------*
000180*	SELECT文
000190*---------------------------------------------------------------*
000200**
000210**     SELECT  Ｈ計画書Ｆ      ASSIGN      TO        HKEKAKUL
000210*     SELECT  Ｈ計画書Ｆ      ASSIGN      TO        "C:\makishisys\data\H_KEKAKU.DAT"
000220*                             ORGANIZATION             IS  INDEXED
000230*                             ACCESS                   IS  DYNAMIC
000240*                             RECORD      KEY          IS  Ｈ計－施術区分
000250*                                                          Ｈ計－用紙区分
000260*                                                          Ｈ計－施術和暦年月
000270*                                                          Ｈ計－患者コード
000280*                                                          Ｈ計－連番
      *                             ALTERNATE RECORD KEY     IS  Ｈ計－施術区分
      *                                                          Ｈ計－用紙区分
      *                                                          Ｈ計－患者コード
      *                                                          Ｈ計－施術和暦年月
      *                                                          Ｈ計－施術日
      *                                                          Ｈ計－連番
000350*                             FILE        STATUS       IS  状態キー
000360*                             LOCK        MODE         IS  AUTOMATIC.
000370***
000380*                           ［ＲＬ＝  7520］
000390* FD  Ｈ計画書Ｆ        BLOCK   CONTAINS   1   RECORDS GLOBAL.
000400*     COPY H_KEKAKU          OF  XFDLIB  JOINING   Ｈ計     AS  PREFIX.
000410*
000420*****************************************************************
000430 01 レコード.
000440   03 レコードキー.
000450     05 施術区分                     PIC 9(1).
000460     05 用紙区分                     PIC 9(3).
000480     05 施術和暦年月.
000490         07 施術和暦                 PIC 9.
000500         07 施術年月.
000510           09 施術年                 PIC 9(2).
000520           09 施術月                 PIC 9(2).
000530     05 患者コード.
000540       07 患者番号                   PIC 9(6).
000550       07 枝番                       PIC X.
000560     05 連番                         PIC 9(2).
000570*
000580   03 レコードデータ.
000590* コメント欄は各用紙ごとに再定義して使用します。
000600     05 コメント                    PIC X(7000).
000610*
000620*    *********************************************
000630*    * 用紙区分:1 施術計画書(鍼灸)               *
000640*    *********************************************
000650     05 計画書鍼灸 REDEFINES コメント.
000741       07 患者の症状                PIC X(1000).
000741       07 施術師の所見              PIC X(1000).
000741       07 頻回理由                  PIC X(1000).
000741       07 今後の施術内容            PIC X(1000).
000741       07 症状経過                  PIC X(1000).
000741       07 施術計画                  PIC X(1000).
000741       07 FILLER                    PIC X(1000).
000620*    *********************************************
000630*    * 用紙区分:2 施術計画書(マッサージ)         *
000640*    *********************************************
000650     05 計画書マッサージ REDEFINES コメント.
             07 症状.
               09 筋麻痺計                PIC 9(1).
               09 関節拘縮計              PIC 9(1).
               09 その他計                PIC 9(1).
001040         09 その他症状計            PIC X(100).
             07 現在の状況.
               09 関節可動域制限          PIC 9(1).
               09 拘縮変形                PIC 9(1).
               09 筋力低下                PIC 9(1).
               09 運動機能障害            PIC 9(1).
               09 麻痺                    PIC 9(1).
               09 不随意運動              PIC 9(1).
               09 運動失調                PIC 9(1).
               09 パーキンソニズム        PIC 9(1).
               09 筋緊張異常              PIC 9(1).
000741       07 患者の症状マ              PIC X(1000).
000741       07 施術師の所見マ            PIC X(1000).
000741       07 頻回理由マ                PIC X(1000).
000741       07 今後の施術内容マ          PIC X(1000).
000741       07 症状経過マ                PIC X(1000).
000741       07 施術計画マ                PIC X(1000).
000660       07 施術日                    PIC 9(2).
000741       07 FILLER                    PIC X(886).
000750*
001420*    印刷日
001430     05 印刷和暦年月日.
001440       07 印刷和暦年月.
001450         09 印刷和暦                 PIC 9.
001460         09 印刷年月.
001470           11 印刷年                 PIC 9(2).
001480           11 印刷月                 PIC 9(2).
001490       07 印刷日                     PIC 9(2).
001500
001510     05 FILLER                       PIC X(475).


