000010*****************************************************************
000020* Ｈ送付先Ｄマスタ　H_souhud.dat ［RL=512BYTE］                 *
000030*****************************************************************
000040* SYSYTEM NAME:鍼灸マッサージ                                   *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.03.27                                       *
000080* PURPOSE     :請求書/送付ラベルの送り先毎に送付先情報を管理    *
000090*****************************************************************
000100* RECORD    KEY  : 送付先番号
000101*-------------------------*
000102*まったく変更なし
000103*-------------------------*
000110*****************************************************************
000120 01  レコード.
000130     03  レコードキー.
000140         05  送付先番号                 PIC X(5).
000150     03  レコードデータ.
000160         05  送付先名称                 PIC X(60).
000170         05  送付先部署名               PIC X(60).
000180         05  送付先郵便番号.
000190           07  送付先郵便番号１         PIC X(3).
000200           07  送付先郵便番号２         PIC X(4).
000210         05  送付先住所.
000220           07  送付先住所１             PIC X(40).
000230           07  送付先住所２             PIC X(40).
000240         05  送付先電話番号             PIC X(20).
000250         05  FILLER                     PIC X(280).
