000010*****************************************************************
000020* Ｈ送付先Ｋマスタ　H_souhuk.dat ［RL=64BYTE］                  *
000030*****************************************************************
000040* SYSYTEM NAME:鍼灸マッサージ                                   *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.03.27                                       *
000070* PURPOSE     :請求書/送付ラベルの印刷条件と送付先を管理        *
000080*****************************************************************
000090* RECORD    KEY  : 保険種別 + 県ＪＩＳ + 保険者番号
000100*
000110*-------------------------*
000120*まったく変更なし
000130*-------------------------*
000140*****************************************************************
000150 01  レコード.
000160     03  レコードキー.
000170         05 保険種別                    PIC 9(2).
000180         05 県ＪＩＳ                    PIC X(2).
000190*-----------------------------------------------*
000200* 県ＪＩＳで総括表を印刷する場合は空白
000210* 複数の保険者番号を一箇所に送付する場合に使用
000220         05 保険者番号.
000230           07 法別番号                  PIC X(2).
000240           07 保番.
000250             09 都道府県番号            PIC X(2).
000260             09 保険番号                PIC X(3).
000270             09 検証番号                PIC X.
000280             09 FILLER                  PIC X(2).
000290*-----------------------------------------------*
000300     03  レコードデータ.
000310*-----------------------------------------------*
000320*        0：なし　1：対象
000330         05 総括表区分                  PIC 9.
000340*-----------------------------------------------*
000350*-----------------------------------------------*
000360*        1：不要
000370         05 請求書区分                  PIC 9.
000380*-----------------------------------------------*
000390         05  送付先番号                 PIC X(5).
000400*-----------------------------------------------*
000410         05  更新日付時間.
000420             07 更新西暦年月日.
000430                09 更新西暦年月.
000440                    11 更新西暦年       PIC 9(4).
000450                    11 更新西暦月       PIC 9(2).
000460                09 更新西暦日           PIC 9(2).
000470             07 更新時間.
000480                09 更新時               PIC 9(2).
000490                09 更新分               PIC 9(2).
000500                09 更新秒               PIC 9(4).
000510*-----------------------------------------------*
000520         05 変更後送付先情報.
000530            07 変更開始和暦年月.
000540               09 変更開始和暦          PIC 9.
000550               09 変更開始年月.
000560                  11 変更開始年         PIC 9(2).
000570                  11 変更開始月         PIC 9(2).
000580*-----------------------------------------------*
000590*           0：なし　1：対象
000600            07 総括表区分後             PIC 9.
000610*-----------------------------------------------*
000620*           1：不要
000630            07 請求書区分後             PIC 9.
000640*-----------------------------------------------*
000650            07 送付先番号後             PIC X(5).
000660*
000670         05  FILLER                     PIC X(15).
