000010*****************************************************************
000020* ＨＯＫＥＮＳ：保険者マスタ［ＲＬ＝３２０］                    *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PURPOSE     :保険者の名称・住所・通常の負担率と異なる場合の   *
000090*              負担率を管理                                     *
000091*****************************************************************
000093*基本的に変更なし
000094*---------------------------------------------------------------*
000095*	SELECT文変更なし、桁数位置変更なし、不用（移動）項目FILLER（空き）化
000096*---------------------------------------------------------------*
000100*****************************************************************
000110 01  レコード.
000120     03  レコードキー.
000130         05  保険種別                   PIC 9(2).
000140         05  保険者番号                 PIC X(10).
000150     03  レコードデータ.
000160         05  保険者カナ                 PIC X(40).
000170         05  保険者名称                 PIC X(40).
000180         05  支部部署名.
000190           07  支部名                   PIC X(20).
000200           07  部署名                   PIC X(20).
000210         05  郵便番号.
000220           07  郵便番号１               PIC X(3).
000230           07  郵便番号２               PIC X(4).
000240         05  住所.
000250           07  住所１                   PIC X(40).
000260           07  住所２                   PIC X(40).
000270         05  電話番号                   PIC X(15).
000290         05  都道府県ＪＩＳ             PIC X(2).
000310**
000412*        変更予定の受領委任情報 （空き１を再利用）
000414         05 変更後委任情報.
000415*           受領委任開始年月
000416            07 受領委任開始和暦年月.
000417               09 受領委任開始和暦     PIC 9.
000418               09 受領委任開始年月.
000419                  11 受領委任開始年    PIC 9(2).
000420                  11 受領委任開始月    PIC 9(2).
000421*           開始日付後の受領委任区分
000422            07 受領委任区分後          PIC X(1).
000423*
000424         05  空き１                     PIC X(10).
000425**
000426* 委任区分で使用
000430         05  共済区分                   PIC 9.
000450* 住所・宛名を別ファイルに持っておく。（請求先マスタ）
000460         05  請求先情報区分             PIC 9.
000472**
000473         05  空き２                     PIC X(41).
000783**
000790         05  請求注意区分               PIC 9.
000800         05  負傷原因必要区分           PIC 9.
000810         05  有効期限和暦年月.
000820             07 有効和暦                PIC 9.
000830             07 有効年月.
000840                09 有効年               PIC 9(2).
000850                09 有効月               PIC 9(2).
000860         05  終了理由区分               PIC 9.
000870         05  変更先保険者番号           PIC X(8).
000871*
000872         05 ラベル番号                  PIC X(5).
000874         05 接尾語区分                  PIC 9.
000881*
000893*     現在の受領委任区分(1:受領委任払い　2：償還払い　その他：代理受領(従来請求))
000894         05 受領委任区分                PIC X(1).
000895*
000900         05 FILLER                      PIC X(2).
