000010*****************************************************************
000020* ＪＩＧＹＯＳ：事業所マスタ ［ＲＬ＝384BYTE］               *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.03.30                                       *
000083* PURPOSE     :保険種別＋保険者（健康保険）＋記号毎に事業所（   *
000090*              患者の勤務先）の住所を管理                       *
000091*****************************************************************
000092*---------------------------------------------------------------*
000093*	SELECT文変更なし、項目桁数変更あり
000094*---------------------------------------------------------------*
000100*****************************************************************
000110 01 レコード.
000120   03 レコードキー.
000130     05 保険種別                       PIC 9(2).
000140     05 保険者番号.
000150       07 保番１                       PIC X(2).
000160       07 保番２                       PIC X(8).
000170     05 記号                           PIC X(24).
000180   03 レコードデータ.
000190     05 郵便番号.
000200       07 郵便番号１                   PIC X(3).
000210       07 郵便番号２                   PIC X(4).
000220     05 事業所住所１                   PIC X(50).
000230     05 事業所住所２                   PIC X(50).
000240     05 電話番号                       PIC X(30).
000250     05 事業所名称                     PIC X(60).
000260     05 FILLER                         PIC X(151).
