000010*****************************************************************
000020* 会計データＦ　KAIKEI02.DAT ［ＲＬ＝５１２BYTE］                 *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2010.03.05                                       *
000070* AUTHOR      :山田 浩之                                        *
000080* PURPOSE     :日毎＋患者毎のレセプト内容を記録                 *
      * 労災自賠責用                                                  *
000090*****************************************************************
000100*---------------------------------------------------------------*
000110*	SELECT文変更あり、項目変更あり
000120*---------------------------------------------------------------*
000130*     SELECT  会計データＦ    ASSIGN      TO        KAIKEIL
000140*                             ORGANIZATION             IS  INDEXED
000150*                             ACCESS MODE              IS  DYNAMIC
000160*                             RECORD KEY               IS  会０２－施術和暦年月日
000170*                                                          会０２－患者コード
000180*                             ALTERNATE RECORD KEY     IS  会０２－患者コード
000190*                                                          会０２－施術和暦年月日
000200*                             FILE STATUS              IS  状態キー
000210*                             LOCK        MODE         IS  AUTOMATIC.
000220*
000230* FD  会計データＦ        BLOCK   CONTAINS   1   RECORDS.
000240*     COPY KAIKEI     OF  XFDLIB  JOINING   会０２   AS  PREFIX.
000250*
000260*****************************************************************
000270 01 レコード.
000280   03 レコードキー.
000290     05 施術和暦年月日.
000300       07 施術和暦年月.
000310         09 施術和暦                       PIC 9.
000320         09 施術年月.
000330           11 施術年                       PIC 9(2).
000340           11 施術月                       PIC 9(2).
000350       07 施術日                           PIC 9(2).
000360     05 患者コード.
000370       07 患者番号                         PIC 9(6).
000380       07 枝番                             PIC X.
000390   03 レコードデータ.
000400     05 合計欄.
000410       07 費用額                           PIC 9(6).
000420       07 入金額                           PIC 9(6).
000430       07 一部負担金                       PIC 9(6).
000440       07 自費額                           PIC 9(6).
000450       07 助成計算負担額                   PIC 9(6).
000460       07 例外レセ用金額欄.
000470         09 例外一部負担金                 PIC 9(6).
000480         09 例外助成計算負担額             PIC 9(6).
000490*
000380     05 料金１.
000390        07 初検.
000410           09 初検料                       PIC 9(5).
000440           09 初検加算.
000450              11 初検時間外                PIC 9.
000460              11 初検休日                  PIC 9.
000470              11 初検深夜                  PIC 9.
000480           09 初検加算料                   PIC 9(5).
000490        07 初検時相談料                    PIC 9(4).
000500        07 再検.
000510           09 再検料                       PIC 9(5).
000540        07 往療.
000550           09 往療距離                     PIC 9(2)V9.
000580           09 往療料                       PIC 9(6).
000590           09 往療加算料                   PIC 9(5).
000600           09 往療加算.
000610              11 往療夜間                  PIC 9.
000620              11 往療難路                  PIC 9.
000630              11 往療暴風雨                PIC 9.
000640              11 往療時間外                PIC 9.
000650*        07 金属副子加算料                  PIC 9(5).
000660*        07 金属副子数.
000670*           09 大                           PIC 9.
000680*           09 中                           PIC 9.
000690*           09 小                           PIC 9.
000700        07 情報提供.
000730           09 施術情報提供料               PIC 9(5).
000740*        07 小計                            PIC 9(7).
000750*        07 費用額                          PIC 9(6).
000760*        07 一部負担金                      PIC 9(6).
000770*        07 請求額                          PIC 9(6).
000780*        07 給付割合                        PIC 9(3).
000790*        07 受給者負担額                    PIC 9(6).
000800*        07 助成請求金額                    PIC 9(6).
000810        07 指導管理.
000840           09 指導管理料                   PIC 9(4).
000850        07 運動療法.
000880           09 運動療法料                   PIC 9(4).
000890        07 休業補償証明書.
000920           09 休業補償証明書料             PIC 9(5).
000930        07 宿泊.
000960           09 宿泊料                       PIC 9(5).
000970        07 食事.
001000           09 食事料                       PIC 9(5).
001010*/自賠責保険のみ
001020        07 施術証明書.
001050           09 施術証明書料                 PIC 9(5).
001060        07 施術明細書.
001090           09 施術明細書料                 PIC 9(5).
001100        07 自賠責その他金額                PIC 9(6).
001130     05 料金２.
001140        07 初回処置    OCCURS   7.
001150           09 初回処置料                   PIC 9(5).
001160        07 初回処置料計                    PIC 9(6).
001170        07 材料費                          PIC 9(5) OCCURS 7.
001250        07 包帯交換料                      PIC 9(5) OCCURS 7.
001280     05 料金３.
001290        07 部位１.
001300           09 後療１.
001330              11 後療料１                  PIC 9(5).
001340           09 冷罨法１.
001370              11 冷罨法料１                PIC 9(4).
001380           09 温罨法１.
001410              11 温罨法料１                PIC 9(4).
001420           09 電療１.
001450              11 電療料１                  PIC 9(5).
001780        07 部位２.
001790           09 後療２.
001820              11 後療料２                  PIC 9(5).
001830           09 冷罨法２.
001860              11 冷罨法料２                PIC 9(4).
001870           09 温罨法２.
001900              11 温罨法料２                PIC 9(4).
001910           09 電療２.
001940              11 電療料２                  PIC 9(5).
002270        07 部位３.
002280           09 後療３.
002310              11 後療料３                  PIC 9(5).
002320           09 冷罨法３.
002350              11 冷罨法料３                PIC 9(4).
002360           09 温罨法３.
002390              11 温罨法料３                PIC 9(4).
002400           09 電療３.
002430              11 電療料３                  PIC 9(5).
002760        07 部位４.
002770           09 後療４.
002800              11 後療料４                  PIC 9(5).
002810           09 冷罨法４.
002840              11 冷罨法料４                PIC 9(4).
002850           09 温罨法４.
002880              11 温罨法料４                PIC 9(4).
002890           09 電療４.
002920              11 電療料４                  PIC 9(5).
003250        07 部位５.
003260           09 後療５.
003290              11 後療料５                  PIC 9(5).
003300           09 冷罨法５.
003330              11 冷罨法料５                PIC 9(4).
003340           09 温罨法５.
003370              11 温罨法料５                PIC 9(4).
003380           09 電療５.
003410              11 電療料５                  PIC 9(5).
003740        07 部位６.
003750           09 後療６.
003780              11 後療料６                  PIC 9(5).
003790           09 冷罨法６.
003820              11 冷罨法料６                PIC 9(4).
003830           09 温罨法６.
003860              11 温罨法料６                PIC 9(4).
003870           09 電療６.
003900              11 電療料６                  PIC 9(5).
004230        07 部位７.
004240           09 後療７.
004270              11 後療料７                  PIC 9(5).
004280           09 冷罨法７.
004310              11 冷罨法料７                PIC 9(4).
004320           09 温罨法７.
004350              11 温罨法料７                PIC 9(4).
004360           09 電療７.
004390              11 電療料７                  PIC 9(5).
001791     05 FILLER                             PIC X(135).
001800*
