000010*****************************************************************
000020* ＫＡＲＥＮＤＢ：カレンダマスタ ［ＲＬ＝６４BYTE］
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1998.06.24                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :年月日ＡＬＬ　ＺＥＲＯで制御情報を管理           *
000090*             :曜日・祝日・休診日を管理                         *
000100*****************************************************************
000110* プレフィクス:カＢ－
000120*****************************************************************
000130 01 レコード.
000140   03 レコードキー.
000150     05 カレンダ年月日.
000160       07 カレンダ年月.
000170         09 カレンダ年                 PIC 9(4).
000180         09 カレンダ月                 PIC 9(2).
000190       07 カレンダ日                   PIC 9(2).
000200   03 レコードデータ.
000210     05 曜日                           PIC 9.
000220*****************************************************************
000230* 通常日：ＺＥＲＯ　祝日：１
000240     05 祝日区分                       PIC 9.
000250*
000260*****************************************************************
000270* 通常日：ＺＥＲＯ　全日休診日：１　午後休診日：２　午前休診日：３
000280     05 休診区分                       PIC 9.
000290*****************************************************************
000291*
000293     05 午前天気                       PIC 9(2).
000294     05 午後天気                       PIC 9(2).
000295*
000300     05 FILLER                         PIC X(49).
