      *****************************************************************
      * ＫＥＩＳＡＮ：計算マスタ ［ＲＬ＝２５６BYTE］                 *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.04.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :制御区分（健保01・労災02・自賠03）毎＋開始年月毎 *
      *              に計算に必要な情報を管理                         *
      *****************************************************************
      * 制御区分：０１　健康保険・老人算定情報                        *
      *****************************************************************
       01 レコード.
         03 レコードキー.
           05 制御区分                     PIC 9(2).
           05  開始和暦年月.
             07  開始和暦                  PIC 9.
             07  開始年月.
               09  開始年                  PIC 9(2).
               09  開始月                  PIC 9(2).
         03  レコードデータ.
      * 新規登録の際、ALL 9 を代入する
           05  終了和暦年月.
             07  終了和暦                  PIC 9.
             07  終了年月.
               09  終了年                  PIC 9(2).
               09  終了月                  PIC 9(2).
      * 骨折・不全骨折
           05 冷罨日数骨折                 PIC 9(2).
      * 脱臼
           05 冷罨日数脱臼                 PIC 9(2).
      * 打撲・捻挫
           05 冷罨日数打撲                 PIC 9(2).
      * 骨折・不全骨折
           05 温罨待機骨折                 PIC 9(2).
      * 脱臼・打撲・捻挫
           05 温罨待機脱臼                 PIC 9(2).
      * 往療基本距離
           05 往療基本距離                 PIC 9(2).
      *
      * 後療料・罨法料・電療料の算定可能部位数
           05 後療可能算定数               PIC 9(2).
      * 逓減率（％表示）
           05  逓減率 OCCURS 9.
             07  多部位逓減率              PIC 9(3).
           05  長期逓減.
             07  長期逓減率                PIC 9(3).
             07  長期頻回逓減率            PIC 9(3).
             07  FILLER                    PIC X(21).
      *
             07  長期逓減月境界日          PIC 9(2).
             07  長期逓減月数              PIC 9(2).
      * 定額算定の継続部位数
             07  長期定額部位数            PIC 9.
           05 老人保険.
             07  老人負担回数              PIC 9(2).
             07  公費老人０円請求          PIC 9.
             07  助成老人０円請求          PIC 9.
           05 FILLER                       PIC X(167).
