000090*****************************************************************
000091* 近隣住所マスタ  kinrin.dat ［RL=384BYTE］                     *
000092*****************************************************************
000093* SYSYTEM NAME:共通                                             *
000094* LANGUAGE PG :NetCOBOL                                         *
000095* PRODUCT DATE:2009.04.02                                       *
000097* PURPOSE     :近隣の住所を記録                                 *
000098*****************************************************************
000099*---------------------------------------------------------------*
000100*	新規ファイル
000101*---------------------------------------------------------------*
000102*
000103*     SELECT  近隣住所マスタ      ASSIGN      TO        KINRINL
000104*                                 ORGANIZATION             IS  INDEXED
000105*                                 ACCESS MODE              IS  DYNAMIC
000106*                                 RECORD KEY               IS  近隣－近隣住所番号
000109*                                 ALTERNATE RECORD KEY     IS  近隣－表示順
000110*                                                              近隣－住所カナ
000111*                                                              近隣－近隣住所番号
000113*                                 FILE STATUS              IS  状態キー
000114*                                 LOCK        MODE         IS  AUTOMATIC.
000115*
000116* FD  近隣住所マスタ    BLOCK   CONTAINS   1   RECORDS.
000117*     COPY KINRIN       OF  XFDLIB  JOINING   近隣   AS  PREFIX.
000118*
000121*****************************************************************
000131 01  レコード.
000141     03  レコードキー.
000151         05 近隣住所番号               PIC 9(3).
000181     03  レコードデータ.
000183         05 郵便番号.
000184           07 郵便番号１               PIC X(3).
000185           07 郵便番号２               PIC X(4).
000186         05 住所                       PIC X(100).
000196         05 住所カナ                   PIC X(100).
000301         05 表示順                     PIC 999V999.
000311         05 FILLER                     PIC X(168).
000321*
