000010*****************************************************************
000020* ＬＡＢＥＬ：ラベルマスタ［ＲＬ＝５１２］                      *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2000.03.23                                       *
000080* PURPOSE     :ラベルマスタ                                     *
000081*****************************************************************
000082*まったく変更なし
000083*****************************************************************
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  ラベル番号.
000130             07  ラベル番号１           PIC X(2).
000140             07  ラベル番号２           PIC 9(3).
000150     03  レコードデータ.
000160         05  ラベルカナ                 PIC X(40).
000170         05  ラベル名称                 PIC X(40).
000180         05  支部部署名.
000190           07  支部名                   PIC X(20).
000200           07  部署名                   PIC X(20).
000210         05  郵便番号.
000220           07  郵便番号１               PIC X(3).
000230           07  郵便番号２               PIC X(4).
000240         05  ラベル住所.
000250           07  ラベル住所１             PIC X(40).
000260           07  ラベル住所２             PIC X(40).
000270         05  電話番号                   PIC X(15).
000280         05  FILLER                     PIC X(285).
