000010*****************************************************************
000020* ＭＥＩＳＹＯ：名称マスタ［ＲＬ＝１２８］                      *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PURPOSE     :区分コード毎に＋名称・略称を管理                 *
000083*****************************************************************
000084*まったく変更なし
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000140*******************************************************************
000150* ００：区分コード体系                                            *
000160* ０１：元号　　　　 ０２：保険種別        ０３：負傷種別         *
000170* ０４：転帰区分　　 ０５：続柄　　　　　　０６：世帯主続柄       *
000180* ０７：　　　　　　 ０８：　　　　　　　　０９：                 *
000190* １０：　　　　　　 １１：保険種別(健保)  １２：保険種別(助成)   *
000200* １３：都道府県(JIS)１４：都道府県(社保)  １５：保険種別(市町村) *
000210* １６：　　　　　　 １７：　　　　　　　　１８：請求台帳種別     *
000220* １９：初検加算減算 ２０：初検加算　　　　２１：往療加算         *
000230* ２２：長期症状　　 ２３：　　　　　　　　２４：　　　　         *
000240* ２５：負傷構成　　 ２６：負傷原因　　　　２７：　　　　         *
000250* ２８：　　　　　　 ２９：　　　　　　　　３０：協会　　　       *
000260* ３１：一部負担金地区３２：請求台帳地区                          *
000270* ５０：プリンタ　　 ５１：保険者請求注意　５２：    　　　       *
000280*******************************************************************
000290*
000300         05  名称コード                PIC 9(3).
000310     03  レコードデータ.
000320         05  正式名称                  PIC N(10).
000330         05  正式名称カナ              PIC X(20).
000340         05  略称                      PIC N(6).
000350         05  略称カナ                  PIC X(12).
000360         05  備考１                    PIC X(20).
000370         05  FILLER                    PIC X(39).
