000010*****************************************************************
000020* PREIGAI：パス例外マスタ［ＲＬ＝６４０］                      *
000021*                   ※ パスワード用                             *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000080* LANGUAGE PG :NetCOBOL                                         *
000081* PRODUCT DATE:2009.10.22                                       *
000083* PURPOSE     :区分コード毎に 例外 を管理（実際はパスワードのみ）*
000084***                                                             *
000085* ※ 旧REIGAI05(REIGAI.DAT)を独立ファイルにした                 *
000086*
000087*     SELECT  パス例外マスタ  ASSIGN      TO           PREIGAIL
000088*                             ORGANIZATION             IS  INDEXED
000089*                             ACCESS MODE              IS  DYNAMIC
000090*                             RECORD KEY               IS  パス例外－区分コード
000091*                                                          パス例外－番号コード
000092*                             FILE STATUS              IS  状態キー
000093*                             LOCK        MODE         IS  AUTOMATIC.
000094*
000095* FD  パス例外マスタ     BLOCK   CONTAINS   1   RECORDS.
000096*     COPY PREIGAI       OF  XFDLIB  JOINING   パス例外   AS  PREFIX.
000097*
000098*
000099*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000131*******************************************************************
000132* 区分コードは、05固定 
000133* 番号コードは、ZERO
000137*******************************************************************
000290*
000300         05  番号コード                PIC 9(3).
000310     03  レコードデータ.
000320         05  パスワード内容   OCCURS 90.
000330            07  パスワード             PIC X(6).
000340            07  レベル                 PIC X.
000370         05  FILLER                    PIC X(5).
