000010*****************************************************************
000020* レセプトＦ　RECEPT.DAT ［ＲＬ＝1536BYTE］       *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2010.02.22                                       *
000070* PURPOSE     :月毎＋患者＋種別毎のレセプト内容を記録           *
000080*
000090*---------------------------------------------------------------*
000100*	SELECT文変更あり、項目変更あり
000110*---------------------------------------------------------------*
000120*
000130*     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000140*                             ORGANIZATION             IS  INDEXED
000150*                             ACCESS MODE              IS  DYNAMIC
000160*                             RECORD KEY               IS  レセ－施術和暦年月
000170*                                                          レセ－患者コード
000180*                                                          レセ－レセ種別
000190*                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000200*                                                          レセ－施術和暦年月
000210*                                                          レセ－レセ種別
000220*                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000230*                                                          レセ－施術和暦年月
000240*                                                          レセ－患者コード
000250*                                                          レセ－レセ種別
000260*                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000270*                                                          レセ－レセ種別
000280*                                                          レセ－請求保険者番号
000290*                                                          レセ－患者コード
000300*                                                          レセ－施術和暦年月
000310*                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000320*                                                          レセ－請求保険者番号
000330*                                                          レセ－患者コード
000340*                                                          レセ－レセ種別
000350*                                                          レセ－施術和暦年月
000360*                             FILE STATUS              IS  状態キー
000370*                             LOCK        MODE         IS  AUTOMATIC.
000380*
000390*****************************************************************
000400 01 レコード.
000410   03 レコードキー.
000420     05 施術和暦年月.
000430       07 施術和暦                     PIC 9.
000440       07 施術年月.
000450         09 施術年                     PIC 9(2).
000460         09 施術月                     PIC 9(2).
000470     05 患者コード.
000480       07 患者番号                     PIC 9(6).
000490       07 枝番                         PIC X.
000500*   / 1:一般,2:老人,3:助成,4:労災,5:自賠責,6:自費,7:生保単独,8保険証忘れ /
000510     05 レセ種別                       PIC 9(2).
000520*
000530   03 レコードデータ.
000540     05 請求年月情報.
000541*       / 0：請求　1：月遅れ請求 2:返戻、9：請求しない /
000550        07 請求区分                    PIC 9.
000560        07 請求和暦年月.
000570          09 請求和暦                  PIC 9.
000580          09 請求年月.
000590            11 請求年                  PIC 9(2).
000600            11 請求月                  PIC 9(2).
000610*    0：なし　1：対象
000620     05 請求対象区分                   PIC 9.
000630*
000640     05 請求保険者番号                 PIC X(10).
000650*
000660     05 負傷情報.
000670        07 負傷データ   OCCURS   7.
000671          09 部位名称１                PIC N(10).
000680          09 部位名称２                PIC N(10).
000690          09 部位実日数                PIC 9(2).
000700*
000712*   / 1:新規,2:継続,3:両方 /
000720        07 レセ請求区分                PIC 9.
000730        07 レセ実日数                  PIC 9(2).
000740*
000750     05 合計欄.
000760        07 合計                        PIC 9(6).
000770        07 一部負担金                  PIC 9(6).
000780        07 請求金額                    PIC 9(6).
000790        07 負担割合                    PIC 9(2).
000800        07 給付割合                    PIC 9(2).
000810        07 受給者負担額                PIC 9(6).
000820        07 助成請求金額                PIC 9(6).
000830*
000840     05 印刷レセ金額合計欄.
000850        07 印刷レセ負担額              PIC 9(6).
000860        07 印刷レセ請求額              PIC 9(6).
000870        07 印刷レセ受給者負担額        PIC 9(6).
000880        07 印刷レセ助成請求金額        PIC 9(6).
000890*
000900*    0：なし、1：まとめる
000910     05 本体枝番まとめ区分                 PIC 9.
000920     05 例外本体枝番まとめ単独金額合計欄.
000930        07 例外本体枝番まとめ単独費用額    PIC 9(6).
000940        07 例外本体枝番まとめ単独負担額    PIC 9(6).
000950        07 例外本体枝番まとめ単独請求額    PIC 9(6).
000960*
000970*
000980     05 料金１.
000990        07 初検料                      PIC 9(5).
001000        07 初検加算料                  PIC 9(5).
001010        07 初検加算.
001020          09 時間外                    PIC 9.
001030          09 休日                      PIC 9.
001040          09 深夜                      PIC 9.
001050        07 初検時相談料                PIC 9(4).
001060        07 再検料                      PIC 9(5).
001070        07 往療.
001080          09 往療距離                  PIC 9(2)V9.
001090          09 往療回数                  PIC 9(2).
001100          09 往療料                    PIC 9(6).
001110          09 往療加算料                PIC 9(5).
001120          09 夜間                      PIC 9.
001130          09 暴風雨雪                  PIC 9.
001140          09 難路                      PIC 9.
001150        07 金属副子.
001160          09 大                        PIC 9.
001170          09 中                        PIC 9.
001180          09 小                        PIC 9.
001190        07 金属副子加算料              PIC 9(5).
001200        07 施術情報提供料              PIC 9(5).
001210        07 小計                        PIC 9(6).
001220        07 初回処置料                  PIC 9(5) OCCURS 7.
001230        07 初回処置料合計              PIC 9(6).
001240*
001250     05 部位１.
001260        07 後療１.
001270           09 後療単価１               PIC 9(4).
001280           09 後療回数１               PIC 9(2).
001290           09 後療料１                 PIC 9(5).
001300        07 冷罨法１.
001310           09 冷罨法回数１             PIC 9(2).
001320           09 冷罨法料１               PIC 9(4).
001330        07 温罨法１.
001340           09 温罨法回数１             PIC 9(2).
001350           09 温罨法料１               PIC 9(4).
001360        07 電療１.
001370           09 電療回数１               PIC 9(2).
001380           09 電療料１                 PIC 9(4).
001390        07 小計１                      PIC 9(6).
001400        07 長期逓減率１                PIC 9(3).
001410        07 長期込小計１                PIC 9(6).
001420     05 部位２.
001430        07 後療２.
001440           09 後療単価２               PIC 9(4).
001450           09 後療回数２               PIC 9(2).
001460           09 後療料２                 PIC 9(5).
001470        07 冷罨法２.
001480           09 冷罨法回数２             PIC 9(2).
001490           09 冷罨法料２               PIC 9(4).
001500        07 温罨法２.
001510           09 温罨法回数２             PIC 9(2).
001520           09 温罨法料２               PIC 9(4).
001530        07 電療２.
001540           09 電療回数２               PIC 9(2).
001550           09 電療料２                 PIC 9(4).
001560        07 小計２                      PIC 9(6).
001570        07 長期逓減率２                PIC 9(3).
001580        07 長期込小計２                PIC 9(6).
001590     05 部位３８.
001600        07 後療３８.
001610           09 後療単価３８             PIC 9(4).
001620           09 後療回数３８             PIC 9(2).
001630           09 後療料３８               PIC 9(5).
001640        07 冷罨法３８.
001650           09 冷罨法回数３８           PIC 9(2).
001660           09 冷罨法料３８             PIC 9(4).
001670        07 温罨法３８.
001680           09 温罨法回数３８           PIC 9(2).
001690           09 温罨法料３８             PIC 9(4).
001700        07 電療３８.
001710           09 電療回数３８             PIC 9(2).
001720           09 電療料３８               PIC 9(4).
001730        07 小計３８                    PIC 9(6).
001740        07 多部位込小計３８            PIC 9(6).
001750        07 長期逓減率３８              PIC 9(3).
001760        07 長期込小計３８              PIC 9(6).
001770     05 部位３０.
001780        07 逓減開始月日３０.
001790           09 逓減開始月３０           PIC 9(2).
001800           09 逓減開始日３０           PIC 9(2).
001810        07 後療３０.
001820           09 後療単価３０             PIC 9(4).
001830           09 後療回数３０             PIC 9(2).
001840           09 後療料３０               PIC 9(5).
001850        07 冷罨法３０.
001860           09 冷罨法回数３０           PIC 9(2).
001870           09 冷罨法料３０             PIC 9(4).
001880        07 温罨法３０.
001890           09 温罨法回数３０           PIC 9(2).
001900           09 温罨法料３０             PIC 9(4).
001910        07 電療３０.
001920           09 電療回数３０             PIC 9(2).
001930           09 電療料３０               PIC 9(4).
001940        07 小計３０                    PIC 9(6).
001950        07 長期逓減率３０              PIC 9(3).
001960        07 長期込小計３０              PIC 9(6).
001970     05 部位４５.
001980        07 後療４５.
001990           09 後療単価４５             PIC 9(4).
002000           09 後療回数４５             PIC 9(2).
002010           09 後療料４５               PIC 9(5).
002020        07 冷罨法４５.
002030           09 冷罨法回数４５           PIC 9(2).
002040           09 冷罨法料４５             PIC 9(4).
002050        07 温罨法４５.
002060           09 温罨法回数４５           PIC 9(2).
002070           09 温罨法料４５             PIC 9(4).
002080        07 電療４５.
002090           09 電療回数４５             PIC 9(2).
002100           09 電療料４５               PIC 9(4).
002110        07 小計４５                    PIC 9(6).
002120        07 多部位込小計４５            PIC 9(6).
002130        07 長期逓減率４５              PIC 9(3).
002140        07 長期込小計４５              PIC 9(6).
002150     05 部位４８.
002160        07 逓減開始月日４８.
002170           09 逓減開始月４８           PIC 9(2).
002180           09 逓減開始日４８           PIC 9(2).
002190        07 後療４８.
002200           09 後療単価４８             PIC 9(4).
002210           09 後療回数４８             PIC 9(2).
002220           09 後療料４８               PIC 9(5).
002230        07 冷罨法４８.
002240           09 冷罨法回数４８           PIC 9(2).
002250           09 冷罨法料４８             PIC 9(4).
002260        07 温罨法４８.
002270           09 温罨法回数４８           PIC 9(2).
002280           09 温罨法料４８             PIC 9(4).
002290        07 電療４８.
002300           09 電療回数４８             PIC 9(2).
002310           09 電療料４８               PIC 9(4).
002320        07 小計４８                    PIC 9(6).
002330        07 多部位込小計４８            PIC 9(6).
002340        07 長期逓減率４８              PIC 9(3).
002350        07 長期込小計４８              PIC 9(6).
002360     05 部位４０.
002370        07 逓減開始月日４０.
002380           09 逓減開始月４０           PIC 9(2).
002390           09 逓減開始日４０           PIC 9(2).
002400        07 後療４０.
002410           09 後療単価４０             PIC 9(4).
002420           09 後療回数４０             PIC 9(2).
002430           09 後療料４０               PIC 9(5).
002440        07 冷罨法４０.
002450           09 冷罨法回数４０           PIC 9(2).
002460           09 冷罨法料４０             PIC 9(4).
002470        07 温罨法４０.
002480           09 温罨法回数４０           PIC 9(2).
002490           09 温罨法料４０             PIC 9(4).
002500        07 電療４０.
002510           09 電療回数４０             PIC 9(2).
002520           09 電療料４０               PIC 9(4).
002530        07 小計４０                    PIC 9(6).
002540        07 長期逓減率４０              PIC 9(3).
002550        07 長期込小計４０              PIC 9(6).
002560     05 部位５２.
002570        07 後療５２.
002580           09 後療単価５２             PIC 9(4).
002590           09 後療回数５２             PIC 9(2).
002600           09 後療料５２               PIC 9(5).
002610        07 冷罨法５２.
002620           09 冷罨法回数５２           PIC 9(2).
002630           09 冷罨法料５２             PIC 9(4).
002640        07 温罨法５２.
002650           09 温罨法回数５２           PIC 9(2).
002660           09 温罨法料５２             PIC 9(4).
002670        07 電療５２.
002680           09 電療回数５２             PIC 9(2).
002690           09 電療料５２               PIC 9(4).
002700        07 小計５２                    PIC 9(6).
002710        07 多部位込小計５２            PIC 9(6).
002720        07 長期逓減率５２              PIC 9(3).
002730        07 長期込小計５２              PIC 9(6).
002740     05 部位５５.
002750        07 逓減開始月日５５.
002760           09 逓減開始月５５           PIC 9(2).
002770           09 逓減開始日５５           PIC 9(2).
002780        07 後療５５.
002790           09 後療単価５５             PIC 9(4).
002800           09 後療回数５５             PIC 9(2).
002810           09 後療料５５               PIC 9(5).
002820        07 冷罨法５５.
002830           09 冷罨法回数５５           PIC 9(2).
002840           09 冷罨法料５５             PIC 9(4).
002850        07 温罨法５５.
002860           09 温罨法回数５５           PIC 9(2).
002870           09 温罨法料５５             PIC 9(4).
002880        07 電療５５.
002890           09 電療回数５５             PIC 9(2).
002900           09 電療料５５               PIC 9(4).
002910        07 小計５５                    PIC 9(6).
002920        07 多部位込小計５５            PIC 9(6).
002930        07 長期逓減率５５              PIC 9(3).
002940        07 長期込小計５５              PIC 9(6).
002950     05 部位５８.
002960        07 逓減開始月日５８.
002970           09 逓減開始月５８           PIC 9(2).
002980           09 逓減開始日５８           PIC 9(2).
002990        07 後療５８.
003000           09 後療単価５８             PIC 9(4).
003010           09 後療回数５８             PIC 9(2).
003020           09 後療料５８               PIC 9(5).
003030        07 冷罨法５８.
003040           09 冷罨法回数５８           PIC 9(2).
003050           09 冷罨法料５８             PIC 9(4).
003060        07 温罨法５８.
003070           09 温罨法回数５８           PIC 9(2).
003080           09 温罨法料５８             PIC 9(4).
003090        07 電療５８.
003100           09 電療回数５８             PIC 9(2).
003110           09 電療料５８               PIC 9(4).
003120        07 小計５８                    PIC 9(6).
003130        07 多部位込小計５８            PIC 9(6).
003140        07 長期逓減率５８              PIC 9(3).
003150        07 長期込小計５８              PIC 9(6).
003160     05 部位５０.
003170        07 逓減開始月日５０.
003180           09 逓減開始月５０           PIC 9(2).
003190           09 逓減開始日５０           PIC 9(2).
003200        07 後療５０.
003210           09 後療単価５０             PIC 9(4).
003220           09 後療回数５０             PIC 9(2).
003230           09 後療料５０               PIC 9(5).
003240        07 冷罨法５０.
003250           09 冷罨法回数５０           PIC 9(2).
003260           09 冷罨法料５０             PIC 9(4).
003270        07 温罨法５０.
003280           09 温罨法回数５０           PIC 9(2).
003290           09 温罨法料５０             PIC 9(4).
003300        07 電療５０.
003310           09 電療回数５０             PIC 9(2).
003320           09 電療料５０               PIC 9(4).
003330        07 小計５０                    PIC 9(6).
003340        07 長期逓減率５０              PIC 9(3).
003350        07 長期込小計５０              PIC 9(6).
003360*
003361*●追加-----------------------------------------*
003362*    0：通常、1：償還払い
003363     05 償還払い区分                   PIC 9.
003364*    0：対象、1：対象外（助成のみ使用）
003365     05 レセ印刷対象区分               PIC 9.
003366*    0：対象、1：対象外（助成のみ使用）
003367     05 会総括表印刷対象区分           PIC 9.
003368*    0：通常、1：本体まとめ
003369     05 本体まとめ区分                 PIC 9.
003370*
003371*    0：通常、1：助成月途中対象
003372     05 助成月途中対象                 PIC 9.
003374*-----------------------------------------------*
003375*
      */６部位目(逓減率は変わっているが５部位目までと名前を揃える)
002950     05 部位６８.
002960        07 逓減開始月日６８.
002970           09 逓減開始月６８           PIC 9(2).
002980           09 逓減開始日６８           PIC 9(2).
002990        07 後療６８.
003000           09 後療単価６８             PIC 9(4).
003010           09 後療回数６８             PIC 9(2).
003020           09 後療料６８               PIC 9(5).
003030        07 冷罨法６８.
003040           09 冷罨法回数６８           PIC 9(2).
003050           09 冷罨法料６８             PIC 9(4).
003060        07 温罨法６８.
003070           09 温罨法回数６８           PIC 9(2).
003080           09 温罨法料６８             PIC 9(4).
003090        07 電療６８.
003100           09 電療回数６８             PIC 9(2).
003110           09 電療料６８               PIC 9(4).
003120        07 小計６８                    PIC 9(6).
003130        07 多部位込小計６８            PIC 9(6).
003140        07 長期逓減率６８              PIC 9(3).
003150        07 長期込小計６８              PIC 9(6).
003160     05 部位６０.
003170        07 逓減開始月日６０.
003180           09 逓減開始月６０           PIC 9(2).
003190           09 逓減開始日６０           PIC 9(2).
003200        07 後療６０.
003210           09 後療単価６０             PIC 9(4).
003220           09 後療回数６０             PIC 9(2).
003230           09 後療料６０               PIC 9(5).
003240        07 冷罨法６０.
003250           09 冷罨法回数６０           PIC 9(2).
003260           09 冷罨法料６０             PIC 9(4).
003270        07 温罨法６０.
003280           09 温罨法回数６０           PIC 9(2).
003290           09 温罨法料６０             PIC 9(4).
003300        07 電療６０.
003310           09 電療回数６０             PIC 9(2).
003320           09 電療料６０               PIC 9(4).
003330        07 小計６０                    PIC 9(6).
003340        07 長期逓減率６０              PIC 9(3).
003350        07 長期込小計６０              PIC 9(6).
      */７部位目
002950     05 部位７８.
002960        07 逓減開始月日７８.
002970           09 逓減開始月７８           PIC 9(2).
002980           09 逓減開始日７８           PIC 9(2).
002990        07 後療７８.
003000           09 後療単価７８             PIC 9(4).
003010           09 後療回数７８             PIC 9(2).
003020           09 後療料７８               PIC 9(5).
003030        07 冷罨法７８.
003040           09 冷罨法回数７８           PIC 9(2).
003050           09 冷罨法料７８             PIC 9(4).
003060        07 温罨法７８.
003070           09 温罨法回数７８           PIC 9(2).
003080           09 温罨法料７８             PIC 9(4).
003090        07 電療７８.
003100           09 電療回数７８             PIC 9(2).
003110           09 電療料７８               PIC 9(4).
003120        07 小計７８                    PIC 9(6).
003130        07 多部位込小計７８            PIC 9(6).
003140        07 長期逓減率７８              PIC 9(3).
003150        07 長期込小計７８              PIC 9(6).
003160     05 部位７０.
003170        07 逓減開始月日７０.
003180           09 逓減開始月７０           PIC 9(2).
003190           09 逓減開始日７０           PIC 9(2).
003200        07 後療７０.
003210           09 後療単価７０             PIC 9(4).
003220           09 後療回数７０             PIC 9(2).
003230           09 後療料７０               PIC 9(5).
003240        07 冷罨法７０.
003250           09 冷罨法回数７０           PIC 9(2).
003260           09 冷罨法料７０             PIC 9(4).
003270        07 温罨法７０.
003280           09 温罨法回数７０           PIC 9(2).
003290           09 温罨法料７０             PIC 9(4).
003300        07 電療７０.
003310           09 電療回数７０             PIC 9(2).
003320           09 電療料７０               PIC 9(4).
003330        07 小計７０                    PIC 9(6).
003340        07 長期逓減率７０              PIC 9(3).
003350        07 長期込小計７０              PIC 9(6).
003380*
003390*     05 FILLER                         PIC X(481).
           05 運動後療.
              07 運動後療回数                PIC 9.
              07 運動後療単価                PIC 9(4).
              07 運動後療料                  PIC 9(4).
              07 運動算定日                  PIC 9(2) OCCURS 5.
           05 金属副子回数                   PIC 9(2).
           05 明細書発行加算料               PIC 9(3).
           05 明細書発行加算日               PIC 9(2).
      */令和6年10月改定対応↓↓↓
           05 部位継続月数                   PIC 9(2) OCCURS 7.
           05 長期頻回逓減率１               PIC 9(3).
           05 長期頻回逓減率２               PIC 9(3).
           05 長期頻回逓減率３８             PIC 9(3).
           05 長期頻回逓減率３０             PIC 9(3).
           05 長期頻回逓減率４８             PIC 9(3).
           05 長期頻回逓減率４０             PIC 9(3).
           05 長期頻回逓減率５８             PIC 9(3).
           05 長期頻回逓減率５０             PIC 9(3).
           05 長期頻回逓減率６８             PIC 9(3).
           05 長期頻回逓減率６０             PIC 9(3).
           05 長期頻回逓減率７８             PIC 9(3).
           05 長期頻回逓減率７０             PIC 9(3).
      */令和6年10月改定対応↑↑↑
003390     05 FILLER                         PIC X(201).
003400*
