000010*****************************************************************
000020* ＲＥＩＧＡＩ０２：例外マスタ［ＲＬ＝６４０］                  *
000021*                   ※ 診察券用                                 *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1999.05.18                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :区分コード毎に 例外 を管理                       *
000081***                                                             *
000082* プリフィックスを例０２－にする                                *
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000140*******************************************************************
000150* ００：区分コード体系                                            *
000160* ０１：福岡総括表　  ０２：診察券用         ０３：               *
000280*******************************************************************
000290*
000300         05  番号コード                PIC 9(3).
000310     03  レコードデータ.
000320         05  タイトル                  PIC N(5).
000321         05  敬称                      PIC N.
000322         05  接骨院名                  PIC N(15).
000340         05  時間１                    PIC X(60).
000341         05  時間２                    PIC X(60).
000342         05  休診日                    PIC X(60).
000343         05  住所                      PIC X(60).
000344         05  電話                      PIC X(60).
000350*
000370         05  FILLER                    PIC X(293).
