000010*****************************************************************
000020* ＲＥＩＧＡＩ０６：例外マスタ［ＲＬ＝６４０］                  *
000021*                   ※ 診察カードレイアウト用                   *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2006.03.30                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :区分コード毎に 例外 を管理                       *
000081***                                                             *
000082* プリフィックスを例０６－にする                                *
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000131*******************************************************************
000132* ００：区分コード体系                                            *
000133* ０１：福岡総括表    ０２：診察券用   ０３：東京都総括票用       *
000134* ０４：その他料金    ０５：パスワード用                          *
000135* ０６：診察カードレイアウト用                                    *
000136*******************************************************************
000290*
000300         05  番号コード                PIC 9(3).
000310     03  レコードデータ.
000311*        / 0:横、1:縦
000312         05  縦横区分                  PIC 9.
000313         05  １行バイト数              PIC 9(2).
000314*      （種類）　0:印字なし、1:患者№＋氏名、2:患者№、3:氏名、4:保険種別等 
000315*                5:他変数エリア1、6:他変数エリア2、7:固定情報エリア、8:書き換えフリーエリア
000316*      （サイズ）0:普通、1:縦倍
000320         05  各行  OCCURS 14.
000321            07  各行種類               PIC 9.
000322            07  各行内容               PIC X(40).
000330            07  各行サイズ             PIC 9.
000387*
000388*        / 0:兼ねない、1:兼ねる
000389         05  書換時受付区分            PIC 9.
000391         05  FILLER                    PIC X(43).
000401*
