000010*****************************************************************
000020* ＲＩＲＥＫＩ：検索履歴ファイル ［ＲＬ＝２５６BYTE］           *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2010.07.12                                       *
000070* AUTHOR      :岡田  憲和                                       *
000080* PURPOSE     :負傷原因・長期理由等の検索キーワード履歴を保存   *
000092*****************************************************************
000093*---------------------------------------------------------------*
000094*	SELECT文
000095*---------------------------------------------------------------*
000096**
000098*     SELECT  検索履歴Ｆ      ASSIGN      TO        RIREKIL
000099*                             ORGANIZATION             IS  INDEXED
000100*                             ACCESS                   IS  DYNAMIC
000103*                             RECORD      KEY          IS  履歴－画面区分
000104*                                                          履歴－キーワード
000105*                             ALTERNATE RECORD KEY     IS  履歴－画面区分
000106*                                                          履歴－登録日時
000107*                             FILE        STATUS       IS  状態キー
000108*                             LOCK        MODE         IS  AUTOMATIC.
000109***
000110*                           ［ＲＬ＝  256］
000111* FD  検索履歴Ｆ        BLOCK   CONTAINS   1   RECORDS.
000112*     COPY RIREKI         OF  XFDLIB  JOINING   履歴   AS  PREFIX.
000113*
000114*****************************************************************
000115 01 レコード.
000116   03 レコードキー.
000120*****************************************************************
000130* 画面区分　０１：負傷原因長文
000140*　　　　　 ０２：負傷原因５段
000141*　　　　　 ０３：長期理由検索
000142*            *
000150     05 画面区分                       PIC 9(3).
000160     05 キーワード                     PIC X(100).
000170*****************************************************************
000196   03 レコードデータ.
000197     05 登録日時.
000198       07 登録年月日.
000199         09 登録年月.
000200           11 登録年                   PIC 9(4).
000201           11 登録月                   PIC 9(2).
000202         09 登録日                     PIC 9(2).
000203       07 登録時間.
000204         09 登録時                     PIC 9(2).
000205         09 登録分                     PIC 9(2).
000206         09 登録秒                     PIC 9(4).
000208     05 FILLER                         PIC X(137).
