000010*****************************************************************
000020* ROUJINH：老人負担区分マスタ［ＲＬ＝１２８］
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2000.12.18                                       *
000080* PURPOSE     :開始年月毎に老人負担区分を管理                   *
000081*****************************************************************
000082*-------------------------*
000083*まったく変更なし
000084*-------------------------*
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  保険種別                  PIC 9(2).
000130         05  開始和暦年月.
000140           07  開始和暦                PIC 9.
000150           07  開始年月.
000160             09  開始年                PIC 9(2).
000170             09  開始月                PIC 9(2).
000180     03  レコードデータ.
000240         05  負担区分                  PIC 9.
000251         05  ４１端数区分              PIC 9.
000260         05  FILLER                    PIC X(119).
