000010*****************************************************************
000020* ＳＥＩＧＹＯ：制御情報マスタ ［ＲＬ＝２５６BYTE］             *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.04.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :制御区分は、00 固定                              *
000090*              システム的に制御する情報を管理                   *
000100*****************************************************************
000110 01 レコード.
000120   03 レコードキー.
000130     05 制御区分                     PIC 9(2).
000140   03 レコードデータ.
000150* 明治：１　大正：２　昭和：３　平成：４
000160     05 カレント元号                 PIC 9.
000170* 都道府県表示：０　都道府県省略（市区からの表示）：１
000180     05 郵便住所区分                 PIC 9.
000190* 通常入力：０　一括入力：１
000200     05 負傷入力区分                 PIC 9.
000210* 初期値：７　最大：９
000220     05 最大登録部位数               PIC 9.
000230* 有り：０　無し：１
000240     05 負傷連続登録                 PIC 9.
000250* 処理のタイミングをとる場合の遅延（ループ）回数
000260     05 遅延回数                     PIC X(4).
000270* 退避するＭＯドライブの設定
000280     05 退避ドライブ                 PIC X(2).
000290* 復旧フォルダ
000300     05 復旧フォルダ                 PIC X(30).
000310* データ運用フォルダ
000320     05 データフォルダ               PIC X(30).
000330* マスタ運用フォルダ
000340     05 マスタフォルダ               PIC X(30).
000350*****************************************************************
000360* 一部負担金免除者のレセプト発行区分（大阪府方式）
000370* 申請書のみ　　   ：ＺＥＲＯ
000380* 申請書＋別用紙   ：１
000390* ２７助成・４１助成の助成分のみ別用紙のみ、他は申請書＋別用紙：２
000400* （全柔方式）
000410     05 助成請求方式                 PIC 9.
000420*****************************************************************
000430*
000440*****************************************************************
000450* 診療日の画面操作にて施術記録日を削除した場合に、受付日も同時に
000460* 削除するかの指定。また、負傷登録時の開始日・終了日に応じて余分な
000470* 施術記録日、受付日を削除する意味も含む。
000480* 削除しない：ＺＥＲＯ　削除する：１
000490*
000500     05 受付日取扱区分               PIC 9.
000510*****************************************************************
000520*
000530* 窓口会計にて未入金金額のチェックを行うか否かの区分
000540* チェックする：ＺＥＲＯ　チェックしない：１
000550     05 入金検証区分                 PIC 9.
000560*****************************************************************
000570*
000580* 助成負担金請求の算定を行うか否かの区分（計算ＰＧ関連）
000590     05 助成負担計算区分             PIC 9.
000600*
000610*****************************************************************
000620* 帳票の出力方法の選択
000630* ＺＥＲＯ：施術年月基準　１：請求年月基準
000640     05 帳票区分                     PIC 9.
000650*****************************************************************
000660*
000670*****************************************************************
000680* プログラムの切り分け等に使用　
000690     05 協会コード                   PIC 9(2).
000700*****************************************************************
000710*
000720*****************************************************************
000730* カルテ用紙（同種別で切り分ける場合）中央接骨師会用　
000740* ０：通常用紙　１：再生紙
000750     05 カルテ用紙種別               PIC 9.
000760*****************************************************************
000770*
000780* 定期修正ドライブ名
000790     05 定期修正ＦＤ                 PIC X(2).
000800     05 定期修正ＣＤ                 PIC X(2).
000810*
000820*****************************************************************
000830* CANON
000840* 01:BJC420 02:BJC430 03:BJC455
000850*
000860* CANON
000870* 50:LBP450
000880     05 プリンタ選択番号             PIC 9(2).
000890*
000900* 受付時現在日以外の場合、確認メッセージを出さない場合、１をたてる
000910     05 受付確認区分                 PIC 9.
000920*
000930* ウィンドウ入力：０　直接入力：１　→使用していないので、負傷原因登録画面の種類に変更
000931* ５行ひとまとめ式：９、それ以外通常
000940     05 負傷部位入力                 PIC 9.
000950*
000960* ０：全て確認する　１：必要な場合のみ確認する　２：確認しない
000970     05 確認入力区分                 PIC 9.
000980*
000990* ０：検索後確認する　１：検索後確認しない
001000     05 検索確認区分                 PIC 9.
001010*
001020* ０：最終通院日 １：月末日 ９：印字なし (柔整師側)
001030     05 レセプト日付区分             PIC 9.
001040*
001050* ０：使用しない    　１：使用する
001060     05 カードリーダ使用区分         PIC 9.
001070* ０：使用しない    　１：使用する
001080     05 バーコード２３２Ｃ使用区分   PIC 9.
001090*
001100* ０：印刷する      　１：印刷しない
001110     05 レセ負傷原因印刷区分         PIC 9.
001120* ０：印刷する      　１：印刷しない
001130     05 レセ長期理由印刷区分         PIC 9.
001140* ０：使用しない    　１：使用する
001150     05 フリガナウィンドウ使用区分   PIC 9.
001160*
001170* 232Cﾊﾞｰｺｰﾄﾞの点滅間隔(秒)
001180     05 バーコード２３２Ｃ間隔       PIC 9(2).
001190*
001200***-- 負傷画面関係 --***
001210* ０：部位ヘルプを自動で出さない 　１：自動で出す
001220     05 部位ヘルプ出力区分           PIC 9.
001230* 部位ヘルプ画面の種類を指定
001240     05 部位ヘルプ画面種類           PIC 9.
001250*
001260* ０：印刷する      　１：印刷しない
001270     05 カルテ負傷原因印刷区分       PIC 9.
001280** -- 負傷画面での無効通院日の削除 --*
001290* ０：削除する      　１：削除しない
001300     05 無効日削除区分               PIC 9.
001310*
001320** -- はり・きゅうレセ画面 --*
001330* ０：使用しない    　１：使用する     ９：はりきゅうシステム
001340     05 はりきゅう使用区分           PIC 9.
001350*
001360** -- 労災・自賠責の運動療法 --*
001370* ０：初期値なし    　１：初期値あり
001380     05 運動療法区分                 PIC 9.
001390*
001400*旧用紙用
001410* -- 労災用印字調整の方向  １：上 　２：下 --*
001420     05 労災印字調整方向             PIC 9.
001430* -- 労災用印字調整 --*
001440     05 労災印字調整数               PIC 9V99.
001450*
001460* ０：最終通院日 １：月末日 ９：印字なし (患者側)
001470     05 レセプト患者日付区分         PIC 9.
001480* ０：印字する   １：印字しない (初期値) 
001490     05 患者委任日印字区分           PIC 9.
001500**
001510* ０：新柔22   １：旧柔21 
001520     05 全柔ＦＰＤ区分               PIC 9.
001530**
001540* -- レセプトの新旧の区分 ---*
001550* ０：旧レセ   １：新レセ 
001551     05 レセ用紙新旧.
001560       07 国保レセ                   PIC 9.
001570       07 退職本人レセ               PIC 9.
001580       07 退職家族レセ               PIC 9.
001590       07 社保本人レセ               PIC 9.
001600       07 社保家族レセ               PIC 9.
001610       07 組合本人レセ               PIC 9.
001620       07 組合家族レセ               PIC 9.
001630       07 共済本人レセ               PIC 9.
001640       07 共済家族レセ               PIC 9.
001650       07 自衛官レセ                 PIC 9.
001660       07 老人レセ                   PIC 9.
001670       07 助成レセ                   PIC 9.
001680*
001690* -- レセプト印字調整の方向  １：右 　２：左 --*
001700     05 国保レセ左右                 PIC 9.
001710     05 国保レセ左右調整数           PIC 9.
001720* -- レセプト印字調整の方向  １：上 　２：下 --*
001730     05 国保レセ上下                 PIC 9.
001740     05 国保レセ上下調整数           PIC 9.
001750*
001760     05 退職本人レセ左右             PIC 9.
001770     05 退職本人レセ左右調整数       PIC 9.
001780     05 退職本人レセ上下             PIC 9.
001790     05 退職本人レセ上下調整数       PIC 9.
001800*
001810     05 退職家族レセ左右             PIC 9.
001820     05 退職家族レセ左右調整数       PIC 9.
001830     05 退職家族レセ上下             PIC 9.
001840     05 退職家族レセ上下調整数       PIC 9.
001850*
001860     05 社保本人レセ左右             PIC 9.
001870     05 社保本人レセ左右調整数       PIC 9.
001880     05 社保本人レセ上下             PIC 9.
001890     05 社保本人レセ上下調整数       PIC 9.
001900*
001910     05 社保家族レセ左右             PIC 9.
001920     05 社保家族レセ左右調整数       PIC 9.
001930     05 社保家族レセ上下             PIC 9.
001940     05 社保家族レセ上下調整数       PIC 9.
001950*
001960     05 組合本人レセ左右             PIC 9.
001970     05 組合本人レセ左右調整数       PIC 9.
001980     05 組合本人レセ上下             PIC 9.
001990     05 組合本人レセ上下調整数       PIC 9.
002000*
002010     05 組合家族レセ左右             PIC 9.
002020     05 組合家族レセ左右調整数       PIC 9.
002030     05 組合家族レセ上下             PIC 9.
002040     05 組合家族レセ上下調整数       PIC 9.
002050*
002060     05 共済本人レセ左右             PIC 9.
002070     05 共済本人レセ左右調整数       PIC 9.
002080     05 共済本人レセ上下             PIC 9.
002090     05 共済本人レセ上下調整数       PIC 9.
002100*
002110     05 共済家族レセ左右             PIC 9.
002120     05 共済家族レセ左右調整数       PIC 9.
002130     05 共済家族レセ上下             PIC 9.
002140     05 共済家族レセ上下調整数       PIC 9.
002150*
002160     05 自衛官レセ左右               PIC 9.
002170     05 自衛官レセ左右調整数         PIC 9.
002180     05 自衛官レセ上下               PIC 9.
002190     05 自衛官レセ上下調整数         PIC 9.
002200*
002210     05 老人レセ左右                 PIC 9.
002220     05 老人レセ左右調整数           PIC 9.
002230     05 老人レセ上下                 PIC 9.
002240     05 老人レセ上下調整数           PIC 9.
002250*
002260     05 助成レセ左右                 PIC 9.
002270     05 助成レセ左右調整数           PIC 9.
002280     05 助成レセ上下                 PIC 9.
002290     05 助成レセ上下調整数           PIC 9.
002300*
002310     05 カルテ左右                   PIC 9.
002320     05 カルテ左右調整数             PIC 9.
002330     05 カルテ上下                   PIC 9.
002340     05 カルテ上下調整数             PIC 9.
002350*
002360* 日接レセ用　０：印字する   １：印字しない (初期値) 
002370     05 請求書氏名印字区分           PIC 9.
002380     05 委任者氏名印字区分           PIC 9.
002390*
002400* ０：負傷画面での近接ﾁｪｯｸする　１：しない
002410     05 近接部位区分                 PIC 9.
002420*
002430* 各種資料の縦横(1:縦)
002440     05 日報                         PIC 9.
002450     05 日計表                       PIC 9.
002460     05 月報                         PIC 9.
002470     05 請求総括表                   PIC 9.
002480     05 保険者別月報                 PIC 9.
002490     05 受診者リスト                 PIC 9.
002500     05 治癒中止リスト               PIC 9.
002510     05 全登録者リスト               PIC 9.
002520*
002530* 労災保険新旧用紙の切替(0:旧、1:新)
002540     05 労災用紙区分                 PIC 9.
002550* Ａ４用紙用
002560* -- レセプト印字調整の方向  １：右 　２：左 --*
002570     05 労災レセ左右                 PIC 9.
002580     05 労災レセ左右調整数           PIC 9V9.
002590* -- レセプト印字調整の方向  １：上 　２：下 --*
002600     05 労災レセ上下                 PIC 9.
002610     05 労災レセ上下調整数           PIC 9V9.
002620     05 労災施術期間区分             PIC 9.
002630     05 自賠施術期間区分             PIC 9.
002640* 受付連動処理
002650     05 受付連動区分                 PIC 9.
002660* 拡張機能（レセＦ作成）０：なし  １：あり
002670     05 拡張機能区分                 PIC 9.
002680* 入金金額登録の初期情報
002690     05 入金登録情報.
002700        07 入金開始和暦年月.
002710           09 入金開始和暦           PIC 9.
002720           09 入金開始年             PIC 9(2).
002730           09 入金開始月             PIC 9(2).
002740        07 入金表示対象              PIC 9.
002750        07 入金表示単位              PIC 9.
002760        07 入金表示順                PIC 9.
002770* レセ並び順種類（個人で使用）
002780     05 レセ並び順種類               PIC 9.
002790* メモ関連の起動判定　１：パスワード連携
002800     05 メモ起動                     PIC 9.
002810* 領収証の書式　０：白紙　１：コクヨ1036
002820     05 領収証書式                   PIC 9.
002830* 日接東京の老人・助成の委任文　０：印字あり　１：印字なし
002840     05 日接委任文印刷               PIC 9.
002850* ダイヤルアップエントリの削除区分 0:削除する 1:削除しない
002860     05 ダイヤルアップ接続           PIC 9.
002870* カルテ裏用
002880     05 カルテ２左右                 PIC 9.
002890     05 カルテ２左右調整数           PIC 9.
002900     05 カルテ２上下                 PIC 9.
002910     05 カルテ２上下調整数           PIC 9.
002920* レセ並び順昇順・降順（昇順０、降順１）
002930     05 レセ並び順昇降               PIC 9.
002940* その他レセ（５mm用）
002950     05 その他レセ左右               PIC 9.
002960     05 その他レセ左右調整数         PIC 9.
002970     05 その他レセ上下               PIC 9.
002980     05 その他レセ上下調整数         PIC 9.
002990* カルテ年齢印刷
003000     05 カルテ年齢印刷区分           PIC 9.
003010* 負傷履歴 ０：通常　１：Visual
003020     05 負傷履歴区分                 PIC 9.
003030* バーコード登録 ０：YAW051, １：YAW052, ２：なし（患者№方式）
003040     05 バーコード登録画面区分       PIC 9.
003050* 新患画面での家族一覧表示区分　0:なし、1:あり
003060     05 家族一覧画面区分             PIC 9.
003070* 受付子画面の処理の振り分け 0:通常 1:領収書ダイレクト印刷 2:領収書ダイレクト＋自費分入力
003080     05 子画面処理区分               PIC 9.
003090* 保険証画面の住所の処理の振り分け 0:通常(上書しない) 1:上書する
003100     05 住所上書区分                 PIC 9.
