000010*****************************************************************
000020* 施術記録Ｆ　ＳＥＫＩＲＯＫ．ＤＡＴ ［ＲＬ＝３８４BYTE］       *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.11.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :日毎＋患者毎＋部位毎の保険算定情報を記録         *
000090*              主として計算に必要なフラグ群を管理               *
000100*              労災・自賠の算定項目も管理する。                 *
000110*****************************************************************
000120 01 レコード.
000130   03 レコードキー.
000140     05 施術和暦年月日.
000150       07 施術和暦年月.
000160         09 施術和暦                   PIC 9.
000170         09 施術年月.
000180           11 施術年                   PIC 9(2).
000190           11 施術月                   PIC 9(2).
000200       07 施術日                       PIC 9(2).
000210     05 患者コード.
000220       07 患者番号                     PIC 9(6).
000230       07 枝番                         PIC X.
000240* ＊＊＊　日毎データ　＊＊＊
000250   03 レコードデータ.
000260* 診療時間として使用
000270     05 受付時間.
000280       07 受付時                       PIC 9(2).
000290       07 受付分                       PIC 9(2).
000300       07 受付秒                       PIC 9(2).
000310*
000320* 　　　１：後療　２．初検
000330     05 診療区分                       PIC 9.
000340*
000350* 初検加算と再検料請求は、月に複数回ある場合がある為、日毎にもつ
000360* 　　　　０：なし　１：時間外　２：休日　３：深夜
000370     05 初検加算                       PIC 9.
000380*
000390* 　　　　０：請求なし　１：請求
000400     05 再検料請求                     PIC 9.
000410*
000420     05 往料.
000430       07 往療距離                     PIC 9(3)V9.
000440*
000450* ０：なし　１：夜間　２：難路　３：暴風雨　４：時間外（労災）
000460       07 往療加算                     PIC 9.
000470*
000480* 　　　　０：なし　１：あり
000490     05 運動療法区分                   PIC 9.
000500*
000510* 　　　　０：なし　１：あり
000520     05 宿泊区分                       PIC 9.
000530*
000540* 　　　　０：なし　１：あり
000550     05 食事区分                       PIC 9.
000560*
000570* 労災は休業証明・自賠は施術証明として使用
000580* 　　　　０：なし　１：あり
000590     05 施術証明区分                   PIC 9.
000600*
000610* 　　　　０：なし　１：あり
000620     05 施術明細区分                   PIC 9.
000630*
000640* ０：請求なし　１：請求あり
000650     05 初検料請求区分                 PIC 9.
000660*
000670     05 FILLER                         PIC X(8).
000680*
000690* ＊＊＊　日毎＋部位毎データ　＊＊＊
000700     05 部位データ    OCCURS 9.
000710       07 部位コード.
000720         09 負傷種別                   PIC 9(2).
000730         09 部位                       PIC 9(2).
000740         09 左右区分                   PIC 9.
000750         09 負傷位置番号               PIC 9(2).
000760* 　　　　０：なし　１：あり
000770       07 整復施療区分                 PIC 9.
000780* 　　　　０：なし　１：冷罨法　２．温罨法
000790       07 罨法区分                     PIC 9.
000800* 　　　　０：なし　１：あり
000810       07 電療区分                     PIC 9.
000820*         ０：なし　１：医師拘縮
000830       07 医師拘縮区分                 PIC 9.
000840*         ０：なし　１：大　２：中　３：小
000850       07 金属副子区分                 PIC 9.
000860*  ０：なし　１：あり指導管理区分日毎に変更、使用せず
000870       07 指導管理区分                 PIC 9.
000880*         ０：なし　１：あり
000890       07 特別材料区分                 PIC 9.
000900*         ０：なし　１：あり
000910       07 包帯交換区分                 PIC 9.
000920*         ０：なし　１：あり
000930       07 情報提供区分                 PIC 9.
000940*
000950* １：治癒　２．全治　３．中止　４．転医　５．自然治癒
000960* ９：継続
000970*　負傷データＦと連携
000980       07 転帰区分                     PIC 9.
000990*
001000       07 経過コード                   PIC 9(4).
001010* ０：請求なし　１：請求あり
001020       07 後療料請求区分               PIC 9.
001030*
001040       07 FILLER                       PIC X(2).
001050*
001060*         ０：なし　１：あり
001070     05 指導管理区分２                 PIC 9.
001071*  ０：なし　１：あり
001072     05 自賠責その他区分               PIC 9.
001073*  ０：なし　１：あり (市町村マスタの特殊負担区分07用)
001074     05 その他計算区分１               PIC 9.
001075*
001076*  ０：なし　１：あり 
001077     05 特殊設定区分                   PIC 9.
001079* ０：加算あり　１：加算なし
001080     05 初検時相談料区分               PIC 9.
001079* 運動後療料を算定した場合の対象になる部位
000490     05 運動後料算定部位               PIC 9.
001079* 明細書発行加算区分 ０：加算なし　１：加算あり
000490     05 明細書発行加算区分             PIC 9.
001082     05 FILLER                         PIC X(119).
