000010*****************************************************************
000020* 受付データＦ　ＵＫＥＴＵＫＥ．ＤＡＴ ［ＲＬ＝１２８BYTE］     *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.11.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :日毎＋患者毎の受付データを記録                   *
000090*              主として来院時間を管理                           *
000100*****************************************************************
000110 01 レコード.
000120   03 レコードキー.
000130     05 施術和暦年月日.
000140       07 施術和暦年月.
000150         09 施術和暦                   PIC 9.
000160         09 施術年月.
000170           11 施術年                   PIC 9(2).
000180           11 施術月                   PIC 9(2).
000190       07 施術日                       PIC 9(2).
000200     05 患者コード.
000210       07 患者番号                     PIC 9(6).
000220       07 枝番                         PIC X.
000230   03 レコードデータ.
000240     05 患者氏名                       PIC N(10).
000250     05 受付時間.
000260       07 受付時                       PIC 9(2).
000270       07 受付分                       PIC 9(2).
000280       07 受付秒                       PIC 9(2).
000290     05 更新年月日.
000300       07 更新和暦                     PIC 9.
000310       07 更新年                       PIC 9(2).
000320       07 更新月                       PIC 9(2).
000330       07 更新日                       PIC 9(2).
000331* 追加990607
000340     05 連番                           PIC 9(4)V9.
000341*
000342*    / 1:自費の施術日
000343     05 自費施術日区分                 PIC 9.
000344*
000350     05 FILLER                         PIC X(75).
