000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAS101.
000060 AUTHOR.                 ‰ª“c Œ›˜a
000070*
000080*----------------------------------------------------------------*
000090*      ’ñoFPDì¬yÃÞ°Àì¬z_³¨ÝÄÞ³½Þ95”Å
000100*
000110* ¦ ¶”NŒŽ“ú(–¾Ž¡-º˜a)‹tA•À‚Ñ‡’Ç‰Á
000120*
000130* ¿‹”NŒŽVer.
000140*
000150*----------------------------------------------------------------*
000160 DATE-WRITTEN.           2000-02-01
000170 DATE-COMPILED.          2000-02-01
000180*----------------------------------------------------------------*
000190******************************************************************
000200*            ENVIRONMENT         DIVISION                        *
000210******************************************************************
000220 ENVIRONMENT             DIVISION.
000230 CONFIGURATION           SECTION.
000240 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000250 OBJECT-COMPUTER.        FMV-DESKPOWER.
000260 SPECIAL-NAMES.          CONSOLE  IS  CONS
000270                         SYSERR   IS  MSGBOX.
000280 INPUT-OUTPUT            SECTION.
000290 FILE-CONTROL.
000300     SELECT  Œ³†ƒ}ƒXƒ^      ASSIGN      TO        GENGOUL
000310                             ORGANIZATION             IS  INDEXED
000320                             ACCESS MODE              IS  DYNAMIC
000330                             RECORD KEY               IS  Œ³|Œ³†‹æ•ª
000340                             FILE STATUS              IS  ó‘ÔƒL[
000350                             LOCK        MODE         IS  AUTOMATIC.
000360     SELECT  –¼Ìƒ}ƒXƒ^      ASSIGN      TO        MEISYOL
000370                             ORGANIZATION             IS  INDEXED
000380                             ACCESS MODE              IS  DYNAMIC
000390                             RECORD KEY               IS  –¼|‹æ•ªƒR[ƒh
000400                                                          –¼|–¼ÌƒR[ƒh
000410                             FILE STATUS              IS  ó‘ÔƒL[
000420                             LOCK        MODE         IS  AUTOMATIC.
000430     SELECT  Ž{pŠî•ñƒ}ƒXƒ^ ASSIGN      TO        SEJOHOL
000440                             ORGANIZATION             IS  INDEXED
000450                             ACCESS MODE              IS  DYNAMIC
000460                             RECORD KEY               IS Ž{î|Ž{pŠ”Ô†
000470                             FILE STATUS              IS  ó‘ÔƒL[
000480                             LOCK        MODE         IS  AUTOMATIC.
000490     SELECT  Ž{p‹L˜^‚e      ASSIGN      TO        SEKIROKL
000500                             ORGANIZATION             IS  INDEXED
000510                             ACCESS MODE              IS  DYNAMIC
000520                             RECORD KEY           IS Ž{‹L|Ž{p˜a—ï”NŒŽ“ú
000530                                                     Ž{‹L|Š³ŽÒƒR[ƒh
000540                             ALTERNATE RECORD KEY IS Ž{‹L|Š³ŽÒƒR[ƒh
000550                                                     Ž{‹L|Ž{p˜a—ï”NŒŽ“ú
000560                             FILE STATUS              IS  ó‘ÔƒL[
000570                             LOCK        MODE         IS  AUTOMATIC.
000580     SELECT  ŽófŽÒî•ñ‚e    ASSIGN      TO        JUSINJL
000590                             ORGANIZATION             IS  INDEXED
000600                             ACCESS MODE              IS  DYNAMIC
000610                             RECORD KEY               IS Žó|Ž{p˜a—ï”NŒŽ
000620                                                          Žó|Š³ŽÒƒR[ƒh
000630                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000640                                                          Žó|Š³ŽÒƒJƒi
000650                                                          Žó|Š³ŽÒƒR[ƒh
000660                             ALTERNATE RECORD KEY     IS  Žó|Š³ŽÒƒR[ƒh
000670                                                         Žó|Ž{p˜a—ï”NŒŽ
000680                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000690                                                          Žó|•ÛŒ¯Ží•Ê
000700                                                          Žó|•ÛŒ¯ŽÒ”Ô†
000710                                                          Žó|Š³ŽÒƒR[ƒh
000720                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000730                                                          Žó|Œö”ïŽí•Ê
000740                                                     Žó|”ï—p•‰’SŽÒ”Ô†
000750                                                          Žó|Š³ŽÒƒR[ƒh
000760                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000770                                                          Žó|•¬Ží•Ê
000780                                                  Žó|”ï—p•‰’SŽÒ”Ô†•¬
000790                                                          Žó|Š³ŽÒƒR[ƒh
000800                             ALTERNATE RECORD KEY  IS Žó|¿‹˜a—ï”NŒŽ
000810                                                      Žó|Ž{p˜a—ï”NŒŽ
000820                                                      Žó|Š³ŽÒƒR[ƒh
000830                             FILE STATUS              IS  ó‘ÔƒL[
000840                             LOCK        MODE         IS  AUTOMATIC.
000850     SELECT  •‰ƒf[ƒ^‚e    ASSIGN      TO        HUSYOUL
000860                             ORGANIZATION             IS  INDEXED
000870                             ACCESS MODE              IS  DYNAMIC
000880                             RECORD KEY               IS •‰|Ž{p˜a—ï”NŒŽ
000890                                                         •‰|Š³ŽÒƒR[ƒh
000900                             ALTERNATE RECORD KEY     IS •‰|Š³ŽÒƒR[ƒh
000910                                                         •‰|Ž{p˜a—ï”NŒŽ
000920                             FILE STATUS              IS  ó‘ÔƒL[
000930                             LOCK        MODE         IS  AUTOMATIC.
000940     SELECT  ƒŒƒZƒvƒg‚e      ASSIGN      TO        RECEPTL
000950                             ORGANIZATION             IS  INDEXED
000960                             ACCESS MODE              IS  DYNAMIC
000970                             RECORD KEY               IS  ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000980                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
000990                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
001000                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|Š³ŽÒƒR[ƒh
001010                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
001020                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
001030                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
001040                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
001050                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
001060                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
001070                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
001080                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
001090                                                          ƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
001100                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
001110                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
001120                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
001130                                                          ƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
001140                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
001150                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
001160                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
001170                             FILE STATUS              IS  ó‘ÔƒL[
001180                             LOCK        MODE         IS  AUTOMATIC.
001190     SELECT  ì‹Æƒtƒ@ƒCƒ‹‚P  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
001200                             ORGANIZATION             IS  INDEXED
001210                             ACCESS                   IS  DYNAMIC
001220                             RECORD      KEY          IS  ì‚P|¿‹˜a—ï”NŒŽ
001230                                                          ì‚P|Ž{p˜a—ï”NŒŽ
001240                                                          ì‚P|•ÛŒ¯‹æ•ª
001250                                                          ì‚P|”ï—p•‰’SŽÒ”Ô†
001260                                                          ì‚P|•ÛŒ¯ŽÒ”Ô†
001270                                                          ì‚P|–{l‰Æ‘°‹æ•ª
001280                                                          ì‚P|Š³ŽÒƒJƒi
001290                                                          ì‚P|Š³ŽÒƒR[ƒh
001300                             FILE        STATUS       IS  ó‘ÔƒL[
001310                             LOCK        MODE         IS  AUTOMATIC.
001320*
001330******************************************************************
001340*                      DATA DIVISION                             *
001350******************************************************************
001360 DATA                    DIVISION.
001370 FILE                    SECTION.
001380*                           m‚q‚k  ‚P‚Q‚Wn
001390 FD  Œ³†ƒ}ƒXƒ^          BLOCK   CONTAINS   1   RECORDS.
001400     COPY GENGOU          OF  XFDLIB  JOINING   Œ³   AS  PREFIX.
001410*                           m‚q‚k  ‚P‚Q‚Wn
001420 FD  –¼Ìƒ}ƒXƒ^          BLOCK   CONTAINS   1   RECORDS.
001430     COPY MEISYO          OF  XFDLIB  JOINING   –¼   AS  PREFIX.
001440*
001450 FD  Ž{pŠî•ñƒ}ƒXƒ^    BLOCK   CONTAINS   1   RECORDS.
001460     COPY SEJOHO         OF  XFDLIB  JOINING   Ž{î   AS  PREFIX.
001470*                           m‚q‚k  ‚Q‚T‚Un
001480 FD  Ž{p‹L˜^‚e          BLOCK   CONTAINS   1   RECORDS.
001490     COPY SEKIROK         OF  XFDLIB  JOINING   Ž{‹L AS  PREFIX.
001500*                           m‚q‚k  ‚R‚Q‚On
001510 FD  ŽófŽÒî•ñ‚e        BLOCK   CONTAINS   1   RECORDS.
001520     COPY JUSINJ          OF  XFDLIB  JOINING   Žó   AS  PREFIX.
001530*                           m‚q‚k  ‚P‚Q‚Wn
001540 FD  •‰ƒf[ƒ^‚e        BLOCK   CONTAINS   1   RECORDS.
001550     COPY HUSYOU          OF  XFDLIB  JOINING   •‰   AS  PREFIX.
001560*
001570*                          m‚q‚k  ‚P‚T‚R‚Un
001580 FD  ƒŒƒZƒvƒg‚e          BLOCK   CONTAINS   1   RECORDS.
001590     COPY RECEPT          OF  XFDLIB  JOINING   ƒŒƒZ  AS  PREFIX.
001600*
001610 FD  ì‹Æƒtƒ@ƒCƒ‹‚P RECORD  CONTAINS 516 CHARACTERS.
001620 01  ì‚P|ƒŒƒR[ƒh.
001630     03  ì‚P|ƒŒƒR[ƒhƒwƒbƒ_.
001640         05  ì‚P|¿‹˜a—ï”NŒŽ.
001650             07  ì‚P|¿‹˜a—ï            PIC 9.
001660             07  ì‚P|¿‹”N              PIC 9(2).
001670             07  ì‚P|¿‹ŒŽ              PIC 9(2).
001680         05  ì‚P|•ÛŒ¯‹æ•ª                PIC 99.
001690         05  ì‚P|•ÛŒ¯ŽÒ”Ô†              PIC X(10).
001700         05  ì‚P|–{l‰Æ‘°‹æ•ª            PIC 9.
001710         05  ì‚P|Ž{p˜a—ï”NŒŽ.
001720             07  ì‚P|Ž{p˜a—ï            PIC 9.
001730             07  ì‚P|Ž{p”N              PIC 9(2).
001740             07  ì‚P|Ž{pŒŽ              PIC 9(2).
001750         05  ì‚P|”í•ÛŒ¯ŽÒƒJƒi            PIC X(20).
001760         05  ì‚P|Š³ŽÒƒR[ƒh.
001770             07 ì‚P|Š³ŽÒ”Ô†             PIC 9(6).
001780             07 ì‚P|Ž}”Ô                 PIC X(1).
001790         05  ì‚P|•ÛŒ¯Ží•Ê                PIC 9(2).
001800         05  ì‚P|•¬Ží•Ê                PIC 9(2).
001810     03  ì‚P|ƒŒƒR[ƒhƒf[ƒ^.
001820         05  ì‚P|‰ïˆõ”Ô†                PIC X(5).
001830         05  ì‚P|˜Vl•¬                PIC 99.
001840         05  ì‚P|Œö”ï•¹—p.
001850             07  ì‚P|”ï—p•‰’SŽÒ”Ô†      PIC X(10).
001860             07  ì‚P|Žó‰vŽÒ”Ô†          PIC X(10).
001870         05  ì‚P|Š³ŽÒŽ–¼.
001880             07  ì‚P|Š³ŽÒŠ¿Žš            PIC X(20).
001890             07  ì‚P|Š³ŽÒƒJƒi            PIC X(20).
001900         05  ì‚P|Š³ŽÒ«•Ê                PIC 9.
001910         05  ì‚P|Š³ŽÒ¶”NŒŽ“ú.
001920             07  ì‚P|Š³ŽÒ˜a—ï            PIC 9(1).
001930             07  ì‚P|Š³ŽÒ”N              PIC 9(2).
001940             07  ì‚P|Š³ŽÒŒŽ              PIC 9(2).
001950             07  ì‚P|Š³ŽÒ“ú              PIC 9(2).
001960         05  ì‚P|‘±•¿                    PIC N(2).
001970         05  ì‚P|”í•ÛŒ¯ŽÒŽ–¼.
001980             07  ì‚P|”í•ÛŒ¯ŽÒŠ¿Žš        PIC X(20).
001990         05  ì‚P|”í•ÛŒ¯ŽÒ«•Ê            PIC 9.
002000         05  ì‚P|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú.
002010             07  ì‚P|”í•ÛŒ¯ŽÒ˜a—ï        PIC 9(1).
002020             07  ì‚P|”í•ÛŒ¯ŽÒ”N          PIC 9(2).
002030             07  ì‚P|”í•ÛŒ¯ŽÒŒŽ          PIC 9(2).
002040             07  ì‚P|”í•ÛŒ¯ŽÒ“ú          PIC 9(2).
002050         05  ì‚P|‹L†                    PIC X(24).
002060         05  ì‚P|”Ô†                    PIC X(12).
002070         05  ì‚P|Ž‘ŠiŽæ“¾”NŒŽ“ú.
002080             07  ì‚P|Ž‘Ši˜a—ï            PIC 9(1).
002090             07  ì‚P|Ž‘Ši”N              PIC 9(2).
002100             07  ì‚P|Ž‘ŠiŒŽ              PIC 9(2).
002110             07  ì‚P|Ž‘Ši“ú              PIC 9(2).
002120         05  ì‚P|—LŒø”NŒŽ“ú.
002130             07  ì‚P|—LŒø˜a—ï            PIC 9(1).
002140             07  ì‚P|—LŒø”N              PIC 9(2).
002150             07  ì‚P|—LŒøŒŽ              PIC 9(2).
002160             07  ì‚P|—LŒø“ú              PIC 9(2).
002170         05  ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥      PIC 9.
002180         05  ì‚P|“]‹A‹æ•ª‘‡            PIC 9.
002190         05  FILLER                        PIC 9(2).
002200         05  ì‚P|’Ê‰@‰ñ”                PIC 9(2).
002210         05  ì‚P|‰f—¿.
002220             07  ì‚P|‰fŠî–{—¿          PIC 9(4).
002230             07  ì‚P|‰f‰ÁŽZ—¿          PIC 9(4).
002240         05  ì‚P|‰—Ã—¿.
002250             07  ì‚P|‰ÁŽZ                PIC 9.
002260             07  ì‚P|‰ñ”                PIC 9(2).
002270             07  ì‚P|‰—Ã—¿‹àŠz          PIC 9(6).
002280         05  ì‚P|‹à‘®•›Žq‰ÁŽZ.
002290             07  ì‚P|Žg—p–‡”.
002300                 09  ì‚P|‘å              PIC 9.
002310                 09  ì‚P|’†              PIC 9.
002320                 09  ì‚P|¬              PIC 9.
002330             07  ì‚P|‹àŠz                PIC 9(6).
002340         05  ì‚P|î•ñ’ñ‹Ÿ—¿              PIC 9(6).
002350         05  ì‚P|•¶‘—¿                  PIC 9(6).
002360         05  ì‚P|ˆê”Ê”ï—p‹àŠz.
002370             07  ì‚P|”ï—p‡Œv‹àŠz        PIC 9(6).
002380             07  ì‚P|•‰’S—¦              PIC 9.
002390             07  ì‚P|•‰’S‹àŠz            PIC 9(6).
002400             07  ì‚P|¿‹‹àŠz            PIC 9(6).
002410         05  ì‚P|˜Vl•¬‹àŠz.
002420             07  ì‚P|Ž©ŒÈ•‰’S‹àŠz        PIC 9(6).
002430             07  ì‚P|·ˆø¿‹‹àŠz        PIC 9(6).
002440             07  ì‚P|‡Œv¿‹‹àŠz        PIC 9(6).
002450         05  ì‚P|•”ˆÊƒf[ƒ^              OCCURS 5.
002460             07  ì‚P|•‰ƒR[ƒh.
002470                 09  ì‚P|Ží•Ê            PIC 9.
002480                 09  ì‚P|•”ˆÊƒR[ƒh      PIC 99.
002490             07  ì‚P|—âãª—Ã–@.
002500                 09  ì‚P|—âãª‰ñ”        PIC 99.
002510                 09  ì‚P|—âãª‹àŠz        PIC 9(6).
002520             07  ì‚P|Ž{p—¿              PIC 9(6).
002530             07  ì‚P|ãª–@—¿.
002540                 09  ì‚P|ãª–@‰ñ”        PIC 99.
002550                 09  ì‚P|ãª–@‹àŠz        PIC 9(6).
002560             07  ì‚P|“d—Ã—¿.
002570                 09  ì‚P|“d—Ã‰ñ”        PIC 99.
002580                 09  ì‚P|“d—Ã‹àŠz        PIC 9(6).
002590             07  ì‚P|Œã—Ã—¿.
002600                 09  ì‚P|Œã—Ã‰ñ”        PIC 99.
002610                 09  ì‚P|Œã—Ã‹àŠz        PIC 9(6).
002620             07  ì‚P|“]‹A‹æ•ª            PIC 9.
002630         05  FILLER                        PIC X(13).
002640*----------------------------------------------------------------*
002650******************************************************************
002660*                WORKING-STORAGE SECTION                         *
002670******************************************************************
002680 WORKING-STORAGE         SECTION.
002690 01 ƒL[“ü—Í                           PIC X    VALUE SPACE.
002700 01 ó‘ÔƒL[                           PIC X(2) VALUE SPACE.
002710 01 I—¹ƒtƒ‰ƒO                         PIC X(3) VALUE SPACE.
002720 01 I—¹ƒtƒ‰ƒO‚Q                       PIC X(3) VALUE SPACE.
002730 01 ŽÀsƒL[‚v                         PIC X(3)  VALUE SPACE.
002740 01 Ž{p‹L˜^—L‚v                       PIC X(3) VALUE SPACE.
002750 01 ƒtƒ@ƒCƒ‹–¼                         PIC N(8) VALUE SPACE.
002760 01 Œp‘±ƒtƒ‰ƒO                         PIC X(3) VALUE SPACE.
002770**
002780 01 •ÛŒ¯Ží•Ê‚v‚q                       PIC 9(2) VALUE ZERO.
002790 01 Š³ŽÒƒR[ƒh‚v‚q.
002800    03 Š³ŽÒ”Ô†‚v‚q                    PIC 9(6) VALUE ZERO.
002810    03 Ž}”Ô‚v‚q                        PIC X    VALUE SPACE.
002820*
002830 01 ˆóüŒ`Ž®‚v‚q                       PIC 9    VALUE ZERO.
002840 01 •ÛŒ¯ŽÒ”Ô†‚v‚q                     PIC X(10) VALUE SPACE.
002850 01 ƒŒƒZƒvƒgŽí—Þ‚v‚q                   PIC X(4) VALUE SPACE.
002860 01 –{l‰Æ‘°‹æ•ª‚v‚q                   PIC 9    VALUE ZERO.
002870 01 ‘±•¿‚v                             PIC N(2) VALUE SPACE.
002880 01 Ž{p˜a—ï”NŒŽ‚v‚q.
002890    03 Ž{p˜a—ï‚v‚q                    PIC 9    VALUE ZERO.
002900    03 Ž{p”N‚v‚q                      PIC 9(2) VALUE ZERO.
002910    03 Ž{pŒŽ‚v‚q                      PIC 9(2) VALUE ZERO.
002920 01 ¿‹˜a—ï”NŒŽ‚v‚q.
002930    03 ¿‹˜a—ï‚v‚q                    PIC 9    VALUE ZERO.
002940    03 ¿‹”N‚v‚q                      PIC 9(2) VALUE ZERO.
002950    03 ¿‹ŒŽ‚v‚q                      PIC 9(2) VALUE ZERO.
002960**
002970 01 •”ˆÊ‚b‚m‚s                         PIC 9     VALUE ZERO.
002980 01 ƒJƒEƒ“ƒ^                           PIC 9(2)  VALUE ZERO.
002990 01 ƒJƒEƒ“ƒ^‚Q                         PIC 9(3)  VALUE ZERO.
003000 01 ƒJƒEƒ“ƒ^‚R                         PIC 9(2)  VALUE ZERO.
003010 01 ‘SŠp‹ó”’                           PIC X(2)  VALUE X"8140".
003020 01 ”¼Šp‹ó”’                           PIC X(2)  VALUE X"2020".
003030**
003040 01 ‡”Ô‚v                             PIC 9(4) VALUE ZERO.
003050** ƒGƒ‰[ƒƒbƒZ[ƒW—p
003060 01 ƒGƒ‰[ƒƒbƒZ[ƒW‚v.
003070    03 ƒGƒ‰[Š³ŽÒƒR[ƒh‚v              PIC X(7) VALUE SPACE.
003080    03 ƒGƒ‰[‹æØ‚è‚v                  PIC X(1) VALUE SPACE.
003090    03 ƒGƒ‰[•ÛŒ¯Ží•Ê‚v                PIC X(2) VALUE SPACE.
003100    03 FILLER                          PIC X(10) VALUE SPACE.
003110** •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß—p
003120 01 •ÛŒ¯ŽÒ”Ô†‚v‚s.
003130    03 •ÛŒ¯ŽÒ”Ô†¶‹l‚ß‚v.
003140      05 •ÛŒ¯ŽÒ”Ô†¶‹l‚ß‚v‚P          PIC X OCCURS 8 VALUE SPACE.
003150    03 •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß‚v.
003160      05 •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß‚v‚P          PIC X OCCURS 8 VALUE ZERO.
003170    03 •ÛŒ¯ŽÒ”Ô†”Žš‚v                PIC 9(8)  VALUE ZERO.
003180    03 •ÛŒ¯ŽÒ”Ô†‚v                    PIC X(8)  VALUE SPACE.
003190** ‰ïˆõ”Ô†‰E‹l‚ß—p
003200 01 ‰ïˆõ”Ô†‚v‚s.
003210    03 ‰ïˆõ”Ô†¶‹l‚ß‚v.
003220      05 ‰ïˆõ”Ô†¶‹l‚ß‚v‚P            PIC X OCCURS 7 VALUE SPACE.
003230    03 ‰ïˆõ”Ô†‰E‹l‚ß‚v.
003240      05 ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P            PIC X OCCURS 7 VALUE ZERO.
003250    03 ‰ïˆõ”Ô†”Žš‚v                  PIC 9(7)  VALUE ZERO.
003260    03 ‰ïˆõ”Ô†‚v                      PIC X(7)  VALUE SPACE.
003270** ¼—ï“ú•tƒ[ƒN—p
003280 01 ¼—ï”NŒŽ‚v.
003290    03 ¼—ï”N‚v                        PIC 9(4) VALUE ZERO.
003300    03 ¼—ïŒŽ‚v                        PIC 9(2) VALUE ZERO.
003310** ¼—ï¿‹”NŒŽ—p
003320 01 ¼—ï¿‹”NŒŽ‚v.
003330    03 ¼—ï¿‹”N‚v                    PIC 9(4) VALUE ZERO.
003340    03 ¼—ï¿‹ŒŽ‚v                    PIC 9(2) VALUE ZERO.
003350** ¼—ïŽ{p”NŒŽ—p
003360 01 ¼—ïŽ{p”NŒŽ‚v.
003370    03 ¼—ïŽ{p”N‚v                    PIC 9(4) VALUE ZERO.
003380    03 ¼—ïŽ{pŒŽ‚v                    PIC 9(2) VALUE ZERO.
003390** ‹L†¶‹l‚ß—p
003400 01 ‹L†‚v‚s.
003410    03 ‹L†Œ³‚v.
003420      05 ‹L†Œ³‚v‚P                    PIC N OCCURS 12 VALUE SPACE.
003430    03 ‹L†¶‹l‚ß‚v.
003440      05 ‹L†¶‹l‚ß‚v‚P                PIC N OCCURS 12 VALUE SPACE.
003450    03 ‹L†‚v.
003460      05 ‹L†‚m‚v                      PIC N(12) VALUE SPACE.
003470    03 ‹L†‚o‚v.
003480      05 ‹L†‚o‚m‚v                    PIC X(24) VALUE SPACE.
003490*
003500**********************************************************************************
003510*
003520 01 ‘Þ”ð€–Ú‚f‚v.
003530   03 ƒŒƒZƒvƒgŽí—Þ‚v                   PIC X(4).
003540   03 ƒŒƒZƒvƒgŽí—Þ‚f‚v                 PIC X(4).
003550   03 ƒŒƒZƒvƒgŽí•Ê‚f‚v                 PIC 9(2).
003560*
003570****************
003580* •‰ƒf[ƒ^‚e *
003590****************
003600 01 •‰î•ñ‚v.
003610    03 •”ˆÊ”‚v                        PIC 9(1)  VALUE ZERO.
003620    03 •”ˆÊî•ñ‚v  OCCURS   9.
003630       05 •”ˆÊ‚b‚m‚s‚v                 PIC 9(1)  VALUE ZERO.
003640       05 •”ˆÊƒR[ƒh‚v.
003650          07 •‰Ží•Ê‚v                PIC 9(2)  VALUE ZERO.
003660          07 •”ˆÊ‚v                    PIC 9(2)  VALUE ZERO.
003670       05 “]‹A‹æ•ª‚v                   PIC 9(1)  VALUE ZERO.
003680*    ************
003690*    * —¿‹àî•ñ *
003700*    ************
003710*    ŒŽ–ˆ‚Ì—¿‹à
003720***********************
003730 01 —¿‹à‚P‚v‚q.
003740   03 ‰ŒŸ‚v‚q.
003750      05 •‰’SŠ„‡‚v‚q               PIC 9(3)    VALUE ZERO.
003760      05 ‰ŒŸ—¿‚v‚q                 PIC 9(5)    VALUE ZERO.
003770      05 ‰ŒŸ‰ÁŽZ—¿‚v‚q             PIC 9(5)    VALUE ZERO.
003780   03 ÄŒŸ—¿‚v‚q                    PIC 9(5)    VALUE ZERO.
003790   03 ‰—Ã‚v‚q.
003800      05 ‰—Ã‰ñ”‚v‚q               PIC 9(2)    VALUE ZERO.
003810      05 ‰—Ã—¿‚v‚q                 PIC 9(5)    VALUE ZERO.
003820      05 ‰—Ã‰ÁŽZ—¿‚v‚q             PIC 9(5)    VALUE ZERO.
003830   03 ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q            PIC 9(5)    VALUE ZERO.
003840   03 ‘å‚v                          PIC 9(1)    VALUE ZERO.
003850   03 ’†‚v                          PIC 9(1)    VALUE ZERO.
003860   03 ¬‚v                          PIC 9(1)    VALUE ZERO.
003870   03 Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q            PIC 9(5)    VALUE ZERO.
003880   03 ˆê•”•‰’S‹à‚v‚q                PIC 9(6)    VALUE ZERO.
003890   03 ¿‹‹àŠz‚v‚q                  PIC 9(6)    VALUE ZERO.
003900   03 ‹‹•tŠ„‡‚v‚q                  PIC 9(1)    VALUE ZERO.
003910   03 Žó‹‹ŽÒ•‰’SŠz‚v‚q              PIC 9(6)    VALUE ZERO.
003920   03 •¬¿‹‹àŠz‚v‚q              PIC 9(6)    VALUE ZERO.
003930*
003940* •‰•”ˆÊ–ˆ‚Ì—¿‹à
003950***********************
003960 01 —¿‹à‚Q‚v‚q.
003970   03 ‰‰ñˆ’u‚v‚q    OCCURS   9.
003980      05 ‰‰ñˆ’u—¿‚v‚q             PIC 9(5)    VALUE ZERO.
003990*
004000* ’üŒ¸–ˆ‚Ì—¿‹à
004010***********************
004020 01 —¿‹à‚R‚v‚q.
004030**********
004040* ‚P•”ˆÊ *
004050**********
004060   03 •”ˆÊ‚P‚v‚q.
004070      05 Œã—Ã‚P‚v‚q.
004080         07 Œã—Ã‰ñ”‚P‚v‚q              PIC 9(2)    VALUE ZERO.
004090         07 Œã—Ã—¿‚P‚v‚q                PIC 9(5)    VALUE ZERO.
004100      05 —âãª–@‚P‚v‚q.
004110         07 —âãª–@‰ñ”‚P‚v‚q            PIC 9(2)    VALUE ZERO.
004120         07 —âãª–@—¿‚P‚v‚q              PIC 9(4)    VALUE ZERO.
004130      05 ‰·ãª–@‚P‚v‚q.
004140         07 ‰·ãª–@‰ñ”‚P‚v‚q            PIC 9(2)    VALUE ZERO.
004150         07 ‰·ãª–@—¿‚P‚v‚q              PIC 9(4)    VALUE ZERO.
004160      05 “d—Ã‚P‚v‚q.
004170         07 “d—Ã‰ñ”‚P‚v‚q              PIC 9(2)    VALUE ZERO.
004180         07 “d—Ã—¿‚P‚v‚q                PIC 9(4)    VALUE ZERO.
004190**********
004200* ‚Q•”ˆÊ *
004210**********
004220   03 •”ˆÊ‚Q‚v‚q.
004230      05 Œã—Ã‚Q‚v‚q.
004240         07 Œã—Ã‰ñ”‚Q‚v‚q              PIC 9(2)    VALUE ZERO.
004250         07 Œã—Ã—¿‚Q‚v‚q                PIC 9(5)    VALUE ZERO.
004260      05 —âãª–@‚Q‚v‚q.
004270         07 —âãª–@‰ñ”‚Q‚v‚q            PIC 9(2)    VALUE ZERO.
004280         07 —âãª–@—¿‚Q‚v‚q              PIC 9(4)    VALUE ZERO.
004290      05 ‰·ãª–@‚Q‚v‚q.
004300         07 ‰·ãª–@‰ñ”‚Q‚v‚q            PIC 9(2)    VALUE ZERO.
004310         07 ‰·ãª–@—¿‚Q‚v‚q              PIC 9(4)    VALUE ZERO.
004320      05 “d—Ã‚Q‚v‚q.
004330         07 “d—Ã‰ñ”‚Q‚v‚q              PIC 9(2)    VALUE ZERO.
004340         07 “d—Ã—¿‚Q‚v‚q                PIC 9(4)    VALUE ZERO.
004350******************
004360* ‚R•”ˆÊ^‚WŠ„ *
004370******************
004380   03 •”ˆÊ‚R‚W‚v‚q.
004390      05 Œã—Ã‚R‚W‚v‚q.
004400         07 Œã—Ã‰ñ”‚R‚W‚v‚q              PIC 9(2)  VALUE ZERO.
004410         07 Œã—Ã—¿‚R‚W‚v‚q                PIC 9(5)  VALUE ZERO.
004420      05 —âãª–@‚R‚W‚v‚q.
004430         07 —âãª–@‰ñ”‚R‚W‚v‚q            PIC 9(2)  VALUE ZERO.
004440         07 —âãª–@—¿‚R‚W‚v‚q              PIC 9(4)  VALUE ZERO.
004450      05 ‰·ãª–@‚R‚W‚v‚q.
004460         07 ‰·ãª–@‰ñ”‚R‚W‚v‚q            PIC 9(2)  VALUE ZERO.
004470         07 ‰·ãª–@—¿‚R‚W‚v‚q              PIC 9(4)  VALUE ZERO.
004480      05 “d—Ã‚R‚W‚v‚q.
004490         07 “d—Ã‰ñ”‚R‚W‚v‚q              PIC 9(2)  VALUE ZERO.
004500         07 “d—Ã—¿‚R‚W‚v‚q                PIC 9(4)  VALUE ZERO.
004510******************
004520* ‚R•”ˆÊ^‚P‚OŠ„ *
004530******************
004540   03 •”ˆÊ‚R‚O‚v‚q.
004550      05 Œã—Ã‚R‚O‚v‚q.
004560         07 Œã—Ã‰ñ”‚R‚O‚v‚q              PIC 9(2)  VALUE ZERO.
004570         07 Œã—Ã—¿‚R‚O‚v‚q                PIC 9(5)  VALUE ZERO.
004580      05 —âãª–@‚R‚O‚v‚q.
004590         07 —âãª–@‰ñ”‚R‚O‚v‚q            PIC 9(2)  VALUE ZERO.
004600         07 —âãª–@—¿‚R‚O‚v‚q              PIC 9(4)  VALUE ZERO.
004610      05 ‰·ãª–@‚R‚O‚v‚q.
004620         07 ‰·ãª–@‰ñ”‚R‚O‚v‚q            PIC 9(2)  VALUE ZERO.
004630         07 ‰·ãª–@—¿‚R‚O‚v‚q              PIC 9(4)  VALUE ZERO.
004640      05 “d—Ã‚R‚O‚v‚q.
004650         07 “d—Ã‰ñ”‚R‚O‚v‚q              PIC 9(2)  VALUE ZERO.
004660         07 “d—Ã—¿‚R‚O‚v‚q                PIC 9(4)  VALUE ZERO.
004670******************
004680* ‚R•”ˆÊ^‡Œv@ *
004690******************
004700   03 •”ˆÊ‚R‚v‚q.
004710      05 Œã—Ã‚R‚v‚q.
004720         07 Œã—Ã‰ñ”‚R‚v‚q                PIC 9(2)  VALUE ZERO.
004730         07 Œã—Ã—¿‚R‚v‚q                  PIC 9(6)  VALUE ZERO.
004740      05 —âãª–@‚R‚v‚q.
004750         07 —âãª–@‰ñ”‚R‚v‚q              PIC 9(2)  VALUE ZERO.
004760         07 —âãª–@—¿‚R‚v‚q                PIC 9(6)  VALUE ZERO.
004770      05 ‰·ãª–@‚R‚v‚q.
004780         07 ‰·ãª–@‰ñ”‚R‚v‚q              PIC 9(2)  VALUE ZERO.
004790         07 ‰·ãª–@—¿‚R‚v‚q                PIC 9(6)  VALUE ZERO.
004800      05 “d—Ã‚R‚v‚q.
004810         07 “d—Ã‰ñ”‚R‚v‚q                PIC 9(2)  VALUE ZERO.
004820         07 “d—Ã—¿‚R‚v‚q                  PIC 9(6)  VALUE ZERO.
004830****************
004840* ‚S•”ˆÊ^‚TŠ„ *
004850****************
004860   03 •”ˆÊ‚S‚T‚v‚q.
004870      05 Œã—Ã‚S‚T‚v‚q.
004880         07 Œã—Ã‰ñ”‚S‚T‚v‚q              PIC 9(2)  VALUE ZERO.
004890         07 Œã—Ã—¿‚S‚T‚v‚q                PIC 9(5)  VALUE ZERO.
004900      05 —âãª–@‚S‚T‚v‚q.
004910         07 —âãª–@‰ñ”‚S‚T‚v‚q            PIC 9(2)  VALUE ZERO.
004920         07 —âãª–@—¿‚S‚T‚v‚q              PIC 9(4)  VALUE ZERO.
004930      05 ‰·ãª–@‚S‚T‚v‚q.
004940         07 ‰·ãª–@‰ñ”‚S‚T‚v‚q            PIC 9(2)  VALUE ZERO.
004950         07 ‰·ãª–@—¿‚S‚T‚v‚q              PIC 9(4)  VALUE ZERO.
004960      05 “d—Ã‚S‚T‚v‚q.
004970         07 “d—Ã‰ñ”‚S‚T‚v‚q              PIC 9(2)  VALUE ZERO.
004980         07 “d—Ã—¿‚S‚T‚v‚q                PIC 9(4)  VALUE ZERO.
004990****************
005000* ‚S•”ˆÊ^‚WŠ„ *
005010****************
005020   03 •”ˆÊ‚S‚W‚v‚q.
005030      05 Œã—Ã‚S‚W‚v‚q.
005040         07 Œã—Ã‰ñ”‚S‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005050         07 Œã—Ã—¿‚S‚W‚v‚q                PIC 9(5)  VALUE ZERO.
005060      05 —âãª–@‚S‚W‚v‚q.
005070         07 —âãª–@‰ñ”‚S‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005080         07 —âãª–@—¿‚S‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005090      05 ‰·ãª–@‚S‚W‚v‚q.
005100         07 ‰·ãª–@‰ñ”‚S‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005110         07 ‰·ãª–@—¿‚S‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005120      05 “d—Ã‚S‚W‚v‚q.
005130         07 “d—Ã‰ñ”‚S‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005140         07 “d—Ã—¿‚S‚W‚v‚q                PIC 9(4)  VALUE ZERO.
005150******************
005160* ‚S•”ˆÊ^‚P‚OŠ„ *
005170******************
005180   03 •”ˆÊ‚S‚O‚v‚q.
005190      05 Œã—Ã‚S‚O‚v‚q.
005200         07 Œã—Ã‰ñ”‚S‚O‚v‚q              PIC 9(2)  VALUE ZERO.
005210         07 Œã—Ã—¿‚S‚O‚v‚q                PIC 9(5)  VALUE ZERO.
005220      05 —âãª–@‚S‚O‚v‚q.
005230         07 —âãª–@‰ñ”‚S‚O‚v‚q            PIC 9(2)  VALUE ZERO.
005240         07 —âãª–@—¿‚S‚O‚v‚q              PIC 9(4)  VALUE ZERO.
005250      05 ‰·ãª–@‚S‚O‚v‚q.
005260         07 ‰·ãª–@‰ñ”‚S‚O‚v‚q            PIC 9(2)  VALUE ZERO.
005270         07 ‰·ãª–@—¿‚S‚O‚v‚q              PIC 9(4)  VALUE ZERO.
005280      05 “d—Ã‚S‚O‚v‚q.
005290         07 “d—Ã‰ñ”‚S‚O‚v‚q              PIC 9(2)  VALUE ZERO.
005300         07 “d—Ã—¿‚S‚O‚v‚q                PIC 9(4)  VALUE ZERO.
005310******************
005320* ‚S•”ˆÊ^‡Œv@ *
005330******************
005340   03 •”ˆÊ‚S‚v‚q.
005350      05 Œã—Ã‚S‚v‚q.
005360         07 Œã—Ã‰ñ”‚S‚v‚q                PIC 9(2)  VALUE ZERO.
005370         07 Œã—Ã—¿‚S‚v‚q                  PIC 9(6)  VALUE ZERO.
005380      05 —âãª–@‚S‚v‚q.
005390         07 —âãª–@‰ñ”‚S‚v‚q              PIC 9(2)  VALUE ZERO.
005400         07 —âãª–@—¿‚S‚v‚q                PIC 9(6)  VALUE ZERO.
005410      05 ‰·ãª–@‚S‚v‚q.
005420         07 ‰·ãª–@‰ñ”‚S‚v‚q              PIC 9(2)  VALUE ZERO.
005430         07 ‰·ãª–@—¿‚S‚v‚q                PIC 9(6)  VALUE ZERO.
005440      05 “d—Ã‚S‚v‚q.
005450         07 “d—Ã‰ñ”‚S‚v‚q                PIC 9(2)  VALUE ZERO.
005460         07 “d—Ã—¿‚S‚v‚q                  PIC 9(6)  VALUE ZERO.
005470********************
005480* ‚T•”ˆÊ^‚QD‚TŠ„ *
005490********************
005500   03 •”ˆÊ‚T‚Q‚v‚q.
005510      05 Œã—Ã‚T‚Q‚v‚q.
005520         07 Œã—Ã‰ñ”‚T‚Q‚v‚q              PIC 9(2)  VALUE ZERO.
005530         07 Œã—Ã—¿‚T‚Q‚v‚q                PIC 9(5)  VALUE ZERO.
005540      05 —âãª–@‚T‚Q‚v‚q.
005550         07 —âãª–@‰ñ”‚T‚Q‚v‚q            PIC 9(2)  VALUE ZERO.
005560         07 —âãª–@—¿‚T‚Q‚v‚q              PIC 9(4)  VALUE ZERO.
005570      05 ‰·ãª–@‚T‚Q‚v‚q.
005580         07 ‰·ãª–@‰ñ”‚T‚Q‚v‚q            PIC 9(2)  VALUE ZERO.
005590         07 ‰·ãª–@—¿‚T‚Q‚v‚q              PIC 9(4)  VALUE ZERO.
005600      05 “d—Ã‚T‚Q‚v‚q.
005610         07 “d—Ã‰ñ”‚T‚Q‚v‚q              PIC 9(2)  VALUE ZERO.
005620         07 “d—Ã—¿‚T‚Q‚v‚q                PIC 9(4)  VALUE ZERO.
005630****************
005640* ‚T•”ˆÊ^‚TŠ„ *
005650****************
005660   03 •”ˆÊ‚T‚T‚v‚q.
005670      05 Œã—Ã‚T‚T‚v‚q.
005680         07 Œã—Ã‰ñ”‚T‚T‚v‚q              PIC 9(2)  VALUE ZERO.
005690         07 Œã—Ã—¿‚T‚T‚v‚q                PIC 9(5)  VALUE ZERO.
005700      05 —âãª–@‚T‚T‚v‚q.
005710         07 —âãª–@‰ñ”‚T‚T‚v‚q            PIC 9(2)  VALUE ZERO.
005720         07 —âãª–@—¿‚T‚T‚v‚q              PIC 9(4)  VALUE ZERO.
005730      05 ‰·ãª–@‚T‚T‚v‚q.
005740         07 ‰·ãª–@‰ñ”‚T‚T‚v‚q            PIC 9(2)  VALUE ZERO.
005750         07 ‰·ãª–@—¿‚T‚T‚v‚q              PIC 9(4)  VALUE ZERO.
005760      05 “d—Ã‚T‚T‚v‚q.
005770         07 “d—Ã‰ñ”‚T‚T‚v‚q              PIC 9(2)  VALUE ZERO.
005780         07 “d—Ã—¿‚T‚T‚v‚q                PIC 9(4)  VALUE ZERO.
005790****************
005800* ‚T•”ˆÊ^‚WŠ„ *
005810****************
005820   03 •”ˆÊ‚T‚W‚v‚q.
005830      05 Œã—Ã‚T‚W‚v‚q.
005840         07 Œã—Ã‰ñ”‚T‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005850         07 Œã—Ã—¿‚T‚W‚v‚q                PIC 9(5)  VALUE ZERO.
005860      05 —âãª–@‚T‚W‚v‚q.
005870         07 —âãª–@‰ñ”‚T‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005880         07 —âãª–@—¿‚T‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005890      05 ‰·ãª–@‚T‚W‚v‚q.
005900         07 ‰·ãª–@‰ñ”‚T‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005910         07 ‰·ãª–@—¿‚T‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005920      05 “d—Ã‚T‚W‚v‚q.
005930         07 “d—Ã‰ñ”‚T‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005940         07 “d—Ã—¿‚T‚W‚v‚q                PIC 9(4)  VALUE ZERO.
005950******************
005960* ‚T•”ˆÊ^‚P‚OŠ„ *
005970******************
005980   03 •”ˆÊ‚T‚O‚v‚q.
005990      05 Œã—Ã‚T‚O‚v‚q.
006000         07 Œã—Ã‰ñ”‚T‚O‚v‚q              PIC 9(2)  VALUE ZERO.
006010         07 Œã—Ã—¿‚T‚O‚v‚q                PIC 9(5)  VALUE ZERO.
006020      05 —âãª–@‚T‚O‚v‚q.
006030         07 —âãª–@‰ñ”‚T‚O‚v‚q            PIC 9(2)  VALUE ZERO.
006040         07 —âãª–@—¿‚T‚O‚v‚q              PIC 9(4)  VALUE ZERO.
006050      05 ‰·ãª–@‚T‚O‚v‚q.
006060         07 ‰·ãª–@‰ñ”‚T‚O‚v‚q            PIC 9(2)  VALUE ZERO.
006070         07 ‰·ãª–@—¿‚T‚O‚v‚q              PIC 9(4)  VALUE ZERO.
006080      05 “d—Ã‚T‚O‚v‚q.
006090         07 “d—Ã‰ñ”‚T‚O‚v‚q              PIC 9(2)  VALUE ZERO.
006100         07 “d—Ã—¿‚T‚O‚v‚q                PIC 9(4)  VALUE ZERO.
006110******************
006120* ‚T•”ˆÊ^‡Œv@ *
006130******************
006140   03 •”ˆÊ‚T‚v‚q.
006150      05 Œã—Ã‚T‚v‚q.
006160         07 Œã—Ã‰ñ”‚T‚v‚q                PIC 9(2)  VALUE ZERO.
006170         07 Œã—Ã—¿‚T‚v‚q                  PIC 9(6)  VALUE ZERO.
006180      05 —âãª–@‚T‚v‚q.
006190         07 —âãª–@‰ñ”‚T‚v‚q              PIC 9(2)  VALUE ZERO.
006200         07 —âãª–@—¿‚T‚v‚q                PIC 9(6)  VALUE ZERO.
006210      05 ‰·ãª–@‚T‚v‚q.
006220         07 ‰·ãª–@‰ñ”‚T‚v‚q              PIC 9(2)  VALUE ZERO.
006230         07 ‰·ãª–@—¿‚T‚v‚q                PIC 9(6)  VALUE ZERO.
006240      05 “d—Ã‚T‚v‚q.
006250         07 “d—Ã‰ñ”‚T‚v‚q                PIC 9(2)  VALUE ZERO.
006260         07 “d—Ã—¿‚T‚v‚q                  PIC 9(6)  VALUE ZERO.
006270*
006280*****************************************************************
006290 01 ŒvŽZ‹@¼—ï”N‚v                     PIC 9(2).
006300* “ú•t‚v‚n‚q‚j
006310 01 ŒvŽZ‹@¼—ï.
006320    03 ŒvŽZ‹@¼—ï”N                    PIC 9(4).
006330    03 ŒvŽZ‹@¼—ïŒŽ“ú                  PIC 9(4).
006340 01 ŒvŽZ‹@¼—ï‚q REDEFINES ŒvŽZ‹@¼—ï.
006350    03 ŒvŽZ‹@¢‹I                      PIC 9(2).
006360    03 ŒvŽZ‹@“ú•t                      PIC 9(6).
006370    03 ŒvŽZ‹@“ú•t‚q REDEFINES ŒvŽZ‹@“ú•t.
006380       05 ŒvŽZ‹@”NŒŽ                   PIC 9(4).
006390       05 ŒvŽZ‹@”NŒŽ‚q REDEFINES ŒvŽZ‹@”NŒŽ.
006400         07 ŒvŽZ‹@”N                   PIC 9(2).
006410         07 ŒvŽZ‹@ŒŽ                   PIC 9(2).
006420       05 ŒvŽZ‹@“ú                     PIC 9(2).
006430*
006440*
006450 01 •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v     PIC X(8) VALUE "MOJI2".
006460 01 ƒvƒƒOƒ‰ƒ€–¼‚v         PIC X(8) VALUE SPACE.
006470*
006480******************************************************************
006490*                          ˜AŒ‹€–Ú                              *
006500******************************************************************
006510*
006520********************
006530* ƒƒbƒZ[ƒW•\Ž¦ƒL[ *
006540********************
006550 01 ˜Aƒ|ƒL[ IS EXTERNAL.
006560    03  ˜Aƒ|ƒƒbƒZ[ƒW               PIC N(20).
006570*
006580 01 ˜Aƒ‚R|ƒL[ IS EXTERNAL.
006590    03  ˜Aƒ‚R|ƒƒbƒZ[ƒW             PIC N(20).
006600    03  ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P           PIC X(20).
006610****************
006620* ‰æ–Ê“ü—Íî•ñ *
006630****************
006640 01 ˜A“ü|‰æ–Êî•ñ‚x‚`‚r‚T‚W‚O IS EXTERNAL.
006650    03 ˜A“ü|¿‹˜a—ï”NŒŽ.
006660       05 ˜A“ü|¿‹˜a—ï               PIC 9.
006670       05 ˜A“ü|¿‹”NŒŽ.
006680         07 ˜A“ü|¿‹”N               PIC 9(2).
006690         07 ˜A“ü|¿‹ŒŽ               PIC 9(2).
006700*
006710 01 ˜AƒŒ|ƒL[ IS EXTERNAL.
006720    03 ˜AƒŒ|•ÛŒ¯Ží•Ê                  PIC 9(2).
006730*
006740*******************************
006750* •‰’S—¦Žæ“¾—p ‚o‚f‚Ì‘Î‰ž1410 *
006760*******************************
006770 01 ˜A—¦|•‰’S—¦Žæ“¾ƒL[ IS EXTERNAL.
006780    03 ˜A—¦|Ž{p˜a—ï”NŒŽ.
006790       05 ˜A—¦|Ž{p˜a—ï             PIC 9.
006800       05 ˜A—¦|Ž{p”NŒŽ.
006810          07 ˜A—¦|Ž{p”N            PIC 9(2).
006820          07 ˜A—¦|Ž{pŒŽ            PIC 9(2).
006830    03 ˜A—¦|Š³ŽÒƒR[ƒh.
006840       05 ˜A—¦|Š³ŽÒ”Ô†             PIC 9(6).
006850       05 ˜A—¦|Ž}”Ô                 PIC X.
006860    03 ˜A—¦|ŽÀÛ•‰’S—¦              PIC 9(3).
006870    03 ˜A—¦|ŽÀÛ–{‘Ì•‰’S—¦          PIC 9(3).
006880    03 ˜A—¦|Œ’•Û•‰’S—¦              PIC 9(3).
006890    03 ˜A—¦|‚Q‚V˜V•‰’S—¦            PIC 9(3).
006900    03 ˜A—¦|•¬•‰’S—¦              PIC 9(3).
006910    03 ˜A—¦|“Á•Ê—p•‰’S—¦            PIC 9(3).
006920*
006930** ˆÃ†•¡‡—p
006940 01 ˜AˆÃ†•¡‡|ˆÃ†î•ñ IS EXTERNAL.
006950    03 ˜AˆÃ†•¡‡|“ü—Íî•ñ.
006960       05 ˜AˆÃ†•¡‡|‹L†               PIC X(24).
006970       05 ˜AˆÃ†•¡‡|”Ô†               PIC X(30).
006980       05 ˜AˆÃ†•¡‡|ˆÃ†‰»€–Ú.
006990         07 ˜AˆÃ†•¡‡|ˆÃ†Š³ŽÒ”Ô†     PIC X(6).
007000         07 ˜AˆÃ†•¡‡|ˆÃ†”»’è‹L†     PIC X.
007010         07 ˜AˆÃ†•¡‡|ˆÃ†”»’è”Ô†     PIC X.
007020         07 ˜AˆÃ†•¡‡|ˆÃ†‹L†         PIC X(24).
007030         07 ˜AˆÃ†•¡‡|ˆÃ†”Ô†         PIC X(30).
007040    03 ˜AˆÃ†•¡‡|o—Íî•ñ.
007050       05 ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†       PIC X(24).
007060       05 ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†       PIC X(30).
007070*
007080******************************************************************
007090*                      PROCEDURE  DIVISION                       *
007100******************************************************************
007110 PROCEDURE               DIVISION.
007120************
007130*           *
007140* ‰Šúˆ—   *
007150*           *
007160************
007170     PERFORM ‰Šú‰».
007180     PERFORM Ž{pŠî•ñŽæ“¾.
007190************
007200*           *
007210* Žåˆ—     *
007220*           *
007230************
007240     PERFORM ì‹Æƒtƒ@ƒCƒ‹ì¬.
007250************
007260*           *
007270* I—¹ˆ—   *
007280*           *
007290************
007300     PERFORM I—¹ˆ—.
007310     MOVE ZERO TO PROGRAM-STATUS.
007320     EXIT PROGRAM.
007330*
007340*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
007350*================================================================*
007360 ‰Šú‰» SECTION.
007370*
007380     PERFORM ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“.
007390* ˜AŒ‹€–Ú‚Ì‘Ò”ð
007400     MOVE ˜A“ü|¿‹˜a—ï      TO ¿‹˜a—ï‚v‚q.
007410     MOVE ˜A“ü|¿‹”N        TO ¿‹”N‚v‚q.
007420     MOVE ˜A“ü|¿‹ŒŽ        TO ¿‹ŒŽ‚v‚q.
007430*
007440*================================================================*
007450 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“ SECTION.
007460*
007470     OPEN INPUT Œ³†ƒ}ƒXƒ^.
007480         MOVE NC"Œ³†ƒ}ƒXƒ^" TO ƒtƒ@ƒCƒ‹–¼.
007490         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007500     OPEN INPUT –¼Ìƒ}ƒXƒ^.
007510         MOVE NC"–¼Ìƒ}ƒXƒ^" TO ƒtƒ@ƒCƒ‹–¼.
007520         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007530     OPEN INPUT Ž{pŠî•ñƒ}ƒXƒ^
007540         MOVE NC"Ž{î" TO ƒtƒ@ƒCƒ‹–¼.
007550         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007560     OPEN INPUT Ž{p‹L˜^‚e.
007570         MOVE NC"Ž{p‹L˜^‚e" TO ƒtƒ@ƒCƒ‹–¼.
007580         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007590     OPEN INPUT ŽófŽÒî•ñ‚e.
007600         MOVE NC"ŽófŽÒî•ñ‚e" TO ƒtƒ@ƒCƒ‹–¼.
007610         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007620     OPEN INPUT •‰ƒf[ƒ^‚e.
007630         MOVE NC"•‰ƒf[ƒ^‚e" TO ƒtƒ@ƒCƒ‹–¼.
007640         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007650     OPEN INPUT ƒŒƒZƒvƒg‚e.
007660         MOVE NC"ƒŒƒZ" TO ƒtƒ@ƒCƒ‹–¼.
007670         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
007680*================================================================*
007690 ƒI[ƒvƒ“ƒ`ƒFƒbƒN SECTION.
007700*
007710     IF ó‘ÔƒL[  NOT =  "00"
007720         DISPLAY ƒtƒ@ƒCƒ‹–¼ NC"‚eƒI[ƒvƒ“ƒGƒ‰[" UPON CONS
007730         DISPLAY NC"ó‘ÔƒL[F" ó‘ÔƒL[         UPON CONS
007740         DISPLAY NC"”Žš‚P•¶Žš“ü—Í‚µ‚d‚m‚s‚d‚qƒL[‚ð‰Ÿ‚µ‚Ä‚­‚¾‚³‚¢"
007750                                                 UPON CONS
007760         ACCEPT  ƒL[“ü—Í FROM CONS
007770         PERFORM ƒtƒ@ƒCƒ‹•Â½
007780         MOVE 99 TO PROGRAM-STATUS
007790         EXIT PROGRAM.
007800*================================================================*
007810 ƒtƒ@ƒCƒ‹•Â½ SECTION.
007820*
007830     CLOSE Œ³†ƒ}ƒXƒ^ –¼Ìƒ}ƒXƒ^ ŽófŽÒî•ñ‚e •‰ƒf[ƒ^‚e
007840           Ž{p‹L˜^‚e Ž{pŠî•ñƒ}ƒXƒ^ ƒŒƒZƒvƒg‚e.
007850*================================================================*
007860 I—¹ˆ— SECTION.
007870*
007880     PERFORM ƒtƒ@ƒCƒ‹•Â½.
007890*================================================================*
007900 ƒGƒ‰[•\Ž¦ SECTION.
007910*
007920     DISPLAY NC"ó‘ÔƒL[" ó‘ÔƒL[  UPON CONS.
007930     DISPLAY NC"ƒtƒ@ƒCƒ‹‘žƒGƒ‰[F" ƒtƒ@ƒCƒ‹–¼   UPON CONS.
007940     DISPLAY NC"ƒVƒXƒeƒ€ŠÇ—ŽÒ‚É˜A—‚µ‚Ä‚­‚¾‚³‚¢"  UPON CONS.
007950     DISPLAY NC"”Žš‚P•¶Žš“ü—Í‚µ‚d‚m‚s‚d‚qƒL[‚ð‰Ÿ‚µ‚Ä‚­‚¾‚³‚¢"                                                                    UPON CONS.
007960     ACCEPT  ƒL[“ü—Í FROM CONS.
007970     PERFORM ƒtƒ@ƒCƒ‹•Â½.
007980     MOVE 99 TO PROGRAM-STATUS.
007990     EXIT PROGRAM.
008000*================================================================*
008010 Ž{pŠî•ñŽæ“¾ SECTION.
008020*
008030     MOVE ZERO  TO Ž{î|Ž{pŠ”Ô†.
008040     READ Ž{pŠî•ñƒ}ƒXƒ^
008050     INVALID KEY
008060          MOVE  NC"Ž{pŠî•ñƒ}ƒXƒ^‚É“o˜^ŒãAŽÀs‚µ‚Ä‰º‚³‚¢" TO ˜Aƒ|ƒƒbƒZ[ƒW
008070          CALL   "MSG001"
008080          CANCEL "MSG001"
008090          PERFORM ƒtƒ@ƒCƒ‹•Â½
008100          MOVE 99 TO PROGRAM-STATUS
008110          EXIT PROGRAM
008120     NOT INVALID KEY
008130          IF  Ž{î|ÚœŽt‰ï‰ïˆõ”Ô† = SPACE
008140              MOVE  NC"Ž{pŠƒ}ƒXƒ^‚É‰ïˆõ”Ô†‚ð“o˜^‚µ‚Ä‰º‚³‚¢" TO ˜Aƒ|ƒƒbƒZ[ƒW
008150              CALL   "MSG001"
008160              CANCEL "MSG001"
008170              PERFORM ƒtƒ@ƒCƒ‹•Â½
008180              MOVE 99 TO PROGRAM-STATUS
008190              EXIT PROGRAM
008200          ELSE
008210              MOVE Ž{î|ÚœŽt‰ï‰ïˆõ”Ô†  TO ‰ïˆõ”Ô†‚v
008220****              PERFORM ‰ïˆõ”Ô†‰E‹l‚ß
008230          END-IF
008240     END-READ.
008250*
008260*================================================================*
008270 ì‹Æƒtƒ@ƒCƒ‹ì¬ SECTION.
008280*
008290     OPEN OUTPUT ì‹Æƒtƒ@ƒCƒ‹‚P.
008300         MOVE NC"ì‚P" TO ƒtƒ@ƒCƒ‹–¼.
008310         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
008320*
008330     PERFORM ì‹Æƒtƒ@ƒCƒ‹‚Pì¬‚P
008340*
008350     CLOSE ì‹Æƒtƒ@ƒCƒ‹‚P.
008360*
008370*================================================================*
008380 ì‹Æƒtƒ@ƒCƒ‹‚Pì¬‚P SECTION.
008390*
008400*********************
008410*       ‘So—Í      *
008420*********************
008430*
008440     MOVE ¿‹˜a—ï‚v‚q  TO ƒŒƒZ|¿‹˜a—ï.
008450     MOVE ¿‹”N‚v‚q    TO ƒŒƒZ|¿‹”N.
008460     MOVE ¿‹ŒŽ‚v‚q    TO ƒŒƒZ|¿‹ŒŽ.
008470     MOVE ZERO          TO ƒŒƒZ|ƒŒƒZŽí•Ê.
008480     MOVE ZERO          TO ƒŒƒZ|Ž{p˜a—ï.
008490     MOVE ZERO          TO ƒŒƒZ|Ž{p”N.
008500     MOVE ZERO          TO ƒŒƒZ|Ž{pŒŽ.
008510     MOVE ZERO          TO ƒŒƒZ|Š³ŽÒ”Ô†.
008520     MOVE SPACE         TO ƒŒƒZ|Ž}”Ô.
008530     START ƒŒƒZƒvƒg‚e   KEY IS >= ƒŒƒZ|¿‹˜a—ï”NŒŽ
008540                                  ƒŒƒZ|Ž{p˜a—ï”NŒŽ
008550                                  ƒŒƒZ|Š³ŽÒƒR[ƒh
008560                                  ƒŒƒZ|ƒŒƒZŽí•Ê
008570     END-START.
008580     IF ó‘ÔƒL[ = "00"
008590         MOVE SPACE  TO I—¹ƒtƒ‰ƒO
008600         PERFORM ƒŒƒZƒvƒg‚e“Çž
008610         PERFORM UNTIL ( I—¹ƒtƒ‰ƒO = "YES" ) OR
008620                       ( ƒŒƒZ|¿‹˜a—ï NOT = ¿‹˜a—ï‚v‚q ) OR
008630                       ( ƒŒƒZ|¿‹”N   NOT = ¿‹”N‚v‚q   ) OR
008640                       ( ƒŒƒZ|¿‹ŒŽ   NOT = ¿‹ŒŽ‚v‚q   )
008650            PERFORM ƒf[ƒ^ƒ`ƒFƒbƒN
008660**
008670** Ž©—R‚Í‘ÎÛŠO
008680            IF  Žó|•ÛŒ¯Ží•Ê = 90
008690                MOVE SPACE  TO ŽÀsƒL[‚v
008700            END-IF
008710** ///
008720** ‚Æ‚è‚ ‚¦‚¸ ˜JÐEŽ©”…Ó‚Í‘ÎÛŠO (ƒŒƒZƒvƒg“à—e‚ªˆá‚¤ˆ×)
008730            IF  Žó|•ÛŒ¯Ží•Ê = 70 OR 80
008740                MOVE SPACE  TO ŽÀsƒL[‚v
008750            END-IF
008760** ///
008770            IF  ŽÀsƒL[‚v = "YES"
008780**
008790*            ********
008800*            * Œ’•Û *
008810*            ********
008820                 IF ( Žó|•ÛŒ¯Ží•Ê   NOT = ZERO ) AND
008830                    ( Žó|•ÛŒ¯ŽÒ”Ô† NOT = SPACE )
008840*                **********************
008850*                * ì‹Æƒtƒ@ƒCƒ‹ì¬ *
008860*                **********************
008870                     IF ( Žó|Œö”ïŽí•Ê       = ZERO  ) AND
008880                        ( Žó|”ï—p•‰’SŽÒ”Ô† = SPACE )
008890** ¶•Û’P“Æ‚Í‘ÎÛŠO (¶•Ûe‚ ‚è‚Æ•¬‚»‚Ì‘¼‚ÍAe‚Ì‚Ý•¬‚È‚µ‚Åo—Í)
008900*/60‚»‚Ì‘¼‚ð•¬ƒŒƒR[ƒh‚Ì‘ÎÛ‚É•ÏX/101109
008910*                         IF  Žó|•¬Ží•Ê   = ZERO  OR 50 OR 60
008920                         IF  Žó|•¬Ží•Ê   = ZERO  OR 50
008930                             PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û
008940                         ELSE
008950                             PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û•¬
008960                         END-IF
008970* ¿‹‚ª‚ ‚éŽžo—Í
008980                         IF ( ì‚P|¿‹‹àŠz     = ZERO ) AND
008990                            ( ì‚P|·ˆø¿‹‹àŠz = ZERO )
009000                             CONTINUE
009010                         ELSE
009020                             PERFORM ì‚Pƒtƒ@ƒCƒ‹‘ž
009030                         END-IF
009040                     END-IF
009050                 END-IF
009060*            ********
009070*            * ˜Vl *
009080*            ********
009090                 IF ( Žó|Œö”ïŽí•Ê       NOT = ZERO ) AND
009100                    ( Žó|”ï—p•‰’SŽÒ”Ô† NOT = SPACE )
009110*                    **********************
009120*                    * ì‹Æƒtƒ@ƒCƒ‹ì¬ *
009130*                    **********************
009140**
009150                         IF Žó|Ž{p˜a—ï”NŒŽ < 42004
009160                             PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒg˜Vl
009170                         ELSE
009180*/60‚»‚Ì‘¼‚ð•¬ƒŒƒR[ƒh‚Ì‘ÎÛ‚É•ÏX/101109
009190*                             IF  Žó|•¬Ží•Ê   = ZERO  OR 50 OR 60
009200                             IF  Žó|•¬Ží•Ê   = ZERO  OR 50
009210                                 PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚
009220                             ELSE
009230                                 PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚•¬
009240                             END-IF
009250                         END-IF
009260* ¿‹‚ª‚ ‚éŽžo—Í
009270                         IF ( ì‚P|¿‹‹àŠz     = ZERO ) AND
009280                            ( ì‚P|·ˆø¿‹‹àŠz = ZERO )
009290                             CONTINUE
009300                         ELSE
009310                             PERFORM ì‚Pƒtƒ@ƒCƒ‹‘ž
009320                         END-IF
009330                 END-IF
009340             END-IF
009350             PERFORM ƒŒƒZƒvƒg‚e“Çž
009360         END-PERFORM
009370     END-IF.
009380*
009390*================================================================*
009400 ƒf[ƒ^ƒ`ƒFƒbƒN SECTION.
009410*
009420     MOVE SPACE          TO ŽÀsƒL[‚v.
009430* *****************************************************************
009440* * ƒŒƒZƒvƒg‚e‚Ì¿‹‘ÎÛ‹æ•ª = 0 ‚Ìê‡ƒf[ƒ^ì¬‘ÎÛ‚Æ‚µ‚È‚¢ *
009450* *****************************************************************
009460
009470     IF ( ƒŒƒZ|¿‹‘ÎÛ‹æ•ª NOT = ZERO ) AND
009480        ( ƒŒƒZ|žŠÒ•¥‚¢‹æ•ª NOT = 2 OR 3 )
009490*        IF(ƒŒƒZ|ƒŒƒZŽí•Ê = 3) AND ( ƒŒƒZ|‰ï‘Š‡•\ˆóü‘ÎÛ‹æ•ª = 1 )
009500        IF(ƒŒƒZ|ƒŒƒZŽí•Ê = 3)
009510           CONTINUE
009520        ELSE
009530           MOVE ƒŒƒZ|Ž{p˜a—ï  TO Žó|Ž{p˜a—ï
009540           MOVE ƒŒƒZ|Ž{p”N    TO Žó|Ž{p”N
009550           MOVE ƒŒƒZ|Ž{pŒŽ    TO Žó|Ž{pŒŽ
009560           MOVE ƒŒƒZ|Š³ŽÒ”Ô†  TO Žó|Š³ŽÒ”Ô†
009570           MOVE ƒŒƒZ|Ž}”Ô      TO Žó|Ž}”Ô
009580           READ ŽófŽÒî•ñ‚e
009590           NOT INVALID KEY
009600**      Œ’•Û‚Ì‚Ý
009610              IF Žó|•ÛŒ¯•ª—Þ = 1
009620                 MOVE "YES"  TO ŽÀsƒL[‚v
009630                 MOVE Žó|Ž{p˜a—ï       TO •‰|Ž{p˜a—ï
009640                 MOVE Žó|Ž{p”N         TO •‰|Ž{p”N
009650                 MOVE Žó|Ž{pŒŽ         TO •‰|Ž{pŒŽ
009660                 MOVE Žó|Š³ŽÒƒR[ƒh     TO •‰|Š³ŽÒƒR[ƒh
009670                 READ •‰ƒf[ƒ^‚e
009680                 END-READ
009690              END-IF
009700           END-READ
009710        END-IF
009720     END-IF.
009730*
009740*================================================================*
009750 ƒŒƒZƒvƒg‚e“Çž SECTION.
009760*
009770     READ ƒŒƒZƒvƒg‚e NEXT
009780     AT END
009790         MOVE "YES" TO I—¹ƒtƒ‰ƒO
009800     END-READ.
009810*
009820*================================================================*
009830 ŽófŽÒî•ñ‚e“Çž SECTION.
009840*
009850     READ ŽófŽÒî•ñ‚e NEXT
009860     AT END
009870         MOVE "YES" TO I—¹ƒtƒ‰ƒO
009880     END-READ.
009890*
009900*================================================================*
009910 Ž{p‹L˜^‚e“Çž SECTION.
009920*
009930     READ Ž{p‹L˜^‚e NEXT
009940     AT END
009950         MOVE "YES"  TO I—¹ƒtƒ‰ƒO‚Q
009960     END-READ.
009970*================================================================*
009980*================================================================*
009990 ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û SECTION.
010000*
010010**********/  Œ’•Û•¬‚È‚µ‚ÌŽž  /**********
010020*
010030     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
010040     INITIALIZE ì‚P|ƒŒƒR[ƒh.
010050*
010060     MOVE Žó|•ÛŒ¯Ží•Ê       TO ì‚P|•ÛŒ¯Ží•Ê.
010070     MOVE ZERO               TO ì‚P|•¬Ží•Ê.
010080*
010090     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
010100     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
010110     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
010120     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
010130     MOVE ZERO               TO ì‚P|˜Vl•¬‹àŠz.
010140*
010150*    •‰’S—¦‚ÌÝ’è
010160     PERFORM •‰’SŠ„‡Žæ“¾.
010170     COMPUTE ì‚P|•‰’S—¦  = ˜A—¦|ŽÀÛ–{‘Ì•‰’S—¦ / 10.
010180*
010190* ˜AŒv “]‹L‚ÌŒã
010200     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
010210*
010220*================================================================*
010230 ì‚PƒŒƒR[ƒhƒZƒbƒg˜Vl SECTION.
010240*
010250**********/ 27˜Vl‚ÌŽž  /**********
010260*
010270     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
010280     INITIALIZE ì‚P|ƒŒƒR[ƒh.
010290*
010300     MOVE Žó|Œö”ïŽí•Ê       TO ì‚P|•ÛŒ¯Ží•Ê.
010310     MOVE Žó|•¬Ží•Ê       TO ì‚P|•¬Ží•Ê.
010320*
010330     MOVE Žó|”ï—p•‰’SŽÒ”Ô† TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
010340     MOVE Žó|Žó‰vŽÒ”Ô†˜Vl TO ì‚P|Žó‰vŽÒ”Ô†.
010350*
010360     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
010370*
010380     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
010390     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
010400     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
010410     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
010420     MOVE ZERO               TO ì‚P|˜Vl•¬‹àŠz.
010430*
010440     MOVE ZERO               TO ì‚P|•‰’S—¦.
010450*
010460* ˜AŒv “]‹L‚ÌŒã
010470     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
010480*
010490** 15/01 27•¬‘Î‰žiã‹L“]‹LŒãA’uŠ·‚¦j
010500     IF Žó|•¬Ží•Ê = 53 OR 54
010510         MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|•ÛŒ¯ŽÒ”Ô†
010520         EVALUATE Žó|•¬Ží•Ê
010530* gá
010540         WHEN 53
010550             MOVE 14   TO ì‚P|˜Vl•¬
010560* ”í”š
010570         WHEN 54
010580             MOVE 15   TO ì‚P|˜Vl•¬
010590         END-EVALUATE
010600* •¬‹àŠz
010610         MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz
010620         MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz
010630         COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz
010640*
010650     END-IF.
010660**
010670*================================================================*
010680 ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚ SECTION.
010690*
010700**********/  Œã‚•¬‚È‚µ‚ÌŽž  /**********
010710*
010720     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
010730     INITIALIZE ì‚P|ƒŒƒR[ƒh.
010740*
010750     MOVE Žó|•ÛŒ¯Ží•Ê       TO ì‚P|•ÛŒ¯Ží•Ê.
010760     MOVE ZERO               TO ì‚P|•¬Ží•Ê.
010770*
010780     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
010790     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
010800     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
010810     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
010820     MOVE ZERO               TO ì‚P|˜Vl•¬‹àŠz.
010830*
010840*    ‹Œ_‚Æ“¯‚¶Žd—l‚É‚·‚é‚½‚ßA‚ ‚¦‚Äƒ[ƒ‚ðƒZƒbƒgB–{“–‚Í‚PŠ„‚RŠ„‚È‚Ç‚©‚Ý‚·‚×‚«
010850     MOVE ZERO               TO  ì‚P|•‰’S—¦.
010860*
010870* ˜AŒv “]‹L‚ÌŒã
010880     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
010890*
010900*================================================================*
010910 ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û•¬ SECTION.
010920*
010930**********/  Œ’•Û•¬‚ ‚è‚ÌŽž  /**********
010940*
010950     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
010960     INITIALIZE ì‚P|ƒŒƒR[ƒh.
010970*
010980     MOVE Žó|•ÛŒ¯Ží•Ê       TO ì‚P|•ÛŒ¯Ží•Ê.
010990     MOVE Žó|•¬Ží•Ê       TO ì‚P|•¬Ží•Ê.
011000*
011010* -- 99XXXXXX ‚Å‚à“]‹L‚·‚é ---
011020     MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
011030*
011040     IF ( Žó|Žó‰vŽÒ”Ô†•¬(1:1) = "*"  ) OR
011050        ( Žó|Žó‰vŽÒ”Ô†•¬(1:2) = "–" )
011060        MOVE SPACE                TO ì‚P|Žó‰vŽÒ”Ô†
011070     ELSE
011080        MOVE Žó|Žó‰vŽÒ”Ô†•¬   TO ì‚P|Žó‰vŽÒ”Ô†
011090     END-IF.
011100*
011110**     MOVE Žó|•¬•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
011120     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
011130*
011140*
011150     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
011160     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
011170     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
011180     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
011190*
011200*    •‰’S—¦‚ÌÝ’è
011210     PERFORM •‰’SŠ„‡Žæ“¾.
011220     COMPUTE ì‚P|•‰’S—¦  = ˜A—¦|ŽÀÛ–{‘Ì•‰’S—¦ / 10.
011230*
011240* •¬‹àŠz
011250     MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz.
011260     MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz.
011270     COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz.
011280*
011290* ˜AŒv “]‹L‚ÌŒã
011300     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
011310*
011320*================================================================*
011330 ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚•¬ SECTION.
011340*
011350**********/  Œã‚•¬‚ ‚è‚ÌŽž  /**********
011360*
011370     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
011380     INITIALIZE ì‚P|ƒŒƒR[ƒh.
011390*
011400     MOVE Žó|•ÛŒ¯Ží•Ê       TO ì‚P|•ÛŒ¯Ží•Ê.
011410     MOVE Žó|•¬Ží•Ê       TO ì‚P|•¬Ží•Ê.
011420*
011430* -- 99XXXXXX ‚Å‚à“]‹L‚·‚é ---
011440     MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
011450*
011460     IF ( Žó|Žó‰vŽÒ”Ô†•¬(1:1) = "*"  ) OR
011470        ( Žó|Žó‰vŽÒ”Ô†•¬(1:2) = "–" )
011480        MOVE SPACE                TO ì‚P|Žó‰vŽÒ”Ô†
011490     ELSE
011500        MOVE Žó|Žó‰vŽÒ”Ô†•¬   TO ì‚P|Žó‰vŽÒ”Ô†
011510     END-IF.
011520*
011530**     MOVE Žó|•¬•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
011540*     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
011550*
011560*
011570     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
011580     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
011590     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
011600     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
011610*
011620*    ‹Œ_‚Æ“¯‚¶Žd—l‚É‚·‚é‚½‚ßA‚ ‚¦‚Äƒ[ƒ‚ðƒZƒbƒgB–{“–‚Í‚PŠ„‚RŠ„‚È‚Ç‚©‚Ý‚·‚×‚«
011630     MOVE ZERO               TO ì‚P|•‰’S—¦.
011640*
011650* •¬‹àŠz
011660     MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz.
011670     MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz.
011680     COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz.
011690*
011700* ˜AŒv “]‹L‚ÌŒã
011710     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
011720*================================================================*
011730 ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg SECTION.
011740*
011750     MOVE ƒŒƒZ|¿‹˜a—ï     TO ì‚P|¿‹˜a—ï.
011760     MOVE ƒŒƒZ|¿‹”N       TO ì‚P|¿‹”N.
011770     MOVE ƒŒƒZ|¿‹ŒŽ       TO ì‚P|¿‹ŒŽ.
011780     MOVE Žó|Ž{p˜a—ï       TO ì‚P|Ž{p˜a—ï Ž{p˜a—ï‚v‚q.
011790     MOVE Žó|Ž{p”N         TO ì‚P|Ž{p”N Ž{p”N‚v‚q.
011800     MOVE Žó|Ž{pŒŽ         TO ì‚P|Ž{pŒŽ Ž{pŒŽ‚v‚q.
011810     MOVE Žó|Š³ŽÒƒR[ƒh     TO ì‚P|Š³ŽÒƒR[ƒh Š³ŽÒƒR[ƒh‚v‚q.
011820****     MOVE ‰ïˆõ”Ô†”Žš‚v     TO ì‚P|‰ïˆõ”Ô†.
011830     MOVE ‰ïˆõ”Ô†‚v         TO ì‚P|‰ïˆõ”Ô†.
011840*
011850     PERFORM •ÛŒ¯‹æ•ªŽæ“¾.
011860*
011870     MOVE Žó|•ÛŒ¯ŽÒ”Ô†     TO ì‚P|•ÛŒ¯ŽÒ”Ô†.
011880     MOVE Žó|Š³ŽÒŽ–¼       TO ì‚P|Š³ŽÒŽ–¼.
011890     MOVE Žó|Š³ŽÒƒJƒi       TO ì‚P|Š³ŽÒƒJƒi.
011900     MOVE Žó|Š³ŽÒ«•Ê       TO ì‚P|Š³ŽÒ«•Ê.
011910     MOVE Žó|Š³ŽÒ¶”NŒŽ“ú   TO ì‚P|Š³ŽÒ¶”NŒŽ“ú.
011920** ˜a—ï –¾Ž¡‚Æº˜a‚ð‹t‚É‚·‚éB
011930     EVALUATE ì‚P|Š³ŽÒ˜a—ï
011940     WHEN 1
011950        MOVE  3  TO ì‚P|Š³ŽÒ˜a—ï
011960     WHEN 3
011970        MOVE  1  TO ì‚P|Š³ŽÒ˜a—ï
011980     END-EVALUATE.
011990**
012000     MOVE Žó|Ž‘ŠiŽæ“¾”NŒŽ“ú TO ì‚P|Ž‘ŠiŽæ“¾”NŒŽ“ú.
012010     MOVE Žó|—LŒø”NŒŽ“ú     TO ì‚P|—LŒø”NŒŽ“ú.
012020     MOVE Žó|–{l‰Æ‘°‹æ•ª   TO ì‚P|–{l‰Æ‘°‹æ•ª.
012030     IF Žó|–{l‰Æ‘°‹æ•ª = 1
012040         MOVE NC"–{l"    TO ‘±•¿‚v
012050     ELSE
012060         MOVE 05          TO –¼|‹æ•ªƒR[ƒh
012070         MOVE Žó|‘±•¿    TO –¼|–¼ÌƒR[ƒh
012080         READ –¼Ìƒ}ƒXƒ^
012090         INVALID KEY
012100             MOVE SPACE     TO ‘±•¿‚v
012110         NOT INVALID KEY
012120             MOVE –¼|—ªÌ  TO ‘±•¿‚v
012130         END-READ
012140     END-IF.
012150     MOVE ‘±•¿‚v             TO ì‚P|‘±•¿.
012160*
012170     MOVE Žó|”í•ÛŒ¯ŽÒŽ–¼   TO ì‚P|”í•ÛŒ¯ŽÒŽ–¼.
012180     MOVE Žó|”í•ÛŒ¯ŽÒƒJƒi   TO ì‚P|”í•ÛŒ¯ŽÒƒJƒi.
012190     MOVE Žó|”í•ÛŒ¯ŽÒ«•Ê   TO ì‚P|”í•ÛŒ¯ŽÒ«•Ê.
012200     MOVE Žó|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú   TO ì‚P|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú.
012210** ˜a—ï –¾Ž¡‚Æº˜a‚ð‹t‚É‚·‚éB
012220     EVALUATE ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
012230     WHEN 1
012240        MOVE  3  TO ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
012250     WHEN 3
012260        MOVE  1  TO ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
012270     END-EVALUATE.
012280**
012290*-----------------------------------------------------------------*
012300     MOVE SPACE TO ˜AˆÃ†•¡‡|ˆÃ†î•ñ.
012310*
012320*    / ˜AˆÃ†•¡‡|“ü—Íî•ñƒZƒbƒg /
012330     MOVE Žó|‹L†       TO ˜AˆÃ†•¡‡|‹L†.
012340     MOVE Žó|”Ô†       TO ˜AˆÃ†•¡‡|”Ô†.
012350     MOVE Žó|ˆÃ†‰»€–Ú TO ˜AˆÃ†•¡‡|ˆÃ†‰»€–Ú.
012360*
012370     CALL   •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v.
012380     CANCEL •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v.
012390*
012400*-----------------------------------------------------------------*
012410*
012420     IF ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†(1:1) = "*"  ) OR
012430        ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†(1:2) = "–" )
012440        MOVE SPACE           TO ì‚P|”Ô†
012450     ELSE
012460        MOVE ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†        TO ì‚P|”Ô†
012470     END-IF.
012480*
012490     IF ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†(1:1) = "*"  ) OR
012500        ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†(1:2) = "–" )
012510        MOVE SPACE               TO ‹L†‚o‚m‚v
012520        INSPECT ‹L†‚o‚m‚v  REPLACING ALL ”¼Šp‹ó”’ BY ‘SŠp‹ó”’
012530        MOVE ‹L†‚o‚v            TO ì‚P|‹L†
012540     ELSE
012550        PERFORM ‹L†¶‹l‚ß
012560        MOVE ‹L†‚v              TO ì‚P|‹L†
012570     END-IF.
012580*
012590*
012600*****     PERFORM ƒŒƒZƒvƒgŒÄo‚µ.
012610     PERFORM •‰ƒf[ƒ^Žæ“¾.
012620     PERFORM —¿‹àî•ñŽæ“¾.
012630     MOVE ‰ŒŸ—¿‚v‚q             TO  ì‚P|‰fŠî–{—¿.
012640*
012650     MOVE ‰ŒŸ‰ÁŽZ—¿‚v‚q         TO  ì‚P|‰f‰ÁŽZ—¿.
012660     MOVE ‰—Ã‰ñ”‚v‚q           TO  ì‚P|‰ñ”.
012670     MOVE ‰—Ã—¿‚v‚q             TO  ì‚P|‰—Ã—¿‹àŠz.
012680*
012690     IF ( ƒŒƒZ|–éŠÔ     = 1 ) OR
012700        ( ƒŒƒZ|–\•—‰Já = 1 ) OR
012710        ( ƒŒƒZ|“ï˜H     = 1 )
012720         MOVE 1  TO  ì‚P|‰ÁŽZ
012730     END-IF.
012740*
012750     MOVE ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q     TO ì‚P|‹àŠz.
012760*
012770     MOVE ‘å‚v                   TO ì‚P|‘å.
012780     MOVE ’†‚v                   TO ì‚P|’†.
012790     MOVE ¬‚v                   TO ì‚P|¬.
012800*
012810     MOVE Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q     TO ì‚P|î•ñ’ñ‹Ÿ—¿.
012820*
012830     MOVE •‰Ží•Ê‚v(1)          TO ì‚P|Ží•Ê(1).
012840     MOVE •”ˆÊ‚v(1)              TO ì‚P|•”ˆÊƒR[ƒh(1).
012850     MOVE Œã—Ã‰ñ”‚P‚v‚q         TO ì‚P|Œã—Ã‰ñ”(1).
012860     MOVE Œã—Ã—¿‚P‚v‚q           TO ì‚P|Œã—Ã‹àŠz(1).
012870     MOVE —âãª–@‰ñ”‚P‚v‚q       TO ì‚P|—âãª‰ñ”(1).
012880     MOVE —âãª–@—¿‚P‚v‚q         TO ì‚P|—âãª‹àŠz(1).
012890     MOVE ‰‰ñˆ’u—¿‚v‚q(1)      TO ì‚P|Ž{p—¿(1).
012900     MOVE ‰·ãª–@‰ñ”‚P‚v‚q       TO ì‚P|ãª–@‰ñ”(1).
012910     MOVE ‰·ãª–@—¿‚P‚v‚q         TO ì‚P|ãª–@‹àŠz(1).
012920     MOVE “d—Ã‰ñ”‚P‚v‚q         TO ì‚P|“d—Ã‰ñ”(1).
012930     MOVE “d—Ã—¿‚P‚v‚q           TO ì‚P|“d—Ã‹àŠz(1).
012940     MOVE “]‹A‹æ•ª‚v(1)          TO ì‚P|“]‹A‹æ•ª(1).
012950     MOVE •‰Ží•Ê‚v(2)          TO ì‚P|Ží•Ê(2).
012960     MOVE •”ˆÊ‚v(2)              TO ì‚P|•”ˆÊƒR[ƒh(2).
012970     MOVE Œã—Ã‰ñ”‚Q‚v‚q         TO ì‚P|Œã—Ã‰ñ”(2).
012980     MOVE Œã—Ã—¿‚Q‚v‚q           TO ì‚P|Œã—Ã‹àŠz(2).
012990     MOVE —âãª–@‰ñ”‚Q‚v‚q       TO ì‚P|—âãª‰ñ”(2).
013000     MOVE —âãª–@—¿‚Q‚v‚q         TO ì‚P|—âãª‹àŠz(2).
013010     MOVE ‰‰ñˆ’u—¿‚v‚q(2)      TO ì‚P|Ž{p—¿(2).
013020     MOVE ‰·ãª–@‰ñ”‚Q‚v‚q       TO ì‚P|ãª–@‰ñ”(2).
013030     MOVE ‰·ãª–@—¿‚Q‚v‚q         TO ì‚P|ãª–@‹àŠz(2).
013040     MOVE “d—Ã‰ñ”‚Q‚v‚q         TO ì‚P|“d—Ã‰ñ”(2).
013050     MOVE “d—Ã—¿‚Q‚v‚q           TO ì‚P|“d—Ã‹àŠz(2).
013060     MOVE “]‹A‹æ•ª‚v(2)          TO ì‚P|“]‹A‹æ•ª(2).
013070     MOVE •‰Ží•Ê‚v(3)          TO ì‚P|Ží•Ê(3).
013080     MOVE •”ˆÊ‚v(3)              TO ì‚P|•”ˆÊƒR[ƒh(3).
013090     MOVE Œã—Ã‰ñ”‚R‚v‚q         TO ì‚P|Œã—Ã‰ñ”(3).
013100     MOVE Œã—Ã—¿‚R‚v‚q           TO ì‚P|Œã—Ã‹àŠz(3).
013110     MOVE —âãª–@‰ñ”‚R‚v‚q       TO ì‚P|—âãª‰ñ”(3).
013120     MOVE —âãª–@—¿‚R‚v‚q         TO ì‚P|—âãª‹àŠz(3).
013130     MOVE ‰‰ñˆ’u—¿‚v‚q(3)      TO ì‚P|Ž{p—¿(3).
013140     MOVE ‰·ãª–@‰ñ”‚R‚v‚q       TO ì‚P|ãª–@‰ñ”(3).
013150     MOVE ‰·ãª–@—¿‚R‚v‚q         TO ì‚P|ãª–@‹àŠz(3).
013160     MOVE “d—Ã‰ñ”‚R‚v‚q         TO ì‚P|“d—Ã‰ñ”(3).
013170     MOVE “d—Ã—¿‚R‚v‚q           TO ì‚P|“d—Ã‹àŠz(3).
013180     MOVE “]‹A‹æ•ª‚v(3)          TO ì‚P|“]‹A‹æ•ª(3).
013190     MOVE •‰Ží•Ê‚v(4)          TO ì‚P|Ží•Ê(4).
013200     MOVE •”ˆÊ‚v(4)              TO ì‚P|•”ˆÊƒR[ƒh(4).
013210     MOVE Œã—Ã‰ñ”‚S‚v‚q         TO ì‚P|Œã—Ã‰ñ”(4).
013220     MOVE Œã—Ã—¿‚S‚v‚q           TO ì‚P|Œã—Ã‹àŠz(4).
013230     MOVE —âãª–@‰ñ”‚S‚v‚q       TO ì‚P|—âãª‰ñ”(4).
013240     MOVE —âãª–@—¿‚S‚v‚q         TO ì‚P|—âãª‹àŠz(4).
013250     MOVE ‰‰ñˆ’u—¿‚v‚q(4)      TO ì‚P|Ž{p—¿(4).
013260     MOVE ‰·ãª–@‰ñ”‚S‚v‚q       TO ì‚P|ãª–@‰ñ”(4).
013270     MOVE ‰·ãª–@—¿‚S‚v‚q         TO ì‚P|ãª–@‹àŠz(4).
013280     MOVE “d—Ã‰ñ”‚S‚v‚q         TO ì‚P|“d—Ã‰ñ”(4).
013290     MOVE “d—Ã—¿‚S‚v‚q           TO ì‚P|“d—Ã‹àŠz(4).
013300     MOVE “]‹A‹æ•ª‚v(4)          TO ì‚P|“]‹A‹æ•ª(4).
013310     MOVE •‰Ží•Ê‚v(5)          TO ì‚P|Ží•Ê(5).
013320     MOVE •”ˆÊ‚v(5)              TO ì‚P|•”ˆÊƒR[ƒh(5).
013330     MOVE Œã—Ã‰ñ”‚T‚v‚q         TO ì‚P|Œã—Ã‰ñ”(5).
013340     MOVE Œã—Ã—¿‚T‚v‚q           TO ì‚P|Œã—Ã‹àŠz(5).
013350     MOVE —âãª–@‰ñ”‚T‚v‚q       TO ì‚P|—âãª‰ñ”(5).
013360     MOVE —âãª–@—¿‚T‚v‚q         TO ì‚P|—âãª‹àŠz(5).
013370     MOVE ‰‰ñˆ’u—¿‚v‚q(5)      TO ì‚P|Ž{p—¿(5).
013380     MOVE ‰·ãª–@‰ñ”‚T‚v‚q       TO ì‚P|ãª–@‰ñ”(5).
013390     MOVE ‰·ãª–@—¿‚T‚v‚q         TO ì‚P|ãª–@‹àŠz(5).
013400     MOVE “d—Ã‰ñ”‚T‚v‚q         TO ì‚P|“d—Ã‰ñ”(5).
013410     MOVE “d—Ã—¿‚T‚v‚q           TO ì‚P|“d—Ã‹àŠz(5).
013420     MOVE “]‹A‹æ•ª‚v(5)          TO ì‚P|“]‹A‹æ•ª(5).
013430*
013440* 1‚Â‚Å‚àŒp‘±‚ª‚ ‚ê‚Î 9 ‚ð“]‹L
013450     IF Œp‘±ƒtƒ‰ƒO = "YES"
013460         MOVE  9                 TO ì‚P|“]‹A‹æ•ª‘‡
013470     END-IF.
013480*
013490*
013500*================================================================*
013510*================================================================*
013520 •‰’SŠ„‡Žæ“¾ SECTION.
013530*/•‰’SŠ„‡
013540     INITIALIZE ˜A—¦|•‰’S—¦Žæ“¾ƒL[.
013550     MOVE Žó|Ž{p˜a—ï”NŒŽ TO ˜A—¦|Ž{p˜a—ï”NŒŽ.
013560     MOVE Žó|Š³ŽÒƒR[ƒh   TO ˜A—¦|Š³ŽÒƒR[ƒh.
013570     MOVE "HUTANRIT" TO ƒvƒƒOƒ‰ƒ€–¼‚v.
013580     CALL ƒvƒƒOƒ‰ƒ€–¼‚v.
013590     CANCEL ƒvƒƒOƒ‰ƒ€–¼‚v.
013600*
013610*================================================================*
013620*================================================================*
013630 ì‚Pƒtƒ@ƒCƒ‹‘ž SECTION.
013640*
013650     WRITE ì‚P|ƒŒƒR[ƒh
013660     INVALID KEY
013670         MOVE NC"ì‚P"  TO ƒtƒ@ƒCƒ‹–¼
013680         PERFORM ƒGƒ‰[•\Ž¦
013690     END-WRITE.
013700*================================================================*
013710*================================================================*
013720 ‰ïˆõ”Ô†‰E‹l‚ß SECTION.
013730*
013740     MOVE ‰ïˆõ”Ô†‚v      TO  ‰ïˆõ”Ô†¶‹l‚ß‚v.
013750     MOVE ZERO            TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v.
013760     MOVE ZERO            TO  ‰ïˆõ”Ô†”Žš‚v.
013770*
013780     MOVE  8  TO  ƒJƒEƒ“ƒ^.
013790*
013800     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(7) NOT = SPACE
013810         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
013820         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(7)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
013830     END-IF.
013840     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(6) NOT = SPACE
013850         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
013860         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(6)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
013870     END-IF.
013880     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(5) NOT = SPACE
013890         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
013900         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(5)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
013910     END-IF.
013920     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(4) NOT = SPACE
013930         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
013940         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(4)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
013950     END-IF.
013960     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(3) NOT = SPACE
013970         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
013980         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(3)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
013990     END-IF.
014000     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(2) NOT = SPACE
014010         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
014020         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(2)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
014030     END-IF.
014040     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(1) NOT = SPACE
014050         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
014060         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(1)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
014070     END-IF.
014080*
014090     MOVE ‰ïˆõ”Ô†‰E‹l‚ß‚v TO ‰ïˆõ”Ô†”Žš‚v.
014100*
014110*================================================================*
014120 ‹L†¶‹l‚ß SECTION.
014130*
014140***** ‹L†‚Ì–³‘Ê‚ÈSPACE‚ðŽæ‚èœ‚¢‚ÄA¶‹l‚ß‚É‚·‚éB
014150     MOVE SPACE           TO  ‹L†‚m‚v.
014160     MOVE SPACE           TO  ‹L†Œ³‚v.
014170     MOVE SPACE           TO  ‹L†¶‹l‚ß‚v.
014180     MOVE ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L† TO  ‹L†Œ³‚v.
014190*
014200     MOVE  ZERO  TO  ƒJƒEƒ“ƒ^‚Q.
014210     PERFORM VARYING ƒJƒEƒ“ƒ^ FROM 1 BY 1 UNTIL ƒJƒEƒ“ƒ^ > 12
014220          IF  ‹L†Œ³‚v‚P(ƒJƒEƒ“ƒ^) NOT = SPACE
014230              COMPUTE ƒJƒEƒ“ƒ^‚Q = ƒJƒEƒ“ƒ^‚Q  +  1
014240              MOVE ‹L†Œ³‚v‚P(ƒJƒEƒ“ƒ^)  TO  ‹L†¶‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^‚Q)
014250          END-IF
014260     END-PERFORM.
014270*
014280     MOVE ‹L†¶‹l‚ß‚v    TO ‹L†‚m‚v.
014290*
014300*”¼ŠpƒXƒy[ƒX‚ð‘SŠp‚É‚©‚¦‚é
014310     INSPECT ‹L†‚v REPLACING ALL ”¼Šp‹ó”’ BY ‘SŠp‹ó”’.
014320*
014330*================================================================*
014340*================================================================*
014350 •ÛŒ¯‹æ•ªŽæ“¾ SECTION.
014360*
014370*
014380     IF ( Žó|•¬Ží•Ê NOT = ZERO ) OR
014390        (( Žó|Œö”ïŽí•Ê = 05 ) AND ( Žó|Ž{p˜a—ï”NŒŽ < 42004 ))
014400**-- •¬E˜Vl --
014410         IF ( Žó|Œö”ïŽí•Ê = 05 ) AND ( Žó|Ž{p˜a—ï”NŒŽ < 42004 )
014420             MOVE 05     TO ì‚P|•ÛŒ¯‹æ•ª
014430         ELSE
014440             EVALUATE Žó|•¬Ží•Ê
014450* ¶•Û
014460             WHEN 50
014470                 MOVE 10     TO ì‚P|•ÛŒ¯‹æ•ª
014480* ‚S‚P˜Vl
014490             WHEN 51
014500                 MOVE 05     TO ì‚P|•ÛŒ¯‹æ•ª
014510* ‚Ð‚Æ‚èe
014520             WHEN 52
014530                 MOVE 13     TO ì‚P|•ÛŒ¯‹æ•ª
014540* gá
014550             WHEN 53
014560                 MOVE 14     TO ì‚P|•ÛŒ¯‹æ•ª
014570* ”í”š
014580             WHEN 54
014590                 MOVE 15     TO ì‚P|•ÛŒ¯‹æ•ª
014600* “û—cŽ™
014610             WHEN 55
014620                 MOVE 16     TO ì‚P|•ÛŒ¯‹æ•ª
014630             WHEN 60
014640*•l¼ŽsŒÎ¼Žs‚Ì¬’†Šw¶‚Í“û—cŽ™ˆµ‚¢‚É‚·‚é/100927
014650                 IF Žó|”ï—p•‰’SŽÒ”Ô†•¬(1:4) = "8322"
014660                     MOVE 16     TO ì‚P|•ÛŒ¯‹æ•ª
014670                 END-IF
014680             END-EVALUATE
014690         END-IF
014700         EVALUATE Žó|•ÛŒ¯Ží•Ê
014710* ‘•Û
014720         WHEN 01
014730* ŽÐ•Û
014740         WHEN 02
014750* ‘g‡
014760         WHEN 03
014770* ‹¤Ï
014780         WHEN 04
014790* “úŒÙ
014800         WHEN 06
014810* ‘Dˆõ
014820         WHEN 07
014830* ‘ÞE
014840         WHEN 08
014850             MOVE Žó|•ÛŒ¯Ží•Ê TO ì‚P|˜Vl•¬
014860* Ž©‰qŠ¯
014870         WHEN 09
014880             MOVE 4 TO ì‚P|˜Vl•¬
014890* ŒãŠú‚—î
014900         WHEN 05
014910             IF Žó|Ž{p˜a—ï”NŒŽ >= 42004
014920                 MOVE 30 TO ì‚P|˜Vl•¬
014930             END-IF
014940*
014950         WHEN OTHER
014960             MOVE SPACE                TO ƒGƒ‰[ƒƒbƒZ[ƒW‚v
014970             MOVE Žó|Š³ŽÒƒR[ƒh       TO ƒGƒ‰[Š³ŽÒƒR[ƒh‚v
014980             MOVE Žó|•ÛŒ¯Ží•Ê         TO ƒGƒ‰[•ÛŒ¯Ží•Ê‚v
014990             MOVE "-"                  TO ƒGƒ‰[‹æØ‚è‚v
015000             MOVE  NC"•ÛŒ¯Ží•Ê‚ªˆÙí‚Å‚·BŠ³ŽÒ|•ÛŒ¯Ží•Ê" TO ˜Aƒ‚R|ƒƒbƒZ[ƒW
015010             MOVE  ƒGƒ‰[ƒƒbƒZ[ƒW‚v  TO ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P
015020             CALL   "MSG003"
015030             CANCEL "MSG003"
015040         END-EVALUATE
015050     ELSE
015060**-- Œ’•Û --
015070         EVALUATE Žó|•ÛŒ¯Ží•Ê
015080* ‘•Û
015090         WHEN 01
015100* ŽÐ•Û
015110         WHEN 02
015120* ‘g‡
015130         WHEN 03
015140* ‹¤Ï
015150         WHEN 04
015160* “úŒÙ
015170         WHEN 06
015180* ‘Dˆõ
015190         WHEN 07
015200* ‘ÞE
015210         WHEN 08
015220             MOVE Žó|•ÛŒ¯Ží•Ê TO ì‚P|•ÛŒ¯‹æ•ª
015230* Ž©‰qŠ¯
015240         WHEN 09
015250             MOVE 4 TO ì‚P|•ÛŒ¯‹æ•ª
015260* ˜JÐ
015270         WHEN 70
015280             MOVE 9 TO ì‚P|•ÛŒ¯‹æ•ª
015290* Ž©”…Ó
015300         WHEN 80
015310             MOVE 12 TO ì‚P|•ÛŒ¯‹æ•ª
015320* ŒãŠú‚—î
015330         WHEN 05
015340             IF Žó|Ž{p˜a—ï”NŒŽ >= 42004
015350                 MOVE 30 TO ì‚P|•ÛŒ¯‹æ•ª
015360             END-IF
015370*
015380         WHEN OTHER
015390             MOVE SPACE                TO ƒGƒ‰[ƒƒbƒZ[ƒW‚v
015400             MOVE Žó|Š³ŽÒƒR[ƒh       TO ƒGƒ‰[Š³ŽÒƒR[ƒh‚v
015410             MOVE Žó|•ÛŒ¯Ží•Ê         TO ƒGƒ‰[•ÛŒ¯Ží•Ê‚v
015420             MOVE "-"                  TO ƒGƒ‰[‹æØ‚è‚v
015430             MOVE  NC"•ÛŒ¯Ží•Ê‚ªˆÙí‚Å‚·BŠ³ŽÒ|•ÛŒ¯Ží•Ê" TO ˜Aƒ‚R|ƒƒbƒZ[ƒW
015440             MOVE  ƒGƒ‰[ƒƒbƒZ[ƒW‚v  TO ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P
015450             CALL   "MSG003"
015460             CANCEL "MSG003"
015470         END-EVALUATE
015480     END-IF.
015490*
015500*================================================================*
015510*================================================================*
015520 —¿‹àî•ñŽæ“¾ SECTION.
015530*
015540***********************************************
015550* —¿‹àƒf[ƒ^ƒZƒbƒg                            *
015560***********************************************
015570*    ****************************************************************
015580*    * —¿‹àiŒŽ–ˆji•‰–ˆji’üŒ¸–ˆj‚É‚Â‚¢‚Ä‚Í˜AŒ‹€–Ú‚æ‚èƒZƒbƒg *
015590*    ****************************************************************
015600     INITIALIZE —¿‹à‚P‚v‚q.
015610     INITIALIZE —¿‹à‚Q‚v‚q.
015620     INITIALIZE —¿‹à‚R‚v‚q.
015630     MOVE ƒŒƒZ|‰ŒŸ—¿                 TO  ‰ŒŸ—¿‚v‚q.
015640*
015650     MOVE ƒŒƒZ|‰ŒŸ‰ÁŽZ—¿             TO  ‰ŒŸ‰ÁŽZ—¿‚v‚q.
015660     MOVE ƒŒƒZ|ÄŒŸ—¿                 TO  ÄŒŸ—¿‚v‚q.
015670     MOVE ƒŒƒZ|‰—Ã‰ñ”               TO  ‰—Ã‰ñ”‚v‚q.
015680     MOVE ƒŒƒZ|‰—Ã—¿                 TO  ‰—Ã—¿‚v‚q.
015690     MOVE ƒŒƒZ|‰—Ã‰ÁŽZ—¿             TO  ‰—Ã‰ÁŽZ—¿‚v‚q.
015700*
015710*
015720     MOVE ƒŒƒZ|‹à‘®•›Žq‰ÁŽZ—¿         TO  ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q.
015730*
015740     MOVE ƒŒƒZ|‘å                     TO ‘å‚v.
015750     MOVE ƒŒƒZ|’†                     TO ’†‚v.
015760     MOVE ƒŒƒZ|¬                     TO ¬‚v.
015770*
015780     MOVE ƒŒƒZ|Ž{pî•ñ’ñ‹Ÿ—¿         TO  Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q.
015790********************
015800* ‰‰ñˆ’u—¿ƒZƒbƒg *
015810********************
015820     PERFORM VARYING •”ˆÊ‚b‚m‚s FROM 1 BY 1
015830             UNTIL ( •”ˆÊ‚b‚m‚s > •”ˆÊ”‚v )
015840         MOVE ƒŒƒZ|‰‰ñˆ’u—¿(•”ˆÊ‚b‚m‚s) TO ‰‰ñˆ’u—¿‚v‚q(•”ˆÊ‚b‚m‚s)
015850     END-PERFORM.
015860********************
015870* ’üŒ¸–ˆ—¿‹àƒZƒbƒg *
015880********************
015890*    **********
015900*    * ‚P•”ˆÊ *
015910*    **********
015920     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚P             TO Œã—Ã‰ñ”‚P‚v‚q.
015930     MOVE ƒŒƒZ|Œã—Ã—¿‚P               TO Œã—Ã—¿‚P‚v‚q.
015940     MOVE ƒŒƒZ|—âãª–@‰ñ”‚P           TO —âãª–@‰ñ”‚P‚v‚q.
015950     MOVE ƒŒƒZ|—âãª–@—¿‚P             TO —âãª–@—¿‚P‚v‚q.
015960     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚P           TO ‰·ãª–@‰ñ”‚P‚v‚q.
015970     MOVE ƒŒƒZ|‰·ãª–@—¿‚P             TO ‰·ãª–@—¿‚P‚v‚q.
015980     MOVE ƒŒƒZ|“d—Ã‰ñ”‚P             TO “d—Ã‰ñ”‚P‚v‚q.
015990     MOVE ƒŒƒZ|“d—Ã—¿‚P               TO “d—Ã—¿‚P‚v‚q.
016000*    **********
016010*    * ‚Q•”ˆÊ *
016020*    **********
016030     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚Q             TO Œã—Ã‰ñ”‚Q‚v‚q.
016040     MOVE ƒŒƒZ|Œã—Ã—¿‚Q               TO Œã—Ã—¿‚Q‚v‚q.
016050     MOVE ƒŒƒZ|—âãª–@‰ñ”‚Q           TO —âãª–@‰ñ”‚Q‚v‚q.
016060     MOVE ƒŒƒZ|—âãª–@—¿‚Q             TO —âãª–@—¿‚Q‚v‚q.
016070     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚Q           TO ‰·ãª–@‰ñ”‚Q‚v‚q.
016080     MOVE ƒŒƒZ|‰·ãª–@—¿‚Q             TO ‰·ãª–@—¿‚Q‚v‚q.
016090     MOVE ƒŒƒZ|“d—Ã‰ñ”‚Q             TO “d—Ã‰ñ”‚Q‚v‚q.
016100     MOVE ƒŒƒZ|“d—Ã—¿‚Q               TO “d—Ã—¿‚Q‚v‚q.
016110*    ****************
016120*    * ‚R•”ˆÊ^‚WŠ„ *
016130*    ****************
016140     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚R‚W             TO Œã—Ã‰ñ”‚R‚W‚v‚q.
016150     MOVE ƒŒƒZ|Œã—Ã—¿‚R‚W               TO Œã—Ã—¿‚R‚W‚v‚q.
016160     MOVE ƒŒƒZ|—âãª–@‰ñ”‚R‚W           TO —âãª–@‰ñ”‚R‚W‚v‚q.
016170     MOVE ƒŒƒZ|—âãª–@—¿‚R‚W             TO —âãª–@—¿‚R‚W‚v‚q.
016180     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚R‚W           TO ‰·ãª–@‰ñ”‚R‚W‚v‚q.
016190     MOVE ƒŒƒZ|‰·ãª–@—¿‚R‚W             TO ‰·ãª–@—¿‚R‚W‚v‚q.
016200     MOVE ƒŒƒZ|“d—Ã‰ñ”‚R‚W             TO “d—Ã‰ñ”‚R‚W‚v‚q.
016210     MOVE ƒŒƒZ|“d—Ã—¿‚R‚W               TO “d—Ã—¿‚R‚W‚v‚q.
016220*    ****************
016230*    * ‚R•”ˆÊ^10Š„ *
016240*    ****************
016250     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚R‚O             TO Œã—Ã‰ñ”‚R‚O‚v‚q.
016260     MOVE ƒŒƒZ|Œã—Ã—¿‚R‚O               TO Œã—Ã—¿‚R‚O‚v‚q.
016270     MOVE ƒŒƒZ|—âãª–@‰ñ”‚R‚O           TO —âãª–@‰ñ”‚R‚O‚v‚q.
016280     MOVE ƒŒƒZ|—âãª–@—¿‚R‚O             TO —âãª–@—¿‚R‚O‚v‚q.
016290     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚R‚O           TO ‰·ãª–@‰ñ”‚R‚O‚v‚q.
016300     MOVE ƒŒƒZ|‰·ãª–@—¿‚R‚O             TO ‰·ãª–@—¿‚R‚O‚v‚q.
016310     MOVE ƒŒƒZ|“d—Ã‰ñ”‚R‚O             TO “d—Ã‰ñ”‚R‚O‚v‚q.
016320     MOVE ƒŒƒZ|“d—Ã—¿‚R‚O               TO “d—Ã—¿‚R‚O‚v‚q.
016330*    ****************
016340*    * ‚R•”ˆÊ^‡Œv *
016350*    ****************
016360     COMPUTE Œã—Ã‰ñ”‚R‚v‚q      = Œã—Ã‰ñ”‚R‚W‚v‚q   + Œã—Ã‰ñ”‚R‚O‚v‚q.
016370     COMPUTE Œã—Ã—¿‚R‚v‚q        = Œã—Ã—¿‚R‚W‚v‚q     + Œã—Ã—¿‚R‚O‚v‚q.
016380     COMPUTE —âãª–@‰ñ”‚R‚v‚q    = —âãª–@‰ñ”‚R‚W‚v‚q + —âãª–@‰ñ”‚R‚O‚v‚q.
016390     COMPUTE —âãª–@—¿‚R‚v‚q      = —âãª–@—¿‚R‚W‚v‚q   + —âãª–@—¿‚R‚O‚v‚q.
016400     COMPUTE ‰·ãª–@‰ñ”‚R‚v‚q    = ‰·ãª–@‰ñ”‚R‚W‚v‚q + ‰·ãª–@‰ñ”‚R‚O‚v‚q.
016410     COMPUTE ‰·ãª–@—¿‚R‚v‚q      = ‰·ãª–@—¿‚R‚W‚v‚q   + ‰·ãª–@—¿‚R‚O‚v‚q.
016420     COMPUTE “d—Ã‰ñ”‚R‚v‚q      = “d—Ã‰ñ”‚R‚W‚v‚q   + “d—Ã‰ñ”‚R‚O‚v‚q.
016430     COMPUTE “d—Ã—¿‚R‚v‚q        = “d—Ã—¿‚R‚W‚v‚q     + “d—Ã—¿‚R‚O‚v‚q.
016440*    ****************
016450*    * ‚S•”ˆÊ^‚TŠ„ *
016460*    ****************
016470     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚T             TO Œã—Ã‰ñ”‚S‚T‚v‚q.
016480     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚T               TO Œã—Ã—¿‚S‚T‚v‚q.
016490     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚T           TO —âãª–@‰ñ”‚S‚T‚v‚q.
016500     MOVE ƒŒƒZ|—âãª–@—¿‚S‚T             TO —âãª–@—¿‚S‚T‚v‚q.
016510     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚T           TO ‰·ãª–@‰ñ”‚S‚T‚v‚q.
016520     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚T             TO ‰·ãª–@—¿‚S‚T‚v‚q.
016530     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚T             TO “d—Ã‰ñ”‚S‚T‚v‚q.
016540     MOVE ƒŒƒZ|“d—Ã—¿‚S‚T               TO “d—Ã—¿‚S‚T‚v‚q.
016550*    ****************
016560*    * ‚S•”ˆÊ^‚WŠ„ *
016570*    ****************
016580     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚W             TO Œã—Ã‰ñ”‚S‚W‚v‚q.
016590     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚W               TO Œã—Ã—¿‚S‚W‚v‚q.
016600     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚W           TO —âãª–@‰ñ”‚S‚W‚v‚q.
016610     MOVE ƒŒƒZ|—âãª–@—¿‚S‚W             TO —âãª–@—¿‚S‚W‚v‚q.
016620     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚W           TO ‰·ãª–@‰ñ”‚S‚W‚v‚q.
016630     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚W             TO ‰·ãª–@—¿‚S‚W‚v‚q.
016640     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚W             TO “d—Ã‰ñ”‚S‚W‚v‚q.
016650     MOVE ƒŒƒZ|“d—Ã—¿‚S‚W               TO “d—Ã—¿‚S‚W‚v‚q.
016660*    ****************
016670*    * ‚S•”ˆÊ^10Š„ *
016680*    ****************
016690     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚O             TO Œã—Ã‰ñ”‚S‚O‚v‚q.
016700     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚O               TO Œã—Ã—¿‚S‚O‚v‚q.
016710     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚O           TO —âãª–@‰ñ”‚S‚O‚v‚q.
016720     MOVE ƒŒƒZ|—âãª–@—¿‚S‚O             TO —âãª–@—¿‚S‚O‚v‚q.
016730     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚O           TO ‰·ãª–@‰ñ”‚S‚O‚v‚q.
016740     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚O             TO ‰·ãª–@—¿‚S‚O‚v‚q.
016750     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚O             TO “d—Ã‰ñ”‚S‚O‚v‚q.
016760     MOVE ƒŒƒZ|“d—Ã—¿‚S‚O               TO “d—Ã—¿‚S‚O‚v‚q.
016770*    ****************
016780*    * ‚S•”ˆÊ^‡Œv *
016790*    ****************
016800     COMPUTE Œã—Ã‰ñ”‚S‚v‚q      = Œã—Ã‰ñ”‚S‚T‚v‚q   + Œã—Ã‰ñ”‚S‚W‚v‚q   + Œã—Ã‰ñ”‚S‚O‚v‚q.
016810     COMPUTE Œã—Ã—¿‚S‚v‚q        = Œã—Ã—¿‚S‚T‚v‚q     + Œã—Ã—¿‚S‚W‚v‚q     + Œã—Ã—¿‚S‚O‚v‚q.
016820     COMPUTE —âãª–@‰ñ”‚S‚v‚q    = —âãª–@‰ñ”‚S‚T‚v‚q + —âãª–@‰ñ”‚S‚W‚v‚q + —âãª–@‰ñ”‚S‚O‚v‚q.
016830     COMPUTE —âãª–@—¿‚S‚v‚q      = —âãª–@—¿‚S‚T‚v‚q   + —âãª–@—¿‚S‚W‚v‚q   + —âãª–@—¿‚S‚O‚v‚q.
016840     COMPUTE ‰·ãª–@‰ñ”‚S‚v‚q    = ‰·ãª–@‰ñ”‚S‚T‚v‚q + ‰·ãª–@‰ñ”‚S‚W‚v‚q + ‰·ãª–@‰ñ”‚S‚O‚v‚q.
016850     COMPUTE ‰·ãª–@—¿‚S‚v‚q      = ‰·ãª–@—¿‚S‚T‚v‚q   + ‰·ãª–@—¿‚S‚W‚v‚q   + ‰·ãª–@—¿‚S‚O‚v‚q.
016860     COMPUTE “d—Ã‰ñ”‚S‚v‚q      = “d—Ã‰ñ”‚S‚T‚v‚q   + “d—Ã‰ñ”‚S‚W‚v‚q   + “d—Ã‰ñ”‚S‚O‚v‚q.
016870     COMPUTE “d—Ã—¿‚S‚v‚q        = “d—Ã—¿‚S‚T‚v‚q     + “d—Ã—¿‚S‚W‚v‚q     + “d—Ã—¿‚S‚O‚v‚q.
016880*    *****************
016890*    * ‚T•”ˆÊ^2.5Š„ *
016900*    *****************
016910     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚Q             TO Œã—Ã‰ñ”‚T‚Q‚v‚q.
016920     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚Q               TO Œã—Ã—¿‚T‚Q‚v‚q.
016930     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚Q           TO —âãª–@‰ñ”‚T‚Q‚v‚q.
016940     MOVE ƒŒƒZ|—âãª–@—¿‚T‚Q             TO —âãª–@—¿‚T‚Q‚v‚q.
016950     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚Q           TO ‰·ãª–@‰ñ”‚T‚Q‚v‚q.
016960     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚Q             TO ‰·ãª–@—¿‚T‚Q‚v‚q.
016970     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚Q             TO “d—Ã‰ñ”‚T‚Q‚v‚q.
016980     MOVE ƒŒƒZ|“d—Ã—¿‚T‚Q               TO “d—Ã—¿‚T‚Q‚v‚q.
016990*    ****************
017000*    * ‚T•”ˆÊ^‚TŠ„ *
017010*    ****************
017020     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚T             TO Œã—Ã‰ñ”‚T‚T‚v‚q.
017030     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚T               TO Œã—Ã—¿‚T‚T‚v‚q.
017040     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚T           TO —âãª–@‰ñ”‚T‚T‚v‚q.
017050     MOVE ƒŒƒZ|—âãª–@—¿‚T‚T             TO —âãª–@—¿‚T‚T‚v‚q.
017060     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚T           TO ‰·ãª–@‰ñ”‚T‚T‚v‚q.
017070     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚T             TO ‰·ãª–@—¿‚T‚T‚v‚q.
017080     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚T             TO “d—Ã‰ñ”‚T‚T‚v‚q.
017090     MOVE ƒŒƒZ|“d—Ã—¿‚T‚T               TO “d—Ã—¿‚T‚T‚v‚q.
017100*    ****************
017110*    * ‚T•”ˆÊ^‚WŠ„ *
017120*    ****************
017130     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚W             TO Œã—Ã‰ñ”‚T‚W‚v‚q.
017140     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚W               TO Œã—Ã—¿‚T‚W‚v‚q.
017150     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚W           TO —âãª–@‰ñ”‚T‚W‚v‚q.
017160     MOVE ƒŒƒZ|—âãª–@—¿‚T‚W             TO —âãª–@—¿‚T‚W‚v‚q.
017170     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚W           TO ‰·ãª–@‰ñ”‚T‚W‚v‚q.
017180     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚W             TO ‰·ãª–@—¿‚T‚W‚v‚q.
017190     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚W             TO “d—Ã‰ñ”‚T‚W‚v‚q.
017200     MOVE ƒŒƒZ|“d—Ã—¿‚T‚W               TO “d—Ã—¿‚T‚W‚v‚q.
017210*    ****************
017220*    * ‚T•”ˆÊ^10Š„ *
017230*    ****************
017240     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚O             TO Œã—Ã‰ñ”‚T‚O‚v‚q.
017250     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚O               TO Œã—Ã—¿‚T‚O‚v‚q.
017260     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚O           TO —âãª–@‰ñ”‚T‚O‚v‚q.
017270     MOVE ƒŒƒZ|—âãª–@—¿‚T‚O             TO —âãª–@—¿‚T‚O‚v‚q.
017280     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚O           TO ‰·ãª–@‰ñ”‚T‚O‚v‚q.
017290     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚O             TO ‰·ãª–@—¿‚T‚O‚v‚q.
017300     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚O             TO “d—Ã‰ñ”‚T‚O‚v‚q.
017310     MOVE ƒŒƒZ|“d—Ã—¿‚T‚O               TO “d—Ã—¿‚T‚O‚v‚q.
017320*    ****************
017330*    * ‚T•”ˆÊ^‡Œv *
017340*    ****************
017350     COMPUTE Œã—Ã‰ñ”‚T‚v‚q   = Œã—Ã‰ñ”‚T‚Q‚v‚q   + Œã—Ã‰ñ”‚T‚T‚v‚q   +
017360                                Œã—Ã‰ñ”‚T‚W‚v‚q   + Œã—Ã‰ñ”‚T‚O‚v‚q.
017370     COMPUTE Œã—Ã—¿‚T‚v‚q     = Œã—Ã—¿‚T‚Q‚v‚q     + Œã—Ã—¿‚T‚T‚v‚q     +
017380                                Œã—Ã—¿‚T‚W‚v‚q     + Œã—Ã—¿‚T‚O‚v‚q.
017390     COMPUTE —âãª–@‰ñ”‚T‚v‚q = —âãª–@‰ñ”‚T‚Q‚v‚q + —âãª–@‰ñ”‚T‚T‚v‚q +
017400                                —âãª–@‰ñ”‚T‚W‚v‚q + —âãª–@‰ñ”‚T‚O‚v‚q.
017410     COMPUTE —âãª–@—¿‚T‚v‚q   = —âãª–@—¿‚T‚Q‚v‚q   + —âãª–@—¿‚T‚T‚v‚q   +
017420                                —âãª–@—¿‚T‚W‚v‚q   + —âãª–@—¿‚T‚O‚v‚q.
017430     COMPUTE ‰·ãª–@‰ñ”‚T‚v‚q = ‰·ãª–@‰ñ”‚T‚Q‚v‚q + ‰·ãª–@‰ñ”‚T‚T‚v‚q +
017440                                ‰·ãª–@‰ñ”‚T‚W‚v‚q + ‰·ãª–@‰ñ”‚T‚O‚v‚q.
017450     COMPUTE ‰·ãª–@—¿‚T‚v‚q   = ‰·ãª–@—¿‚T‚Q‚v‚q   + ‰·ãª–@—¿‚T‚T‚v‚q   +
017460                                ‰·ãª–@—¿‚T‚W‚v‚q   + ‰·ãª–@—¿‚T‚O‚v‚q.
017470     COMPUTE “d—Ã‰ñ”‚T‚v‚q   = “d—Ã‰ñ”‚T‚Q‚v‚q   + “d—Ã‰ñ”‚T‚T‚v‚q   +
017480                                “d—Ã‰ñ”‚T‚W‚v‚q   + “d—Ã‰ñ”‚T‚O‚v‚q.
017490     COMPUTE “d—Ã—¿‚T‚v‚q     = “d—Ã—¿‚T‚Q‚v‚q     + “d—Ã—¿‚T‚T‚v‚q     +
017500                                “d—Ã—¿‚T‚W‚v‚q     + “d—Ã—¿‚T‚O‚v‚q.
017510*
017520*================================================================*
017530 •‰ƒf[ƒ^Žæ“¾ SECTION.
017540*
017550**************************************************
017560* ˜AŒ‹ƒf[ƒ^‚©‚ç•‰ƒf[ƒ^‚e‚æ‚èˆÈ‰º‚Ìî•ñ‚ðŽæ“¾ *
017570* œ •”ˆÊ{•‰Ží•Ê                              *
017580* œ “]‹A‹æ•ª ....‹æ•ª‚É‚æ‚èƒ`ƒFƒbƒN‚É"›"‚ðŠi”[ *
017590* œ ‹à‘®•›Žq ....‹æ•ª‚É‚æ‚èƒ`ƒFƒbƒN‚É"›"‚ðŠi”[ *
017600* œ Œo‰ßƒR[ƒh...Œo‰ßƒ}ƒXƒ^‚æ‚èŽæ“¾             *
017610**************************************************
017620     INITIALIZE •‰î•ñ‚v.
017630     MOVE SPACE TO Œp‘±ƒtƒ‰ƒO.
017640     MOVE Ž{p˜a—ï‚v‚q       TO •‰|Ž{p˜a—ï.
017650     MOVE Ž{p”N‚v‚q         TO •‰|Ž{p”N.
017660     MOVE Ž{pŒŽ‚v‚q         TO •‰|Ž{pŒŽ.
017670     MOVE Š³ŽÒƒR[ƒh‚v‚q     TO •‰|Š³ŽÒƒR[ƒh.
017680     READ •‰ƒf[ƒ^‚e
017690     INVALID KEY
017700         CONTINUE
017710*            /* ‚ ‚è‚¦‚È‚¢ */
017720     NOT INVALID KEY
017730         MOVE •‰|•”ˆÊ”                   TO •”ˆÊ”‚v
017740         PERFORM VARYING •”ˆÊ‚b‚m‚s FROM 1 BY 1
017750                 UNTIL ( •”ˆÊ‚b‚m‚s > •”ˆÊ”‚v )
017760             MOVE •‰|•‰Ží•Ê(•”ˆÊ‚b‚m‚s) TO •‰Ží•Ê‚v(•”ˆÊ‚b‚m‚s)
017770             MOVE •‰|•”ˆÊ(•”ˆÊ‚b‚m‚s)     TO •”ˆÊ‚v(•”ˆÊ‚b‚m‚s)
017780*
017790             MOVE •‰|“]‹A‹æ•ª(•”ˆÊ‚b‚m‚s) TO “]‹A‹æ•ª‚v(•”ˆÊ‚b‚m‚s)
017800*   --- Œp‘±‚Ì•”ˆÊ‚ª‚ ‚é‚©”»’è ---
017810             IF •‰|“]‹A‹æ•ª(•”ˆÊ‚b‚m‚s) = 9
017820                  MOVE "YES" TO Œp‘±ƒtƒ‰ƒO
017830             END-IF
017840*
017850         END-PERFORM
017860     END-READ.
017870*
017880*================================================================*
017890*================================================================*
017900 ƒŒƒZƒvƒgŽí•ÊŽæ“¾ SECTION.
017910*
017920     IF Žó|•¬Ží•Ê  = ZERO
017930         EVALUATE TRUE
017940         WHEN (Žó|•ÛŒ¯Ží•Ê = 01) AND (Žó|Œö”ïŽí•Ê = ZERO)
017950            MOVE "KOKU"    TO ƒŒƒZƒvƒgŽí—Þ‚v
017960         WHEN (Žó|•ÛŒ¯Ží•Ê = 02 OR 06 OR 07) AND (Žó|–{l‰Æ‘°‹æ•ª = 1) AND (Žó|Œö”ïŽí•Ê = ZERO)
017970            MOVE "SYAH"    TO ƒŒƒZƒvƒgŽí—Þ‚v
017980         WHEN (Žó|•ÛŒ¯Ží•Ê = 02 OR 06 OR 07) AND (Žó|–{l‰Æ‘°‹æ•ª = 2) AND (Žó|Œö”ïŽí•Ê = ZERO)
017990            MOVE "SYAK"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018000         WHEN (Žó|•ÛŒ¯Ží•Ê = 03) AND (Žó|–{l‰Æ‘°‹æ•ª = 1) AND (Žó|Œö”ïŽí•Ê = ZERO)
018010            MOVE "KUMH"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018020         WHEN (Žó|•ÛŒ¯Ží•Ê = 03) AND (Žó|–{l‰Æ‘°‹æ•ª = 2) AND (Žó|Œö”ïŽí•Ê = ZERO)
018030            MOVE "KUMK"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018040         WHEN (Žó|•ÛŒ¯Ží•Ê = 04) AND (Žó|–{l‰Æ‘°‹æ•ª = 1) AND (Žó|Œö”ïŽí•Ê = ZERO)
018050            MOVE "KYOH"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018060         WHEN (Žó|•ÛŒ¯Ží•Ê = 04) AND (Žó|–{l‰Æ‘°‹æ•ª = 2) AND (Žó|Œö”ïŽí•Ê = ZERO)
018070            MOVE "KYOK"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018080         WHEN Žó|Œö”ïŽí•Ê = 05
018090            MOVE "ROUJ"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018100         WHEN (Žó|•ÛŒ¯Ží•Ê = 08) AND (Žó|Œö”ïŽí•Ê = ZERO)
018110            MOVE "TAIS"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018120         WHEN (Žó|•ÛŒ¯Ží•Ê = 09) AND (Žó|Œö”ïŽí•Ê = ZERO)
018130            MOVE "JIEI"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018140         WHEN OTHER
018150            CONTINUE
018160*** ¦ ˜JÐEŽ©”…Ó ’Ç‰Á•K—v
018170*            MOVE  NC"•ÛŒ¯Ží•Ê‚ª•s³‚Å‚·B" TO ˜Aƒ|ƒƒbƒZ[ƒW
018180*            CALL   "MSG001"
018190*            CANCEL "MSG001"
018200*            PERFORM ƒtƒ@ƒCƒ‹•Â½
018210*            EXIT PROGRAM
018220         END-EVALUATE
018230     ELSE
018240** •¬‚ª‚ ‚éŽž
018250         MOVE "JYOS"    TO ƒŒƒZƒvƒgŽí—Þ‚v
018260     END-IF.
018270*
018280*================================================================*
018290******************************************************************
018300 END PROGRAM YAS101.
018310******************************************************************
