000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAS102.
000060 AUTHOR.                 岡田 憲和
000070*
000080*----------------------------------------------------------------*
000090*      あさひ接骨師会 提出FPD作成【FPD書込】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100* 請求年月Ver.
000110*      MED =  
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-09-10
000140 DATE-COMPILED.          2012-09-10
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  制－制御区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000330     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS                   IS  DYNAMIC
000360                             RECORD      KEY          IS  作１－請求和暦年月
000370                                                          作１－施術和暦年月
000381                                                          作１－保険区分
000390                                                          作１－費用負担者番号
000400                                                          作１－保険者番号
000410                                                          作１－本人家族区分
000420                                                          作１－患者カナ
000430                                                          作１－患者コード
000440                             FILE        STATUS       IS  状態キー
000450                             LOCK        MODE         IS  AUTOMATIC.
000460*
000470*     SELECT 会提出ファイル   ASSIGN      TO        DATAFL
000480     SELECT 会提出ファイル ASSIGN    TO    FD-NAME
000490                             ORGANIZATION             IS  SEQUENTIAL
000500                             ACCESS MODE              IS  SEQUENTIAL
000510                             FILE STATUS              IS  状態キー
000520                             LOCK      MODE           IS  AUTOMATIC.
000530******************************************************************
000540*                      DATA DIVISION                             *
000550******************************************************************
000560 DATA                    DIVISION.
000570 FILE                    SECTION.
000580*
000590*                           ［ＲＬ＝  ２５６］
000600 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000610     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000620*
000630 FD  作業ファイル１ RECORD  CONTAINS 516 CHARACTERS.
000640 01  作１－レコード.
000650     03  作１－レコードヘッダ.
000660         05  作１－請求和暦年月.
000670             07  作１－請求和暦            PIC 9.
000680             07  作１－請求年              PIC 9(2).
000690             07  作１－請求月              PIC 9(2).
000701         05  作１－保険区分                PIC 99.
000710         05  作１－保険者番号              PIC X(10).
000720         05  作１－本人家族区分            PIC 9.
000730         05  作１－施術和暦年月.
000740             07  作１－施術和暦            PIC 9.
000750             07  作１－施術年              PIC 9(2).
000760             07  作１－施術月              PIC 9(2).
000770         05  作１－被保険者カナ            PIC X(20).
000780         05  作１－患者コード.
000790             07 作１－患者番号             PIC 9(6).
000800             07 作１－枝番                 PIC X(1).
000810         05  作１－保険種別                PIC 9(2).
000820         05  作１－助成種別                PIC 9(2).
000830     03  作１－レコードデータ.
000840         05  作１－会員番号                PIC X(5).
000850         05  作１－老人助成                PIC 99.
000860         05  作１－公費併用.
000870             07  作１－費用負担者番号      PIC X(10).
000880             07  作１－受益者番号          PIC X(10).
000890         05  作１－患者氏名.
000900             07  作１－患者漢字            PIC N(10).
000910             07  作１－患者カナ            PIC X(20).
000920         05  作１－患者性別                PIC 9.
000930         05  作１－患者生年月日.
000940             07  作１－患者和暦            PIC 9(1).
000950             07  作１－患者年              PIC 9(2).
000960             07  作１－患者月              PIC 9(2).
000970             07  作１－患者日              PIC 9(2).
000980         05  作１－続柄                    PIC N(2).
000990         05  作１－被保険者氏名.
001000             07  作１－被保険者漢字        PIC N(10).
001010         05  作１－被保険者性別            PIC 9.
001020         05  作１－被保険者生年月日.
001030             07  作１－被保険者和暦        PIC 9(1).
001040             07  作１－被保険者年          PIC 9(2).
001050             07  作１－被保険者月          PIC 9(2).
001060             07  作１－被保険者日          PIC 9(2).
001070         05  作１－記号                    PIC N(12).
001080         05  作１－番号                    PIC X(12).
001090         05  作１－資格取得年月日.
001100             07  作１－資格和暦            PIC 9(1).
001110             07  作１－資格年              PIC 9(2).
001120             07  作１－資格月              PIC 9(2).
001130             07  作１－資格日              PIC 9(2).
001140         05  作１－有効年月日.
001150             07  作１－有効和暦            PIC 9(1).
001160             07  作１－有効年              PIC 9(2).
001170             07  作１－有効月              PIC 9(2).
001180             07  作１－有効日              PIC 9(2).
001190         05  作１－助成自己負担金未払      PIC 9.
001200         05  作１－転帰区分総合            PIC 9.
001210         05  FILLER                        PIC 9(2).
001220         05  作１－通院回数                PIC 9(2).
001230         05  作１－初診料.
001240             07  作１－初診基本料          PIC 9(4).
001250             07  作１－初診加算料          PIC 9(4).
001260         05  作１－往療料.
001270             07  作１－加算                PIC 9.
001280             07  作１－回数                PIC 9(2).
001290             07  作１－往療料金額          PIC 9(6).
001300         05  作１－金属副子加算.
001310             07  作１－使用枚数.
001320                 09  作１－大              PIC 9.
001330                 09  作１－中              PIC 9.
001340                 09  作１－小              PIC 9.
001350             07  作１－金額                PIC 9(6).
001360         05  作１－情報提供料              PIC 9(6).
001370         05  作１－文書料                  PIC 9(6).
001380         05  作１－一般費用金額.
001390             07  作１－費用合計金額        PIC 9(6).
001400             07  作１－負担率              PIC 9.
001410             07  作１－負担金額            PIC 9(6).
001420             07  作１－請求金額            PIC 9(6).
001430         05  作１－老人助成金額.
001440             07  作１－自己負担金額        PIC 9(6).
001450             07  作１－差引請求金額        PIC 9(6).
001460             07  作１－合計請求金額        PIC 9(6).
001470         05  作１－部位データ              OCCURS 5.
001480             07  作１－負傷コード.
001490                 09  作１－種別            PIC 9.
001500                 09  作１－部位コード      PIC 99.
001510             07  作１－冷罨療法.
001520                 09  作１－冷罨回数        PIC 99.
001530                 09  作１－冷罨金額        PIC 9(6).
001540             07  作１－施術料              PIC 9(6).
001550             07  作１－罨法料.
001560                 09  作１－罨法回数        PIC 99.
001570                 09  作１－罨法金額        PIC 9(6).
001580             07  作１－電療料.
001590                 09  作１－電療回数        PIC 99.
001600                 09  作１－電療金額        PIC 9(6).
001610             07  作１－後療料.
001620                 09  作１－後療回数        PIC 99.
001630                 09  作１－後療金額        PIC 9(6).
001640             07  作１－転帰区分            PIC 9.
001650         05  FILLER                        PIC X(13).
001660*
001670*
001680 FD  会提出ファイル RECORD  CONTAINS 720 CHARACTERS.
001690 01  会提－レコード.
001700     03  会提－レコードデータ.
001710         05  会提－会員番号                  PIC X(5).
001720         05  会提－年月.
001730             07  会提－和暦                  PIC 9.
001740             07  会提－年                    PIC 9(2).
001750             07  会提－月                    PIC 9(2).
001760         05  会提－保険者データ.
001770             07  会提－保険区分              PIC 99.
001780             07  会提－保険者番号            PIC X(10).
001790             07  会提－老人助成              PIC 99.
001800             07  会提－公費併用.
001810                 09  会提－費用負担者番号    PIC X(10).
001820                 09  会提－受益者番号        PIC X(10).
001830         05  会提－患者データ.
001840             07  会提－患者コード            PIC X(7).
001850             07  会提－患者氏名.
001860                 09  会提－患者漢字          PIC N(10).
001870                 09  会提－患者カナ          PIC X(20).
001880             07  会提－患者性別              PIC 9.
001890             07  会提－患者生年月日.
001900                 09  会提－患者和暦          PIC 9(1).
001910                 09  会提－患者年            PIC 9(2).
001920                 09  会提－患者月            PIC 9(2).
001930                 09  会提－患者日            PIC 9(2).
001940             07  会提－本人家族区分          PIC 9.
001950             07  会提－続柄                  PIC N(2).
001960         05  会提－被保険者データ.
001970             07  会提－被保険者氏名.
001980                 09  会提－被保険者漢字      PIC N(10).
001990                 09  会提－被保険者カナ      PIC X(20).
002000             07  会提－被保険者性別          PIC 9.
002010             07  会提－被保険者生年月日.
002020                 09  会提－被保険者和暦      PIC 9(1).
002030                 09  会提－被保険者年        PIC 9(2).
002040                 09  会提－被保険者月        PIC 9(2).
002050                 09  会提－被保険者日        PIC 9(2).
002060             07  会提－記号                  PIC N(12).
002070             07  会提－番号                  PIC X(12).
002080             07  会提－資格取得年月日.
002090                 09  会提－資格和暦          PIC 9(1).
002100                 09  会提－資格年            PIC 9(2).
002110                 09  会提－資格月            PIC 9(2).
002120                 09  会提－資格日            PIC 9(2).
002130             07  会提－有効年月日.
002140                 09  会提－有効和暦          PIC 9(1).
002150                 09  会提－有効年            PIC 9(2).
002160                 09  会提－有効月            PIC 9(2).
002170                 09  会提－有効日            PIC 9(2).
002180         05  会提－助成自己負担金未払        PIC 9.
002190         05  会提－転帰区分総合              PIC 9.
002200         05  FILLER                          PIC X(24).
002210         05  会提－通院回数                  PIC 9(2).
002220         05  会提－初診料.
002230             07  会提－初診基本料            PIC 9(4).
002240             07  会提－初診加算料            PIC 9(4).
002250         05  会提－往療料.
002260             07  会提－加算                  PIC 9.
002270             07  会提－回数                  PIC 9(2).
002280             07  会提－往療料金額            PIC 9(6).
002290         05  会提－金属副子加算.
002300             07  会提－使用枚数.
002310                 09  会提－大                PIC 9.
002320                 09  会提－中                PIC 9.
002330                 09  会提－小                PIC 9.
002340             07  会提－金額                  PIC 9(6).
002350         05  会提－情報提供料                PIC 9(6).
002360         05  会提－文書料                    PIC 9(6).
002370         05  会提－一般費用金額.
002380             07  会提－費用合計金額          PIC 9(6).
002390             07  会提－負担率                PIC 9.
002400             07  会提－負担金額              PIC 9(6).
002410             07  会提－請求金額              PIC 9(6).
002420         05  会提－老人助成金額.
002430             07  会提－自己負担金額          PIC 9(6).
002440             07  会提－差引請求金額          PIC 9(6).
002450             07  会提－合計請求金額          PIC 9(6).
002460         05  会提－部位データ                OCCURS 5.
002470             07  会提－部位.
002480                 09  会提－負傷コード.
002490                     11  会提－種別          PIC 9.
002500                     11  会提－部位コード    PIC 99.
002510                 09  会提－冷罨療法.
002520                     11  会提－冷罨回数      PIC 99.
002530                     11  会提－冷罨金額      PIC 9(6).
002540                 09  会提－施術料            PIC 9(6).
002550                 09  会提－罨法料.
002560                     11  会提－罨法回数      PIC 99.
002570                     11  会提－罨法金額      PIC 9(6).
002580                 09  会提－電療料.
002590                     11  会提－電療回数      PIC 99.
002600                     11  会提－電療金額      PIC 9(6).
002610                 09  会提－後療料.
002620                     11  会提－後療回数      PIC 99.
002630                     11  会提－後療金額      PIC 9(6).
002640                 09  会提－転帰区分          PIC 9.
002650                 09  FILLER                  PIC X(8).
002660         05  FILLER                          PIC X(165).
002670*
002680*----------------------------------------------------------------*
002690******************************************************************
002700*                WORKING-STORAGE SECTION                         *
002710******************************************************************
002720 WORKING-STORAGE         SECTION.
002730 01 キー入力                           PIC X    VALUE SPACE.
002740 01 状態キー                           PIC X(2) VALUE SPACE.
002750 01 終了フラグ                         PIC X(3) VALUE SPACE.
002760 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002770 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002780 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002790 01 ファイル名                         PIC N(8) VALUE SPACE.
002800 01 カウンタ                           PIC 9(1) VALUE ZERO.
002810**
002820** エラーメッセージ用
002830 01 エラーメッセージＷ.
002840    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002850    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002860    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002870    03 FILLER                          PIC X(10) VALUE SPACE.
002880*
002890* フロッピーパス用
002900 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002910 01 FD-NAME                            PIC X(30) VALUE SPACE.
002920******************************************************************
002930*                          連結項目                              *
002940******************************************************************
002953*
002954 01 連入－画面情報ＹＡＳ１００ IS EXTERNAL.
002955    03 連入－ドライブ                  PIC X(1).
002956*
002957*
002960********************
002970* メッセージ表示キー *
002980********************
002990 01 連メ－キー IS EXTERNAL.
003000    03  連メ－メッセージ               PIC N(20).
003010*
003020 01 連メ３－キー IS EXTERNAL.
003030    03  連メ３－メッセージ             PIC N(20).
003040    03  連メ３－メッセージ１           PIC X(20).
003050*
003060******************************************************************
003070*                      PROCEDURE  DIVISION                       *
003080******************************************************************
003090 PROCEDURE               DIVISION.
003100************
003110*           *
003120* 初期処理   *
003130*           *
003140************
003150     PERFORM 初期化.
003160************
003170*           *
003180* 主処理     *
003190*           *
003200************
003210     PERFORM 提出ファイル作成.
003220************
003230*           *
003240* 終了処理   *
003250*           *
003260************
003270     PERFORM 終了処理.
003280     MOVE ZERO TO PROGRAM-STATUS.
003290     EXIT PROGRAM.
003300*
003310*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
003320*================================================================*
003330 初期化 SECTION.
003340*
003350     PERFORM ファイルオープン.
003360*
003370*================================================================*
003380 ファイルオープン SECTION.
003390*
003400*     OPEN INPUT 制御情報マスタ.
003410*         MOVE NC"制御情報マスタ" TO ファイル名.
003420*         PERFORM オープンチェック.
003430*     MOVE ZERO TO 制－制御区分.
003440*     READ 制御情報マスタ
003450*     NOT INVALID KEY
003460*         MOVE 制－定期修正ＦＤ TO 定期修正ＦＤＷ
003471*     END-READ.
003481     MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003490     IF 定期修正ＦＤＷ = SPACE
003491        MOVE "A" TO 定期修正ＦＤＷ
003500     END-IF.
003510     STRING 定期修正ＦＤＷ   DELIMITED BY SIZE
003520            ":\Datafl.dat"   DELIMITED BY SIZE
003530           INTO FD-NAME
003540     END-STRING.
003550*
003560     OPEN OUTPUT 会提出ファイル.
003570     IF 状態キー  =  "30"
003580         MOVE  NC"　　　フロッピーが入っていません。" TO 連メ－メッセージ
003590         CALL   "MSG001"
003600         CANCEL "MSG001"
003610         MOVE 99 TO PROGRAM-STATUS
003620         EXIT PROGRAM
003630     ELSE
003640         MOVE NC"会提出ファイル" TO ファイル名
003650         PERFORM オープンチェック
003660     END-IF.
003670*
003680     OPEN INPUT 作業ファイル１.
003690         MOVE NC"作１" TO ファイル名.
003700         PERFORM オープンチェック.
003710*================================================================*
003720 オープンチェック SECTION.
003730*
003740     IF 状態キー  NOT =  "00"
003750         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003760         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003770         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003780                                                 UPON CONS
003790         ACCEPT  キー入力 FROM CONS
003800         PERFORM ファイル閉鎖
003810         MOVE 99 TO PROGRAM-STATUS
003820         EXIT PROGRAM.
003830*================================================================*
003840 ファイル閉鎖 SECTION.
003850*
003860     CLOSE  会提出ファイル 作業ファイル１ 制御情報マスタ.
003870*================================================================*
003880 終了処理 SECTION.
003890*
003900     PERFORM ファイル閉鎖.
003910*================================================================*
003920 エラー表示 SECTION.
003930*
003940     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003950     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003960     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003970     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003980     ACCEPT  キー入力 FROM CONS.
003990     PERFORM ファイル閉鎖.
004000     MOVE 99 TO PROGRAM-STATUS.
004010     EXIT PROGRAM.
004020*================================================================*
004030 提出ファイル作成 SECTION.
004040*
004050     MOVE SPACE   TO 終了フラグ.
004060     PERFORM 作業ファイル１読込.
004070     IF  終了フラグ = "YES"
004080         MOVE  NC"　データが０件です。確認して下さい" TO 連メ－メッセージ
004090         CALL   "MSG001"
004100         CANCEL "MSG001"
004110         PERFORM ファイル閉鎖
004120         MOVE 99 TO PROGRAM-STATUS
004130         EXIT PROGRAM
004140     END-IF.
004150*
004160     PERFORM UNTIL 終了フラグ = "YES"
004170              PERFORM レコードセット
004180              PERFORM ファイル書込
004190         PERFORM 作業ファイル１読込
004200     END-PERFORM.
004210*
004220*================================================================*
004230 レコードセット SECTION.
004240*
004250     MOVE SPACE TO 会提－レコード.
004260     INITIALIZE    会提－レコード.
004270*
004280     MOVE 作１－会員番号         TO  会提－会員番号.
004290*     MOVE 作１－請求和暦         TO  会提－和暦.
004300*     MOVE 作１－請求年           TO  会提－年.
004310*     MOVE 作１－請求月           TO  会提－月.
004320* 施術年月を転記
004330     MOVE 作１－施術和暦         TO  会提－和暦.
004340     MOVE 作１－施術年           TO  会提－年.
004350     MOVE 作１－施術月           TO  会提－月.
004360*
004370     MOVE 作１－保険区分         TO  会提－保険区分.
004380     MOVE 作１－保険者番号       TO  会提－保険者番号.
004390     MOVE 作１－老人助成         TO  会提－老人助成.
004400     MOVE 作１－費用負担者番号   TO  会提－費用負担者番号.
004410     MOVE 作１－受益者番号       TO  会提－受益者番号.
004420     MOVE 作１－患者コード       TO  会提－患者コード.
004430*
004440     MOVE 作１－患者氏名         TO  会提－患者氏名.
004450     MOVE 作１－患者カナ         TO  会提－患者カナ.
004460     MOVE 作１－患者性別         TO  会提－患者性別.
004470     MOVE 作１－患者生年月日     TO  会提－患者生年月日.
004480     MOVE 作１－本人家族区分     TO  会提－本人家族区分.
004490     MOVE 作１－続柄             TO  会提－続柄.
004500     MOVE 作１－被保険者氏名     TO  会提－被保険者氏名.
004510     MOVE 作１－被保険者カナ     TO  会提－被保険者カナ.
004520     MOVE 作１－被保険者性別     TO  会提－被保険者性別.
004530     MOVE 作１－被保険者生年月日 TO  会提－被保険者生年月日.
004540     MOVE 作１－番号             TO  会提－番号
004550     MOVE 作１－記号             TO  会提－記号
004560     MOVE 作１－資格取得年月日   TO  会提－資格取得年月日.
004570     MOVE 作１－有効年月日       TO  会提－有効年月日.
004580     MOVE 作１－助成自己負担金未払   TO  会提－助成自己負担金未払.
004590     MOVE 作１－転帰区分総合     TO  会提－転帰区分総合.
004600*
004610     MOVE 作１－通院回数         TO   会提－通院回数.
004620     MOVE 作１－初診基本料       TO   会提－初診基本料.
004630     MOVE 作１－初診加算料       TO   会提－初診加算料.
004640*
004650     MOVE 作１－回数             TO   会提－回数.
004660     MOVE 作１－往療料金額       TO   会提－往療料金額.
004670     MOVE 作１－加算             TO   会提－加算.
004680*
004690*
004700     MOVE 作１－金額             TO  会提－金額.
004710*
004720     MOVE 作１－大               TO  会提－大.
004730     MOVE 作１－中               TO  会提－中.
004740     MOVE 作１－小               TO  会提－小.
004750*
004760     MOVE 作１－情報提供料       TO  会提－情報提供料.
004770*
004780     MOVE 作１－文書料           TO  会提－文書料.
004790     MOVE 作１－費用合計金額     TO  会提－費用合計金額.
004800     MOVE 作１－負担金額         TO  会提－負担金額.
004810     MOVE 作１－請求金額         TO  会提－請求金額.
004820     MOVE 作１－負担率           TO  会提－負担率.
004830     MOVE 作１－合計請求金額     TO  会提－合計請求金額.
004840     MOVE 作１－自己負担金額     TO  会提－自己負担金額.
004850     MOVE 作１－差引請求金額     TO  会提－差引請求金額.
004860*
004870     PERFORM VARYING カウンタ FROM 1 BY 1
004880             UNTIL ( カウンタ > 5 )
004890         MOVE 作１－種別(カウンタ)          TO  会提－種別(カウンタ)
004900         MOVE 作１－部位コード(カウンタ)    TO  会提－部位コード(カウンタ)
004910         MOVE 作１－後療回数(カウンタ)      TO  会提－後療回数(カウンタ)
004920         MOVE 作１－後療金額(カウンタ)      TO  会提－後療金額(カウンタ)
004930         MOVE 作１－冷罨回数(カウンタ)      TO  会提－冷罨回数(カウンタ)
004940         MOVE 作１－冷罨金額(カウンタ)      TO  会提－冷罨金額(カウンタ)
004950         MOVE 作１－施術料(カウンタ)        TO  会提－施術料(カウンタ)
004960         MOVE 作１－罨法回数(カウンタ)      TO  会提－罨法回数(カウンタ)
004970         MOVE 作１－罨法金額(カウンタ)      TO  会提－罨法金額(カウンタ)
004980         MOVE 作１－電療回数(カウンタ)      TO  会提－電療回数(カウンタ)
004990         MOVE 作１－電療金額(カウンタ)      TO  会提－電療金額(カウンタ)
005000         MOVE 作１－転帰区分(カウンタ)      TO  会提－転帰区分(カウンタ)
005010     END-PERFORM.
005020*
005030*================================================================*
005040 作業ファイル１読込 SECTION.
005050*
005060     READ 作業ファイル１ NEXT
005070     AT END
005080         MOVE "YES" TO 終了フラグ
005090     END-READ.
005100*
005110*================================================================*
005120 ファイル書込 SECTION.
005130*
005140     WRITE 会提－レコード.
005150     IF 状態キー  NOT =  "00"
005160         MOVE NC"会提出ファイル" TO ファイル名
005170         PERFORM エラー表示
005180     END-IF.
005190*================================================================*
005200******************************************************************
005210 END PROGRAM YAS102.
005220******************************************************************
