000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAS721.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         カルテ（裏）【ﾃﾞｰﾀ作成】あさひ接骨師会
000100*         MED = YAS720 
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2012-08-02
000130 DATE-COMPILED.          2012-08-02
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000270                             ORGANIZATION             IS  INDEXED
000280                             ACCESS MODE              IS  DYNAMIC
000290                             RECORD KEY               IS  元－元号区分
000300                             FILE STATUS              IS  状態キー
000310                             LOCK        MODE         IS  AUTOMATIC.
000320     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000330                             ORGANIZATION             IS  INDEXED
000340                             ACCESS MODE              IS  DYNAMIC
000350                             RECORD KEY               IS  受－施術和暦年月
000360                                                          受－患者コード
000370                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000380                                                          受－患者カナ
000390                                                          受－患者コード
000400                             ALTERNATE RECORD KEY     IS  受－患者コード
000410                                                          受－施術和暦年月
000420                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000430                                                          受－保険種別
000440                                                          受－保険者番号
000450                                                          受－患者コード
000460                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000470                                                          受－公費種別
000480                                                          受－費用負担者番号
000490                                                          受－患者コード
000500                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000510                                                          受－助成種別
000520                                                          受－費用負担者番号助成
000530                                                          受－患者コード
000540                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000550                                                          受－施術和暦年月
000560                                                          受－患者コード
000570                             FILE STATUS              IS  状態キー
000580                             LOCK        MODE         IS  AUTOMATIC.
000590     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
000600                             ORGANIZATION             IS  INDEXED
000610                             ACCESS MODE              IS  DYNAMIC
000620                             RECORD KEY               IS  負－施術和暦年月
000630                                                          負－患者コード
000640                             ALTERNATE RECORD KEY     IS  負－患者コード
000650                                                          負－施術和暦年月
000660                             FILE STATUS              IS  状態キー
000670                             LOCK        MODE         IS  AUTOMATIC.
000130     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000140                             ORGANIZATION             IS  INDEXED
000150                             ACCESS MODE              IS  DYNAMIC
000160                             RECORD KEY               IS  レセ－施術和暦年月
000170                                                          レセ－患者コード
000180                                                          レセ－レセ種別
000190                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000200                                                          レセ－施術和暦年月
000210                                                          レセ－レセ種別
000220                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000230                                                          レセ－施術和暦年月
000240                                                          レセ－患者コード
000250                                                          レセ－レセ種別
000260                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000270                                                          レセ－レセ種別
000280                                                          レセ－請求保険者番号
000290                                                          レセ－患者コード
000300                                                          レセ－施術和暦年月
000310                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000320                                                          レセ－請求保険者番号
000330                                                          レセ－患者コード
000340                                                          レセ－レセ種別
000350                                                          レセ－施術和暦年月
000360                             FILE STATUS              IS  状態キー
000370                             LOCK        MODE         IS  AUTOMATIC.
000690     SELECT  会計データＦ    ASSIGN      TO        KAIKEIL
000700                             ORGANIZATION             IS  INDEXED
000710                             ACCESS MODE              IS  DYNAMIC
000089                             RECORD KEY               IS  会－施術和暦年月日
000090                                                          会－患者コード
000092                             ALTERNATE RECORD KEY     IS  会－患者コード
000093                                                          会－施術和暦年月日
000790                             FILE STATUS              IS  状態キー
000800                             LOCK        MODE         IS  AUTOMATIC.
000680     SELECT  施術記録Ｆ      ASSIGN      TO      SEKIROKL
000690                             ORGANIZATION        IS  INDEXED
000700                             ACCESS MODE         IS  DYNAMIC
000710                             RECORD KEY          IS  施記－施術和暦年月日
000720                                                     施記－患者コード
000730                             ALTERNATE RECORD KEY IS 施記－患者コード
000740                                                     施記－施術和暦年月日
000750                             FILE STATUS              IS  状態キー
000760                             LOCK        MODE         IS  AUTOMATIC.
000770     SELECT  メモファイル    ASSIGN      TO        MEMOL
000780                             ORGANIZATION             IS  INDEXED
000790                             ACCESS MODE              IS  DYNAMIC
000800                             RECORD KEY               IS  メモ－制御区分
000810                                                          メモ－患者コード
000820                                                          メモ－施術和暦年月日
000830                             ALTERNATE RECORD KEY     IS  メモ－制御区分
000840                                                          メモ－施術和暦年月日
000850                                                          メモ－患者コード
000860                             ALTERNATE RECORD KEY     IS  メモ－患者コード
000870                                                          メモ－施術和暦年月日
000880                                                          メモ－制御区分
000890                             FILE STATUS              IS  状態キー
000900                             LOCK        MODE         IS  AUTOMATIC.
000910     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W7211L.DAT"
000920                             ORGANIZATION             IS  INDEXED
000930                             ACCESS                   IS  DYNAMIC
000940                             RECORD      KEY          IS  作１－施術和暦年月日
000950                                                          作１－患者コード
000960                             ALTERNATE RECORD KEY     IS  作１－施術和暦年月日
000970                                                          作１－患者カナ
000980                                                          作１－患者コード
000990                             ALTERNATE RECORD KEY     IS  作１－患者コード
001000                                                          作１－施術和暦年月日
001010                             ALTERNATE RECORD KEY     IS  作１－患者カナ
001020                                                          作１－患者コード
001030                                                          作１－施術和暦年月日
001040                             FILE        STATUS       IS  状態キー
001050                             LOCK        MODE         IS  AUTOMATIC.
001060     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W7212L.DAT"
001070                             ORGANIZATION             IS  INDEXED
001080                             ACCESS                   IS  DYNAMIC
001090                             RECORD      KEY          IS  作２－施術和暦年月
001100                                                          作２－患者コード
001110                             FILE        STATUS       IS  状態キー
001120                             LOCK        MODE         IS  AUTOMATIC.
001130******************************************************************
001140*                      DATA DIVISION                             *
001150******************************************************************
001160 DATA                    DIVISION.
001170 FILE                    SECTION.
001180*                           ［ＲＬ＝  １２８］
001190 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001200     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001210*                           ［ＲＬ＝  ３２０］
001220 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001230     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
      *                          ［ＲＬ＝  １５３６］
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001060*                           ［ＲＬ＝  ５１２］
001070 FD  会計データＦ        BLOCK   CONTAINS   1   RECORDS.
001080     COPY KAIKEI     OF  XFDLIB  JOINING   会   AS  PREFIX.
001240*                           ［ＲＬ＝  ２５６］
001250 FD  施術記録Ｆ          BLOCK   CONTAINS   1   RECORDS.
001260    COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001270*                           ［ＲＬ＝  １２８］
001280 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001290     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001300*                           ［ＲＬ＝  ８３２］
001310 FD  メモファイル        BLOCK CONTAINS 1     RECORDS.
001320     COPY MEMO           OF    XFDLIB JOINING メモ AS PREFIX.
001330**************************
001340* 作業ファイル１／カルテ *
001350**************************
001360*                         ［ＲＬ＝  ３２０］
001370 FD  作業ファイル１ RECORD  CONTAINS 320 CHARACTERS.
001380 01 作１－レコード.
001390    03 作１－レコードキー.
001400       05 作１－施術和暦年月日.
                07 作１－施術和暦年月.
001410             09 作１－施術和暦             PIC 9.
001420             09 作１－施術年月.
001430                11 作１－施術年            PIC 9(2).
001440                11 作１－施術月            PIC 9(2).
001450          07 作１－施術日                  PIC 9(2).
001460       05 作１－患者コード.
001470          07 作１－患者番号                PIC 9(6).
001480          07 作１－枝番                    PIC X(1).
001490    03 作１－レコードデータ.
001500       05 作１－保険種別                   PIC 9(2).
001510       05 作１－公費種別                   PIC 9(2).
001520       05 作１－助成種別                   PIC 9(2).
001530       05 作１－保険者番号                 PIC X(10).
001540       05 作１－本人家族区分               PIC 9(1).
001550       05 作１－被保険者カナ               PIC X(50).
001560       05 作１－患者カナ                   PIC X(50).
001570       05 作１－患者氏名                   PIC X(50).
001580       05 作１－負担割合                   PIC 9(2).
001590       05 作１－料金.
001590          07 作１－初検金額                PIC 9(5).
001690          07 作１－整復金額                PIC 9(5).
001700          07 作１－後療金額                PIC 9(5).
001710          07 作１－罨法金額                PIC 9(5).
001720          07 作１－電療金額                PIC 9(5).
001730          07 作１－一部負担金              PIC 9(5).
001740          07 作１－コメント                PIC X(100).
      */明細行に費用額を印字0304
                07 作１－費用額                  PIC 9(6).
001750       05 FILLER                           PIC X(1).
001760*
001770*                         ［ＲＬ＝  １２８］
001780 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
001790 01 作２－レコード.
001800    03 作２－レコードキー.
001810       05 作２－施術和暦年月.
001820          07 作２－施術和暦                PIC 9.
001830          07 作２－施術年月.
001840             09 作２－施術年               PIC 9(2).
001850             09 作２－施術月               PIC 9(2).
001860       05 作２－患者コード.
001870          07 作２－患者番号                PIC 9(6).
001880          07 作２－枝番                    PIC X(1).
001890    03 作２－レコードデータ.
001900       05 作２－請求開始和暦年月.
001910          07 作２－開始和暦                PIC 9.
001920          07 作２－開始年月.
001930             09 作２－開始年               PIC 9(2).
001940             09 作２－開始月               PIC 9(2).
001950             09 作２－開始日               PIC 9(2).
001960       05 作２－請求終了和暦年月.
001970          07 作２－終了和暦                PIC 9.
001980          07 作２－終了年月.
001990             09 作２－終了年               PIC 9(2).
002000             09 作２－終了月               PIC 9(2).
002010             09 作２－終了日               PIC 9(2).
002020       05 作２－請求期間                   PIC 9(2).
002030       05 作２－施術回数                   PIC 9(2).
002040       05 作２－費用額                     PIC 9(6).
002050       05 作２－請求額                     PIC 9(6).
002060       05 作２－負担金                     PIC 9(5).
002070       05 作２－転帰                       OCCURS 4.
002080          07 作２－転帰区分                PIC N(1).
002090       05 作２－初検計                     PIC 9(5).
002100       05 作２－整復計                     PIC 9(5).
002110       05 作２－後療計                     PIC 9(5).
002120       05 作２－罨法計                     PIC 9(5).
002130       05 作２－電療計                     PIC 9(5).
002140       05 作２－負担計                     PIC 9(5).
             05 作２－相談料計                   PIC 9(4).
002150       05 FILLER                           PIC X(39).
002160*
002170*----------------------------------------------------------------*
002180******************************************************************
002190*                WORKING-STORAGE SECTION                         *
002200******************************************************************
002210 WORKING-STORAGE         SECTION.
002220 01 キー入力                           PIC X    VALUE SPACE.
002230 01 状態キー                           PIC X(2) VALUE SPACE.
002240 01 終了フラグ                         PIC X(3) VALUE SPACE.
002250 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002260 01 終了フラグ３                       PIC X(3) VALUE SPACE.
002270 01 ファイル名                         PIC N(2) VALUE SPACE.
002280 01 実行キーＷ                         PIC X(4) VALUE SPACE.
002290 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002300 01 継続フラグ                         PIC X(3) VALUE SPACE.
002310 01 対象フラグ                         PIC X(3) VALUE SPACE.
002320 01 部位ＣＮＴ                         PIC 9    VALUE ZERO.
002330 01 カウンタ                           PIC 9    VALUE ZERO.
002340 01 印刷ありフラグ                     PIC 9    VALUE ZERO.
002350 01 印刷フラグ                         PIC X(3) VALUE SPACE.
002360* **************
002370* * 項目待避用 
002380* **************
002390 01 待避項目ＷＲ.
002400    03 施術和暦年月ＷＲ.
002410       05 施術和暦ＷＲ                 PIC 9(1) VALUE ZERO.
002420       05 施術年ＷＲ                   PIC 9(2) VALUE ZERO.
002430       05 施術月ＷＲ                   PIC 9(2) VALUE ZERO.
002440    03 施術日ＷＲ                      PIC 9(2) VALUE ZERO.
002450    03 開始日ＷＰ                      PIC 9(2) VALUE ZERO.
002460    03 終了日ＷＰ                      PIC 9(2) VALUE ZERO.
002470    03 開始和暦年月日ＷＲ.
002480       05 開始和暦年月ＷＲ.
002490          07 開始和暦ＷＲ              PIC 9(1) VALUE ZERO.
002500          07 開始年ＷＲ                PIC 9(2) VALUE ZERO.
002510          07 開始月ＷＲ                PIC 9(2) VALUE ZERO.
002520       05 開始日ＷＲ                   PIC 9(2) VALUE ZERO.
002530    03 終了和暦年月日ＷＲ.
002540       05 終了和暦年月ＷＲ.
002550          07 終了和暦ＷＲ              PIC 9(1) VALUE ZERO.
002560          07 終了年ＷＲ                PIC 9(2) VALUE ZERO.
002570          07 終了月ＷＲ                PIC 9(2) VALUE ZERO.
002580       05 終了日ＷＲ                   PIC 9(2) VALUE ZERO.
002590    03 種別区分ＷＲ                    PIC X(4) VALUE SPACE.
002600    03 保険種別ＷＲ                    PIC 9(2) VALUE ZERO.
002610    03 患者コードＷＲ.
002620       05 患者番号ＷＲ                 PIC 9(6) VALUE ZERO.
002630       05 枝番ＷＲ                     PIC X(1) VALUE SPACE.
002640    03 本人家族区分ＷＲ                PIC 9(1) VALUE ZERO.
002650*
002660    03 印刷条件ＷＲ                    PIC 9(2) VALUE ZERO.
002670*
002680 01 公費負担者番号Ｗ.
002690    03 法別番号Ｗ                      PIC X(2) VALUE SPACE.
002700    03 FILLER                          PIC X(8) VALUE SPACE.
002710 01 退避項目ＧＷ.
002720   03 レセプト種類Ｗ                 PIC X(4).
002730   03 レセプト種類ＧＷ               PIC X(4).
002740   03 レセプト種別ＧＷ               PIC 9(2).
002750*
002760 01 明細.
002770    03 初検料ＷＲ                    PIC 9(4)  VALUE ZERO.
          03 相談料ＷＲ                    PIC 9(4)  VALUE ZERO.
002780    03 初検加算料ＷＲ                PIC 9(4)  VALUE ZERO.
002790    03 休日ＷＲ                      PIC 9     VALUE ZERO.
002800    03 深夜ＷＲ                      PIC 9     VALUE ZERO.
002810    03 時間外ＷＲ                    PIC 9     VALUE ZERO.
002820    03 診療時ＷＲ                    PIC 9(2)  VALUE ZERO.
002830    03 診療分ＷＲ                    PIC 9(2)  VALUE ZERO.
002840    03 再検料ＷＲ                    PIC 9(4)  VALUE ZERO.
002850    03 往療夜間ＷＲ                  PIC 9     VALUE ZERO.
002860    03 往療難路ＷＲ                  PIC 9     VALUE ZERO.
002870    03 往療暴風ＷＲ                  PIC 9     VALUE ZERO.
002880    03 往療回数ＷＲ                  PIC 9(2)  VALUE ZERO.
002890    03 往療距離ＷＲ                  PIC 9(3)V9 VALUE ZERO.
002900    03 往療料ＷＲ                    PIC 9(6)  VALUE ZERO.
002910    03 往療加算料ＷＲ                PIC 9(5)  VALUE ZERO.
002920    03 電罨料ＷＲ                    PIC 9(4)  VALUE ZERO.
002930    03 一部負担金ＷＲ                PIC 9(5)  VALUE ZERO.
002940    03 金属副子加算料ＷＲ            PIC 9(5)  VALUE ZERO.
003140    03 運動後療料ＷＲ                PIC 9(4)  VALUE ZERO.
002950    03 施術情報提供料ＷＲ            PIC 9(6)  VALUE ZERO.
002960    03 部位Ｗ                        OCCURS 4.
002970       05 初回処置料ＷＲ             PIC 9(4)  VALUE ZERO.
002980       05 後療料ＷＲ                 PIC 9(4)  VALUE ZERO.
002990       05 冷罨料ＷＲ                 PIC 9(4)  VALUE ZERO.
003000       05 温罨料ＷＲ                 PIC 9(4)  VALUE ZERO.
003010       05 電療料ＷＲ                 PIC 9(4)  VALUE ZERO.
003020       05 部位計ＷＲ                 PIC 9(4)  VALUE ZERO.
003030       05 金属ＷＲ                   PIC 9     VALUE ZERO.
003040    03 日数ＷＲ                      PIC 9(2)  OCCURS 5 VALUE ZERO.
003050    03 冷罨法料３０ＷＲ              PIC 9(4)  VALUE ZERO.
003060    03 冷罨法料３８ＷＲ              PIC 9(4)  VALUE ZERO.
003070    03 冷罨法料４０ＷＲ              PIC 9(4)  VALUE ZERO.
003080    03 冷罨法料４５ＷＲ              PIC 9(4)  VALUE ZERO.
003090    03 冷罨法料４８ＷＲ              PIC 9(4)  VALUE ZERO.
003100    03 温罨法料３０ＷＲ              PIC 9(4)  VALUE ZERO.
003110    03 温罨法料３８ＷＲ              PIC 9(4)  VALUE ZERO.
003120    03 温罨法料４０ＷＲ              PIC 9(4)  VALUE ZERO.
003130    03 温罨法料４５ＷＲ              PIC 9(4)  VALUE ZERO.
003140    03 温罨法料４８ＷＲ              PIC 9(4)  VALUE ZERO.
003150    03 電療料３０ＷＲ                PIC 9(4)  VALUE ZERO.
003160    03 電療料３８ＷＲ                PIC 9(4)  VALUE ZERO.
003170    03 電療料４０ＷＲ                PIC 9(4)  VALUE ZERO.
003180    03 電療料４５ＷＲ                PIC 9(4)  VALUE ZERO.
003190    03 電療料４８ＷＲ                PIC 9(4)  VALUE ZERO.
003200    03 後療料３０ＷＲ                PIC 9(4)  VALUE ZERO.
003210    03 後療料３８ＷＲ                PIC 9(4)  VALUE ZERO.
003220    03 後療料４０ＷＲ                PIC 9(4)  VALUE ZERO.
003230    03 後療料４５ＷＲ                PIC 9(4)  VALUE ZERO.
003240    03 後療料４８ＷＲ                PIC 9(4)  VALUE ZERO.
003250    03 冷罨料計ＷＲ                  PIC 9(4)  VALUE ZERO.
003260    03 温罨料計ＷＲ                  PIC 9(4)  VALUE ZERO.
003270    03 電療料計ＷＲ                  PIC 9(4)  VALUE ZERO.
003280*
003290 01 集計Ｗ.
003300    03 初検計Ｗ                      PIC 9(5)  VALUE ZERO.
003310    03 整復計Ｗ                      PIC 9(5)  VALUE ZERO.
003320    03 一部負担金計Ｗ                PIC 9(5)  VALUE ZERO.
003330    03 後療計Ｗ                      PIC 9(5)  VALUE ZERO.
003340    03 罨法計Ｗ                      PIC 9(5)  VALUE ZERO.
003350    03 電療計Ｗ                      PIC 9(5)  VALUE ZERO.
          03 相談料計Ｗ                    PIC 9(4)  VALUE ZERO.
003360** 月末日用
003370 01 施術西暦年Ｗ                       PIC 9(4)  VALUE ZERO.
003380 01 商Ｗ                               PIC 9(3)  VALUE ZERO.
003390 01 余Ｗ                               PIC 9(3)  VALUE ZERO.
003400*
003410*/デバック用
003420 01 時刻.
003430   03 時 PIC 9(2) VALUE ZERO.
003440   03 分 PIC 9(2) VALUE ZERO.
003450   03 秒 PIC 9(2) VALUE ZERO.
003460 01 時刻Ｗ PIC 9(6) VALUE ZERO.
003470******************************************************************
003480*                          連結項目                              *
003490******************************************************************
003500*
003510************
003520* 入力キー *
003530************
003540*
003550 01 連入－入力データＹＡＳ７２０ IS EXTERNAL.
003560    03 連入－開始和暦年月日.
003570       05 連入－開始和暦                  PIC 9(1).
003580       05 連入－開始年                    PIC 9(2).
003590       05 連入－開始月                    PIC 9(2).
003600       05 連入－開始日                    PIC 9(2).
003610    03 連入－終了和暦年月日.
003620       05 連入－終了和暦                  PIC 9(1).
003630       05 連入－終了年                    PIC 9(2).
003640       05 連入－終了月                    PIC 9(2).
003650       05 連入－終了日                    PIC 9(2).
003670    03 連入－保険種別                     PIC 9(2).
003680    03 連入－本人家族区分                 PIC 9(1).
003690    03 連入－患者コード.
003700       05 連入－患者番号                  PIC 9(6).
003710       05 連入－枝番                      PIC X(1).
003720*
003730    03 連入－印刷条件                     PIC 9(2).
004080    03 連入－印刷モード                   PIC X(4).
002870************
002880* 印刷キー *
002890************
002900 01 連印－対象データＹＡＳ７２０ IS EXTERNAL.
003120    03 連印－施術和暦年月日.
003130       05 連印－施術和暦                  PIC 9(1).
003140       05 連印－施術年                    PIC 9(2).
003150       05 連印－施術月                    PIC 9(2).
003190    03 連印－患者コード.
003200       05 連印－患者番号                  PIC 9(6).
003210       05 連印－枝番                      PIC X(1).
003020    03 連印－氏名モード                   PIC 9(1).
003020    03 連印－バーコードモード             PIC 9(1).
003020    03 連印－合計モード                   PIC 9(1).
003020    03 連印－明細モード                   PIC 9(1).
003020    03 連印－コメントモード               PIC 9(1).
003020    03 連印－初検時相談支援               PIC 9(1).
          03 連印－読み順                       PIC X(4).
003070    03 連印－処理キー                     PIC X(4).
006990*
007000 01 連レ－キー IS EXTERNAL.
007010    03 連レ－保険種別                  PIC 9(2).
007020*
007030**********************
007040* メッセージ表示キー *
007050**********************
007060 01 連メ－キー IS EXTERNAL.
007070    03  連メ－メッセージ                 PIC N(20).
007089*
007090******************************************************************
007091*                      PROCEDURE  DIVISION                       *
007100******************************************************************
007110 PROCEDURE               DIVISION.
007120************
007130*           *
007140* 初期処理   *
007150*           *
007160************
007170     PERFORM 初期化.
007180************
007190*           *
007200* 主処理     *
007210*           *
007220************
007230     MOVE ZERO TO 印刷ありフラグ.
      */指定モードで氏名、バーコードのみ印刷の場合は通院日がなくても対象に。030314
           IF (連入－印刷モード     = "SITE") AND
              (連印－明細モード     = ZERO)   AND
              (連印－合計モード     = ZERO)   AND
              (連印－コメントモード = ZERO)
               PERFORM 氏名バーコードファイル作成
           ELSE
               PERFORM 作業ファイル作成
           END-IF.
007330     IF 印刷ありフラグ = ZERO
      */バーコードモードの場合はエラー表示をしない。0301
               IF 連入－印刷モード NOT = "BARC"
007340             MOVE  NC"　印刷の対象になるデータがありません。" TO 連メ－メッセージ
007350             CALL   "MSG001"
007360             CANCEL "MSG001"
               END-IF
007370         MOVE 01   TO PROGRAM-STATUS
007380     ELSE
007390         MOVE ZERO TO PROGRAM-STATUS
           END-IF.
007410************
007420*           *
007430* 終了処理   *
007440*           *
007450************
007460     PERFORM 終了処理.
007480     EXIT PROGRAM.
007490*
007500*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
007510*================================================================*
007520 初期化 SECTION.
007530*
007540     PERFORM ファイルオープン.
007550* 連結項目の待避
007560     INITIALIZE 待避項目ＷＲ.
007580     MOVE 連入－保険種別      TO 保険種別ＷＲ.
007590     MOVE 連入－患者番号      TO 患者番号ＷＲ.
007600     MOVE 連入－枝番          TO 枝番ＷＲ.
007610     MOVE 連入－開始和暦      TO 開始和暦ＷＲ.
007620     MOVE 連入－開始年        TO 開始年ＷＲ.
007630     MOVE 連入－開始月        TO 開始月ＷＲ.
007640     MOVE 連入－開始日        TO 開始日ＷＲ.
007650     MOVE 連入－終了和暦      TO 終了和暦ＷＲ.
007660     MOVE 連入－終了年        TO 終了年ＷＲ.
007670     MOVE 連入－終了月        TO 終了月ＷＲ.
007680     MOVE 連入－終了日        TO 終了日ＷＲ.
007690     MOVE 連入－本人家族区分  TO 本人家族区分ＷＲ.
007700*
007710     MOVE 連入－印刷条件      TO 印刷条件ＷＲ.
007720*================================================================*
007730 ファイルオープン SECTION.
007740*
007750     OPEN INPUT   元号マスタ
007760         MOVE NC"元号" TO ファイル名.
007770         PERFORM オープンチェック.
007780     OPEN INPUT 受診者情報Ｆ.
007790         MOVE NC"受診者情報Ｆ" TO ファイル名.
007800         PERFORM オープンチェック.
007810     OPEN INPUT 負傷データＦ.
007820         MOVE NC"負傷データＦ" TO ファイル名.
007830         PERFORM オープンチェック.
007870     OPEN INPUT レセプトＦ.
007880         MOVE NC"レセ"         TO ファイル名.
007890         PERFORM オープンチェック.
003060     OPEN INPUT 会計データＦ.
003070         MOVE NC"会計" TO ファイル名.
003080         PERFORM オープンチェック.
007840     OPEN INPUT 施術記録Ｆ.
007850         MOVE NC"施術記録Ｆ"   TO ファイル名.
007860         PERFORM オープンチェック.
007870     OPEN INPUT メモファイル.
007880         MOVE NC"メモ"         TO ファイル名.
007890         PERFORM オープンチェック.
007900*================================================================*
007910 オープンチェック SECTION.
007920*
007930     IF 状態キー  NOT =  "00"
007940         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
007950         DISPLAY NC"状態キー：" 状態キー         UPON CONS
007960         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
007970                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
007980         ACCEPT  キー入力 FROM CONS
007990         PERFORM ファイル閉鎖
008000         MOVE 99 TO PROGRAM-STATUS
008010         EXIT PROGRAM.
008020*================================================================*
008030 ファイル閉鎖 SECTION.
008040*
008050     CLOSE 元号マスタ  受診者情報Ｆ 負傷データＦ 施術記録Ｆ
008060           レセプトＦ  会計データＦ メモファイル.
008070*================================================================*
008080 終了処理 SECTION.
008090*
008100     PERFORM ファイル閉鎖.
008110*================================================================*
008120 エラー表示 SECTION.
008130*
008140     DISPLAY NC"状態キー" 状態キー  UPON CONS.
008150     DISPLAY NC"５ファイル書込エラー：" ファイル名   UPON CONS.
008160     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
008170     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003131*-----------------------------------------*
003132     CALL "actcshm"  WITH C LINKAGE.
003133*-----------------------------------------*
008180     ACCEPT  キー入力 FROM CONS.
008190     PERFORM ファイル閉鎖.
008200     MOVE 99 TO PROGRAM-STATUS.
008210     EXIT PROGRAM.
008220*================================================================*
008230 受診者情報Ｆ読込 SECTION.
008240*
008250     READ 受診者情報Ｆ NEXT
008260     AT END
008270         MOVE "YES" TO 終了フラグ
008280     END-READ.
008290*================================================================*
008300 作業ファイル作成 SECTION.
008310*
008320     OPEN OUTPUT 作業ファイル１
008330          MOVE NC"作１" TO ファイル名
008340          PERFORM オープンチェック
008350     OPEN OUTPUT 作業ファイル２
008360          MOVE NC"作２" TO ファイル名
008370          PERFORM オープンチェック
008380*
008390     MOVE 開始和暦ＷＲ      TO 受－施術和暦.
008400     MOVE 開始年ＷＲ        TO 受－施術年.
008410     MOVE 開始月ＷＲ        TO 受－施術月.
008420     MOVE SPACE             TO 受－患者カナ.
008430     MOVE SPACE             TO 受－患者コード.
008440     START 受診者情報Ｆ   KEY IS >= 受－施術和暦年月
008450                                    受－患者カナ
008460                                    受－患者コード
           END-START.
008470     IF 状態キー = "00"
008480         MOVE SPACE  TO 終了フラグ
008490         PERFORM 受診者情報Ｆ読込
008500         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008510                       ( 受－施術和暦年月 > 終了和暦年月ＷＲ )
008520*/印刷対象条件の判定
008530                 IF ((保険種別ＷＲ     NOT = ZERO)              AND
008540                     (保険種別ＷＲ     NOT = 受－保険種別))     OR
008550*/患者指定時、枝番も含まれてしまう為変更20304
008560*                    ((患者番号ＷＲ     NOT = ZERO)              AND
008570*                     (患者番号ＷＲ     NOT = 受－患者番号))     OR
008580*                    ((枝番ＷＲ         NOT = SPACE)             AND
008590*                     (枝番ＷＲ         NOT = 受－枝番))         OR
008600                    ((患者番号ＷＲ    NOT = ZERO)               AND
008610                     (患者コードＷＲ   NOT = 受－患者コード))   OR
008620                    ((本人家族区分ＷＲ NOT = ZERO)              AND
008630                     (本人家族区分ＷＲ NOT = 受－本人家族区分)) OR
008640                     (受－保険種別         = 70 OR 80 OR 90)
008650*/対象外
008660                     CONTINUE
008670                 ELSE
008680*/印刷条件ＷＲ←保留
008690                     MOVE "YES" TO 対象フラグ
008700                     IF 印刷条件ＷＲ NOT = ZERO
008710                         PERFORM 印刷条件判定
008720                     END-IF
008730                     IF 対象フラグ = "YES"
008740                         PERFORM データチェック
008750                         IF 実行キーＷ = "YES"
008760                             MOVE 受－施術和暦年月 TO 施術和暦年月ＷＲ
008770                             IF 受－施術和暦年月 = 開始和暦年月ＷＲ
008780                                 MOVE 開始日ＷＲ TO 開始日ＷＰ
008790                             ELSE
008800                                 MOVE 1          TO 開始日ＷＰ
008810                             END-IF
008820                             IF 受－施術和暦年月 = 終了和暦年月ＷＲ
008830                                 MOVE 終了日ＷＲ TO 終了日ＷＰ
008840                             ELSE
008850                                 PERFORM 月末日取得
008860                             END-IF
008870                             PERFORM 作１レコードセット
008880*/対象データのみ計算するように変更
008890                             IF 印刷フラグ = "YES"
008900                                 PERFORM 作２レコードセット
008910                             END-IF
008920                         END-IF
008930                     END-IF
008940                 END-IF
008950                 PERFORM 受診者情報Ｆ読込
008960         END-PERFORM
008970     END-IF.
008980     CLOSE 作業ファイル１ 作業ファイル２.
008990*================================================================*
009000 作１レコードセット SECTION.
009010*
009020     MOVE SPACE TO 印刷フラグ.
009030     INITIALIZE 作１－レコード.
009040     MOVE 受－保険種別     TO 作１－保険種別.
009050     MOVE 受－公費種別     TO 作１－公費種別.
009060     MOVE 受－助成種別     TO 作１－助成種別.
009070     MOVE 受－保険者番号   TO 作１－保険者番号.
009080     MOVE 受－本人家族区分 TO 作１－本人家族区分.
009090     MOVE 受－被保険者カナ TO 作１－被保険者カナ.
009100     MOVE 受－患者コード   TO 作１－患者コード.
009110     MOVE 受－患者カナ     TO 作１－患者カナ.
009120     MOVE 受－患者氏名     TO 作１－患者氏名.
009150     PERFORM VARYING 施術日ＷＲ FROM 開始日ＷＰ BY 1
009160             UNTIL ( 施術日ＷＲ > 終了日ＷＰ )
009170         INITIALIZE 作１－料金
009180         MOVE 受－患者番号  TO 施記－患者番号
009190         MOVE 受－枝番      TO 施記－枝番
009200         MOVE 受－施術和暦  TO 施記－施術和暦
009210         MOVE 受－施術年    TO 施記－施術年
009220         MOVE 受－施術月    TO 施記－施術月
009230         MOVE 施術日ＷＲ    TO 施記－施術日
009240         READ 施術記録Ｆ
009250         NOT INVALID KEY
009260*/対象データのみ計算するように変更
009270             IF 印刷フラグ = SPACE
009280                 PERFORM レセプト呼出し２
009290                 MOVE レセ－負担割合 TO 作１－負担割合
009292*
009300             END-IF
009310             MOVE "YES" TO 印刷フラグ
009320*
009330             PERFORM レセプト呼出し１
009340             PERFORM 料金情報取得
009350             PERFORM 項目ごと計算
009360             PERFORM 作業ファイルセット
009370             PERFORM 作１レコード書込
009380         END-READ
009390     END-PERFORM.
009411*================================================================*
009412 作業ファイルセット SECTION.
009420*
009430     MOVE 受－施術和暦       TO 作１－施術和暦 メモ－施術和暦.
009440     MOVE 受－施術年         TO 作１－施術年 メモ－施術年.
009450     MOVE 受－施術月         TO 作１－施術月 メモ－施術月.
009460     MOVE 施術日ＷＲ         TO 作１－施術日 メモ－施術日.
009470     MOVE 一部負担金ＷＲ     TO 作１－一部負担金.
009480     MOVE 1                  TO メモ－制御区分.
009490     MOVE 受－患者コード     TO メモ－患者コード.
009500     READ メモファイル
009510     NOT INVALID KEY
009520         MOVE メモ－施術コメント TO 作１－コメント
009530     END-READ.
      */明細行に費用額を印字0304
           MOVE レセ－合計         TO 作１－費用額.
009540*================================================================*
009550 作業２ファイルセット SECTION.
009560*
009570     MOVE 受－施術和暦       TO 作２－施術和暦.
009580     MOVE 受－施術年         TO 作２－施術年.
009590     MOVE 受－施術月         TO 作２－施術月.
009600     MOVE 初検計Ｗ           TO 作２－初検計.
009610     MOVE 整復計Ｗ           TO 作２－整復計.
009620     MOVE 後療計Ｗ           TO 作２－後療計.
009630     MOVE 罨法計Ｗ           TO 作２－罨法計.
009640     MOVE 電療計Ｗ           TO 作２－電療計.
009650     MOVE 一部負担金計Ｗ     TO 作２－負担計.
           MOVE 相談料計Ｗ         TO 作２－相談料計.
009660*================================================================*
009670 作２レコードセット SECTION.
009680*
009690     INITIALIZE 作２－レコード.
009700     MOVE SPACE TO 集計Ｗ.
009710     MOVE 受－患者コード   TO 作２－患者コード.
009720     PERFORM レセプト呼出し２.
009730     PERFORM 料金情報取得２.
009740     PERFORM VARYING 施術日ＷＲ FROM 1 BY 1
009750             UNTIL ( 施術日ＷＲ > 31 )
009760         INITIALIZE 作１－料金
009770         MOVE 受－患者番号  TO 施記－患者番号
009780         MOVE 受－枝番      TO 施記－枝番
009790         MOVE 受－施術和暦  TO 施記－施術和暦
009800         MOVE 受－施術年    TO 施記－施術年
009810         MOVE 受－施術月    TO 施記－施術月
009820         MOVE 施術日ＷＲ    TO 施記－施術日
009830         READ 施術記録Ｆ
009840         NOT INVALID KEY
009850             PERFORM レセプト呼出し１
009860             PERFORM 集計
009870         END-READ
009880     END-PERFORM.
009890     PERFORM 作業２ファイルセット.
009900     PERFORM 作２レコード書込.
009910*================================================================*
009920 レセプト呼出し１ SECTION.
009930*
009180     MOVE 受－患者番号  TO 会－患者番号.
009190     MOVE 受－枝番      TO 会－枝番.
009200     MOVE 受－施術和暦  TO 会－施術和暦.
009210     MOVE 受－施術年    TO 会－施術年.
009220     MOVE 受－施術月    TO 会－施術月.
009230     MOVE 施術日ＷＲ    TO 会－施術日.
009240     READ 会計データＦ
           INVALID KEY
               MOVE SPACE     TO 会－レコード
           END-READ.
009710*
009720*     IF  受－助成種別 NOT = ZERO
009730*         MOVE 会－助成計算負担額 TO 一部負担金ＷＲ
009740*     ELSE
009750         MOVE 会－一部負担金     TO 一部負担金ＷＲ.
009760*     END-IF.
010310*
010320*================================================================*
010330 レセプト呼出し２ SECTION.
010340*
0           IF 受－助成種別 NOT = ZERO
              MOVE  3   TO レセ－レセ種別
           ELSE
              IF 受－公費種別 NOT = ZERO
                 MOVE  2   TO レセ－レセ種別
              ELSE
                 IF 受－保険種別 = 85
                    MOVE  7   TO レセ－レセ種別
                 ELSE
                    MOVE  1   TO レセ－レセ種別
                 END-IF
              END-IF
           END-IF.
005200     MOVE 受－施術和暦  TO レセ－施術和暦.
005210     MOVE 受－施術年    TO レセ－施術年.  
005220     MOVE 受－施術月    TO レセ－施術月.  
005230     MOVE 受－患者番号  TO レセ－患者番号.
005240     MOVE 受－枝番      TO レセ－枝番.    
           READ レセプトＦ
           INVALID KEY
               MOVE SPACE     TO レセ－レコード
           END-READ.
010670*
011540*================================================================*
011550 料金情報取得 SECTION.
011560*
011570***********************************************
011580* 料金データセット                            *
011590***********************************************
011600*    ****************************************************************
011610*    * 料金（月毎）（負傷毎）（逓減毎）については連結項目よりセット *
011620*    ****************************************************************
011630     MOVE 1  TO カウンタ.
011640     MOVE 会－初検料             TO  初検料ＷＲ.
011690*
011700     MOVE 会－初検加算料         TO  初検加算料ＷＲ.
011710     MOVE 会－休日               TO  休日ＷＲ.
011760     MOVE 会－深夜               TO  深夜ＷＲ.
011810     MOVE 会－時間外             TO  時間外ＷＲ.
011860     MOVE 会－再検料             TO  再検料ＷＲ.
011910     MOVE 会－往療料             TO  往療料ＷＲ.
011960     MOVE 会－往療加算料         TO  往療加算料ＷＲ.
011970     MOVE 会－夜間               TO  往療夜間ＷＲ.
012020     MOVE 会－難路               TO  往療難路ＷＲ.
012070     MOVE 会－暴風雨雪           TO  往療暴風ＷＲ.
012190     MOVE 会－施術情報提供料     TO  施術情報提供料ＷＲ.
      */初検時相談支援料/080618
           MOVE 会－初検時相談料       TO  相談料ＷＲ.
012240     COMPUTE 作１－初検金額 = 初検料ＷＲ + 初検加算料ＷＲ + 再検料ＷＲ + 往療料ＷＲ +
012250                              往療加算料ＷＲ + 施術情報提供料ＷＲ + 相談料ＷＲ.
012260*
012270*================================================================*
012280 料金情報取得２ SECTION.
012290*
012350     MOVE レセ－一部負担金   TO 作２－負担金.
012400     MOVE レセ－合計         TO 作２－費用額.
012410     MOVE レセ－請求金額     TO 作２－請求額.
012440     MOVE SPACE  TO 継続フラグ.
012450     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
012460               UNTIL (部位ＣＮＴ > 5)
012470         EVALUATE 負－転帰区分(部位ＣＮＴ)
012480         WHEN 1
012490             MOVE NC"治"  TO 作２－転帰区分(部位ＣＮＴ)
012500         WHEN 2
012510             MOVE NC"全"  TO 作２－転帰区分(部位ＣＮＴ)
012520         WHEN 3
012530             MOVE NC"中"  TO 作２－転帰区分(部位ＣＮＴ)
012540         WHEN 4
012550             MOVE NC"転"  TO 作２－転帰区分(部位ＣＮＴ)
012560         WHEN 5
012570             MOVE NC"自"  TO 作２－転帰区分(部位ＣＮＴ)
012580         WHEN 9
012590             MOVE NC"継"  TO 作２－転帰区分(部位ＣＮＴ)
012600             MOVE "YES" TO 継続フラグ
012610         END-EVALUATE
012620     END-PERFORM.
012630     MOVE レセ－レセ実日数   TO 作２－施術回数.
012640     MOVE 施術年ＷＲ     TO 作２－開始年.
012650     MOVE 施術月ＷＲ     TO 作２－開始月.
012660     IF 負－初検和暦年月 = 施術和暦年月ＷＲ
012670         MOVE 負－初検日 TO 作２－開始日
012680     ELSE
012690         MOVE 1          TO 作２－開始日
012700     END-IF.
012710     IF 継続フラグ = "YES"
012720         PERFORM 月末日取得
012730         MOVE 施術年ＷＲ   TO 作２－終了年
012740         MOVE 施術月ＷＲ   TO 作２－終了月
012750         MOVE 終了日ＷＰ   TO 作２－終了日
012760     ELSE
012770         PERFORM 最終通院日取得
012780     END-IF.
012790     COMPUTE 作２－請求期間 = 作２－終了日 - 作２－開始日 + 1.
012800*================================================================*
012810 項目ごと計算 SECTION.
012820***********************************************
012830* 料金データセット                            *
012840***********************************************
      */運動後療料/180518
012130     MOVE 会－金属副子加算料 TO 金属副子加算料ＷＲ.
015100     MOVE 会－運動後療料     TO 運動後療料ＷＲ.
013070     COMPUTE 作１－整復金額 = 会－初回処置料合計 + 金属副子加算料ＷＲ + 運動後療料ＷＲ.
013080*
013090     MOVE 会－後療料１     TO 後療料ＷＲ(1).
013100     MOVE 会－後療料２     TO 後療料ＷＲ(2).
013110     MOVE 会－後療料３８   TO 後療料３８ＷＲ.
013120     MOVE 会－後療料３０   TO 後療料３０ＷＲ.
013130     COMPUTE 後療料ＷＲ(3)   = 後療料３８ＷＲ   + 後療料３０ＷＲ.
013140     MOVE 会－後療料４５   TO 後療料４５ＷＲ.
013150     MOVE 会－後療料４８   TO 後療料４８ＷＲ.
013160     MOVE 会－後療料４０   TO 後療料４０ＷＲ.
013170     COMPUTE 後療料ＷＲ(4)   = 後療料４５ＷＲ   + 後療料４８ＷＲ   + 後療料４０ＷＲ.
013180     COMPUTE 作１－後療金額 = 後療料ＷＲ(1) + 後療料ＷＲ(2) + 後療料ＷＲ(3) + 後療料ＷＲ(4).
013680********************
013690* 逓減毎料金セット *
013700********************
013710     MOVE 会－冷罨法料１             TO 冷罨料ＷＲ(1).
013720     MOVE 会－冷罨法料２             TO 冷罨料ＷＲ(2).
013730     MOVE 会－冷罨法料３８           TO 冷罨法料３８ＷＲ.
013740     MOVE 会－冷罨法料３０           TO 冷罨法料３０ＷＲ.
013750     COMPUTE 冷罨料ＷＲ(3)   = 冷罨法料３８ＷＲ  + 冷罨法料３０ＷＲ.
013760     MOVE 会－冷罨法料４５           TO 冷罨法料４５ＷＲ.
013770     MOVE 会－冷罨法料４８           TO 冷罨法料４８ＷＲ.
013780     MOVE 会－冷罨法料４０           TO 冷罨法料４０ＷＲ.
013790     COMPUTE 冷罨料ＷＲ(4)   = 冷罨法料４５ＷＲ  + 冷罨法料４８ＷＲ  + 冷罨法料４０ＷＲ.
013800     COMPUTE 冷罨料計ＷＲ = 冷罨料ＷＲ(1) + 冷罨料ＷＲ(2) + 冷罨料ＷＲ(3) + 冷罨料ＷＲ(4).
014020*
014030     MOVE 会－温罨法料１             TO 温罨料ＷＲ(1).
014040     MOVE 会－温罨法料２             TO 温罨料ＷＲ(2).
014050     MOVE 会－温罨法料３８           TO 温罨法料３８ＷＲ.
014060     MOVE 会－温罨法料３０           TO 温罨法料３０ＷＲ.
014070     COMPUTE 温罨料ＷＲ(3)   = 温罨法料３８ＷＲ  + 温罨法料３０ＷＲ.
014080     MOVE 会－温罨法料４５           TO 温罨法料４５ＷＲ.
014090     MOVE 会－温罨法料４８           TO 温罨法料４８ＷＲ.
014100     MOVE 会－温罨法料４０           TO 温罨法料４０ＷＲ.
014110     COMPUTE 温罨料ＷＲ(4)   = 温罨法料４５ＷＲ  + 温罨法料４８ＷＲ  + 温罨法料４０ＷＲ.
014120     COMPUTE 温罨料計ＷＲ = 温罨料ＷＲ(1) + 温罨料ＷＲ(2) + 温罨料ＷＲ(3) + 温罨料ＷＲ(4).
014130     COMPUTE 作１－罨法金額 = 冷罨料計ＷＲ + 温罨料計ＷＲ.
014630*
014640     MOVE 会－電療料１             TO 電療料ＷＲ(1).
014650     MOVE 会－電療料２             TO 電療料ＷＲ(2).
014660     MOVE 会－電療料３８           TO 電療料３８ＷＲ.
014670     MOVE 会－電療料３０           TO 電療料３０ＷＲ.
014680     COMPUTE 電療料ＷＲ(3)  = 電療料３８ＷＲ  + 電療料３０ＷＲ.
014690     MOVE 会－電療料４５           TO 電療料４５ＷＲ.
014700     MOVE 会－電療料４８           TO 電療料４８ＷＲ.
014710     MOVE 会－電療料４０           TO 電療料４０ＷＲ.
014720     COMPUTE 電療料ＷＲ(4)  = 電療料４５ＷＲ  + 電療料４８ＷＲ  + 電療料４０ＷＲ.
014730     COMPUTE 作１－電療金額 = 電療料ＷＲ(1) + 電療料ＷＲ(2) + 電療料ＷＲ(3) + 電療料ＷＲ(4).
015230*
015240*================================================================*
015250 集計 SECTION.
015260***********************************************
015270* 料金データセット                            *
015280***********************************************
015290     MOVE 会－初検料             TO  初検料ＷＲ.
015300*
015310     MOVE 会－初検加算料         TO  初検加算料ＷＲ.
015320     MOVE 会－再検料             TO  再検料ＷＲ.
015330     MOVE 会－往療料             TO  往療料ＷＲ.
015340     MOVE 会－往療加算料         TO  往療加算料ＷＲ.
015350     MOVE 会－金属副子加算料     TO  金属副子加算料ＷＲ.
015100     MOVE 会－運動後療料         TO  運動後療料ＷＲ.
015360     MOVE 会－施術情報提供料     TO  施術情報提供料ＷＲ.
           MOVE 会－初検時相談料       TO  相談料ＷＲ.
015370     COMPUTE 初検計Ｗ = 初検計Ｗ + 初検料ＷＲ + 初検加算料ＷＲ + 再検料ＷＲ + 往療料ＷＲ +
015380                        往療加算料ＷＲ + 金属副子加算料ＷＲ + 施術情報提供料ＷＲ +
                              相談料ＷＲ + 運動後療料ＷＲ.
015390*
015400     COMPUTE 整復計Ｗ = 整復計Ｗ + 会－初回処置料合計.
015410*
015420     MOVE 会－後療料１     TO 後療料ＷＲ(1).
015430     MOVE 会－後療料２     TO 後療料ＷＲ(2).
015440     MOVE 会－後療料３８   TO 後療料３８ＷＲ.
015450     MOVE 会－後療料３０   TO 後療料３０ＷＲ.
015460     COMPUTE 後療料ＷＲ(3)   = 後療料３８ＷＲ   + 後療料３０ＷＲ.
015470     MOVE 会－後療料４５   TO 後療料４５ＷＲ.
015480     MOVE 会－後療料４８   TO 後療料４８ＷＲ.
015490     MOVE 会－後療料４０   TO 後療料４０ＷＲ.
015500     COMPUTE 後療料ＷＲ(4)   = 後療料４５ＷＲ   + 後療料４８ＷＲ   + 後療料４０ＷＲ.
015510     COMPUTE 後療計Ｗ = 後療計Ｗ + 後療料ＷＲ(1) + 後療料ＷＲ(2) + 後療料ＷＲ(3) + 後療料ＷＲ(4).
015520********************
015530* 逓減毎料金セット *
015540********************
015550     MOVE 会－冷罨法料１             TO 冷罨料ＷＲ(1).
015560     MOVE 会－冷罨法料２             TO 冷罨料ＷＲ(2).
015570     MOVE 会－冷罨法料３８           TO 冷罨法料３８ＷＲ.
015580     MOVE 会－冷罨法料３０           TO 冷罨法料３０ＷＲ.
015590     COMPUTE 冷罨料ＷＲ(3)   = 冷罨法料３８ＷＲ  + 冷罨法料３０ＷＲ.
015600     MOVE 会－冷罨法料４５           TO 冷罨法料４５ＷＲ.
015610     MOVE 会－冷罨法料４８           TO 冷罨法料４８ＷＲ.
015620     MOVE 会－冷罨法料４０           TO 冷罨法料４０ＷＲ.
015630     COMPUTE 冷罨料ＷＲ(4)   = 冷罨法料４５ＷＲ  + 冷罨法料４８ＷＲ  + 冷罨法料４０ＷＲ.
015640     COMPUTE 冷罨料計ＷＲ = 冷罨料ＷＲ(1) + 冷罨料ＷＲ(2) + 冷罨料ＷＲ(3) + 冷罨料ＷＲ(4).
015650*
015660     MOVE 会－温罨法料１             TO 温罨料ＷＲ(1).
015670     MOVE 会－温罨法料２             TO 温罨料ＷＲ(2).
015680     MOVE 会－温罨法料３８           TO 温罨法料３８ＷＲ.
015690     MOVE 会－温罨法料３０           TO 温罨法料３０ＷＲ.
015700     COMPUTE 温罨料ＷＲ(3)   = 温罨法料３８ＷＲ  + 温罨法料３０ＷＲ.
015710     MOVE 会－温罨法料４５           TO 温罨法料４５ＷＲ.
015720     MOVE 会－温罨法料４８           TO 温罨法料４８ＷＲ.
015730     MOVE 会－温罨法料４０           TO 温罨法料４０ＷＲ.
015740     COMPUTE 温罨料ＷＲ(4)   = 温罨法料４５ＷＲ  + 温罨法料４８ＷＲ  + 温罨法料４０ＷＲ.
015750     COMPUTE 温罨料計ＷＲ = 温罨料ＷＲ(1) + 温罨料ＷＲ(2) + 温罨料ＷＲ(3) + 温罨料ＷＲ(4).
015760     COMPUTE 罨法計Ｗ = 罨法計Ｗ + 冷罨料計ＷＲ + 温罨料計ＷＲ.
015770*
015780     MOVE 会－電療料１             TO 電療料ＷＲ(1).
015790     MOVE 会－電療料２             TO 電療料ＷＲ(2).
015800     MOVE 会－電療料３８           TO 電療料３８ＷＲ.
015810     MOVE 会－電療料３０           TO 電療料３０ＷＲ.
015820     COMPUTE 電療料ＷＲ(3)  = 電療料３８ＷＲ  + 電療料３０ＷＲ.
015830     MOVE 会－電療料４５           TO 電療料４５ＷＲ.
015840     MOVE 会－電療料４８           TO 電療料４８ＷＲ.
015850     MOVE 会－電療料４０           TO 電療料４０ＷＲ.
015860     COMPUTE 電療料ＷＲ(4)  = 電療料４５ＷＲ  + 電療料４８ＷＲ  + 電療料４０ＷＲ.
015870     COMPUTE 電療計Ｗ = 電療計Ｗ + 電療料ＷＲ(1) + 電療料ＷＲ(2) + 電療料ＷＲ(3) + 電療料ＷＲ(4).
015880*
015890     COMPUTE 一部負担金計Ｗ = 一部負担金計Ｗ + 一部負担金ＷＲ.
015900*
      */初検時相談料
           COMPUTE 相談料計Ｗ = 相談料計Ｗ + 相談料ＷＲ.
015910*================================================================*
015920 作１レコード書込 SECTION.
015930*
015940     WRITE 作１－レコード
015950     INVALID KEY
015960         MOVE NC"作１"  TO ファイル名
015970         PERFORM エラー表示
015980     END-WRITE.
015990     MOVE 1 TO 印刷ありフラグ.
016000*================================================================*
016010 作２レコード書込 SECTION.
016020*
016030     WRITE 作２－レコード
016040     INVALID KEY
016050         MOVE NC"作２"  TO ファイル名
016060         PERFORM エラー表示
016070     END-WRITE.
016080*================================================================*
016090 データチェック SECTION.
016100*
016110     MOVE SPACE          TO 実行キーＷ.
016120* *****************************************************************
016130* * 負傷部位有無チェック：部位数 = 0 の場合データ作成対象としない *
016140* *****************************************************************
016150     MOVE 受－施術和暦   TO 負－施術和暦.
016160     MOVE 受－施術年     TO 負－施術年.
016170     MOVE 受－施術月     TO 負－施術月.
016180     MOVE 受－患者番号   TO 負－患者番号.
016190     MOVE 受－枝番       TO 負－枝番.
016200     READ 負傷データＦ
016210     INVALID KEY
016220         MOVE SPACE  TO 実行キーＷ
016230     NOT INVALID KEY
016240         IF 負－部位数 NOT = ZERO
016250*        *************************************************************
016260*        * 施術記録チェック：通院数 = 0 の場合データ作成対象としない *
016270*        *************************************************************
016280             MOVE 負－患者番号  TO 施記－患者番号
016290             MOVE 負－枝番      TO 施記－枝番
016300             MOVE 負－施術和暦  TO 施記－施術和暦
016310             MOVE 負－施術年    TO 施記－施術年
016320             MOVE 負－施術月    TO 施記－施術月
016330             MOVE ZERO          TO 施記－施術日
016340             START 施術記録Ｆ   KEY IS >= 施記－患者コード
016350                                          施記－施術和暦年月日
016360             END-START
016370             IF 状態キー = "00"
016380                 MOVE SPACE TO 終了フラグ２
016390                 MOVE SPACE TO 施術記録有Ｗ
016400                 PERFORM 施術記録Ｆ読込
016410                 PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
016420                               (施記－患者コード NOT = 負－患者コード) OR
016430                               (施記－施術和暦   NOT = 負－施術和暦  ) OR
016440                               (施記－施術年     NOT = 負－施術年    ) OR
016450                               (施記－施術月     NOT = 負－施術月    ) OR
016460                               (施術記録有Ｗ         = "YES"         )
016470                     MOVE "YES"  TO 施術記録有Ｗ
016480                     MOVE "YES"  TO 実行キーＷ
016490                 END-PERFORM
016500             ELSE
016510                 MOVE SPACE  TO 実行キーＷ
016520             END-IF
016530         ELSE
016540             MOVE SPACE  TO 実行キーＷ
016550         END-IF
016560     END-READ.
016570*
016580*================================================================*
016590 施術記録Ｆ読込 SECTION.
016600*
016610     READ 施術記録Ｆ NEXT
016620     AT END
016630         MOVE "YES"  TO 終了フラグ２
016640     END-READ.
016650*================================================================*
016660 印刷条件判定 SECTION.
016670*
016680     MOVE SPACE TO 対象フラグ
016690*/労災自賠責のデータは対象外
016700     IF 受－保険種別 NOT = 70 AND 80
016710         EVALUATE 印刷条件ＷＲ
016720         WHEN 01
016730             PERFORM 初検判定
016740         WHEN 02
016750             PERFORM 後療のみ判定
016760         WHEN 03
016770             PERFORM 終了判定
016780         WHEN 04
016790             PERFORM 初検判定
016800             IF 対象フラグ = "YES"
016810                 PERFORM 終了判定
016820             END-IF
016830         WHEN OTHER
016840             CONTINUE
016850         END-EVALUATE
016860     END-IF.
016870*================================================================*
016880 初検判定 SECTION.
016890*
016900     MOVE 受－患者番号  TO 施記－患者番号
016910     MOVE 受－枝番      TO 施記－枝番
016920     MOVE 受－施術和暦  TO 施記－施術和暦
016930     MOVE 受－施術年    TO 施記－施術年
016940     MOVE 受－施術月    TO 施記－施術月
016950     MOVE ZERO          TO 施記－施術日
016960     START 施術記録Ｆ   KEY IS >= 施記－患者コード
016970                                  施記－施術和暦年月日
016980     END-START
016990     IF 状態キー = "00"
017000         MOVE SPACE TO 終了フラグ２
017010         PERFORM 施術記録Ｆ読込
017020         PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
017030                       (施記－患者コード NOT = 受－患者コード) OR
017040                       (施記－施術和暦   NOT = 受－施術和暦  ) OR
017050                       (施記－施術年     NOT = 受－施術年    ) OR
017060                       (施記－施術月     NOT = 受－施術月    )
017070*
017080             IF 施記－診療区分 = 2
017090                 MOVE "YES" TO 対象フラグ
017100                 MOVE "YES" TO 終了フラグ２
017110             END-IF
017120             PERFORM 施術記録Ｆ読込
017130         END-PERFORM
017140     END-IF.
017150*================================================================*
017160 後療のみ判定 SECTION.
017170*
017180     MOVE 受－患者番号  TO 施記－患者番号
017190     MOVE 受－枝番      TO 施記－枝番
017200     MOVE 受－施術和暦  TO 施記－施術和暦
017210     MOVE 受－施術年    TO 施記－施術年
017220     MOVE 受－施術月    TO 施記－施術月
017230     MOVE ZERO          TO 施記－施術日
017240     START 施術記録Ｆ   KEY IS >= 施記－患者コード
017250                                  施記－施術和暦年月日
017260     END-START
017270     IF 状態キー = "00"
017280         MOVE SPACE TO 終了フラグ２
017290         PERFORM 施術記録Ｆ読込
017300         PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
017310                       (施記－患者コード NOT = 受－患者コード) OR
017320                       (施記－施術和暦   NOT = 受－施術和暦  ) OR
017330                       (施記－施術年     NOT = 受－施術年    ) OR
017340                       (施記－施術月     NOT = 受－施術月    )
017350*
017360             IF 施記－診療区分 = 1
017370                 MOVE "YES" TO 対象フラグ
017380             ELSE
017390                 MOVE SPACE TO 対象フラグ
017400                 MOVE "YES" TO 終了フラグ２
017410             END-IF
017420             PERFORM 施術記録Ｆ読込
017430         END-PERFORM
017440     END-IF.
017450*================================================================*
017460 終了判定 SECTION.
017470*
017480     MOVE "YES" TO 対象フラグ.
017490*
017500     MOVE 受－施術和暦   TO 負－施術和暦.
017510     MOVE 受－施術年     TO 負－施術年.
017520     MOVE 受－施術月     TO 負－施術月.
017530     MOVE 受－患者番号   TO 負－患者番号.
017540     MOVE 受－枝番       TO 負－枝番.
017550     READ 負傷データＦ
017560     INVALID KEY
017570         MOVE SPACE  TO 対象フラグ
017580     NOT INVALID KEY
017590         IF 負－部位数 = ZERO
017600             MOVE SPACE TO 対象フラグ
017610         ELSE
017620             PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
017630                      UNTIL (部位ＣＮＴ > 負－部位数)
017640                 IF 負－転帰区分(部位ＣＮＴ) = 9 OR 5
017650                     MOVE SPACE TO 対象フラグ
017660                 END-IF
017670             END-PERFORM
017680         END-IF
017690     END-READ.
017700*================================================================*
017710 月末日取得 SECTION.
017720*
017730     MOVE 施術和暦ＷＲ TO 元－元号区分.
017740     READ 元号マスタ
017750     NOT INVALID KEY
017760         MOVE 元－開始西暦年 TO 施術西暦年Ｗ
017770     END-READ.
017780     IF 施術西暦年Ｗ NOT = ZERO
017790        COMPUTE 施術西暦年Ｗ = 施術西暦年Ｗ + 施術年ＷＲ - 1
017800     END-IF.
017810*
017820     EVALUATE 施術月ＷＲ
017830     WHEN 4
017840     WHEN 6
017850     WHEN 9
017860     WHEN 11
017870         MOVE 30 TO 終了日ＷＰ
017880     WHEN 2
017890         DIVIDE 4 INTO 施術西暦年Ｗ GIVING    商Ｗ
017900                                    REMAINDER 余Ｗ
017910         END-DIVIDE
017920         IF 余Ｗ = ZERO
017930             MOVE 29 TO 終了日ＷＰ
017940         ELSE
017950             MOVE 28 TO 終了日ＷＰ
017960         END-IF
017970     WHEN 1
017980     WHEN 3
017990     WHEN 5
018000     WHEN 7
018010     WHEN 8
018020     WHEN 10
018030     WHEN 12
018040         MOVE 31 TO 終了日ＷＰ
018050     WHEN OTHER
018060          CONTINUE
018070     END-EVALUATE.
018080*
018090*================================================================*
018100 最終通院日取得 SECTION.
018110     MOVE ZERO          TO 作２－終了年.
018120     MOVE ZERO          TO 作２－終了月.
018130     MOVE ZERO          TO 作２－終了日.
018140     MOVE 受－患者番号  TO 施記－患者番号.
018150     MOVE 受－枝番      TO 施記－枝番.
018160     MOVE 施術和暦ＷＲ  TO 施記－施術和暦.
018170     MOVE 施術年ＷＲ    TO 施記－施術年.
018180     MOVE 施術月ＷＲ    TO 施記－施術月.
018190     MOVE 31            TO 施記－施術日.
018200*
018210     START 施術記録Ｆ   KEY IS <= 施記－患者コード
018220                                  施記－施術和暦年月日
018230                                  REVERSED
018240     END-START.
018250*
018260     IF 状態キー = "00"
018270         MOVE SPACE  TO 終了フラグ２
018280         PERFORM 施術記録Ｆ読込
018290         IF ( 施記－患者番号 = 受－患者番号 ) AND ( 施記－枝番 = 受－枝番 ) AND 
018300            ( 施記－施術和暦 = 施術和暦ＷＲ ) AND ( 施記－施術年 = 施術年ＷＲ ) AND
018310            ( 施記－施術月 = 施術月ＷＲ )     AND ( 終了フラグ２ = SPACE )
018320             MOVE  施記－施術年  TO  作２－終了年
018330             MOVE  施記－施術月  TO  作２－終了月
018340             MOVE  施記－施術日  TO  作２－終了日
018350         END-IF
018360     END-IF.
018420*================================================================*
       氏名バーコードファイル作成 SECTION.
      *
008320     OPEN OUTPUT 作業ファイル１
008330          MOVE NC"作１" TO ファイル名
008340          PERFORM オープンチェック
      */相談支援の為作業ファイル２を作成する/090703
008350     OPEN OUTPUT 作業ファイル２
008360          MOVE NC"作２" TO ファイル名
008370          PERFORM オープンチェック
      *
008390     MOVE 開始和暦ＷＲ      TO 受－施術和暦.
008400     MOVE 開始年ＷＲ        TO 受－施術年.
008410     MOVE 開始月ＷＲ        TO 受－施術月.
008420     MOVE SPACE             TO 受－患者カナ.
008430     MOVE SPACE             TO 受－患者コード.
008440     START 受診者情報Ｆ   KEY IS >= 受－施術和暦年月
008450                                    受－患者カナ
008460                                    受－患者コード
           END-START.
008470     IF 状態キー = "00"
008480         MOVE SPACE  TO 終了フラグ
008490         PERFORM 受診者情報Ｆ読込
008500         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008510                       ( 受－施術和暦年月 > 終了和暦年月ＷＲ )
008520*/印刷対象条件の判定
008530             IF ((保険種別ＷＲ     NOT = ZERO)              AND
008540                 (保険種別ＷＲ     NOT = 受－保険種別))     OR
008600                ((患者番号ＷＲ     NOT = ZERO)              AND
008610                 (患者コードＷＲ   NOT = 受－患者コード))   OR
008620                ((本人家族区分ＷＲ NOT = ZERO)              AND
008630                 (本人家族区分ＷＲ NOT = 受－本人家族区分)) OR
008640                 (受－保険種別         = 70 OR 80 OR 90)
008650*/対象外
008660                 CONTINUE
008670             ELSE
008690                 MOVE "YES" TO 対象フラグ
008700                 IF 印刷条件ＷＲ NOT = ZERO
008710                     PERFORM 印刷条件判定
008720                 END-IF
008730                 IF 対象フラグ = "YES"
                           MOVE SPACE TO 印刷フラグ
                           INITIALIZE 作１－レコード
                           MOVE 受－保険種別     TO 作１－保険種別
                           MOVE 受－公費種別     TO 作１－公費種別
                           MOVE 受－助成種別     TO 作１－助成種別
                           MOVE 受－保険者番号   TO 作１－保険者番号
                           MOVE 受－本人家族区分 TO 作１－本人家族区分
                           MOVE 受－被保険者カナ TO 作１－被保険者カナ
                           MOVE 受－患者コード   TO 作１－患者コード
                           MOVE 受－患者カナ     TO 作１－患者カナ
                           MOVE 受－患者氏名     TO 作１－患者氏名
                           MOVE 受－施術和暦     TO 作１－施術和暦
                           MOVE 受－施術年       TO 作１－施術年
                           MOVE 受－施術月       TO 作１－施術月
                           MOVE ZERO             TO 作１－施術日
                           MOVE ZERO             TO 作１－一部負担金
                           MOVE SPACE            TO 作１－コメント
                           MOVE レセ－負担割合   TO 作１－負担割合
                           PERFORM 作１レコード書込
      */相談支援の為作業ファイル２を作成する/090703
                           IF 連印－初検時相談支援 NOT = ZERO
                               PERFORM 作２レコードセット
                           END-IF
008930                 END-IF
008940             END-IF
008950             PERFORM 受診者情報Ｆ読込
008960         END-PERFORM
008970     END-IF.
008980     CLOSE 作業ファイル１.
008980     CLOSE 作業ファイル２.
018420*================================================================*
018430******************************************************************
018440 END PROGRAM YAS721.
018450******************************************************************
