000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YCK101.
000060 AUTHOR.                 ’r“c@KŽq
000070*
000080*----------------------------------------------------------------*
000090*      ’ñoFPDì¬yÃÞ°Àì¬z_+³¨ÝÄÞ³½Þ”Å
000100* ¿‹”NŒŽVer.
000110*      MED = YCK580 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-11-29
000140 DATE-COMPILED.          2012-11-29
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000530     SELECT  –¼Ìƒ}ƒXƒ^      ASSIGN      TO        MEISYOL
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS MODE              IS  DYNAMIC
000560                             RECORD KEY               IS  –¼|‹æ•ªƒR[ƒh
000570                                                          –¼|–¼ÌƒR[ƒh
000580                             FILE STATUS              IS  ó‘ÔƒL[
000590                             LOCK        MODE         IS  AUTOMATIC.
000600     SELECT  Ž{pŠî•ñƒ}ƒXƒ^ ASSIGN      TO        SEJOHOL
000610                             ORGANIZATION             IS  INDEXED
000620                             ACCESS MODE              IS  DYNAMIC
000630                             RECORD KEY               IS Ž{î|Ž{pŠ”Ô†
000640                             FILE STATUS              IS  ó‘ÔƒL[
000650                             LOCK        MODE         IS  AUTOMATIC.
000130     SELECT  ƒŒƒZƒvƒg‚e      ASSIGN      TO        RECEPTL
000140                             ORGANIZATION             IS  INDEXED
000150                             ACCESS MODE              IS  DYNAMIC
000160                             RECORD KEY               IS  ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000170                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
000180                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
000190                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|Š³ŽÒƒR[ƒh
000200                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000210                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
000220                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
000230                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000240                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
000250                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
000260                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
000270                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
000280                                                          ƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
000290                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
000300                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000310                             ALTERNATE RECORD KEY     IS  ƒŒƒZ|¿‹˜a—ï”NŒŽ
000320                                                          ƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
000330                                                          ƒŒƒZ|Š³ŽÒƒR[ƒh
000340                                                          ƒŒƒZ|ƒŒƒZŽí•Ê
000350                                                          ƒŒƒZ|Ž{p˜a—ï”NŒŽ
000360                             FILE STATUS              IS  ó‘ÔƒL[
000370                             LOCK        MODE         IS  AUTOMATIC.
000130     SELECT  ì‹ÆƒŒƒZƒvƒg‚e  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1012L.DAT"
000140                             ORGANIZATION             IS  INDEXED
000150                             ACCESS MODE              IS  DYNAMIC
000160                             RECORD KEY               IS  ìƒŒƒZ|¿‹˜a—ï”NŒŽ
000170                                                          ìƒŒƒZ|Š³ŽÒƒR[ƒh
000180                                                          ìƒŒƒZ|ƒŒƒZŽí•Ê
000170                                                          ìƒŒƒZ|Ž{p˜a—ï”NŒŽ
000190                             ALTERNATE RECORD KEY     IS  ìƒŒƒZ|Š³ŽÒƒR[ƒh
000200                                                          ìƒŒƒZ|Ž{p˜a—ï”NŒŽ
000210                                                          ìƒŒƒZ|ƒŒƒZŽí•Ê
000220                             ALTERNATE RECORD KEY     IS  ìƒŒƒZ|¿‹˜a—ï”NŒŽ
000230                                                          ìƒŒƒZ|Ž{p˜a—ï”NŒŽ
000240                                                          ìƒŒƒZ|Š³ŽÒƒR[ƒh
000250                                                          ìƒŒƒZ|ƒŒƒZŽí•Ê
000260                             ALTERNATE RECORD KEY     IS  ìƒŒƒZ|¿‹˜a—ï”NŒŽ
000270                                                          ìƒŒƒZ|ƒŒƒZŽí•Ê
000280                                                          ìƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
000290                                                          ìƒŒƒZ|Š³ŽÒƒR[ƒh
000300                                                          ìƒŒƒZ|Ž{p˜a—ï”NŒŽ
000310                             ALTERNATE RECORD KEY     IS  ìƒŒƒZ|¿‹˜a—ï”NŒŽ
000320                                                          ìƒŒƒZ|¿‹•ÛŒ¯ŽÒ”Ô†
000330                                                          ìƒŒƒZ|Š³ŽÒƒR[ƒh
000340                                                          ìƒŒƒZ|ƒŒƒZŽí•Ê
000350                                                          ìƒŒƒZ|Ž{p˜a—ï”NŒŽ
000360                             FILE STATUS              IS  ó‘ÔƒL[
000370                             LOCK        MODE         IS  AUTOMATIC.
000750     SELECT  ŽófŽÒî•ñ‚e    ASSIGN      TO        JUSINJL
000760                             ORGANIZATION             IS  INDEXED
000770                             ACCESS MODE              IS  DYNAMIC
000780                             RECORD KEY               IS Žó|Ž{p˜a—ï”NŒŽ
000790                                                          Žó|Š³ŽÒƒR[ƒh
000800                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000810                                                          Žó|Š³ŽÒƒJƒi
000820                                                          Žó|Š³ŽÒƒR[ƒh
000830                             ALTERNATE RECORD KEY     IS  Žó|Š³ŽÒƒR[ƒh
000840                                                         Žó|Ž{p˜a—ï”NŒŽ
000850                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000860                                                          Žó|•ÛŒ¯Ží•Ê
000870                                                          Žó|•ÛŒ¯ŽÒ”Ô†
000880                                                          Žó|Š³ŽÒƒR[ƒh
000890                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000900                                                          Žó|Œö”ïŽí•Ê
000910                                                     Žó|”ï—p•‰’SŽÒ”Ô†
000920                                                          Žó|Š³ŽÒƒR[ƒh
000930                             ALTERNATE RECORD KEY     IS Žó|Ž{p˜a—ï”NŒŽ
000940                                                          Žó|•¬Ží•Ê
000950                                                  Žó|”ï—p•‰’SŽÒ”Ô†•¬
000960                                                          Žó|Š³ŽÒƒR[ƒh
000970                             ALTERNATE RECORD KEY  IS Žó|¿‹˜a—ï”NŒŽ
000980                                                      Žó|Ž{p˜a—ï”NŒŽ
000990                                                      Žó|Š³ŽÒƒR[ƒh
001000                             FILE STATUS              IS  ó‘ÔƒL[
001010                             LOCK        MODE         IS  AUTOMATIC.
001020     SELECT  •‰ƒf[ƒ^‚e    ASSIGN      TO        HUSYOUL
001030                             ORGANIZATION             IS  INDEXED
001040                             ACCESS MODE              IS  DYNAMIC
001050                             RECORD KEY               IS •‰|Ž{p˜a—ï”NŒŽ
001060                                                         •‰|Š³ŽÒƒR[ƒh
001070                             ALTERNATE RECORD KEY     IS •‰|Š³ŽÒƒR[ƒh
001080                                                         •‰|Ž{p˜a—ï”NŒŽ
001090                             FILE STATUS              IS  ó‘ÔƒL[
001100                             LOCK        MODE         IS  AUTOMATIC.
001101     SELECT  ì‹Æƒtƒ@ƒCƒ‹‚P  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
001102                             ORGANIZATION             IS  INDEXED
001103                             ACCESS                   IS  DYNAMIC
001104                             RECORD      KEY          IS  ì‚P|¿‹˜a—ï”NŒŽ
001105                                                          ì‚P|Ž{p˜a—ï”NŒŽ
001106                                                          ì‚P|•ÛŒ¯‹æ•ª
001107                                                          ì‚P|”ï—p•‰’SŽÒ”Ô†
001108                                                          ì‚P|•ÛŒ¯ŽÒ”Ô†
001109                                                          ì‚P|Š³ŽÒƒJƒi
001110                                                          ì‚P|Š³ŽÒƒR[ƒh
001111                             FILE        STATUS       IS  ó‘ÔƒL[
001112                             LOCK        MODE         IS  AUTOMATIC.
001122*
001230******************************************************************
001240*                      DATA DIVISION                             *
001250******************************************************************
001260 DATA                    DIVISION.
001270 FILE                    SECTION.
001370*                           m‚q‚k  ‚P‚Q‚Wn
001380 FD  –¼Ìƒ}ƒXƒ^          BLOCK   CONTAINS   1   RECORDS.
001390     COPY MEISYO          OF  XFDLIB  JOINING   –¼   AS  PREFIX.
001400*
001410 FD  Ž{pŠî•ñƒ}ƒXƒ^    BLOCK   CONTAINS   1   RECORDS.
001420     COPY SEJOHO         OF  XFDLIB  JOINING   Ž{î   AS  PREFIX.
001460*                           m‚q‚k  ‚R‚Q‚On
001470 FD  ŽófŽÒî•ñ‚e        BLOCK   CONTAINS   1   RECORDS.
001480     COPY JUSINJ          OF  XFDLIB  JOINING   Žó   AS  PREFIX.
001490*                           m‚q‚k  ‚P‚Q‚Wn
001500 FD  •‰ƒf[ƒ^‚e        BLOCK   CONTAINS   1   RECORDS.
001510     COPY HUSYOU          OF  XFDLIB  JOINING   •‰   AS  PREFIX.
      *                          m‚q‚k  ‚P‚T‚R‚Un
       FD  ƒŒƒZƒvƒg‚e          BLOCK   CONTAINS   1   RECORDS.
           COPY RECEPT          OF  XFDLIB  JOINING   ƒŒƒZ  AS  PREFIX.
      *                          m‚q‚k  ‚P‚T‚R‚Un
       FD  ì‹ÆƒŒƒZƒvƒg‚e      BLOCK   CONTAINS   1   RECORDS.
           COPY RECEPT          OF  XFDLIB  JOINING   ìƒŒƒZ  AS  PREFIX.
001520*
001530*
001540 FD  ì‹Æƒtƒ@ƒCƒ‹‚P RECORD  CONTAINS 512 CHARACTERS.
001550 01  ì‚P|ƒŒƒR[ƒh.
001560     03  ì‚P|ƒŒƒR[ƒhƒwƒbƒ_.
001570         05  ì‚P|¿‹˜a—ï”NŒŽ.
001580             07  ì‚P|¿‹˜a—ï            PIC 9.
001590             07  ì‚P|¿‹”N              PIC 9(2).
001600             07  ì‚P|¿‹ŒŽ              PIC 9(2).
001610         05  ì‚P|•ÛŒ¯‹æ•ª                PIC 99.
001620         05  ì‚P|•ÛŒ¯ŽÒ”Ô†              PIC X(10).
001630         05  ì‚P|–{l‰Æ‘°‹æ•ª            PIC 9.
001640         05  ì‚P|Ž{p˜a—ï”NŒŽ.
001650             07  ì‚P|Ž{p˜a—ï            PIC 9.
001660             07  ì‚P|Ž{p”N              PIC 9(2).
001670             07  ì‚P|Ž{pŒŽ              PIC 9(2).
001680         05  ì‚P|”í•ÛŒ¯ŽÒƒJƒi            PIC X(20).
001690         05  ì‚P|Š³ŽÒƒR[ƒh.
001700             07 ì‚P|Š³ŽÒ”Ô†             PIC 9(6).
001710             07 ì‚P|Ž}”Ô                 PIC X(1).
001720     03  ì‚P|ƒŒƒR[ƒhƒf[ƒ^.
001730         05  ì‚P|‰ïˆõ”Ô†                PIC X(5).
001740         05  ì‚P|˜Vl•¬                PIC 99.
001750         05  ì‚P|Œö”ï•¹—p.
001760             07  ì‚P|”ï—p•‰’SŽÒ”Ô†      PIC X(10).
001770             07  ì‚P|Žó‰vŽÒ”Ô†          PIC X(10).
001780         05  ì‚P|Š³ŽÒŽ–¼.
001790             07  ì‚P|Š³ŽÒŠ¿Žš            PIC N(10).
001800             07  ì‚P|Š³ŽÒƒJƒi            PIC X(20).
001810         05  ì‚P|Š³ŽÒ«•Ê                PIC 9.
001820         05  ì‚P|Š³ŽÒ¶”NŒŽ“ú.
001830             07  ì‚P|Š³ŽÒ˜a—ï            PIC 9(1).
001840             07  ì‚P|Š³ŽÒ”N              PIC 9(2).
001850             07  ì‚P|Š³ŽÒŒŽ              PIC 9(2).
001860             07  ì‚P|Š³ŽÒ“ú              PIC 9(2).
001870         05  ì‚P|‘±•¿                    PIC N(2).
001880         05  ì‚P|”í•ÛŒ¯ŽÒŽ–¼.
001890             07  ì‚P|”í•ÛŒ¯ŽÒŠ¿Žš        PIC N(10).
001900         05  ì‚P|”í•ÛŒ¯ŽÒ«•Ê            PIC 9.
001910         05  ì‚P|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú.
001920             07  ì‚P|”í•ÛŒ¯ŽÒ˜a—ï        PIC 9(1).
001930             07  ì‚P|”í•ÛŒ¯ŽÒ”N          PIC 9(2).
001940             07  ì‚P|”í•ÛŒ¯ŽÒŒŽ          PIC 9(2).
001950             07  ì‚P|”í•ÛŒ¯ŽÒ“ú          PIC 9(2).
001960         05  ì‚P|‹L†                    PIC N(12).
001970         05  ì‚P|”Ô†                    PIC X(12).
001980         05  ì‚P|Ž‘ŠiŽæ“¾”NŒŽ“ú.
001990             07  ì‚P|Ž‘Ši˜a—ï            PIC 9(1).
002000             07  ì‚P|Ž‘Ši”N              PIC 9(2).
002010             07  ì‚P|Ž‘ŠiŒŽ              PIC 9(2).
002020             07  ì‚P|Ž‘Ši“ú              PIC 9(2).
002030         05  ì‚P|—LŒø”NŒŽ“ú.
002040             07  ì‚P|—LŒø˜a—ï            PIC 9(1).
002050             07  ì‚P|—LŒø”N              PIC 9(2).
002060             07  ì‚P|—LŒøŒŽ              PIC 9(2).
002070             07  ì‚P|—LŒø“ú              PIC 9(2).
002080         05  ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥      PIC 9.
002090         05  ì‚P|“]‹A‹æ•ª‘‡            PIC 9.
002100         05  FILLER                        PIC 9(2).
002110         05  ì‚P|’Ê‰@‰ñ”                PIC 9(2).
002120         05  ì‚P|‰f—¿.
002130             07  ì‚P|‰fŠî–{—¿          PIC 9(4).
002140             07  ì‚P|‰f‰ÁŽZ—¿          PIC 9(4).
002150         05  ì‚P|‰—Ã—¿.
002160             07  ì‚P|‰ÁŽZ                PIC 9.
002170             07  ì‚P|‰ñ”                PIC 9(2).
002180             07  ì‚P|‰—Ã—¿‹àŠz          PIC 9(6).
002190         05  ì‚P|‹à‘®•›Žq‰ÁŽZ.
002200             07  ì‚P|Žg—p–‡”.
002210                 09  ì‚P|‘å              PIC 9.
002220                 09  ì‚P|’†              PIC 9.
002230                 09  ì‚P|¬              PIC 9.
002240             07  ì‚P|‹àŠz                PIC 9(6).
002250         05  ì‚P|î•ñ’ñ‹Ÿ—¿              PIC 9(6).
002260         05  ì‚P|•¶‘—¿                  PIC 9(6).
002270         05  ì‚P|ˆê”Ê”ï—p‹àŠz.
002280             07  ì‚P|”ï—p‡Œv‹àŠz        PIC 9(6).
002290             07  ì‚P|•‰’S—¦              PIC 9.
002300             07  ì‚P|•‰’S‹àŠz            PIC 9(6).
002310             07  ì‚P|¿‹‹àŠz            PIC 9(6).
002320         05  ì‚P|˜Vl•¬‹àŠz.
002330             07  ì‚P|Ž©ŒÈ•‰’S‹àŠz        PIC 9(6).
002340             07  ì‚P|·ˆø¿‹‹àŠz        PIC 9(6).
002350             07  ì‚P|‡Œv¿‹‹àŠz        PIC 9(6).
002360         05  ì‚P|•”ˆÊƒf[ƒ^              OCCURS 5.
002370             07  ì‚P|•‰ƒR[ƒh.
002380                 09  ì‚P|Ží•Ê            PIC 9.
002390                 09  ì‚P|•”ˆÊƒR[ƒh      PIC 99.
002400             07  ì‚P|—âãª—Ã–@.
002410                 09  ì‚P|—âãª‰ñ”        PIC 99.
002420                 09  ì‚P|—âãª‹àŠz        PIC 9(6).
002430             07  ì‚P|Ž{p—¿              PIC 9(6).
002440             07  ì‚P|ãª–@—¿.
002450                 09  ì‚P|ãª–@‰ñ”        PIC 99.
002460                 09  ì‚P|ãª–@‹àŠz        PIC 9(6).
002470             07  ì‚P|“d—Ã—¿.
002480                 09  ì‚P|“d—Ã‰ñ”        PIC 99.
002490                 09  ì‚P|“d—Ã‹àŠz        PIC 9(6).
002500             07  ì‚P|Œã—Ã—¿.
002510                 09  ì‚P|Œã—Ã‰ñ”        PIC 99.
002520                 09  ì‚P|Œã—Ã‹àŠz        PIC 9(6).
002530             07  ì‚P|“]‹A‹æ•ª            PIC 9.
002540         05  FILLER                        PIC X(13).
002550*
002560*----------------------------------------------------------------*
002570******************************************************************
002580*                WORKING-STORAGE SECTION                         *
002590******************************************************************
002600 WORKING-STORAGE         SECTION.
002610 01 ƒL[“ü—Í                           PIC X    VALUE SPACE.
002620 01 ó‘ÔƒL[                           PIC X(2) VALUE SPACE.
002630 01 I—¹ƒtƒ‰ƒO                         PIC X(3) VALUE SPACE.
002640 01 I—¹ƒtƒ‰ƒO‚Q                       PIC X(3) VALUE SPACE.
002650 01 ŽÀsƒL[‚v                         PIC X(3)  VALUE SPACE.
002660 01 Ž{p‹L˜^—L‚v                       PIC X(3) VALUE SPACE.
002670 01 ƒtƒ@ƒCƒ‹–¼                         PIC N(8) VALUE SPACE.
002671 01 Œp‘±ƒtƒ‰ƒO                         PIC X(3) VALUE SPACE.
002680**
002690 01 •ÛŒ¯Ží•Ê‚v‚q                       PIC 9(2) VALUE ZERO.
002691 01 Š³ŽÒƒR[ƒh‚v‚q.
002692    03 Š³ŽÒ”Ô†‚v‚q                    PIC 9(6) VALUE ZERO.
002693    03 Ž}”Ô‚v‚q                        PIC X    VALUE SPACE.
002694*
002710 01 ˆóüŒ`Ž®‚v‚q                       PIC 9    VALUE ZERO.
002720 01 •ÛŒ¯ŽÒ”Ô†‚v‚q                     PIC X(10) VALUE SPACE.
002730 01 ƒŒƒZƒvƒgŽí—Þ‚v‚q                   PIC X(4) VALUE SPACE.
002740 01 –{l‰Æ‘°‹æ•ª‚v‚q                   PIC 9    VALUE ZERO.
002750 01 ‘±•¿‚v                             PIC N(2) VALUE SPACE.
002760 01 Ž{p˜a—ï”NŒŽ‚v‚q.
002770    03 Ž{p˜a—ï‚v‚q                    PIC 9    VALUE ZERO.
002780    03 Ž{p”N‚v‚q                      PIC 9(2) VALUE ZERO.
002790    03 Ž{pŒŽ‚v‚q                      PIC 9(2) VALUE ZERO.
002800 01 ¿‹˜a—ï”NŒŽ‚v‚q.
002810    03 ¿‹˜a—ï‚v‚q                    PIC 9    VALUE ZERO.
002820    03 ¿‹”N‚v‚q                      PIC 9(2) VALUE ZERO.
002830    03 ¿‹ŒŽ‚v‚q                      PIC 9(2) VALUE ZERO.
002840**
002850 01 •”ˆÊ‚b‚m‚s                         PIC 9     VALUE ZERO.
002860 01 ƒJƒEƒ“ƒ^                           PIC 9(2)  VALUE ZERO.
002870 01 ƒJƒEƒ“ƒ^‚Q                         PIC 9(3)  VALUE ZERO.
002880 01 ƒJƒEƒ“ƒ^‚R                         PIC 9(2)  VALUE ZERO.
002890 01 ‘SŠp‹ó”’                           PIC X(2)  VALUE X"8140".
002900 01 ”¼Šp‹ó”’                           PIC X(2)  VALUE X"2020".
002910**
002920** ƒGƒ‰[ƒƒbƒZ[ƒW—p
002930 01 ƒGƒ‰[ƒƒbƒZ[ƒW‚v.
002940    03 ƒGƒ‰[Š³ŽÒƒR[ƒh‚v              PIC X(7) VALUE SPACE.
002950    03 ƒGƒ‰[‹æØ‚è‚v                  PIC X(1) VALUE SPACE.
002960    03 ƒGƒ‰[•ÛŒ¯Ží•Ê‚v                PIC X(2) VALUE SPACE.
002970    03 FILLER                          PIC X(10) VALUE SPACE.
002980** •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß—p
002990 01 •ÛŒ¯ŽÒ”Ô†‚v‚s.
003000    03 •ÛŒ¯ŽÒ”Ô†¶‹l‚ß‚v.
003010      05 •ÛŒ¯ŽÒ”Ô†¶‹l‚ß‚v‚P          PIC X OCCURS 8 VALUE SPACE.
003020    03 •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß‚v.
003030      05 •ÛŒ¯ŽÒ”Ô†‰E‹l‚ß‚v‚P          PIC X OCCURS 8 VALUE ZERO.
003040    03 •ÛŒ¯ŽÒ”Ô†”Žš‚v                PIC 9(8)  VALUE ZERO.
003050    03 •ÛŒ¯ŽÒ”Ô†‚v                    PIC X(8)  VALUE SPACE.
003060** ‰ïˆõ”Ô†‰E‹l‚ß—p
003070 01 ‰ïˆõ”Ô†‚v‚s.
003080    03 ‰ïˆõ”Ô†¶‹l‚ß‚v.
003090      05 ‰ïˆõ”Ô†¶‹l‚ß‚v‚P            PIC X OCCURS 7 VALUE SPACE.
003100    03 ‰ïˆõ”Ô†‰E‹l‚ß‚v.
003110      05 ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P            PIC X OCCURS 7 VALUE ZERO.
003120    03 ‰ïˆõ”Ô†”Žš‚v                  PIC 9(7)  VALUE ZERO.
003130    03 ‰ïˆõ”Ô†‚v                      PIC X(7)  VALUE SPACE.
003140** ¼—ï“ú•tƒ[ƒN—p
003150 01 ¼—ï”NŒŽ‚v.
003160    03 ¼—ï”N‚v                        PIC 9(4) VALUE ZERO.
003170    03 ¼—ïŒŽ‚v                        PIC 9(2) VALUE ZERO.
003180** ¼—ï¿‹”NŒŽ—p
003190 01 ¼—ï¿‹”NŒŽ‚v.
003200    03 ¼—ï¿‹”N‚v                    PIC 9(4) VALUE ZERO.
003210    03 ¼—ï¿‹ŒŽ‚v                    PIC 9(2) VALUE ZERO.
003220** ¼—ïŽ{p”NŒŽ—p
003230 01 ¼—ïŽ{p”NŒŽ‚v.
003240    03 ¼—ïŽ{p”N‚v                    PIC 9(4) VALUE ZERO.
003250    03 ¼—ïŽ{pŒŽ‚v                    PIC 9(2) VALUE ZERO.
003260** ‹L†¶‹l‚ß—p
003270 01 ‹L†‚v‚s.
003280    03 ‹L†Œ³‚v.
003290      05 ‹L†Œ³‚v‚P                    PIC N OCCURS 12 VALUE SPACE.
003300    03 ‹L†¶‹l‚ß‚v.
003310      05 ‹L†¶‹l‚ß‚v‚P                PIC N OCCURS 12 VALUE SPACE.
003320    03 ‹L†‚v.
003330      05 ‹L†‚m‚v                      PIC N(12) VALUE SPACE.
003340    03 ‹L†‚o‚v.
003350      05 ‹L†‚o‚m‚v                    PIC X(24) VALUE SPACE.
003380*
003591**********************************************************************************
003592*
003593 01 ‘Þ”ð€–Ú‚f‚v.
003594   03 ƒŒƒZƒvƒgŽí—Þ‚v                   PIC X(4).
003595   03 ƒŒƒZƒvƒgŽí—Þ‚f‚v                 PIC X(4).
003596   03 ƒŒƒZƒvƒgŽí•Ê‚f‚v                 PIC 9(2).
003599*
003600****************
003610* •‰ƒf[ƒ^‚e *
003620****************
003630 01 •‰î•ñ‚v.
003640    03 •”ˆÊ”‚v                        PIC 9(1)  VALUE ZERO.
003650    03 •”ˆÊî•ñ‚v  OCCURS   9.
003660       05 •”ˆÊ‚b‚m‚s‚v                 PIC 9(1)  VALUE ZERO.
003670       05 •”ˆÊƒR[ƒh‚v.
003680          07 •‰Ží•Ê‚v                PIC 9(2)  VALUE ZERO.
003690          07 •”ˆÊ‚v                    PIC 9(2)  VALUE ZERO.
003700       05 “]‹A‹æ•ª‚v                   PIC 9(1)  VALUE ZERO.
003710*    ************
003720*    * —¿‹àî•ñ *
003730*    ************
003740*    ŒŽ–ˆ‚Ì—¿‹à
003750***********************
003760 01 —¿‹à‚P‚v‚q.
003770   03 ‰ŒŸ‚v‚q.
003780      05 •‰’SŠ„‡‚v‚q               PIC 9(3)    VALUE ZERO.
003790      05 ‰ŒŸ—¿‚v‚q                 PIC 9(5)    VALUE ZERO.
003800      05 ‰ŒŸ‰ÁŽZ—¿‚v‚q             PIC 9(5)    VALUE ZERO.
003810   03 ÄŒŸ—¿‚v‚q                    PIC 9(5)    VALUE ZERO.
003820   03 ‰—Ã‚v‚q.
003830      05 ‰—Ã‰ñ”‚v‚q               PIC 9(2)    VALUE ZERO.
003840      05 ‰—Ã—¿‚v‚q                 PIC 9(5)    VALUE ZERO.
003850      05 ‰—Ã‰ÁŽZ—¿‚v‚q             PIC 9(5)    VALUE ZERO.
003860   03 ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q            PIC 9(5)    VALUE ZERO.
003870   03 ‘å‚v                          PIC 9(1)    VALUE ZERO.
003880   03 ’†‚v                          PIC 9(1)    VALUE ZERO.
003890   03 ¬‚v                          PIC 9(1)    VALUE ZERO.
003900   03 Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q            PIC 9(5)    VALUE ZERO.
003910   03 ˆê•”•‰’S‹à‚v‚q                PIC 9(6)    VALUE ZERO.
003920   03 ¿‹‹àŠz‚v‚q                  PIC 9(6)    VALUE ZERO.
003930   03 ‹‹•tŠ„‡‚v‚q                  PIC 9(1)    VALUE ZERO.
003940   03 Žó‹‹ŽÒ•‰’SŠz‚v‚q              PIC 9(6)    VALUE ZERO.
003950   03 •¬¿‹‹àŠz‚v‚q              PIC 9(6)    VALUE ZERO.
003960*
003970* •‰•”ˆÊ–ˆ‚Ì—¿‹à
003980***********************
003990 01 —¿‹à‚Q‚v‚q.
004000   03 ‰‰ñˆ’u‚v‚q    OCCURS   9.
004010      05 ‰‰ñˆ’u—¿‚v‚q             PIC 9(5)    VALUE ZERO.
004020*
004030* ’üŒ¸–ˆ‚Ì—¿‹à
004040***********************
004050 01 —¿‹à‚R‚v‚q.
004060**********
004070* ‚P•”ˆÊ *
004080**********
004090   03 •”ˆÊ‚P‚v‚q.
004100      05 Œã—Ã‚P‚v‚q.
004110         07 Œã—Ã‰ñ”‚P‚v‚q              PIC 9(2)    VALUE ZERO.
004120         07 Œã—Ã—¿‚P‚v‚q                PIC 9(5)    VALUE ZERO.
004130      05 —âãª–@‚P‚v‚q.
004140         07 —âãª–@‰ñ”‚P‚v‚q            PIC 9(2)    VALUE ZERO.
004150         07 —âãª–@—¿‚P‚v‚q              PIC 9(4)    VALUE ZERO.
004160      05 ‰·ãª–@‚P‚v‚q.
004170         07 ‰·ãª–@‰ñ”‚P‚v‚q            PIC 9(2)    VALUE ZERO.
004180         07 ‰·ãª–@—¿‚P‚v‚q              PIC 9(4)    VALUE ZERO.
004190      05 “d—Ã‚P‚v‚q.
004200         07 “d—Ã‰ñ”‚P‚v‚q              PIC 9(2)    VALUE ZERO.
004210         07 “d—Ã—¿‚P‚v‚q                PIC 9(4)    VALUE ZERO.
004220**********
004230* ‚Q•”ˆÊ *
004240**********
004250   03 •”ˆÊ‚Q‚v‚q.
004260      05 Œã—Ã‚Q‚v‚q.
004270         07 Œã—Ã‰ñ”‚Q‚v‚q              PIC 9(2)    VALUE ZERO.
004280         07 Œã—Ã—¿‚Q‚v‚q                PIC 9(5)    VALUE ZERO.
004290      05 —âãª–@‚Q‚v‚q.
004300         07 —âãª–@‰ñ”‚Q‚v‚q            PIC 9(2)    VALUE ZERO.
004310         07 —âãª–@—¿‚Q‚v‚q              PIC 9(4)    VALUE ZERO.
004320      05 ‰·ãª–@‚Q‚v‚q.
004330         07 ‰·ãª–@‰ñ”‚Q‚v‚q            PIC 9(2)    VALUE ZERO.
004340         07 ‰·ãª–@—¿‚Q‚v‚q              PIC 9(4)    VALUE ZERO.
004350      05 “d—Ã‚Q‚v‚q.
004360         07 “d—Ã‰ñ”‚Q‚v‚q              PIC 9(2)    VALUE ZERO.
004370         07 “d—Ã—¿‚Q‚v‚q                PIC 9(4)    VALUE ZERO.
004380******************
004390* ‚R•”ˆÊ^‚WŠ„ *
004400******************
004410   03 •”ˆÊ‚R‚W‚v‚q.
004420      05 Œã—Ã‚R‚W‚v‚q.
004430         07 Œã—Ã‰ñ”‚R‚W‚v‚q              PIC 9(2)  VALUE ZERO.
004440         07 Œã—Ã—¿‚R‚W‚v‚q                PIC 9(5)  VALUE ZERO.
004450      05 —âãª–@‚R‚W‚v‚q.
004460         07 —âãª–@‰ñ”‚R‚W‚v‚q            PIC 9(2)  VALUE ZERO.
004470         07 —âãª–@—¿‚R‚W‚v‚q              PIC 9(4)  VALUE ZERO.
004480      05 ‰·ãª–@‚R‚W‚v‚q.
004490         07 ‰·ãª–@‰ñ”‚R‚W‚v‚q            PIC 9(2)  VALUE ZERO.
004500         07 ‰·ãª–@—¿‚R‚W‚v‚q              PIC 9(4)  VALUE ZERO.
004510      05 “d—Ã‚R‚W‚v‚q.
004520         07 “d—Ã‰ñ”‚R‚W‚v‚q              PIC 9(2)  VALUE ZERO.
004530         07 “d—Ã—¿‚R‚W‚v‚q                PIC 9(4)  VALUE ZERO.
004540******************
004550* ‚R•”ˆÊ^‚P‚OŠ„ *
004560******************
004570   03 •”ˆÊ‚R‚O‚v‚q.
004580      05 Œã—Ã‚R‚O‚v‚q.
004590         07 Œã—Ã‰ñ”‚R‚O‚v‚q              PIC 9(2)  VALUE ZERO.
004600         07 Œã—Ã—¿‚R‚O‚v‚q                PIC 9(5)  VALUE ZERO.
004610      05 —âãª–@‚R‚O‚v‚q.
004620         07 —âãª–@‰ñ”‚R‚O‚v‚q            PIC 9(2)  VALUE ZERO.
004630         07 —âãª–@—¿‚R‚O‚v‚q              PIC 9(4)  VALUE ZERO.
004640      05 ‰·ãª–@‚R‚O‚v‚q.
004650         07 ‰·ãª–@‰ñ”‚R‚O‚v‚q            PIC 9(2)  VALUE ZERO.
004660         07 ‰·ãª–@—¿‚R‚O‚v‚q              PIC 9(4)  VALUE ZERO.
004670      05 “d—Ã‚R‚O‚v‚q.
004680         07 “d—Ã‰ñ”‚R‚O‚v‚q              PIC 9(2)  VALUE ZERO.
004690         07 “d—Ã—¿‚R‚O‚v‚q                PIC 9(4)  VALUE ZERO.
004700******************
004710* ‚R•”ˆÊ^‡Œv@ *
004720******************
004730   03 •”ˆÊ‚R‚v‚q.
004740      05 Œã—Ã‚R‚v‚q.
004750         07 Œã—Ã‰ñ”‚R‚v‚q                PIC 9(2)  VALUE ZERO.
004760         07 Œã—Ã—¿‚R‚v‚q                  PIC 9(6)  VALUE ZERO.
004770      05 —âãª–@‚R‚v‚q.
004780         07 —âãª–@‰ñ”‚R‚v‚q              PIC 9(2)  VALUE ZERO.
004790         07 —âãª–@—¿‚R‚v‚q                PIC 9(6)  VALUE ZERO.
004800      05 ‰·ãª–@‚R‚v‚q.
004810         07 ‰·ãª–@‰ñ”‚R‚v‚q              PIC 9(2)  VALUE ZERO.
004820         07 ‰·ãª–@—¿‚R‚v‚q                PIC 9(6)  VALUE ZERO.
004830      05 “d—Ã‚R‚v‚q.
004840         07 “d—Ã‰ñ”‚R‚v‚q                PIC 9(2)  VALUE ZERO.
004850         07 “d—Ã—¿‚R‚v‚q                  PIC 9(6)  VALUE ZERO.
004860****************
004870* ‚S•”ˆÊ^‚TŠ„ *
004880****************
004890   03 •”ˆÊ‚S‚T‚v‚q.
004900      05 Œã—Ã‚S‚T‚v‚q.
004910         07 Œã—Ã‰ñ”‚S‚T‚v‚q              PIC 9(2)  VALUE ZERO.
004920         07 Œã—Ã—¿‚S‚T‚v‚q                PIC 9(5)  VALUE ZERO.
004930      05 —âãª–@‚S‚T‚v‚q.
004940         07 —âãª–@‰ñ”‚S‚T‚v‚q            PIC 9(2)  VALUE ZERO.
004950         07 —âãª–@—¿‚S‚T‚v‚q              PIC 9(4)  VALUE ZERO.
004960      05 ‰·ãª–@‚S‚T‚v‚q.
004970         07 ‰·ãª–@‰ñ”‚S‚T‚v‚q            PIC 9(2)  VALUE ZERO.
004980         07 ‰·ãª–@—¿‚S‚T‚v‚q              PIC 9(4)  VALUE ZERO.
004990      05 “d—Ã‚S‚T‚v‚q.
005000         07 “d—Ã‰ñ”‚S‚T‚v‚q              PIC 9(2)  VALUE ZERO.
005010         07 “d—Ã—¿‚S‚T‚v‚q                PIC 9(4)  VALUE ZERO.
005020****************
005030* ‚S•”ˆÊ^‚WŠ„ *
005040****************
005050   03 •”ˆÊ‚S‚W‚v‚q.
005060      05 Œã—Ã‚S‚W‚v‚q.
005070         07 Œã—Ã‰ñ”‚S‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005080         07 Œã—Ã—¿‚S‚W‚v‚q                PIC 9(5)  VALUE ZERO.
005090      05 —âãª–@‚S‚W‚v‚q.
005100         07 —âãª–@‰ñ”‚S‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005110         07 —âãª–@—¿‚S‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005120      05 ‰·ãª–@‚S‚W‚v‚q.
005130         07 ‰·ãª–@‰ñ”‚S‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005140         07 ‰·ãª–@—¿‚S‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005150      05 “d—Ã‚S‚W‚v‚q.
005160         07 “d—Ã‰ñ”‚S‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005170         07 “d—Ã—¿‚S‚W‚v‚q                PIC 9(4)  VALUE ZERO.
005180******************
005190* ‚S•”ˆÊ^‚P‚OŠ„ *
005200******************
005210   03 •”ˆÊ‚S‚O‚v‚q.
005220      05 Œã—Ã‚S‚O‚v‚q.
005230         07 Œã—Ã‰ñ”‚S‚O‚v‚q              PIC 9(2)  VALUE ZERO.
005240         07 Œã—Ã—¿‚S‚O‚v‚q                PIC 9(5)  VALUE ZERO.
005250      05 —âãª–@‚S‚O‚v‚q.
005260         07 —âãª–@‰ñ”‚S‚O‚v‚q            PIC 9(2)  VALUE ZERO.
005270         07 —âãª–@—¿‚S‚O‚v‚q              PIC 9(4)  VALUE ZERO.
005280      05 ‰·ãª–@‚S‚O‚v‚q.
005290         07 ‰·ãª–@‰ñ”‚S‚O‚v‚q            PIC 9(2)  VALUE ZERO.
005300         07 ‰·ãª–@—¿‚S‚O‚v‚q              PIC 9(4)  VALUE ZERO.
005310      05 “d—Ã‚S‚O‚v‚q.
005320         07 “d—Ã‰ñ”‚S‚O‚v‚q              PIC 9(2)  VALUE ZERO.
005330         07 “d—Ã—¿‚S‚O‚v‚q                PIC 9(4)  VALUE ZERO.
005340******************
005350* ‚S•”ˆÊ^‡Œv@ *
005360******************
005370   03 •”ˆÊ‚S‚v‚q.
005380      05 Œã—Ã‚S‚v‚q.
005390         07 Œã—Ã‰ñ”‚S‚v‚q                PIC 9(2)  VALUE ZERO.
005400         07 Œã—Ã—¿‚S‚v‚q                  PIC 9(6)  VALUE ZERO.
005410      05 —âãª–@‚S‚v‚q.
005420         07 —âãª–@‰ñ”‚S‚v‚q              PIC 9(2)  VALUE ZERO.
005430         07 —âãª–@—¿‚S‚v‚q                PIC 9(6)  VALUE ZERO.
005440      05 ‰·ãª–@‚S‚v‚q.
005450         07 ‰·ãª–@‰ñ”‚S‚v‚q              PIC 9(2)  VALUE ZERO.
005460         07 ‰·ãª–@—¿‚S‚v‚q                PIC 9(6)  VALUE ZERO.
005470      05 “d—Ã‚S‚v‚q.
005480         07 “d—Ã‰ñ”‚S‚v‚q                PIC 9(2)  VALUE ZERO.
005490         07 “d—Ã—¿‚S‚v‚q                  PIC 9(6)  VALUE ZERO.
005500********************
005510* ‚T•”ˆÊ^‚QD‚TŠ„ *
005520********************
005530   03 •”ˆÊ‚T‚Q‚v‚q.
005540      05 Œã—Ã‚T‚Q‚v‚q.
005550         07 Œã—Ã‰ñ”‚T‚Q‚v‚q              PIC 9(2)  VALUE ZERO.
005560         07 Œã—Ã—¿‚T‚Q‚v‚q                PIC 9(5)  VALUE ZERO.
005570      05 —âãª–@‚T‚Q‚v‚q.
005580         07 —âãª–@‰ñ”‚T‚Q‚v‚q            PIC 9(2)  VALUE ZERO.
005590         07 —âãª–@—¿‚T‚Q‚v‚q              PIC 9(4)  VALUE ZERO.
005600      05 ‰·ãª–@‚T‚Q‚v‚q.
005610         07 ‰·ãª–@‰ñ”‚T‚Q‚v‚q            PIC 9(2)  VALUE ZERO.
005620         07 ‰·ãª–@—¿‚T‚Q‚v‚q              PIC 9(4)  VALUE ZERO.
005630      05 “d—Ã‚T‚Q‚v‚q.
005640         07 “d—Ã‰ñ”‚T‚Q‚v‚q              PIC 9(2)  VALUE ZERO.
005650         07 “d—Ã—¿‚T‚Q‚v‚q                PIC 9(4)  VALUE ZERO.
005660****************
005670* ‚T•”ˆÊ^‚TŠ„ *
005680****************
005690   03 •”ˆÊ‚T‚T‚v‚q.
005700      05 Œã—Ã‚T‚T‚v‚q.
005710         07 Œã—Ã‰ñ”‚T‚T‚v‚q              PIC 9(2)  VALUE ZERO.
005720         07 Œã—Ã—¿‚T‚T‚v‚q                PIC 9(5)  VALUE ZERO.
005730      05 —âãª–@‚T‚T‚v‚q.
005740         07 —âãª–@‰ñ”‚T‚T‚v‚q            PIC 9(2)  VALUE ZERO.
005750         07 —âãª–@—¿‚T‚T‚v‚q              PIC 9(4)  VALUE ZERO.
005760      05 ‰·ãª–@‚T‚T‚v‚q.
005770         07 ‰·ãª–@‰ñ”‚T‚T‚v‚q            PIC 9(2)  VALUE ZERO.
005780         07 ‰·ãª–@—¿‚T‚T‚v‚q              PIC 9(4)  VALUE ZERO.
005790      05 “d—Ã‚T‚T‚v‚q.
005800         07 “d—Ã‰ñ”‚T‚T‚v‚q              PIC 9(2)  VALUE ZERO.
005810         07 “d—Ã—¿‚T‚T‚v‚q                PIC 9(4)  VALUE ZERO.
005820****************
005830* ‚T•”ˆÊ^‚WŠ„ *
005840****************
005850   03 •”ˆÊ‚T‚W‚v‚q.
005860      05 Œã—Ã‚T‚W‚v‚q.
005870         07 Œã—Ã‰ñ”‚T‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005880         07 Œã—Ã—¿‚T‚W‚v‚q                PIC 9(5)  VALUE ZERO.
005890      05 —âãª–@‚T‚W‚v‚q.
005900         07 —âãª–@‰ñ”‚T‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005910         07 —âãª–@—¿‚T‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005920      05 ‰·ãª–@‚T‚W‚v‚q.
005930         07 ‰·ãª–@‰ñ”‚T‚W‚v‚q            PIC 9(2)  VALUE ZERO.
005940         07 ‰·ãª–@—¿‚T‚W‚v‚q              PIC 9(4)  VALUE ZERO.
005950      05 “d—Ã‚T‚W‚v‚q.
005960         07 “d—Ã‰ñ”‚T‚W‚v‚q              PIC 9(2)  VALUE ZERO.
005970         07 “d—Ã—¿‚T‚W‚v‚q                PIC 9(4)  VALUE ZERO.
005980******************
005990* ‚T•”ˆÊ^‚P‚OŠ„ *
006000******************
006010   03 •”ˆÊ‚T‚O‚v‚q.
006020      05 Œã—Ã‚T‚O‚v‚q.
006030         07 Œã—Ã‰ñ”‚T‚O‚v‚q              PIC 9(2)  VALUE ZERO.
006040         07 Œã—Ã—¿‚T‚O‚v‚q                PIC 9(5)  VALUE ZERO.
006050      05 —âãª–@‚T‚O‚v‚q.
006060         07 —âãª–@‰ñ”‚T‚O‚v‚q            PIC 9(2)  VALUE ZERO.
006070         07 —âãª–@—¿‚T‚O‚v‚q              PIC 9(4)  VALUE ZERO.
006080      05 ‰·ãª–@‚T‚O‚v‚q.
006090         07 ‰·ãª–@‰ñ”‚T‚O‚v‚q            PIC 9(2)  VALUE ZERO.
006100         07 ‰·ãª–@—¿‚T‚O‚v‚q              PIC 9(4)  VALUE ZERO.
006110      05 “d—Ã‚T‚O‚v‚q.
006120         07 “d—Ã‰ñ”‚T‚O‚v‚q              PIC 9(2)  VALUE ZERO.
006130         07 “d—Ã—¿‚T‚O‚v‚q                PIC 9(4)  VALUE ZERO.
006140******************
006150* ‚T•”ˆÊ^‡Œv@ *
006160******************
006170   03 •”ˆÊ‚T‚v‚q.
006180      05 Œã—Ã‚T‚v‚q.
006190         07 Œã—Ã‰ñ”‚T‚v‚q                PIC 9(2)  VALUE ZERO.
006200         07 Œã—Ã—¿‚T‚v‚q                  PIC 9(6)  VALUE ZERO.
006210      05 —âãª–@‚T‚v‚q.
006220         07 —âãª–@‰ñ”‚T‚v‚q              PIC 9(2)  VALUE ZERO.
006230         07 —âãª–@—¿‚T‚v‚q                PIC 9(6)  VALUE ZERO.
006240      05 ‰·ãª–@‚T‚v‚q.
006250         07 ‰·ãª–@‰ñ”‚T‚v‚q              PIC 9(2)  VALUE ZERO.
006260         07 ‰·ãª–@—¿‚T‚v‚q                PIC 9(6)  VALUE ZERO.
006270      05 “d—Ã‚T‚v‚q.
006280         07 “d—Ã‰ñ”‚T‚v‚q                PIC 9(2)  VALUE ZERO.
006290         07 “d—Ã—¿‚T‚v‚q                  PIC 9(6)  VALUE ZERO.
006300*
006310*****************************************************************
006320 01 ŒvŽZ‹@¼—ï”N‚v                     PIC 9(2).
006330* “ú•t‚v‚n‚q‚j
006340 01 ŒvŽZ‹@¼—ï.
006350    03 ŒvŽZ‹@¼—ï”N                    PIC 9(4).
006360    03 ŒvŽZ‹@¼—ïŒŽ“ú                  PIC 9(4).
006370 01 ŒvŽZ‹@¼—ï‚q REDEFINES ŒvŽZ‹@¼—ï.
006380    03 ŒvŽZ‹@¢‹I                      PIC 9(2).
006390    03 ŒvŽZ‹@“ú•t                      PIC 9(6).
006400    03 ŒvŽZ‹@“ú•t‚q REDEFINES ŒvŽZ‹@“ú•t.
006410       05 ŒvŽZ‹@”NŒŽ                   PIC 9(4).
006420       05 ŒvŽZ‹@”NŒŽ‚q REDEFINES ŒvŽZ‹@”NŒŽ.
006430         07 ŒvŽZ‹@”N                   PIC 9(2).
006440         07 ŒvŽZ‹@ŒŽ                   PIC 9(2).
006450       05 ŒvŽZ‹@“ú                     PIC 9(2).
006460*
       01 •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v     PIC X(8) VALUE "MOJI2".
002230*
006470******************************************************************
006480*                          ˜AŒ‹€–Ú                              *
006490******************************************************************
006500*
006510********************
006520* ƒƒbƒZ[ƒW•\Ž¦ƒL[ *
006530********************
006540 01 ˜Aƒ|ƒL[ IS EXTERNAL.
006550    03  ˜Aƒ|ƒƒbƒZ[ƒW               PIC N(20).
006560*
006570 01 ˜Aƒ‚R|ƒL[ IS EXTERNAL.
006580    03  ˜Aƒ‚R|ƒƒbƒZ[ƒW             PIC N(20).
006590    03  ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P           PIC X(20).
006600****************
006610* ‰æ–Ê“ü—Íî•ñ *
006620****************
002287 01 ˜A“ü|‰æ–Êî•ñ‚x‚b‚j‚T‚W‚O IS EXTERNAL.
002297    03 ˜A“ü|ˆóüŒ`Ž®                  PIC 9.
002307    03 ˜A“ü|¿‹˜a—ï”NŒŽ.
002317       05 ˜A“ü|¿‹˜a—ï               PIC 9.
002327       05 ˜A“ü|¿‹”NŒŽ.
002337         07 ˜A“ü|¿‹”N               PIC 9(2).
002347         07 ˜A“ü|¿‹ŒŽ               PIC 9(2).
          03 ˜A“ü|ƒvƒŒƒrƒ…[‹æ•ª            PIC 9.
009940*
009942 01 ˜AƒŒ|ƒL[ IS EXTERNAL.
009943    03 ˜AƒŒ|•ÛŒ¯Ží•Ê                  PIC 9(2).
009950*
      * ˆÃ†•¡‡—p
       01 ˜AˆÃ†•¡‡|ˆÃ†î•ñ IS EXTERNAL.
          03 ˜AˆÃ†•¡‡|“ü—Íî•ñ.
             05 ˜AˆÃ†•¡‡|‹L†               PIC X(24).
             05 ˜AˆÃ†•¡‡|”Ô†               PIC X(30).
             05 ˜AˆÃ†•¡‡|ˆÃ†‰»€–Ú.
                07 ˜AˆÃ†•¡‡|ˆÃ†Š³ŽÒ”Ô†    PIC X(6).
                07 ˜AˆÃ†•¡‡|ˆÃ†”»’è‹L†    PIC X.
                07 ˜AˆÃ†•¡‡|ˆÃ†”»’è”Ô†    PIC X.
                07 ˜AˆÃ†•¡‡|ˆÃ†‹L†        PIC X(24).
                07 ˜AˆÃ†•¡‡|ˆÃ†”Ô†        PIC X(30).
          03 ˜AˆÃ†•¡‡|o—Íî•ñ.
             05 ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†       PIC X(24).
             05 ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†       PIC X(30).
003322*
009960******************************************************************
009970*                      PROCEDURE  DIVISION                       *
009980******************************************************************
009990 PROCEDURE               DIVISION.
010000************
010010*           *
010020* ‰Šúˆ—   *
010030*           *
010040************
010050     PERFORM ‰Šú‰».
010060     PERFORM Ž{pŠî•ñŽæ“¾.
010070************
010080*           *
010090* Žåˆ—     *
010100*           *
010110************
010120     PERFORM ì‹Æƒtƒ@ƒCƒ‹ì¬.
010130************
010140*           *
010150* I—¹ˆ—   *
010160*           *
010170************
010180     PERFORM I—¹ˆ—.
010190     MOVE ZERO TO PROGRAM-STATUS.
010200     EXIT PROGRAM.
010210*
010220*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
010230*================================================================*
010240 ‰Šú‰» SECTION.
010250*
010260     PERFORM ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“.
010270* ˜AŒ‹€–Ú‚Ì‘Ò”ð
010280     MOVE ˜A“ü|¿‹˜a—ï      TO ¿‹˜a—ï‚v‚q.
010290     MOVE ˜A“ü|¿‹”N        TO ¿‹”N‚v‚q.
010300     MOVE ˜A“ü|¿‹ŒŽ        TO ¿‹ŒŽ‚v‚q.
010310*
010590*================================================================*
010600 ƒtƒ@ƒCƒ‹ƒI[ƒvƒ“ SECTION.
010610*
010710     OPEN INPUT –¼Ìƒ}ƒXƒ^.
010720         MOVE NC"–¼Ìƒ}ƒXƒ^" TO ƒtƒ@ƒCƒ‹–¼.
010730         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
010740     OPEN INPUT Ž{pŠî•ñƒ}ƒXƒ^
010750         MOVE NC"Ž{î" TO ƒtƒ@ƒCƒ‹–¼.
010760         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
010800     OPEN INPUT ŽófŽÒî•ñ‚e.
010810         MOVE NC"ŽófŽÒî•ñ‚e" TO ƒtƒ@ƒCƒ‹–¼.
010820         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
010830     OPEN INPUT •‰ƒf[ƒ^‚e.
010840         MOVE NC"•‰ƒf[ƒ^‚e" TO ƒtƒ@ƒCƒ‹–¼.
010850         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
006630     OPEN INPUT ƒŒƒZƒvƒg‚e.
006640         MOVE NC"ƒŒƒZ" TO ƒtƒ@ƒCƒ‹–¼.
006650         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
010860*================================================================*
010870 ƒI[ƒvƒ“ƒ`ƒFƒbƒN SECTION.
010880*
010890     IF ó‘ÔƒL[  NOT =  "00"
010900         DISPLAY ƒtƒ@ƒCƒ‹–¼ NC"‚eƒI[ƒvƒ“ƒGƒ‰[" UPON CONS
010910         DISPLAY NC"ó‘ÔƒL[F" ó‘ÔƒL[         UPON CONS
010920         DISPLAY NC"”Žš‚P•¶Žš“ü—Í‚µ‚d‚m‚s‚d‚qƒL[‚ð‰Ÿ‚µ‚Ä‚­‚¾‚³‚¢"
010930                                                 UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
010940         ACCEPT  ƒL[“ü—Í FROM CONS
010950         PERFORM ƒtƒ@ƒCƒ‹•Â½
010960         MOVE 99 TO PROGRAM-STATUS
010970         EXIT PROGRAM.
010980*================================================================*
010990 ƒtƒ@ƒCƒ‹•Â½ SECTION.
011000*
011010     CLOSE –¼Ìƒ}ƒXƒ^ ŽófŽÒî•ñ‚e •‰ƒf[ƒ^‚e
011020           Ž{pŠî•ñƒ}ƒXƒ^ ƒŒƒZƒvƒg‚e ì‹ÆƒŒƒZƒvƒg‚e.
011030*================================================================*
011040 I—¹ˆ— SECTION.
011050*
011060     PERFORM ƒtƒ@ƒCƒ‹•Â½.
011070*================================================================*
011080 ƒGƒ‰[•\Ž¦ SECTION.
011090*
011100     DISPLAY NC"ó‘ÔƒL[" ó‘ÔƒL[  UPON CONS.
011110     DISPLAY NC"ƒtƒ@ƒCƒ‹‘žƒGƒ‰[F" ƒtƒ@ƒCƒ‹–¼   UPON CONS.
011120     DISPLAY NC"ƒVƒXƒeƒ€ŠÇ—ŽÒ‚É˜A—‚µ‚Ä‚­‚¾‚³‚¢"  UPON CONS.
011130     DISPLAY NC"”Žš‚P•¶Žš“ü—Í‚µ‚d‚m‚s‚d‚qƒL[‚ð‰Ÿ‚µ‚Ä‚­‚¾‚³‚¢"                                                                    UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
011140     ACCEPT  ƒL[“ü—Í FROM CONS.
011150     PERFORM ƒtƒ@ƒCƒ‹•Â½.
011160     MOVE 99 TO PROGRAM-STATUS.
011170     EXIT PROGRAM.
011180*================================================================*
011190 Ž{pŠî•ñŽæ“¾ SECTION.
011200*
011210     MOVE ZERO  TO Ž{î|Ž{pŠ”Ô†.
011220     READ Ž{pŠî•ñƒ}ƒXƒ^
011230     INVALID KEY
011240          MOVE  NC"Ž{pŠî•ñƒ}ƒXƒ^‚É“o˜^ŒãAŽÀs‚µ‚Ä‰º‚³‚¢" TO ˜Aƒ|ƒƒbƒZ[ƒW
011250          CALL   "MSG001"
011260          CANCEL "MSG001"
011270          PERFORM ƒtƒ@ƒCƒ‹•Â½
011280          MOVE 99 TO PROGRAM-STATUS
011290          EXIT PROGRAM
011300     NOT INVALID KEY
011310          IF  Ž{î|ÚœŽt‰ï‰ïˆõ”Ô† = SPACE
011320              MOVE  NC"Ž{pŠƒ}ƒXƒ^‚É‰ïˆõ”Ô†‚ð“o˜^‚µ‚Ä‰º‚³‚¢" TO ˜Aƒ|ƒƒbƒZ[ƒW
011330              CALL   "MSG001"
011340              CANCEL "MSG001"
011350              PERFORM ƒtƒ@ƒCƒ‹•Â½
011360              MOVE 99 TO PROGRAM-STATUS
011370              EXIT PROGRAM
011380          ELSE
011390              MOVE Ž{î|ÚœŽt‰ï‰ïˆõ”Ô†  TO ‰ïˆõ”Ô†‚v
011400****              PERFORM ‰ïˆõ”Ô†‰E‹l‚ß
011410          END-IF
011420     END-READ.
011430*
011440*================================================================*
011450 ì‹Æƒtƒ@ƒCƒ‹ì¬ SECTION.
011460*
           PERFORM ì‹ÆƒŒƒZƒvƒg‚eì¬.
011470     OPEN OUTPUT ì‹Æƒtƒ@ƒCƒ‹‚P.
011480         MOVE NC"ì‚P" TO ƒtƒ@ƒCƒ‹–¼.
011490         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
011500*
011510     PERFORM ì‹Æƒtƒ@ƒCƒ‹‚Pì¬‚P
011520*
011530     CLOSE ì‹Æƒtƒ@ƒCƒ‹‚P.
011540*
011440*================================================================*
011450 ì‹ÆƒŒƒZƒvƒg‚eì¬ SECTION.
011460*
006630     OPEN OUTPUT ì‹ÆƒŒƒZƒvƒg‚e.
006640         MOVE NC"ìƒŒƒZ" TO ƒtƒ@ƒCƒ‹–¼.
006650         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
      *
           PERFORM ƒŒƒZƒvƒg‚e“Çž.
           PERFORM UNTIL I—¹ƒtƒ‰ƒO NOT = SPACE
              MOVE ƒŒƒZ|ƒŒƒR[ƒh TO ìƒŒƒZ|ƒŒƒR[ƒh
              WRITE ìƒŒƒZ|ƒŒƒR[ƒh
              PERFORM ƒŒƒZƒvƒg‚e“Çž
           END-PERFORM.
      *
           CLOSE ì‹ÆƒŒƒZƒvƒg‚e
006630     OPEN INPUT ì‹ÆƒŒƒZƒvƒg‚e.
006640         MOVE NC"ìƒŒƒZ" TO ƒtƒ@ƒCƒ‹–¼.
006650         PERFORM ƒI[ƒvƒ“ƒ`ƒFƒbƒN.
011550*================================================================*
011560 ì‹Æƒtƒ@ƒCƒ‹‚Pì¬‚P SECTION.
011570*
011580*********************
011590*       ‘So—Í      *
011600*********************
011610*
005610     MOVE ¿‹˜a—ï‚v‚q  TO ƒŒƒZ|¿‹˜a—ï.
005620     MOVE ¿‹”N‚v‚q    TO ƒŒƒZ|¿‹”N.
005630     MOVE ¿‹ŒŽ‚v‚q    TO ƒŒƒZ|¿‹ŒŽ.
005640     MOVE 1             TO ƒŒƒZ|Ž{p˜a—ï.
005650     MOVE ZERO          TO ƒŒƒZ|Ž{p”N.
005660     MOVE ZERO          TO ƒŒƒZ|Ž{pŒŽ.
005670     MOVE ZERO          TO ƒŒƒZ|Š³ŽÒ”Ô†.
005680     MOVE LOW-VALUE     TO ƒŒƒZ|Ž}”Ô.
013730     MOVE ZERO          TO ƒŒƒZ|ƒŒƒZŽí•Ê.
004840     START ƒŒƒZƒvƒg‚e   KEY IS >= ƒŒƒZ|¿‹˜a—ï”NŒŽ
004850                                  ƒŒƒZ|Ž{p˜a—ï”NŒŽ
004860                                  ƒŒƒZ|Š³ŽÒƒR[ƒh
000250                                  ƒŒƒZ|ƒŒƒZŽí•Ê
011730     END-START.
011740     IF ó‘ÔƒL[ = "00"
011750         MOVE SPACE  TO I—¹ƒtƒ‰ƒO
011760         PERFORM ƒŒƒZƒvƒg‚e“Çž
               MOVE ƒŒƒZ|ƒŒƒR[ƒh TO ìƒŒƒZ|ƒŒƒR[ƒh
011770         PERFORM UNTIL ( I—¹ƒtƒ‰ƒO = "YES" ) OR
004920                       ( ƒŒƒZ|¿‹˜a—ï NOT = ¿‹˜a—ï‚v‚q ) OR
004930                       ( ƒŒƒZ|¿‹”N   NOT = ¿‹”N‚v‚q   ) OR
004940                       ( ƒŒƒZ|¿‹ŒŽ   NOT = ¿‹ŒŽ‚v‚q   )
011810            PERFORM ƒf[ƒ^ƒ`ƒFƒbƒN
011820** Ž©—R‚Í‘ÎÛŠO
011830            IF  Žó|•ÛŒ¯Ží•Ê = 90
011840                MOVE SPACE  TO ŽÀsƒL[‚v
011850            END-IF
011851** ///
011860** ‚Æ‚è‚ ‚¦‚¸ ˜JÐEŽ©”…Ó‚Í‘ÎÛŠO (ƒŒƒZƒvƒg“à—e‚ªˆá‚¤ˆ×)
011870            IF  Žó|•ÛŒ¯Ží•Ê = 70 OR 80
011880                MOVE SPACE  TO ŽÀsƒL[‚v
011890            END-IF
011900** ///
011910            IF  ŽÀsƒL[‚v = "YES"
011940*
005610               EVALUATE TRUE
011950*            ********
011960*            * Œ’•Û *
011970*            ********
013940               WHEN ƒŒƒZ|ƒŒƒZŽí•Ê   = 1
012000*                **********************
012010*                * ì‹Æƒtƒ@ƒCƒ‹ì¬ *
012020*                **********************
012050                  IF  Žó|•¬Ží•Ê   = ZERO  OR 50
012060                      PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û
012070                  ELSE
                           MOVE 3              TO ìƒŒƒZ|ƒŒƒZŽí•Ê
                           READ ì‹ÆƒŒƒZƒvƒg‚e
                           INVALID KEY
012060                         PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û
                           NOT INVALID KEY
012060                         PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û•¬
                           END-READ
012090                  END-IF
012091* ¿‹‚ª‚ ‚éŽžo—Í
012092                  IF ( ì‚P|¿‹‹àŠz     = ZERO ) AND
012093                     ( ì‚P|·ˆø¿‹‹àŠz = ZERO )
012094                      CONTINUE
012095                  ELSE
012100                      PERFORM ì‚Pƒtƒ@ƒCƒ‹‘ž
012101                  END-IF
012130*            ********
012140*            * ˜Vl *
012150*            ********
013940               WHEN ƒŒƒZ|ƒŒƒZŽí•Ê   = 2
012180*                **********************
012190*                * ì‹Æƒtƒ@ƒCƒ‹ì¬ *
012200*                **********************
012211                  IF Žó|Ž{p˜a—ï”NŒŽ < 42004
012212                     PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒg˜Vl
012213                  ELSE
012215                     IF  Žó|•¬Ží•Ê   = ZERO  OR 50
012216                         PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚
012217                     ELSE
                               MOVE 3              TO ìƒŒƒZ|ƒŒƒZŽí•Ê
                               READ ì‹ÆƒŒƒZƒvƒg‚e
                               INVALID KEY
012060                             PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚
                               NOT INVALID KEY
                                   PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚•¬
                               END-READ
012219                     END-IF
012220                  END-IF
012221* ¿‹‚ª‚ ‚éŽžo—Í
012222                  IF ( ì‚P|¿‹‹àŠz     = ZERO ) AND
012223                     ( ì‚P|·ˆø¿‹‹àŠz = ZERO )
012224                     CONTINUE
012225                  ELSE
012226                     PERFORM ì‚Pƒtƒ@ƒCƒ‹‘ž
012227                  END-IF
004220*            ********
004230*            * •¬ *
004240*            ********
                     WHEN ƒŒƒZ|ƒŒƒZŽí•Ê   = 3
                        IF Žó|Œö”ïŽí•Ê = ZERO
                           MOVE 1           TO ìƒŒƒZ|ƒŒƒZŽí•Ê
                        ELSE
                           MOVE 2           TO ìƒŒƒZ|ƒŒƒZŽí•Ê
                        END-IF
                        READ ì‹ÆƒŒƒZƒvƒg‚e
                        INVALID KEY
012060                     PERFORM ì‚PƒŒƒR[ƒhƒZƒbƒg•¬
012226                     PERFORM ì‚Pƒtƒ@ƒCƒ‹‘ž
                        END-READ
                     END-EVALUATE
                  END-IF
012290            PERFORM ƒŒƒZƒvƒg‚e“Çž
01                MOVE ƒŒƒZ|ƒŒƒR[ƒh TO ìƒŒƒZ|ƒŒƒR[ƒh
012300         END-PERFORM
012310     END-IF.
012320*
012330*================================================================*
012340 ƒf[ƒ^ƒ`ƒFƒbƒN SECTION.
012350*
012360     MOVE SPACE  TO ŽÀsƒL[‚v.
019520* *****************************************************************
019530* * ƒŒƒZƒvƒg‚e‚Ì¿‹‘ÎÛ‹æ•ª = 0 ‚Ìê‡ƒf[ƒ^ì¬‘ÎÛ‚Æ‚µ‚È‚¢ *
019540* *****************************************************************
019640     IF ( ƒŒƒZ|¿‹‘ÎÛ‹æ•ª NOT = ZERO ) AND
005778        ( ƒŒƒZ|žŠÒ•¥‚¢‹æ•ª NOT = 2 OR 3 )
              IF(ƒŒƒZ|ƒŒƒZŽí•Ê = 3) AND ( ƒŒƒZ|‰ï‘Š‡•\ˆóü‘ÎÛ‹æ•ª = 1 )
      *        IF(ƒŒƒZ|ƒŒƒZŽí•Ê = 3)
                 CONTINUE
              ELSE
004090           MOVE ƒŒƒZ|Ž{p˜a—ï  TO Žó|Ž{p˜a—ï
004100           MOVE ƒŒƒZ|Ž{p”N    TO Žó|Ž{p”N
004110           MOVE ƒŒƒZ|Ž{pŒŽ    TO Žó|Ž{pŒŽ
004120           MOVE ƒŒƒZ|Š³ŽÒ”Ô†  TO Žó|Š³ŽÒ”Ô†
004130           MOVE ƒŒƒZ|Ž}”Ô      TO Žó|Ž}”Ô
                 READ ŽófŽÒî•ñ‚e
                 NOT INVALID KEY
005786**      Œ’•Û‚Ì‚Ý
005787              IF Žó|•ÛŒ¯•ª—Þ = 1
019880                 MOVE "YES"  TO ŽÀsƒL[‚v
022370                 MOVE Žó|Ž{p˜a—ï       TO •‰|Ž{p˜a—ï
022380                 MOVE Žó|Ž{p”N         TO •‰|Ž{p”N
022390                 MOVE Žó|Ž{pŒŽ         TO •‰|Ž{pŒŽ
022400                 MOVE Žó|Š³ŽÒƒR[ƒh     TO •‰|Š³ŽÒƒR[ƒh
022410                 READ •‰ƒf[ƒ^‚e
                       END-READ
005789              END-IF
019950           END-READ
              END-IF
019960     END-IF.
012820*
012920*================================================================*
012930 ƒŒƒZƒvƒg‚e“Çž SECTION.
012940*
012950     READ ƒŒƒZƒvƒg‚e NEXT
012960     AT END
012970         MOVE "YES" TO I—¹ƒtƒ‰ƒO
012980     END-READ.
012990*
013071*================================================================*
013072 ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û SECTION.
013073*
013074**********/  Œ’•Û•¬‚È‚µ‚ÌŽž  /**********
013075*
013076     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013077     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013079*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”       TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ƒŒƒZ|‡Œv             TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ƒŒƒZ|ˆê•”•‰’S‹à       TO ì‚P|•‰’S‹àŠz.
013083     MOVE ƒŒƒZ|¿‹‹àŠz         TO ì‚P|¿‹‹àŠz.
013084     MOVE ZERO                   TO ì‚P|˜Vl•¬‹àŠz.
013085*
013086     MOVE ƒŒƒZ|•‰’SŠ„‡         TO ì‚P|•‰’S—¦.
013087* ˜AŒv “]‹L‚ÌŒã
013088     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013089*
013090*================================================================*
013091 ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚ SECTION.
013092*
013093**********/  Œã‚•¬‚È‚µ‚ÌŽž  /**********
013094*
013095     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013096     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013097*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”       TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ƒŒƒZ|‡Œv             TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ƒŒƒZ|ˆê•”•‰’S‹à       TO ì‚P|•‰’S‹àŠz.
013083     MOVE ƒŒƒZ|¿‹‹àŠz         TO ì‚P|¿‹‹àŠz.
013084     MOVE ZERO                   TO ì‚P|˜Vl•¬‹àŠz.
013115*
013086     MOVE ƒŒƒZ|•‰’SŠ„‡         TO ì‚P|•‰’S—¦.
013117* ˜AŒv “]‹L‚ÌŒã
013118     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013120*
013121*================================================================*
013122 ì‚PƒŒƒR[ƒhƒZƒbƒg˜Vl SECTION.
013123*
013124**********/ 27˜Vl‚ÌŽž  /**********
013125*
013126     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013127     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013128*
013129     MOVE Žó|”ï—p•‰’SŽÒ”Ô† TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
013130     MOVE Žó|Žó‰vŽÒ”Ô†˜Vl TO ì‚P|Žó‰vŽÒ”Ô†.
013131*
013132     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013133*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
013083     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
013084     MOVE ZERO               TO ì‚P|˜Vl•¬‹àŠz.
013139*
013140     MOVE ZERO               TO ì‚P|•‰’S—¦.
013141*
013142* ˜AŒv “]‹L‚ÌŒã
013143     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013144*
013145** 15/01 27•¬‘Î‰žiã‹L“]‹LŒãA’uŠ·‚¦j
013146     IF Žó|•¬Ží•Ê = 53 OR 54
013147         MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|•ÛŒ¯ŽÒ”Ô†
013148         EVALUATE Žó|•¬Ží•Ê
013149* gá
013150         WHEN 53
013151             MOVE 14   TO ì‚P|˜Vl•¬
013152* ”í”š
013153         WHEN 54
013154             MOVE 15   TO ì‚P|˜Vl•¬
013155         END-EVALUATE
013156* •¬‹àŠz
013157         MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz
013158         MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz
013159         COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz
013160*
013161     END-IF.
013162**
013163*================================================================*
013164 ì‚PƒŒƒR[ƒhƒZƒbƒgŒ’•Û•¬ SECTION.
013165*
013166**********/  Œ’•Û•¬‚ ‚è‚ÌŽž  /**********
013167*
013168     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013169     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013170*
013171* -- 99XXXXXX ‚Å‚à“]‹L‚·‚é ---
013172     MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
013173*
013174     IF ( Žó|Žó‰vŽÒ”Ô†•¬(1:1) = "*"  ) OR
013175        ( Žó|Žó‰vŽÒ”Ô†•¬(1:2) = "–" )
013176        MOVE SPACE                TO ì‚P|Žó‰vŽÒ”Ô†
013177     ELSE
013178        MOVE Žó|Žó‰vŽÒ”Ô†•¬   TO ì‚P|Žó‰vŽÒ”Ô†
013179     END-IF.
013180*
013181**     MOVE Žó|•¬•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013182     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013183*
013184*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
013083     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
013189*
013086     MOVE ƒŒƒZ|•‰’SŠ„‡     TO ì‚P|•‰’S—¦.
013191*
013192* •¬‹àŠz
013193     MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz TO ì‚P|Ž©ŒÈ•‰’S‹àŠz.
013194     MOVE ƒŒƒZ|•¬¿‹‹àŠz TO ì‚P|·ˆø¿‹‹àŠz.
013195     COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz.
013196*
013197* ˜AŒv “]‹L‚ÌŒã
013198     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013199*
013200*================================================================*
013201 ì‚PƒŒƒR[ƒhƒZƒbƒgŒã‚•¬ SECTION.
013202*
013203**********/  Œã‚•¬‚ ‚è‚ÌŽž  /**********
013204*
013205     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013206     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013207*
013208* -- 99XXXXXX ‚Å‚à“]‹L‚·‚é ---
013209     MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
013210*
013211     IF ( Žó|Žó‰vŽÒ”Ô†•¬(1:1) = "*"  ) OR
013212        ( Žó|Žó‰vŽÒ”Ô†•¬(1:2) = "–" )
013213        MOVE SPACE                TO ì‚P|Žó‰vŽÒ”Ô†
013214     ELSE
013215        MOVE Žó|Žó‰vŽÒ”Ô†•¬   TO ì‚P|Žó‰vŽÒ”Ô†
013216     END-IF.
013217*
013218**     MOVE Žó|•¬•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013219**     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013220*
013221*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ƒŒƒZ|‡Œv         TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ƒŒƒZ|ˆê•”•‰’S‹à   TO ì‚P|•‰’S‹àŠz.
013083     MOVE ƒŒƒZ|¿‹‹àŠz     TO ì‚P|¿‹‹àŠz.
013226*
013086     MOVE ƒŒƒZ|•‰’SŠ„‡     TO ì‚P|•‰’S—¦.
013228*
013229* •¬‹àŠz
013230     MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz.
013231     MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz.
013232     COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz.
013233*
013234* ˜AŒv “]‹L‚ÌŒã
013235     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013236*
013200*================================================================*
013201 ì‚PƒŒƒR[ƒhƒZƒbƒg•¬ SECTION.
013202*
013203**********/  •¬‚Ì‚Ý‚ÌŽž  /**********
013204*
013205     MOVE SPACE TO ì‚P|ƒŒƒR[ƒh.
013206     INITIALIZE ì‚P|ƒŒƒR[ƒh.
013207*
013208* -- 99XXXXXX ‚Å‚à“]‹L‚·‚é ---
013209     MOVE Žó|”ï—p•‰’SŽÒ”Ô†•¬  TO ì‚P|”ï—p•‰’SŽÒ”Ô†.
013210*
013211     IF ( Žó|Žó‰vŽÒ”Ô†•¬(1:1) = "*"  ) OR
013212        ( Žó|Žó‰vŽÒ”Ô†•¬(1:2) = "–" )
013213        MOVE SPACE                TO ì‚P|Žó‰vŽÒ”Ô†
013214     ELSE
013215        MOVE Žó|Žó‰vŽÒ”Ô†•¬   TO ì‚P|Žó‰vŽÒ”Ô†
013216     END-IF.
013217*
013218**     MOVE Žó|•¬•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013219**     MOVE Žó|˜Vl•‰’S‹à–Æœ TO ì‚P|•¬Ž©ŒÈ•‰’S‹à–¢•¥.
013220*
013221*
013080     MOVE ƒŒƒZ|ƒŒƒZŽÀ“ú”   TO ì‚P|’Ê‰@‰ñ”.
013081     MOVE ZERO               TO ì‚P|”ï—p‡Œv‹àŠz.
013082     MOVE ZERO               TO ì‚P|•‰’S‹àŠz.
013083     MOVE ZERO               TO ì‚P|¿‹‹àŠz.
013226*
013086     MOVE ƒŒƒZ|•‰’SŠ„‡     TO ì‚P|•‰’S—¦.
013228*
013229* •¬‹àŠz
013230     MOVE ƒŒƒZ|Žó‹‹ŽÒ•‰’SŠz   TO ì‚P|Ž©ŒÈ•‰’S‹àŠz.
013231     MOVE ƒŒƒZ|•¬¿‹‹àŠz   TO ì‚P|·ˆø¿‹‹àŠz.
013232     COMPUTE ì‚P|‡Œv¿‹‹àŠz = ì‚P|Ž©ŒÈ•‰’S‹àŠz + ì‚P|·ˆø¿‹‹àŠz.
013233*
013234* ˜AŒv “]‹L‚ÌŒã
013235     PERFORM ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg.
013236*
013238*================================================================*
013740*================================================================*
013750 ‹¤’ÊƒŒƒR[ƒhƒZƒbƒg SECTION.
013760*
013770     MOVE ƒŒƒZ|¿‹˜a—ï     TO ì‚P|¿‹˜a—ï.
013780     MOVE ƒŒƒZ|¿‹”N       TO ì‚P|¿‹”N.
013790     MOVE ƒŒƒZ|¿‹ŒŽ       TO ì‚P|¿‹ŒŽ.
013791     MOVE Žó|Ž{p˜a—ï       TO ì‚P|Ž{p˜a—ï Ž{p˜a—ï‚v‚q.
013792     MOVE Žó|Ž{p”N         TO ì‚P|Ž{p”N Ž{p”N‚v‚q.
013793     MOVE Žó|Ž{pŒŽ         TO ì‚P|Ž{pŒŽ Ž{pŒŽ‚v‚q.
013800     MOVE Žó|Š³ŽÒƒR[ƒh     TO ì‚P|Š³ŽÒƒR[ƒh Š³ŽÒƒR[ƒh‚v‚q.
013810****     MOVE ‰ïˆõ”Ô†”Žš‚v     TO ì‚P|‰ïˆõ”Ô†.
013811     MOVE ‰ïˆõ”Ô†‚v         TO ì‚P|‰ïˆõ”Ô†.
013820*
013830     PERFORM •ÛŒ¯‹æ•ªŽæ“¾.
013840*
013850     MOVE Žó|•ÛŒ¯ŽÒ”Ô†     TO ì‚P|•ÛŒ¯ŽÒ”Ô†.
013860     MOVE Žó|Š³ŽÒŽ–¼       TO ì‚P|Š³ŽÒŽ–¼.
013870     MOVE Žó|Š³ŽÒƒJƒi       TO ì‚P|Š³ŽÒƒJƒi.
013880     MOVE Žó|Š³ŽÒ«•Ê       TO ì‚P|Š³ŽÒ«•Ê.
013890     MOVE Žó|Š³ŽÒ¶”NŒŽ“ú   TO ì‚P|Š³ŽÒ¶”NŒŽ“ú.
013891** ˜a—ï –¾Ž¡‚Æº˜a‚ð‹t‚É‚·‚éB
013892     EVALUATE ì‚P|Š³ŽÒ˜a—ï
013893     WHEN 1 
013894        MOVE  3  TO ì‚P|Š³ŽÒ˜a—ï
013895     WHEN 3 
013896        MOVE  1  TO ì‚P|Š³ŽÒ˜a—ï
013897     END-EVALUATE.
013898*
013900     MOVE Žó|Ž‘ŠiŽæ“¾”NŒŽ“ú TO ì‚P|Ž‘ŠiŽæ“¾”NŒŽ“ú.
013910     MOVE Žó|—LŒø”NŒŽ“ú     TO ì‚P|—LŒø”NŒŽ“ú.
013920     MOVE Žó|–{l‰Æ‘°‹æ•ª   TO ì‚P|–{l‰Æ‘°‹æ•ª.
013930     IF Žó|–{l‰Æ‘°‹æ•ª = 1
013940         MOVE NC"–{l"    TO ‘±•¿‚v
013950     ELSE
013960         MOVE 05          TO –¼|‹æ•ªƒR[ƒh
013970         MOVE Žó|‘±•¿    TO –¼|–¼ÌƒR[ƒh
013980         READ –¼Ìƒ}ƒXƒ^
013990         INVALID KEY
014000             MOVE SPACE     TO ‘±•¿‚v
014010         NOT INVALID KEY
014020             MOVE –¼|—ªÌ  TO ‘±•¿‚v
014030         END-READ
014040     END-IF.
014050     MOVE ‘±•¿‚v             TO ì‚P|‘±•¿.
014060*
014070     MOVE Žó|”í•ÛŒ¯ŽÒŽ–¼   TO ì‚P|”í•ÛŒ¯ŽÒŽ–¼.
014080     MOVE Žó|”í•ÛŒ¯ŽÒƒJƒi   TO ì‚P|”í•ÛŒ¯ŽÒƒJƒi.
014090     MOVE Žó|”í•ÛŒ¯ŽÒ«•Ê   TO ì‚P|”í•ÛŒ¯ŽÒ«•Ê.
014100     MOVE Žó|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú   TO ì‚P|”í•ÛŒ¯ŽÒ¶”NŒŽ“ú.
014101*
014102** ˜a—ï –¾Ž¡‚Æº˜a‚ð‹t‚É‚·‚éB
014103     EVALUATE ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
014104     WHEN 1 
014105        MOVE  3  TO ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
014106     WHEN 3 
014107        MOVE  1  TO ì‚P|”í•ÛŒ¯ŽÒ˜a—ï
014108     END-EVALUATE.
014109**
      *-----------------------------------------------------------------*
           MOVE SPACE TO ˜AˆÃ†•¡‡|ˆÃ†î•ñ.
      *
      *    / ˜AˆÃ†•¡‡|“ü—Íî•ñƒZƒbƒg /
           MOVE Žó|‹L†       TO ˜AˆÃ†•¡‡|‹L†.
           MOVE Žó|”Ô†       TO ˜AˆÃ†•¡‡|”Ô†.
           MOVE Žó|ˆÃ†‰»€–Ú TO ˜AˆÃ†•¡‡|ˆÃ†‰»€–Ú.
      *
           CALL   •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v.
           CANCEL •¡‡ƒvƒƒOƒ‰ƒ€–¼‚v.
      *
      *-----------------------------------------------------------------*
014110*
014120*     IF ( Žó|”Ô†(1:1) = "*"  ) OR
014130*        ( Žó|”Ô†(1:2) = "–" )
007430     IF ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†(1:1) = "*"  ) OR
007440        ( ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†(1:2) = "–" )
014140        MOVE SPACE           TO ì‚P|”Ô†
014150     ELSE
014160        MOVE ˜AˆÃ†•¡‡|•¡‡‚µ‚½”Ô†        TO ì‚P|”Ô†
014170     END-IF.
014180*
014190*     IF Žó|‹L†(1:1)  = NC"–" 
007530     IF ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†(1:2)  = "–" 
014200        MOVE SPACE               TO ‹L†‚o‚m‚v
014210        INSPECT ‹L†‚o‚m‚v  REPLACING ALL ”¼Šp‹ó”’ BY ‘SŠp‹ó”’
014220        MOVE ‹L†‚o‚v            TO ì‚P|‹L†
014230     ELSE
014240        PERFORM ‹L†¶‹l‚ß
014250        MOVE ‹L†‚v              TO ì‚P|‹L†
014260     END-IF.
014270*
014281     PERFORM •‰ƒf[ƒ^Žæ“¾.
014290     PERFORM —¿‹àî•ñŽæ“¾.
014310     MOVE ‰ŒŸ—¿‚v‚q             TO  ì‚P|‰fŠî–{—¿.
014320*
014330     MOVE ‰ŒŸ‰ÁŽZ—¿‚v‚q         TO  ì‚P|‰f‰ÁŽZ—¿.
014340     MOVE ‰—Ã‰ñ”‚v‚q           TO  ì‚P|‰ñ”.
014350     MOVE ‰—Ã—¿‚v‚q             TO  ì‚P|‰—Ã—¿‹àŠz.
014361*
014362     IF ( ƒŒƒZ|–éŠÔ     = 1 ) OR
014363        ( ƒŒƒZ|–\•—‰Já = 1 ) OR
014364        ( ƒŒƒZ|“ï˜H     = 1 )
014365         MOVE 1  TO  ì‚P|‰ÁŽZ
014366     END-IF.
014380*
014390     MOVE ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q     TO ì‚P|‹àŠz.
014400*
014410     MOVE ‘å‚v                   TO ì‚P|‘å.
014420     MOVE ’†‚v                   TO ì‚P|’†.
014430     MOVE ¬‚v                   TO ì‚P|¬.
014440*
014450     MOVE Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q     TO ì‚P|î•ñ’ñ‹Ÿ—¿.
014460*
014470     MOVE •‰Ží•Ê‚v(1)          TO ì‚P|Ží•Ê(1).
014480     MOVE •”ˆÊ‚v(1)              TO ì‚P|•”ˆÊƒR[ƒh(1).
014490     MOVE Œã—Ã‰ñ”‚P‚v‚q         TO ì‚P|Œã—Ã‰ñ”(1).
014500     MOVE Œã—Ã—¿‚P‚v‚q           TO ì‚P|Œã—Ã‹àŠz(1).
014510     MOVE —âãª–@‰ñ”‚P‚v‚q       TO ì‚P|—âãª‰ñ”(1).
014520     MOVE —âãª–@—¿‚P‚v‚q         TO ì‚P|—âãª‹àŠz(1).
014530     MOVE ‰‰ñˆ’u—¿‚v‚q(1)      TO ì‚P|Ž{p—¿(1).
014540     MOVE ‰·ãª–@‰ñ”‚P‚v‚q       TO ì‚P|ãª–@‰ñ”(1).
014550     MOVE ‰·ãª–@—¿‚P‚v‚q         TO ì‚P|ãª–@‹àŠz(1).
014560     MOVE “d—Ã‰ñ”‚P‚v‚q         TO ì‚P|“d—Ã‰ñ”(1).
014570     MOVE “d—Ã—¿‚P‚v‚q           TO ì‚P|“d—Ã‹àŠz(1).
014580     MOVE “]‹A‹æ•ª‚v(1)          TO ì‚P|“]‹A‹æ•ª(1).
014590     MOVE •‰Ží•Ê‚v(2)          TO ì‚P|Ží•Ê(2).
014600     MOVE •”ˆÊ‚v(2)              TO ì‚P|•”ˆÊƒR[ƒh(2).
014610     MOVE Œã—Ã‰ñ”‚Q‚v‚q         TO ì‚P|Œã—Ã‰ñ”(2).
014620     MOVE Œã—Ã—¿‚Q‚v‚q           TO ì‚P|Œã—Ã‹àŠz(2).
014630     MOVE —âãª–@‰ñ”‚Q‚v‚q       TO ì‚P|—âãª‰ñ”(2).
014640     MOVE —âãª–@—¿‚Q‚v‚q         TO ì‚P|—âãª‹àŠz(2).
014650     MOVE ‰‰ñˆ’u—¿‚v‚q(2)      TO ì‚P|Ž{p—¿(2).
014660     MOVE ‰·ãª–@‰ñ”‚Q‚v‚q       TO ì‚P|ãª–@‰ñ”(2).
014670     MOVE ‰·ãª–@—¿‚Q‚v‚q         TO ì‚P|ãª–@‹àŠz(2).
014680     MOVE “d—Ã‰ñ”‚Q‚v‚q         TO ì‚P|“d—Ã‰ñ”(2).
014690     MOVE “d—Ã—¿‚Q‚v‚q           TO ì‚P|“d—Ã‹àŠz(2).
014700     MOVE “]‹A‹æ•ª‚v(2)          TO ì‚P|“]‹A‹æ•ª(2).
014710     MOVE •‰Ží•Ê‚v(3)          TO ì‚P|Ží•Ê(3).
014720     MOVE •”ˆÊ‚v(3)              TO ì‚P|•”ˆÊƒR[ƒh(3).
014730     MOVE Œã—Ã‰ñ”‚R‚v‚q         TO ì‚P|Œã—Ã‰ñ”(3).
014740     MOVE Œã—Ã—¿‚R‚v‚q           TO ì‚P|Œã—Ã‹àŠz(3).
014750     MOVE —âãª–@‰ñ”‚R‚v‚q       TO ì‚P|—âãª‰ñ”(3).
014760     MOVE —âãª–@—¿‚R‚v‚q         TO ì‚P|—âãª‹àŠz(3).
014770     MOVE ‰‰ñˆ’u—¿‚v‚q(3)      TO ì‚P|Ž{p—¿(3).
014780     MOVE ‰·ãª–@‰ñ”‚R‚v‚q       TO ì‚P|ãª–@‰ñ”(3).
014790     MOVE ‰·ãª–@—¿‚R‚v‚q         TO ì‚P|ãª–@‹àŠz(3).
014800     MOVE “d—Ã‰ñ”‚R‚v‚q         TO ì‚P|“d—Ã‰ñ”(3).
014810     MOVE “d—Ã—¿‚R‚v‚q           TO ì‚P|“d—Ã‹àŠz(3).
014820     MOVE “]‹A‹æ•ª‚v(3)          TO ì‚P|“]‹A‹æ•ª(3).
014830     MOVE •‰Ží•Ê‚v(4)          TO ì‚P|Ží•Ê(4).
014840     MOVE •”ˆÊ‚v(4)              TO ì‚P|•”ˆÊƒR[ƒh(4).
014850     MOVE Œã—Ã‰ñ”‚S‚v‚q         TO ì‚P|Œã—Ã‰ñ”(4).
014860     MOVE Œã—Ã—¿‚S‚v‚q           TO ì‚P|Œã—Ã‹àŠz(4).
014870     MOVE —âãª–@‰ñ”‚S‚v‚q       TO ì‚P|—âãª‰ñ”(4).
014880     MOVE —âãª–@—¿‚S‚v‚q         TO ì‚P|—âãª‹àŠz(4).
014890     MOVE ‰‰ñˆ’u—¿‚v‚q(4)      TO ì‚P|Ž{p—¿(4).
014900     MOVE ‰·ãª–@‰ñ”‚S‚v‚q       TO ì‚P|ãª–@‰ñ”(4).
014910     MOVE ‰·ãª–@—¿‚S‚v‚q         TO ì‚P|ãª–@‹àŠz(4).
014920     MOVE “d—Ã‰ñ”‚S‚v‚q         TO ì‚P|“d—Ã‰ñ”(4).
014930     MOVE “d—Ã—¿‚S‚v‚q           TO ì‚P|“d—Ã‹àŠz(4).
014940     MOVE “]‹A‹æ•ª‚v(4)          TO ì‚P|“]‹A‹æ•ª(4).
014950     MOVE •‰Ží•Ê‚v(5)          TO ì‚P|Ží•Ê(5).
014960     MOVE •”ˆÊ‚v(5)              TO ì‚P|•”ˆÊƒR[ƒh(5).
014970     MOVE Œã—Ã‰ñ”‚T‚v‚q         TO ì‚P|Œã—Ã‰ñ”(5).
014980     MOVE Œã—Ã—¿‚T‚v‚q           TO ì‚P|Œã—Ã‹àŠz(5).
014990     MOVE —âãª–@‰ñ”‚T‚v‚q       TO ì‚P|—âãª‰ñ”(5).
015000     MOVE —âãª–@—¿‚T‚v‚q         TO ì‚P|—âãª‹àŠz(5).
015010     MOVE ‰‰ñˆ’u—¿‚v‚q(5)      TO ì‚P|Ž{p—¿(5).
015020     MOVE ‰·ãª–@‰ñ”‚T‚v‚q       TO ì‚P|ãª–@‰ñ”(5).
015030     MOVE ‰·ãª–@—¿‚T‚v‚q         TO ì‚P|ãª–@‹àŠz(5).
015040     MOVE “d—Ã‰ñ”‚T‚v‚q         TO ì‚P|“d—Ã‰ñ”(5).
015050     MOVE “d—Ã—¿‚T‚v‚q           TO ì‚P|“d—Ã‹àŠz(5).
015060     MOVE “]‹A‹æ•ª‚v(5)          TO ì‚P|“]‹A‹æ•ª(5).
015070*
015090* 1‚Â‚Å‚àŒp‘±‚ª‚ ‚ê‚Î 9 ‚ð“]‹L
015100     IF Œp‘±ƒtƒ‰ƒO = "YES"
015110         MOVE  9                 TO ì‚P|“]‹A‹æ•ª‘‡
015120     END-IF.
015130*
016220*================================================================*
016230 ì‚Pƒtƒ@ƒCƒ‹‘ž SECTION.
016240*
016250     WRITE ì‚P|ƒŒƒR[ƒh
016260     INVALID KEY
016270         MOVE NC"ì‚P"  TO ƒtƒ@ƒCƒ‹–¼
016280         PERFORM ƒGƒ‰[•\Ž¦
016290     END-WRITE.
016300*================================================================*
016740*================================================================*
016750 ‰ïˆõ”Ô†‰E‹l‚ß SECTION.
016760*
016770     MOVE ‰ïˆõ”Ô†‚v      TO  ‰ïˆõ”Ô†¶‹l‚ß‚v.
016780     MOVE ZERO            TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v.
016790     MOVE ZERO            TO  ‰ïˆõ”Ô†”Žš‚v.
016800*
016810     MOVE  8  TO  ƒJƒEƒ“ƒ^.
016820*
016830     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(7) NOT = SPACE
016840         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
016850         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(7)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
016860     END-IF.
016870     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(6) NOT = SPACE
016880         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
016890         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(6)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
016900     END-IF.
016910     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(5) NOT = SPACE
016920         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
016930         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(5)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
016940     END-IF.
016950     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(4) NOT = SPACE
016960         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
016970         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(4)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
016980     END-IF.
016990     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(3) NOT = SPACE
017000         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
017010         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(3)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
017020     END-IF.
017030     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(2) NOT = SPACE
017040         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
017050         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(2)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
017060     END-IF.
017070     IF  ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(1) NOT = SPACE
017080         COMPUTE ƒJƒEƒ“ƒ^ = ƒJƒEƒ“ƒ^  -  1
017090         MOVE ‰ïˆõ”Ô†¶‹l‚ß‚v‚P(1)  TO  ‰ïˆõ”Ô†‰E‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^)
017100     END-IF.
017110*
017120     MOVE ‰ïˆõ”Ô†‰E‹l‚ß‚v TO ‰ïˆõ”Ô†”Žš‚v.
017130*
017140*================================================================*
017150 ‹L†¶‹l‚ß SECTION.
017160*
017170***** ‹L†‚Ì–³‘Ê‚ÈSPACE‚ðŽæ‚èœ‚¢‚ÄA¶‹l‚ß‚É‚·‚éB
017180     MOVE SPACE           TO  ‹L†‚m‚v.
017190     MOVE SPACE           TO  ‹L†Œ³‚v.
017200     MOVE SPACE           TO  ‹L†¶‹l‚ß‚v.
017210     MOVE ˜AˆÃ†•¡‡|•¡‡‚µ‚½‹L†        TO  ‹L†Œ³‚v.
017220*
017230     MOVE  ZERO  TO  ƒJƒEƒ“ƒ^‚Q.
017240     PERFORM VARYING ƒJƒEƒ“ƒ^ FROM 1 BY 1 UNTIL ƒJƒEƒ“ƒ^ > 12
017250          IF  ‹L†Œ³‚v‚P(ƒJƒEƒ“ƒ^) NOT = SPACE
017260              COMPUTE ƒJƒEƒ“ƒ^‚Q = ƒJƒEƒ“ƒ^‚Q  +  1
017270              MOVE ‹L†Œ³‚v‚P(ƒJƒEƒ“ƒ^)  TO  ‹L†¶‹l‚ß‚v‚P(ƒJƒEƒ“ƒ^‚Q)
017280          END-IF
017290     END-PERFORM.
017300*
017310     MOVE ‹L†¶‹l‚ß‚v    TO ‹L†‚m‚v.
017320*
017330*”¼ŠpƒXƒy[ƒX‚ð‘SŠp‚É‚©‚¦‚é
017340     INSPECT ‹L†‚v REPLACING ALL ”¼Šp‹ó”’ BY ‘SŠp‹ó”’.
017350*
017360*================================================================*
017361*================================================================*
017362 •ÛŒ¯‹æ•ªŽæ“¾ SECTION.
017363*
017364*
017365     IF ( Žó|•¬Ží•Ê NOT = ZERO ) OR
017366        (( Žó|Œö”ïŽí•Ê = 05 ) AND ( Žó|Ž{p˜a—ï”NŒŽ < 42004 ))
017368**-- •¬E˜Vl --
017369         IF ( Žó|Œö”ïŽí•Ê = 05 ) AND ( Žó|Ž{p˜a—ï”NŒŽ < 42004 )
017371             MOVE 05     TO ì‚P|•ÛŒ¯‹æ•ª
017372         ELSE
017373             EVALUATE Žó|•¬Ží•Ê
017374* ¶•Û
017375             WHEN 50
017376                 MOVE 10     TO ì‚P|•ÛŒ¯‹æ•ª
017377* ‚S‚P˜Vl
017378             WHEN 51
017379                 MOVE 05     TO ì‚P|•ÛŒ¯‹æ•ª
017380* ‚Ð‚Æ‚èe
017381             WHEN 52
017382                 MOVE 13     TO ì‚P|•ÛŒ¯‹æ•ª
017383* gá
017384             WHEN 53
017385             WHEN 60
017386                 MOVE 14     TO ì‚P|•ÛŒ¯‹æ•ª
017387* ”í”š
017388             WHEN 54
017389                 MOVE 15     TO ì‚P|•ÛŒ¯‹æ•ª
017390* “û—cŽ™
017391             WHEN 55
017392                 MOVE 16     TO ì‚P|•ÛŒ¯‹æ•ª
017393             END-EVALUATE
017394         END-IF
017395         EVALUATE Žó|•ÛŒ¯Ží•Ê
017396* ‘•Û
017397         WHEN 01
017398* ŽÐ•Û
017399         WHEN 02
017400* ‘g‡
017401         WHEN 03
017402* ‹¤Ï
017403         WHEN 04
017404* “úŒÙ
017405         WHEN 06
017406* ‘Dˆõ
017407         WHEN 07
017408* ‘ÞE
017409         WHEN 08
017410             MOVE Žó|•ÛŒ¯Ží•Ê TO ì‚P|˜Vl•¬
017411* Ž©‰qŠ¯
017412         WHEN 09
017413             MOVE 4 TO ì‚P|˜Vl•¬
017414* ŒãŠú‚—î
017415         WHEN 05
017416***             MOVE 30 TO ì‚P|˜Vl•¬
017417             MOVE 05 TO ì‚P|˜Vl•¬
017418*
017419         WHEN OTHER
017420             MOVE SPACE                TO ƒGƒ‰[ƒƒbƒZ[ƒW‚v
017421             MOVE Žó|Š³ŽÒƒR[ƒh       TO ƒGƒ‰[Š³ŽÒƒR[ƒh‚v
017422             MOVE Žó|•ÛŒ¯Ží•Ê         TO ƒGƒ‰[•ÛŒ¯Ží•Ê‚v
017423             MOVE "-"                  TO ƒGƒ‰[‹æØ‚è‚v
017424             MOVE  NC"•ÛŒ¯Ží•Ê‚ªˆÙí‚Å‚·BŠ³ŽÒ|•ÛŒ¯Ží•Ê" TO ˜Aƒ‚R|ƒƒbƒZ[ƒW
017425             MOVE  ƒGƒ‰[ƒƒbƒZ[ƒW‚v  TO ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P
017426             CALL   "MSG003"
017427             CANCEL "MSG003"
017428         END-EVALUATE
017429     ELSE
017430**-- Œ’•Û --
017431         EVALUATE Žó|•ÛŒ¯Ží•Ê
017432* ‘•Û
017433         WHEN 01
017434* ŽÐ•Û
017435         WHEN 02
017436* ‘g‡
017437         WHEN 03
017438* ‹¤Ï
017439         WHEN 04
017440* “úŒÙ
017441         WHEN 06
017442* ‘Dˆõ
017443         WHEN 07
017444* ‘ÞE
017445         WHEN 08
017446             MOVE Žó|•ÛŒ¯Ží•Ê TO ì‚P|•ÛŒ¯‹æ•ª
017447* Ž©‰qŠ¯
017448         WHEN 09
017449             MOVE 4 TO ì‚P|•ÛŒ¯‹æ•ª
017450* ˜JÐ
017451         WHEN 70
017452             MOVE 9 TO ì‚P|•ÛŒ¯‹æ•ª
017453* Ž©”…Ó
017454         WHEN 80
017455             MOVE 12 TO ì‚P|•ÛŒ¯‹æ•ª
017456* ŒãŠú‚—î
017457         WHEN 05
017458***             MOVE 30 TO ì‚P|•ÛŒ¯‹æ•ª
017459             MOVE 05 TO ì‚P|•ÛŒ¯‹æ•ª
017461*
017462         WHEN OTHER
017463             MOVE SPACE                TO ƒGƒ‰[ƒƒbƒZ[ƒW‚v
017464             MOVE Žó|Š³ŽÒƒR[ƒh       TO ƒGƒ‰[Š³ŽÒƒR[ƒh‚v
017465             MOVE Žó|•ÛŒ¯Ží•Ê         TO ƒGƒ‰[•ÛŒ¯Ží•Ê‚v
017466             MOVE "-"                  TO ƒGƒ‰[‹æØ‚è‚v
017467             MOVE  NC"•ÛŒ¯Ží•Ê‚ªˆÙí‚Å‚·BŠ³ŽÒ|•ÛŒ¯Ží•Ê" TO ˜Aƒ‚R|ƒƒbƒZ[ƒW
017468             MOVE  ƒGƒ‰[ƒƒbƒZ[ƒW‚v  TO ˜Aƒ‚R|ƒƒbƒZ[ƒW‚P
017469             CALL   "MSG003"
017470             CANCEL "MSG003"
017471         END-EVALUATE
017472     END-IF.
017473*
017474*================================================================*
018800*================================================================*
018810 —¿‹àî•ñŽæ“¾ SECTION.
018820*
018830***********************************************
018840* —¿‹àƒf[ƒ^ƒZƒbƒg                            *
018850***********************************************
018860*    ****************************************************************
018870*    * —¿‹àiŒŽ–ˆji•‰–ˆji’üŒ¸–ˆj‚É‚Â‚¢‚Ä‚Í˜AŒ‹€–Ú‚æ‚èƒZƒbƒg *
018880*    ****************************************************************
018890     INITIALIZE —¿‹à‚P‚v‚q.
018900     INITIALIZE —¿‹à‚Q‚v‚q.
018910     INITIALIZE —¿‹à‚R‚v‚q.
018920     MOVE ƒŒƒZ|‰ŒŸ—¿                 TO  ‰ŒŸ—¿‚v‚q.
018930*
018940     MOVE ƒŒƒZ|‰ŒŸ‰ÁŽZ—¿             TO  ‰ŒŸ‰ÁŽZ—¿‚v‚q.
018950     MOVE ƒŒƒZ|ÄŒŸ—¿                 TO  ÄŒŸ—¿‚v‚q.
018960     MOVE ƒŒƒZ|‰—Ã‰ñ”               TO  ‰—Ã‰ñ”‚v‚q.
018970     MOVE ƒŒƒZ|‰—Ã—¿                 TO  ‰—Ã—¿‚v‚q.
018980     MOVE ƒŒƒZ|‰—Ã‰ÁŽZ—¿             TO  ‰—Ã‰ÁŽZ—¿‚v‚q.
018990*
019000*
019010     MOVE ƒŒƒZ|‹à‘®•›Žq‰ÁŽZ—¿         TO  ‹à‘®•›Žq‰ÁŽZ—¿‚v‚q.
019020*
019030     MOVE ƒŒƒZ|‘å                     TO ‘å‚v.
019040     MOVE ƒŒƒZ|’†                     TO ’†‚v.
019050     MOVE ƒŒƒZ|¬                     TO ¬‚v.
019060*
019070     MOVE ƒŒƒZ|Ž{pî•ñ’ñ‹Ÿ—¿         TO  Ž{pî•ñ’ñ‹Ÿ—¿‚v‚q.
019080********************
019090* ‰‰ñˆ’u—¿ƒZƒbƒg *
019100********************
019110     PERFORM VARYING •”ˆÊ‚b‚m‚s FROM 1 BY 1
019120             UNTIL ( •”ˆÊ‚b‚m‚s > •”ˆÊ”‚v )
019130         MOVE ƒŒƒZ|‰‰ñˆ’u—¿(•”ˆÊ‚b‚m‚s) TO ‰‰ñˆ’u—¿‚v‚q(•”ˆÊ‚b‚m‚s)
019140     END-PERFORM.
019150********************
019160* ’üŒ¸–ˆ—¿‹àƒZƒbƒg *
019170********************
019180*    **********
019190*    * ‚P•”ˆÊ *
019200*    **********
019210     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚P             TO Œã—Ã‰ñ”‚P‚v‚q.
019220     MOVE ƒŒƒZ|Œã—Ã—¿‚P               TO Œã—Ã—¿‚P‚v‚q.
019230     MOVE ƒŒƒZ|—âãª–@‰ñ”‚P           TO —âãª–@‰ñ”‚P‚v‚q.
019240     MOVE ƒŒƒZ|—âãª–@—¿‚P             TO —âãª–@—¿‚P‚v‚q.
019250     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚P           TO ‰·ãª–@‰ñ”‚P‚v‚q.
019260     MOVE ƒŒƒZ|‰·ãª–@—¿‚P             TO ‰·ãª–@—¿‚P‚v‚q.
019270     MOVE ƒŒƒZ|“d—Ã‰ñ”‚P             TO “d—Ã‰ñ”‚P‚v‚q.
019280     MOVE ƒŒƒZ|“d—Ã—¿‚P               TO “d—Ã—¿‚P‚v‚q.
019290*    **********
019300*    * ‚Q•”ˆÊ *
019310*    **********
019320     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚Q             TO Œã—Ã‰ñ”‚Q‚v‚q.
019330     MOVE ƒŒƒZ|Œã—Ã—¿‚Q               TO Œã—Ã—¿‚Q‚v‚q.
019340     MOVE ƒŒƒZ|—âãª–@‰ñ”‚Q           TO —âãª–@‰ñ”‚Q‚v‚q.
019350     MOVE ƒŒƒZ|—âãª–@—¿‚Q             TO —âãª–@—¿‚Q‚v‚q.
019360     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚Q           TO ‰·ãª–@‰ñ”‚Q‚v‚q.
019370     MOVE ƒŒƒZ|‰·ãª–@—¿‚Q             TO ‰·ãª–@—¿‚Q‚v‚q.
019380     MOVE ƒŒƒZ|“d—Ã‰ñ”‚Q             TO “d—Ã‰ñ”‚Q‚v‚q.
019390     MOVE ƒŒƒZ|“d—Ã—¿‚Q               TO “d—Ã—¿‚Q‚v‚q.
019400*    ****************
019410*    * ‚R•”ˆÊ^‚WŠ„ *
019420*    ****************
019430     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚R‚W             TO Œã—Ã‰ñ”‚R‚W‚v‚q.
019440     MOVE ƒŒƒZ|Œã—Ã—¿‚R‚W               TO Œã—Ã—¿‚R‚W‚v‚q.
019450     MOVE ƒŒƒZ|—âãª–@‰ñ”‚R‚W           TO —âãª–@‰ñ”‚R‚W‚v‚q.
019460     MOVE ƒŒƒZ|—âãª–@—¿‚R‚W             TO —âãª–@—¿‚R‚W‚v‚q.
019470     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚R‚W           TO ‰·ãª–@‰ñ”‚R‚W‚v‚q.
019480     MOVE ƒŒƒZ|‰·ãª–@—¿‚R‚W             TO ‰·ãª–@—¿‚R‚W‚v‚q.
019490     MOVE ƒŒƒZ|“d—Ã‰ñ”‚R‚W             TO “d—Ã‰ñ”‚R‚W‚v‚q.
019500     MOVE ƒŒƒZ|“d—Ã—¿‚R‚W               TO “d—Ã—¿‚R‚W‚v‚q.
019510*    ****************
019520*    * ‚R•”ˆÊ^10Š„ *
019530*    ****************
019540     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚R‚O             TO Œã—Ã‰ñ”‚R‚O‚v‚q.
019550     MOVE ƒŒƒZ|Œã—Ã—¿‚R‚O               TO Œã—Ã—¿‚R‚O‚v‚q.
019560     MOVE ƒŒƒZ|—âãª–@‰ñ”‚R‚O           TO —âãª–@‰ñ”‚R‚O‚v‚q.
019570     MOVE ƒŒƒZ|—âãª–@—¿‚R‚O             TO —âãª–@—¿‚R‚O‚v‚q.
019580     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚R‚O           TO ‰·ãª–@‰ñ”‚R‚O‚v‚q.
019590     MOVE ƒŒƒZ|‰·ãª–@—¿‚R‚O             TO ‰·ãª–@—¿‚R‚O‚v‚q.
019600     MOVE ƒŒƒZ|“d—Ã‰ñ”‚R‚O             TO “d—Ã‰ñ”‚R‚O‚v‚q.
019610     MOVE ƒŒƒZ|“d—Ã—¿‚R‚O               TO “d—Ã—¿‚R‚O‚v‚q.
019620*    ****************
019630*    * ‚R•”ˆÊ^‡Œv *
019640*    ****************
019650     COMPUTE Œã—Ã‰ñ”‚R‚v‚q      = Œã—Ã‰ñ”‚R‚W‚v‚q   + Œã—Ã‰ñ”‚R‚O‚v‚q.
019660     COMPUTE Œã—Ã—¿‚R‚v‚q        = Œã—Ã—¿‚R‚W‚v‚q     + Œã—Ã—¿‚R‚O‚v‚q.
019670     COMPUTE —âãª–@‰ñ”‚R‚v‚q    = —âãª–@‰ñ”‚R‚W‚v‚q + —âãª–@‰ñ”‚R‚O‚v‚q.
019680     COMPUTE —âãª–@—¿‚R‚v‚q      = —âãª–@—¿‚R‚W‚v‚q   + —âãª–@—¿‚R‚O‚v‚q.
019690     COMPUTE ‰·ãª–@‰ñ”‚R‚v‚q    = ‰·ãª–@‰ñ”‚R‚W‚v‚q + ‰·ãª–@‰ñ”‚R‚O‚v‚q.
019700     COMPUTE ‰·ãª–@—¿‚R‚v‚q      = ‰·ãª–@—¿‚R‚W‚v‚q   + ‰·ãª–@—¿‚R‚O‚v‚q.
019710     COMPUTE “d—Ã‰ñ”‚R‚v‚q      = “d—Ã‰ñ”‚R‚W‚v‚q   + “d—Ã‰ñ”‚R‚O‚v‚q.
019720     COMPUTE “d—Ã—¿‚R‚v‚q        = “d—Ã—¿‚R‚W‚v‚q     + “d—Ã—¿‚R‚O‚v‚q.
019730*    ****************
019740*    * ‚S•”ˆÊ^‚TŠ„ *
019750*    ****************
019760     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚T             TO Œã—Ã‰ñ”‚S‚T‚v‚q.
019770     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚T               TO Œã—Ã—¿‚S‚T‚v‚q.
019780     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚T           TO —âãª–@‰ñ”‚S‚T‚v‚q.
019790     MOVE ƒŒƒZ|—âãª–@—¿‚S‚T             TO —âãª–@—¿‚S‚T‚v‚q.
019800     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚T           TO ‰·ãª–@‰ñ”‚S‚T‚v‚q.
019810     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚T             TO ‰·ãª–@—¿‚S‚T‚v‚q.
019820     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚T             TO “d—Ã‰ñ”‚S‚T‚v‚q.
019830     MOVE ƒŒƒZ|“d—Ã—¿‚S‚T               TO “d—Ã—¿‚S‚T‚v‚q.
019840*    ****************
019850*    * ‚S•”ˆÊ^‚WŠ„ *
019860*    ****************
019870     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚W             TO Œã—Ã‰ñ”‚S‚W‚v‚q.
019880     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚W               TO Œã—Ã—¿‚S‚W‚v‚q.
019890     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚W           TO —âãª–@‰ñ”‚S‚W‚v‚q.
019900     MOVE ƒŒƒZ|—âãª–@—¿‚S‚W             TO —âãª–@—¿‚S‚W‚v‚q.
019910     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚W           TO ‰·ãª–@‰ñ”‚S‚W‚v‚q.
019920     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚W             TO ‰·ãª–@—¿‚S‚W‚v‚q.
019930     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚W             TO “d—Ã‰ñ”‚S‚W‚v‚q.
019940     MOVE ƒŒƒZ|“d—Ã—¿‚S‚W               TO “d—Ã—¿‚S‚W‚v‚q.
019950*    ****************
019960*    * ‚S•”ˆÊ^10Š„ *
019970*    ****************
019980     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚S‚O             TO Œã—Ã‰ñ”‚S‚O‚v‚q.
019990     MOVE ƒŒƒZ|Œã—Ã—¿‚S‚O               TO Œã—Ã—¿‚S‚O‚v‚q.
020000     MOVE ƒŒƒZ|—âãª–@‰ñ”‚S‚O           TO —âãª–@‰ñ”‚S‚O‚v‚q.
020010     MOVE ƒŒƒZ|—âãª–@—¿‚S‚O             TO —âãª–@—¿‚S‚O‚v‚q.
020020     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚S‚O           TO ‰·ãª–@‰ñ”‚S‚O‚v‚q.
020030     MOVE ƒŒƒZ|‰·ãª–@—¿‚S‚O             TO ‰·ãª–@—¿‚S‚O‚v‚q.
020040     MOVE ƒŒƒZ|“d—Ã‰ñ”‚S‚O             TO “d—Ã‰ñ”‚S‚O‚v‚q.
020050     MOVE ƒŒƒZ|“d—Ã—¿‚S‚O               TO “d—Ã—¿‚S‚O‚v‚q.
020060*    ****************
020070*    * ‚S•”ˆÊ^‡Œv *
020080*    ****************
020090     COMPUTE Œã—Ã‰ñ”‚S‚v‚q      = Œã—Ã‰ñ”‚S‚T‚v‚q   + Œã—Ã‰ñ”‚S‚W‚v‚q   + Œã—Ã‰ñ”‚S‚O‚v‚q.
020100     COMPUTE Œã—Ã—¿‚S‚v‚q        = Œã—Ã—¿‚S‚T‚v‚q     + Œã—Ã—¿‚S‚W‚v‚q     + Œã—Ã—¿‚S‚O‚v‚q.
020110     COMPUTE —âãª–@‰ñ”‚S‚v‚q    = —âãª–@‰ñ”‚S‚T‚v‚q + —âãª–@‰ñ”‚S‚W‚v‚q + —âãª–@‰ñ”‚S‚O‚v‚q.
020120     COMPUTE —âãª–@—¿‚S‚v‚q      = —âãª–@—¿‚S‚T‚v‚q   + —âãª–@—¿‚S‚W‚v‚q   + —âãª–@—¿‚S‚O‚v‚q.
020130     COMPUTE ‰·ãª–@‰ñ”‚S‚v‚q    = ‰·ãª–@‰ñ”‚S‚T‚v‚q + ‰·ãª–@‰ñ”‚S‚W‚v‚q + ‰·ãª–@‰ñ”‚S‚O‚v‚q.
020140     COMPUTE ‰·ãª–@—¿‚S‚v‚q      = ‰·ãª–@—¿‚S‚T‚v‚q   + ‰·ãª–@—¿‚S‚W‚v‚q   + ‰·ãª–@—¿‚S‚O‚v‚q.
020150     COMPUTE “d—Ã‰ñ”‚S‚v‚q      = “d—Ã‰ñ”‚S‚T‚v‚q   + “d—Ã‰ñ”‚S‚W‚v‚q   + “d—Ã‰ñ”‚S‚O‚v‚q.
020160     COMPUTE “d—Ã—¿‚S‚v‚q        = “d—Ã—¿‚S‚T‚v‚q     + “d—Ã—¿‚S‚W‚v‚q     + “d—Ã—¿‚S‚O‚v‚q.
020170*    *****************
020180*    * ‚T•”ˆÊ^2.5Š„ *
020190*    *****************
020200     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚Q             TO Œã—Ã‰ñ”‚T‚Q‚v‚q.
020210     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚Q               TO Œã—Ã—¿‚T‚Q‚v‚q.
020220     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚Q           TO —âãª–@‰ñ”‚T‚Q‚v‚q.
020230     MOVE ƒŒƒZ|—âãª–@—¿‚T‚Q             TO —âãª–@—¿‚T‚Q‚v‚q.
020240     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚Q           TO ‰·ãª–@‰ñ”‚T‚Q‚v‚q.
020250     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚Q             TO ‰·ãª–@—¿‚T‚Q‚v‚q.
020260     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚Q             TO “d—Ã‰ñ”‚T‚Q‚v‚q.
020270     MOVE ƒŒƒZ|“d—Ã—¿‚T‚Q               TO “d—Ã—¿‚T‚Q‚v‚q.
020280*    ****************
020290*    * ‚T•”ˆÊ^‚TŠ„ *
020300*    ****************
020310     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚T             TO Œã—Ã‰ñ”‚T‚T‚v‚q.
020320     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚T               TO Œã—Ã—¿‚T‚T‚v‚q.
020330     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚T           TO —âãª–@‰ñ”‚T‚T‚v‚q.
020340     MOVE ƒŒƒZ|—âãª–@—¿‚T‚T             TO —âãª–@—¿‚T‚T‚v‚q.
020350     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚T           TO ‰·ãª–@‰ñ”‚T‚T‚v‚q.
020360     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚T             TO ‰·ãª–@—¿‚T‚T‚v‚q.
020370     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚T             TO “d—Ã‰ñ”‚T‚T‚v‚q.
020380     MOVE ƒŒƒZ|“d—Ã—¿‚T‚T               TO “d—Ã—¿‚T‚T‚v‚q.
020390*    ****************
020400*    * ‚T•”ˆÊ^‚WŠ„ *
020410*    ****************
020420     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚W             TO Œã—Ã‰ñ”‚T‚W‚v‚q.
020430     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚W               TO Œã—Ã—¿‚T‚W‚v‚q.
020440     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚W           TO —âãª–@‰ñ”‚T‚W‚v‚q.
020450     MOVE ƒŒƒZ|—âãª–@—¿‚T‚W             TO —âãª–@—¿‚T‚W‚v‚q.
020460     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚W           TO ‰·ãª–@‰ñ”‚T‚W‚v‚q.
020470     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚W             TO ‰·ãª–@—¿‚T‚W‚v‚q.
020480     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚W             TO “d—Ã‰ñ”‚T‚W‚v‚q.
020490     MOVE ƒŒƒZ|“d—Ã—¿‚T‚W               TO “d—Ã—¿‚T‚W‚v‚q.
020500*    ****************
020510*    * ‚T•”ˆÊ^10Š„ *
020520*    ****************
020530     MOVE ƒŒƒZ|Œã—Ã‰ñ”‚T‚O             TO Œã—Ã‰ñ”‚T‚O‚v‚q.
020540     MOVE ƒŒƒZ|Œã—Ã—¿‚T‚O               TO Œã—Ã—¿‚T‚O‚v‚q.
020550     MOVE ƒŒƒZ|—âãª–@‰ñ”‚T‚O           TO —âãª–@‰ñ”‚T‚O‚v‚q.
020560     MOVE ƒŒƒZ|—âãª–@—¿‚T‚O             TO —âãª–@—¿‚T‚O‚v‚q.
020570     MOVE ƒŒƒZ|‰·ãª–@‰ñ”‚T‚O           TO ‰·ãª–@‰ñ”‚T‚O‚v‚q.
020580     MOVE ƒŒƒZ|‰·ãª–@—¿‚T‚O             TO ‰·ãª–@—¿‚T‚O‚v‚q.
020590     MOVE ƒŒƒZ|“d—Ã‰ñ”‚T‚O             TO “d—Ã‰ñ”‚T‚O‚v‚q.
020600     MOVE ƒŒƒZ|“d—Ã—¿‚T‚O               TO “d—Ã—¿‚T‚O‚v‚q.
020610*    ****************
020620*    * ‚T•”ˆÊ^‡Œv *
020630*    ****************
020640     COMPUTE Œã—Ã‰ñ”‚T‚v‚q   = Œã—Ã‰ñ”‚T‚Q‚v‚q   + Œã—Ã‰ñ”‚T‚T‚v‚q   +
020650                                Œã—Ã‰ñ”‚T‚W‚v‚q   + Œã—Ã‰ñ”‚T‚O‚v‚q.
020660     COMPUTE Œã—Ã—¿‚T‚v‚q     = Œã—Ã—¿‚T‚Q‚v‚q     + Œã—Ã—¿‚T‚T‚v‚q     +
020670                                Œã—Ã—¿‚T‚W‚v‚q     + Œã—Ã—¿‚T‚O‚v‚q.
020680     COMPUTE —âãª–@‰ñ”‚T‚v‚q = —âãª–@‰ñ”‚T‚Q‚v‚q + —âãª–@‰ñ”‚T‚T‚v‚q +
020690                                —âãª–@‰ñ”‚T‚W‚v‚q + —âãª–@‰ñ”‚T‚O‚v‚q.
020700     COMPUTE —âãª–@—¿‚T‚v‚q   = —âãª–@—¿‚T‚Q‚v‚q   + —âãª–@—¿‚T‚T‚v‚q   +
020710                                —âãª–@—¿‚T‚W‚v‚q   + —âãª–@—¿‚T‚O‚v‚q.
020720     COMPUTE ‰·ãª–@‰ñ”‚T‚v‚q = ‰·ãª–@‰ñ”‚T‚Q‚v‚q + ‰·ãª–@‰ñ”‚T‚T‚v‚q +
020730                                ‰·ãª–@‰ñ”‚T‚W‚v‚q + ‰·ãª–@‰ñ”‚T‚O‚v‚q.
020740     COMPUTE ‰·ãª–@—¿‚T‚v‚q   = ‰·ãª–@—¿‚T‚Q‚v‚q   + ‰·ãª–@—¿‚T‚T‚v‚q   +
020750                                ‰·ãª–@—¿‚T‚W‚v‚q   + ‰·ãª–@—¿‚T‚O‚v‚q.
020760     COMPUTE “d—Ã‰ñ”‚T‚v‚q   = “d—Ã‰ñ”‚T‚Q‚v‚q   + “d—Ã‰ñ”‚T‚T‚v‚q   +
020770                                “d—Ã‰ñ”‚T‚W‚v‚q   + “d—Ã‰ñ”‚T‚O‚v‚q.
020780     COMPUTE “d—Ã—¿‚T‚v‚q     = “d—Ã—¿‚T‚Q‚v‚q     + “d—Ã—¿‚T‚T‚v‚q     +
020790                                “d—Ã—¿‚T‚W‚v‚q     + “d—Ã—¿‚T‚O‚v‚q.
020800*
020810*================================================================*
020811 •‰ƒf[ƒ^Žæ“¾ SECTION.
020812*
020813**************************************************
020814* ˜AŒ‹ƒf[ƒ^‚©‚ç•‰ƒf[ƒ^‚e‚æ‚èˆÈ‰º‚Ìî•ñ‚ðŽæ“¾ *
020815* œ •”ˆÊ{•‰Ží•Ê                              *
020816* œ “]‹A‹æ•ª ....‹æ•ª‚É‚æ‚èƒ`ƒFƒbƒN‚É"›"‚ðŠi”[ *
020817* œ ‹à‘®•›Žq ....‹æ•ª‚É‚æ‚èƒ`ƒFƒbƒN‚É"›"‚ðŠi”[ *
020818* œ Œo‰ßƒR[ƒh...Œo‰ßƒ}ƒXƒ^‚æ‚èŽæ“¾             *
020819**************************************************
020820     INITIALIZE •‰î•ñ‚v.
020821     MOVE SPACE TO Œp‘±ƒtƒ‰ƒO.
020822     MOVE Ž{p˜a—ï‚v‚q       TO •‰|Ž{p˜a—ï.
020823     MOVE Ž{p”N‚v‚q         TO •‰|Ž{p”N.
020824     MOVE Ž{pŒŽ‚v‚q         TO •‰|Ž{pŒŽ.
020825     MOVE Š³ŽÒƒR[ƒh‚v‚q     TO •‰|Š³ŽÒƒR[ƒh.
020826     READ •‰ƒf[ƒ^‚e
020827     INVALID KEY
020828         CONTINUE
020829*            /* ‚ ‚è‚¦‚È‚¢ */
020830     NOT INVALID KEY
020831         MOVE •‰|•”ˆÊ”                   TO •”ˆÊ”‚v
020832         PERFORM VARYING •”ˆÊ‚b‚m‚s FROM 1 BY 1
020833                 UNTIL ( •”ˆÊ‚b‚m‚s > •”ˆÊ”‚v )
020834             MOVE •‰|•‰Ží•Ê(•”ˆÊ‚b‚m‚s) TO •‰Ží•Ê‚v(•”ˆÊ‚b‚m‚s)
020835             MOVE •‰|•”ˆÊ(•”ˆÊ‚b‚m‚s)     TO •”ˆÊ‚v(•”ˆÊ‚b‚m‚s)
020836*
020837             MOVE •‰|“]‹A‹æ•ª(•”ˆÊ‚b‚m‚s) TO “]‹A‹æ•ª‚v(•”ˆÊ‚b‚m‚s)
020838*   --- Œp‘±‚Ì•”ˆÊ‚ª‚ ‚é‚©”»’è ---
020839             IF •‰|“]‹A‹æ•ª(•”ˆÊ‚b‚m‚s) = 9
020840                  MOVE "YES" TO Œp‘±ƒtƒ‰ƒO
020841             END-IF
020842*
020843         END-PERFORM
020844     END-READ.
020845*
021110*================================================================*
021120******************************************************************
021130 END PROGRAM YCK101.
021140******************************************************************
