000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YCK102.
000060 AUTHOR.                 池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【FPD書込】柔+ｳｨﾝﾄﾞｳｽﾞ版
000100* 請求年月Ver.
000110*      MED = YCK580 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-11-30
000140 DATE-COMPILED.          2012-11-30
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS                   IS  DYNAMIC
000300                             RECORD      KEY          IS  作１－請求和暦年月
000310                                                          作１－施術和暦年月
000320                                                          作１－保険区分
000330                                                          作１－費用負担者番号
000340                                                          作１－保険者番号
000350                                                          作１－患者カナ
000360                                                          作１－患者コード
000370                             FILE        STATUS       IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000390*
000400     SELECT 会提出ファイル   ASSIGN      TO        FD-NAME
000410                             ORGANIZATION             IS  SEQUENTIAL
000420                             ACCESS MODE              IS  SEQUENTIAL
000430                             FILE STATUS              IS  状態キー
000440                             LOCK      MODE           IS  AUTOMATIC.
000450******************************************************************
000460*                      DATA DIVISION                             *
000470******************************************************************
000480 DATA                    DIVISION.
000490 FILE                    SECTION.
000500*
000501*
000502 FD  作業ファイル１ RECORD  CONTAINS 512 CHARACTERS.
000503 01  作１－レコード.
000504     03  作１－レコードヘッダ.
000505         05  作１－請求和暦年月.
000506             07  作１－請求和暦            PIC 9.
000507             07  作１－請求年              PIC 9(2).
000508             07  作１－請求月              PIC 9(2).
000509         05  作１－保険区分                PIC 99.
000510         05  作１－保険者番号              PIC X(10).
000511         05  作１－本人家族区分            PIC 9.
000512         05  作１－施術和暦年月.
000513             07  作１－施術和暦            PIC 9.
000514             07  作１－施術年              PIC 9(2).
000515             07  作１－施術月              PIC 9(2).
000516         05  作１－被保険者カナ            PIC X(20).
000517         05  作１－患者コード.
000518             07 作１－患者番号             PIC 9(6).
000519             07 作１－枝番                 PIC X(1).
000520     03  作１－レコードデータ.
000521         05  作１－会員番号                PIC X(5).
000522         05  作１－老人助成                PIC 99.
000523         05  作１－公費併用.
000524             07  作１－費用負担者番号      PIC X(10).
000525             07  作１－受益者番号          PIC X(10).
000526         05  作１－患者氏名.
000527             07  作１－患者漢字            PIC N(10).
000528             07  作１－患者カナ            PIC X(20).
000529         05  作１－患者性別                PIC 9.
000530         05  作１－患者生年月日.
000531             07  作１－患者和暦            PIC 9(1).
000532             07  作１－患者年              PIC 9(2).
000533             07  作１－患者月              PIC 9(2).
000534             07  作１－患者日              PIC 9(2).
000535         05  作１－続柄                    PIC N(2).
000536         05  作１－被保険者氏名.
000537             07  作１－被保険者漢字        PIC N(10).
000538         05  作１－被保険者性別            PIC 9.
000539         05  作１－被保険者生年月日.
000540             07  作１－被保険者和暦        PIC 9(1).
000541             07  作１－被保険者年          PIC 9(2).
000542             07  作１－被保険者月          PIC 9(2).
000543             07  作１－被保険者日          PIC 9(2).
000544         05  作１－記号                    PIC N(12).
000545         05  作１－番号                    PIC X(12).
000546         05  作１－資格取得年月日.
000547             07  作１－資格和暦            PIC 9(1).
000548             07  作１－資格年              PIC 9(2).
000549             07  作１－資格月              PIC 9(2).
000550             07  作１－資格日              PIC 9(2).
000551         05  作１－有効年月日.
000552             07  作１－有効和暦            PIC 9(1).
000553             07  作１－有効年              PIC 9(2).
000554             07  作１－有効月              PIC 9(2).
000555             07  作１－有効日              PIC 9(2).
000556         05  作１－助成自己負担金未払      PIC 9.
000557         05  作１－転帰区分総合            PIC 9.
000558         05  FILLER                        PIC 9(2).
000559         05  作１－通院回数                PIC 9(2).
000560         05  作１－初診料.
000561             07  作１－初診基本料          PIC 9(4).
000562             07  作１－初診加算料          PIC 9(4).
000563         05  作１－往療料.
000564             07  作１－加算                PIC 9.
000565             07  作１－回数                PIC 9(2).
000566             07  作１－往療料金額          PIC 9(6).
000567         05  作１－金属副子加算.
000568             07  作１－使用枚数.
000569                 09  作１－大              PIC 9.
000570                 09  作１－中              PIC 9.
000571                 09  作１－小              PIC 9.
000572             07  作１－金額                PIC 9(6).
000573         05  作１－情報提供料              PIC 9(6).
000574         05  作１－文書料                  PIC 9(6).
000575         05  作１－一般費用金額.
000576             07  作１－費用合計金額        PIC 9(6).
000577             07  作１－負担率              PIC 9.
000578             07  作１－負担金額            PIC 9(6).
000579             07  作１－請求金額            PIC 9(6).
000580         05  作１－老人助成金額.
000581             07  作１－自己負担金額        PIC 9(6).
000582             07  作１－差引請求金額        PIC 9(6).
000583             07  作１－合計請求金額        PIC 9(6).
000584         05  作１－部位データ              OCCURS 5.
000585             07  作１－負傷コード.
000586                 09  作１－種別            PIC 9.
000587                 09  作１－部位コード      PIC 99.
000588             07  作１－冷罨療法.
000589                 09  作１－冷罨回数        PIC 99.
000590                 09  作１－冷罨金額        PIC 9(6).
000591             07  作１－施術料              PIC 9(6).
000592             07  作１－罨法料.
000593                 09  作１－罨法回数        PIC 99.
000594                 09  作１－罨法金額        PIC 9(6).
000595             07  作１－電療料.
000596                 09  作１－電療回数        PIC 99.
000597                 09  作１－電療金額        PIC 9(6).
000598             07  作１－後療料.
000599                 09  作１－後療回数        PIC 99.
000600                 09  作１－後療金額        PIC 9(6).
000601             07  作１－転帰区分            PIC 9.
000602         05  FILLER                        PIC X(13).
001520*
001530*
001540 FD  会提出ファイル RECORD  CONTAINS 720 CHARACTERS.
001550 01  会提－レコード.
001560     03  会提－レコードデータ.
001570         05  会提－会員番号                  PIC X(5).
001580         05  会提－年月.
001590             07  会提－和暦                  PIC 9.
001600             07  会提－年                    PIC 9(2).
001610             07  会提－月                    PIC 9(2).
001620         05  会提－保険者データ.
001630             07  会提－保険区分              PIC 99.
001640             07  会提－保険者番号            PIC X(10).
001650             07  会提－老人助成              PIC 99.
001660             07  会提－公費併用.
001670                 09  会提－費用負担者番号    PIC X(10).
001680                 09  会提－受益者番号        PIC X(10).
001690         05  会提－患者データ.
001700             07  会提－患者コード            PIC X(7).
001710             07  会提－患者氏名.
001720                 09  会提－患者漢字          PIC N(10).
001730                 09  会提－患者カナ          PIC X(20).
001740             07  会提－患者性別              PIC 9.
001750             07  会提－患者生年月日.
001760                 09  会提－患者和暦          PIC 9(1).
001770                 09  会提－患者年            PIC 9(2).
001780                 09  会提－患者月            PIC 9(2).
001790                 09  会提－患者日            PIC 9(2).
001800             07  会提－本人家族区分          PIC 9.
001810             07  会提－続柄                  PIC N(2).
001820         05  会提－被保険者データ.
001830             07  会提－被保険者氏名.
001840                 09  会提－被保険者漢字      PIC N(10).
001850                 09  会提－被保険者カナ      PIC X(20).
001860             07  会提－被保険者性別          PIC 9.
001870             07  会提－被保険者生年月日.
001880                 09  会提－被保険者和暦      PIC 9(1).
001890                 09  会提－被保険者年        PIC 9(2).
001900                 09  会提－被保険者月        PIC 9(2).
001910                 09  会提－被保険者日        PIC 9(2).
001920             07  会提－記号                  PIC N(12).
001930             07  会提－番号                  PIC X(12).
001940             07  会提－資格取得年月日.
001950                 09  会提－資格和暦          PIC 9(1).
001960                 09  会提－資格年            PIC 9(2).
001970                 09  会提－資格月            PIC 9(2).
001980                 09  会提－資格日            PIC 9(2).
001990             07  会提－有効年月日.
002000                 09  会提－有効和暦          PIC 9(1).
002010                 09  会提－有効年            PIC 9(2).
002020                 09  会提－有効月            PIC 9(2).
002030                 09  会提－有効日            PIC 9(2).
002040         05  会提－助成自己負担金未払        PIC 9.
002050         05  会提－転帰区分総合              PIC 9.
002060         05  FILLER                          PIC X(24).
002070         05  会提－通院回数                  PIC 9(2).
002080         05  会提－初診料.
002090             07  会提－初診基本料            PIC 9(4).
002100             07  会提－初診加算料            PIC 9(4).
002110         05  会提－往療料.
002120             07  会提－加算                  PIC 9.
002130             07  会提－回数                  PIC 9(2).
002140             07  会提－往療料金額            PIC 9(6).
002150         05  会提－金属副子加算.
002160             07  会提－使用枚数.
002170                 09  会提－大                PIC 9.
002180                 09  会提－中                PIC 9.
002190                 09  会提－小                PIC 9.
002200             07  会提－金額                  PIC 9(6).
002210         05  会提－情報提供料                PIC 9(6).
002220         05  会提－文書料                    PIC 9(6).
002230         05  会提－一般費用金額.
002240             07  会提－費用合計金額          PIC 9(6).
002250             07  会提－負担率                PIC 9.
002260             07  会提－負担金額              PIC 9(6).
002270             07  会提－請求金額              PIC 9(6).
002280         05  会提－老人助成金額.
002290             07  会提－自己負担金額          PIC 9(6).
002300             07  会提－差引請求金額          PIC 9(6).
002310             07  会提－合計請求金額          PIC 9(6).
002320         05  会提－部位データ                OCCURS 5.
002330             07  会提－部位.
002340                 09  会提－負傷コード.
002350                     11  会提－種別          PIC 9.
002360                     11  会提－部位コード    PIC 99.
002370                 09  会提－冷罨療法.
002380                     11  会提－冷罨回数      PIC 99.
002390                     11  会提－冷罨金額      PIC 9(6).
002400                 09  会提－施術料            PIC 9(6).
002410                 09  会提－罨法料.
002420                     11  会提－罨法回数      PIC 99.
002430                     11  会提－罨法金額      PIC 9(6).
002440                 09  会提－電療料.
002450                     11  会提－電療回数      PIC 99.
002460                     11  会提－電療金額      PIC 9(6).
002470                 09  会提－後療料.
002480                     11  会提－後療回数      PIC 99.
002490                     11  会提－後療金額      PIC 9(6).
002500                 09  会提－転帰区分          PIC 9.
002510                 09  FILLER                  PIC X(8).
002520         05  FILLER                          PIC X(165).
002530*
002540*----------------------------------------------------------------*
002550******************************************************************
002560*                WORKING-STORAGE SECTION                         *
002570******************************************************************
002580 WORKING-STORAGE         SECTION.
002590 01 キー入力                           PIC X    VALUE SPACE.
002600 01 状態キー                           PIC X(2) VALUE SPACE.
002610 01 終了フラグ                         PIC X(3) VALUE SPACE.
002620 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002630 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002640 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002650 01 ファイル名                         PIC N(8) VALUE SPACE.
002660 01 カウンタ                           PIC 9(1) VALUE ZERO.
002670**
002680** エラーメッセージ用
002690 01 エラーメッセージＷ.
002700    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002710    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002720    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002730    03 FILLER                          PIC X(10) VALUE SPACE.
002240*
002250* フロッピーパス用
002251 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002252 01 FD-NAME                            PIC X(30) VALUE SPACE.
002260*
002740******************************************************************
002750*                          連結項目                              *
002760******************************************************************
002770*
002780********************
002790* メッセージ表示キー *
002800********************
002810 01 連メ－キー IS EXTERNAL.
002820    03  連メ－メッセージ               PIC N(20).
004090*
004091 01 連メ７－キー IS EXTERNAL.
004092    03  連メ７－メッセージ１               PIC X(40).
004102    03  連メ７－メッセージ２               PIC X(40).
      *
       01 連入－画面情報ＹＣＫ１００ IS EXTERNAL.
          03 連入－ドライブ                  PIC X(1).
      *
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
002870*
002880******************************************************************
002890*                      PROCEDURE  DIVISION                       *
002900******************************************************************
002910 PROCEDURE               DIVISION.
002920************
002930*           *
002940* 初期処理   *
002950*           *
002960************
002970     PERFORM 初期化.
002980************
002990*           *
003000* 主処理     *
003010*           *
003020************
003030     PERFORM 提出ファイル作成.
003040************
003050*           *
003060* 終了処理   *
003070*           *
003080************
003090     PERFORM 終了処理.
003100     MOVE ZERO TO PROGRAM-STATUS.
003110     EXIT PROGRAM.
003120*
003130*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
003140*================================================================*
003150 初期化 SECTION.
003160*
003170     PERFORM ファイルオープン.
003180*
003190*================================================================*
003200 ファイルオープン SECTION.
003210*
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\Datafl.dat" TO FD-NAME
           ELSE
003324        MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003326        IF 定期修正ＦＤＷ = SPACE
003327           MOVE "A" TO 定期修正ＦＤＷ
003328        END-IF
003330        STRING 定期修正ＦＤＷ   DELIMITED BY SIZE
003331               ":\Datafl.dat"   DELIMITED BY SIZE
003334            INTO FD-NAME
003335        END-STRING
           END-IF.
003336**
003220     OPEN OUTPUT 会提出ファイル.
002680     IF 状態キー  NOT =  "00"
002690         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
               MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
002700         CALL   "MSG007"
002710         CANCEL "MSG007"
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM
003320     END-IF.
003330*
003340     OPEN INPUT 作業ファイル１.
003350         MOVE NC"作１" TO ファイル名.
003360         PERFORM オープンチェック.
003370*================================================================*
003380 オープンチェック SECTION.
003390*
003400     IF 状態キー  NOT =  "00"
003410         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003420         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003430         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003440                                                 UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
003450         ACCEPT  キー入力 FROM CONS
003460         PERFORM ファイル閉鎖
003470         MOVE 99 TO PROGRAM-STATUS
003480         EXIT PROGRAM.
003490*================================================================*
003500 ファイル閉鎖 SECTION.
003510*
003520     CLOSE  会提出ファイル 作業ファイル１.
003530*================================================================*
003540 終了処理 SECTION.
003550*
003560     PERFORM ファイル閉鎖.
003570*================================================================*
003580 エラー表示 SECTION.
003590*
003600     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003610     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003620     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003630     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
003640     ACCEPT  キー入力 FROM CONS.
003650     PERFORM ファイル閉鎖.
003660     MOVE 99 TO PROGRAM-STATUS.
003670     EXIT PROGRAM.
003680*================================================================*
003690 提出ファイル作成 SECTION.
003700*
003710     MOVE SPACE   TO 終了フラグ.
003720     PERFORM 作業ファイル１読込.
003730     IF  終了フラグ = "YES"
003740         MOVE  NC"データが０件です。確認して下さい" TO 連メ－メッセージ
003750         CALL   "MSG001"
003760         CANCEL "MSG001"
003770         PERFORM ファイル閉鎖
003780         MOVE 99 TO PROGRAM-STATUS
003790         EXIT PROGRAM
003800     END-IF.
003810*
003820     PERFORM UNTIL 終了フラグ = "YES"
003830              PERFORM レコードセット
003840              PERFORM ファイル書込
003850         PERFORM 作業ファイル１読込
003860     END-PERFORM.
003870*
003880*================================================================*
003890 レコードセット SECTION.
003900*
003910     MOVE SPACE TO 会提－レコード.
003920     INITIALIZE    会提－レコード.
003930*
003940     MOVE 作１－会員番号         TO  会提－会員番号.
003950*     MOVE 作１－請求和暦         TO  会提－和暦.
003960*     MOVE 作１－請求年           TO  会提－年.
003970*     MOVE 作１－請求月           TO  会提－月.
003971* 施術年月を転記
003972     MOVE 作１－施術和暦         TO  会提－和暦.
003973     MOVE 作１－施術年           TO  会提－年.
003974     MOVE 作１－施術月           TO  会提－月.
003975*
003980     MOVE 作１－保険区分         TO  会提－保険区分.
003990     MOVE 作１－保険者番号       TO  会提－保険者番号.
004000     MOVE 作１－老人助成         TO  会提－老人助成.
004010     MOVE 作１－費用負担者番号   TO  会提－費用負担者番号.
004020     MOVE 作１－受益者番号       TO  会提－受益者番号.
004030     MOVE 作１－患者コード       TO  会提－患者コード.
004040*
004050     MOVE 作１－患者氏名         TO  会提－患者氏名.
004060     MOVE 作１－患者カナ         TO  会提－患者カナ.
004070     MOVE 作１－患者性別         TO  会提－患者性別.
004080     MOVE 作１－患者生年月日     TO  会提－患者生年月日.
004090     MOVE 作１－本人家族区分     TO  会提－本人家族区分.
004100     MOVE 作１－続柄             TO  会提－続柄.
004110     MOVE 作１－被保険者氏名     TO  会提－被保険者氏名.
004120     MOVE 作１－被保険者カナ     TO  会提－被保険者カナ.
004130     MOVE 作１－被保険者性別     TO  会提－被保険者性別.
004140     MOVE 作１－被保険者生年月日 TO  会提－被保険者生年月日.
004150     MOVE 作１－番号             TO  会提－番号
004160     MOVE 作１－記号             TO  会提－記号
004170     MOVE 作１－資格取得年月日   TO  会提－資格取得年月日.
004180     MOVE 作１－有効年月日       TO  会提－有効年月日.
004190     MOVE 作１－助成自己負担金未払   TO  会提－助成自己負担金未払.
004200     MOVE 作１－転帰区分総合     TO  会提－転帰区分総合.
004210*
004220     MOVE 作１－通院回数         TO   会提－通院回数.
004230     MOVE 作１－初診基本料       TO   会提－初診基本料.
004240     MOVE 作１－初診加算料       TO   会提－初診加算料.
004250*
004260     MOVE 作１－回数             TO   会提－回数.
004270     MOVE 作１－往療料金額       TO   会提－往療料金額.
004280     MOVE 作１－加算             TO   会提－加算.
004290*
004300*
004310     MOVE 作１－金額             TO  会提－金額.
004320*
004330     MOVE 作１－大               TO  会提－大.
004340     MOVE 作１－中               TO  会提－中.
004350     MOVE 作１－小               TO  会提－小.
004360*
004370     MOVE 作１－情報提供料       TO  会提－情報提供料.
004380*
004390     MOVE 作１－文書料           TO  会提－文書料.
004400     MOVE 作１－費用合計金額     TO  会提－費用合計金額.
004410     MOVE 作１－負担金額         TO  会提－負担金額.
004420     MOVE 作１－請求金額         TO  会提－請求金額.
004430     MOVE 作１－負担率           TO  会提－負担率.
004440     MOVE 作１－合計請求金額     TO  会提－合計請求金額.
004450     MOVE 作１－自己負担金額     TO  会提－自己負担金額.
004460     MOVE 作１－差引請求金額     TO  会提－差引請求金額.
004470*
004480     PERFORM VARYING カウンタ FROM 1 BY 1
004490             UNTIL ( カウンタ > 5 )
004500         MOVE 作１－種別(カウンタ)          TO  会提－種別(カウンタ)
004510         MOVE 作１－部位コード(カウンタ)    TO  会提－部位コード(カウンタ)
004520         MOVE 作１－後療回数(カウンタ)      TO  会提－後療回数(カウンタ)
004530         MOVE 作１－後療金額(カウンタ)      TO  会提－後療金額(カウンタ)
004540         MOVE 作１－冷罨回数(カウンタ)      TO  会提－冷罨回数(カウンタ)
004550         MOVE 作１－冷罨金額(カウンタ)      TO  会提－冷罨金額(カウンタ)
004560         MOVE 作１－施術料(カウンタ)        TO  会提－施術料(カウンタ)
004570         MOVE 作１－罨法回数(カウンタ)      TO  会提－罨法回数(カウンタ)
004580         MOVE 作１－罨法金額(カウンタ)      TO  会提－罨法金額(カウンタ)
004590         MOVE 作１－電療回数(カウンタ)      TO  会提－電療回数(カウンタ)
004600         MOVE 作１－電療金額(カウンタ)      TO  会提－電療金額(カウンタ)
004610         MOVE 作１－転帰区分(カウンタ)      TO  会提－転帰区分(カウンタ)
004620     END-PERFORM.
004630*
004640*================================================================*
004650 作業ファイル１読込 SECTION.
004660*
004670     READ 作業ファイル１ NEXT
004680     AT END
004690         MOVE "YES" TO 終了フラグ
004700     END-READ.
004710*
004720*================================================================*
004730 ファイル書込 SECTION.
004740*
004750     WRITE 会提－レコード.
004760     IF 状態キー  NOT =  "00"
004770         MOVE NC"会提出ファイル" TO ファイル名
004780         PERFORM エラー表示
004790     END-IF.
004800*================================================================*
004810******************************************************************
004820 END PROGRAM YCK102.
004830******************************************************************
