      *****************************************************************
      * ＢＵＩＣＯＤＥ　部位マスタ［ＲＬ＝１２８］                    *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.11.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :部位コードの名称および                           *
      *              システム部位コードと会部位コードの相関関係を管理 *
      *****************************************************************
      *****************************************************************
      * １．部位コードと会部位コードは、１対１とする。                *
      * ２．同じ意味でも名称が異なる場合は違う部位コードとして        *
      *     登録する。(料金体系は同じ)                                *
      * ３．部位コードは、拘縮後療コードも含む。                      *
      * ４．部位名称２は、拘縮後療の場合（拘縮後療）と入力。          *
      *****************************************************************
       01  レコード.
         03  レコードキー.
           05  部位コード.
             07  負傷種別                 PIC 9(2).
             07  部位                     PIC 9(2).
             07  左右区分                 PIC 9.
             07  負傷位置番号             PIC 9(2).
         03  レコードデータ.
           05  部位名称１                 PIC N(10).
           05  部位名称２                 PIC N(10).
      * 英数字も対応可能にするため、英数字項目とする。
           05  会部位コード               PIC X(8).
           05  会ＯＣＲコード             PIC X(8).
      * 使用頻度の区分を設定　３：非常によく使う　２：よく使う　１：あまり使わない
           05  使用頻度区分               PIC X.
           05  FILLER                     PIC X(64).
