      *****************************************************************
      * ＢＵＩＣＮＢ　部位変換マスタ［ＲＬ＝１２８］                  *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.07.08                                       *
      * AUTHOR      :山田  浩之                                       *
      * PURPOSE     :                                                 *
      *****************************************************************
       01  レコード.
         03  レコードキー.
           05  旧負傷コード.
             07  旧負傷種別               PIC 9(1).
             07  旧部位コード             PIC 9(2).
         03  レコードデータ.
           05  新負傷種別                 PIC 9(2).
           05  新部位                     PIC 9(2).
           05  FILLER                     PIC X(121).
