      *****************************************************************
      * ＢＵＩＭＥＩ　部位名称マスタ［ＲＬ＝１２８］                  *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.06.18                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :部位（負傷種別＋部位　迄）の名称を管理           *
      *****************************************************************
       01  レコード.
         03  レコードキー.
           05  部位コード.
             07  負傷種別                 PIC 9(2).
             07  部位                     PIC 9(2).
         03  レコードデータ.
           05  正式名称                   PIC N(20).
           05  正式名称カナ               PIC X(40).
           05  略称                       PIC N(12).
           05  略称カナ                   PIC X(24).
           05  FILLER                     PIC X(4).
