000010*****************************************************************
000020* ＧＥＮＧＯＵ：元号マスタ［ＲＬ＝１２８］                      *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PURPOSE     :元号区分の名称および元号の開始・終了年月（西暦） *
000070*              を管理                                           *
000080*****************************************************************
000090*基本的に変更なし
000100*---------------------------------------------------------------*
000110*	項目追加
000120*****************************************************************
000130 01  レコード.
000140     03  レコードキー.
000150         05  元号区分                  PIC 9.
000160     03  レコードデータ.
000170         05  元号名称                  PIC N(4).
000180         05  開始西暦年月日.
000190           07  開始西暦年月.
000200             09  開始西暦年            PIC 9(4).
000210             09  開始西暦月            PIC 9(2).
000220           07  開始西暦日              PIC 9(2).
000230         05  終了西暦年月日.
000240           07  終了西暦年月.
000250             09  終了西暦年            PIC 9(4).
000260             09  終了西暦月            PIC 9(2).
000270           07  終了西暦日              PIC 9(2).
000280         05  有効上限年                PIC 9(2).
000290         05  有効下限年                PIC 9(2).
000300         05  元号略                    PIC X.
000310*/ 追加 (2011.02.01) /
000320         05  正式開始西暦年月日.
000330           07  正式開始西暦年月.
000340             09  正式開始西暦年        PIC 9(4).
000350             09  正式開始西暦月        PIC 9(2).
000360           07  正式開始西暦日          PIC 9(2).
000370*/ 追加 (2013.06.06) /
000380         05 正式開始和暦年月日.
000390           07 正式開始和暦年月.
000400             09 正式開始和暦           PIC 9.
000410             09 正式開始年月.
000420               11 正式開始年           PIC 9(2).
000430               11 正式開始月           PIC 9(2).
000440           07 正式開始日               PIC 9(2).
000450         05 正式終了和暦年月日.
000460           07 正式終了和暦年月.
000470             09 正式終了和暦           PIC 9.
000480             09 正式終了年月.
000490               11 正式終了年           PIC 9(2).
000500               11 正式終了月           PIC 9(2).
000510           07 正式終了日               PIC 9(2).
000520         05 元号カナ                   PIC X(10).
000530*
000540         05  FILLER                    PIC X(66).
