000010*****************************************************************
000020* ‚g•ρ‘ƒtƒ@ƒCƒ‹ H_HOKOK.DAT m‚q‚k2560BYTEn               *
000030*****************************************************************
000040* SYSYTEM NAME:_ FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2018.07.31                                       *
000070* AUTHOR      :‰ª“c  ›a                                       *
000080* PURPOSE     :{p•ρ‘‚β‚P”N‚P‚U‰ρ——R‘‚Μ“ΰ—e‚π•Ϋ‘¶         *
000090*                                                               *
000100*   —p†‹ζ•ª@’ •[–Ό                                            *
000110*      1      {p•ρ‘                                        *
000120*      2      ‚P”N‚P‚U‰ρ——R‘iθI‹„j                          *
000130*      3      ‚P”N‚P‚U‰ρ——R‘iƒ}ƒbƒT[ƒWj                    *
000140*      4      ‰—Γ——R                                          *
000150*                                                               *
000160*****************************************************************
000170*---------------------------------------------------------------*
000180*	SELECT•¶
000190*---------------------------------------------------------------*
000200**
000210*     SELECT  ‚g•ρ‘‚e      ASSIGN      TO        HHOKOKL
000220*                             ORGANIZATION             IS  INDEXED
000230*                             ACCESS                   IS  DYNAMIC
000240*                             RECORD      KEY          IS  ‚g•ρ|{p‹ζ•ª
000250*                                                          ‚g•ρ|—p†‹ζ•ª
000260*                                                          ‚g•ρ|{pa—ο”N
000270*                                                          ‚g•ρ|³ÒƒR[ƒh
000280*                                                          ‚g•ρ|A”Τ
000290*                             ALTERNATE RECORD KEY     IS  ‚g•ρ|{p‹ζ•ª
000300*                                                          ‚g•ρ|—p†‹ζ•ª
000310*                                                          ‚g•ρ|³ÒƒR[ƒh
000320*                                                          ‚g•ρ|{pa—ο”N
000330*                                                          ‚g•ρ|{p“ϊ
000340*                                                          ‚g•ρ|A”Τ
000350*                             FILE        STATUS       IS  σ‘ΤƒL[
000360*                             LOCK        MODE         IS  AUTOMATIC.
000370***
000380*                           m‚q‚k  2048n
000390* FD  ‚g•ρ‘‚e        BLOCK   CONTAINS   1   RECORDS GLOBAL.
000400*     COPY H_HOKOK          OF  XFDLIB  JOINING   ‚g•ρ     AS  PREFIX.
000410*
000420*****************************************************************
000430 01 ƒƒR[ƒh.
000440   03 ƒƒR[ƒhƒL[.
000450     05 {p‹ζ•ª                     PIC 9(1).
000460     05 —p†‹ζ•ª                     PIC 9(3).
000470     05 {pa—ο”N“ϊ.
000480       07 {pa—ο”N.
000490         09 {pa—ο                 PIC 9.
000500         09 {p”N.
000510           11 {p”N                 PIC 9(2).
000520           11 {p                 PIC 9(2).
000530     05 ³ÒƒR[ƒh.
000540       07 ³Ò”Τ†                   PIC 9(6).
000550       07 }”Τ                       PIC X.
000560     05 A”Τ                         PIC 9(2).
000570*
000580   03 ƒƒR[ƒhƒf[ƒ^.
000590* ƒRƒƒ“ƒg—“‚Νe—p†‚²‚Ζ‚ΙΔ’θ‹`‚µ‚Δg—p‚µ‚ά‚·B
000600     05 ƒRƒƒ“ƒg                    PIC X(2000).
000610*
000620*    *********************************************
000630*    * —p†‹ζ•ª:1 {p•ρ‘                     *
000640*    *********************************************
000650     05 {p•ρ‘ REDEFINES ƒRƒƒ“ƒg.
000660       07 {p“ϊ                    PIC 9(2).
000670       07 “―Σγt.
000680         09 γtƒR[ƒh              PIC 9(3).
000690         09 γ—Γ‹@Φ–Ό              PIC X(60).
000700         09 –Ό                    PIC X(30).
000710       07 {p‚Μ“ΰ—e•p“x            PIC X(500).
000720       07 ³Ò‚Μσ‘Τo‰ί            PIC X(500).
000730       07 “Α‹L‚·‚Χ‚«–€            PIC X(500).
000740       07 {p‚Μ•p“x                PIC 9(2).
000741       07 FILLER                    PIC X(403).
000750*
000760*    *********************************************
000770*    * —p†‹ζ•ª:2 ‚P”N‚P‚U‰ρ——R‘iθI‹„κ—pj   *
000780*    *********************************************
000790     05 ——R‘θI‹„ REDEFINES ƒRƒƒ“ƒg.
000800       07 •]‰Ώa—ο”N“ϊθI.
000810         09 •]‰Ώa—ο”NθI.
000820           11 •]‰Ώa—οθI            PIC 9.
000830           11 •]‰Ώ”NθI.
000840             13 •]‰Ώ”NθI            PIC 9(2).
000850             13 •]‰ΏθI            PIC 9(2).
000860         09 •]‰Ώ“ϊθI                PIC 9(2).
000870*      ’Ι‚έ‚Μ‹­‚³ 0(γ) - 10(‹­)
000880       07 ’Ι‚έ‹­“x‹ζ•ªθI            PIC 9(2).
000890*      ‘O‰ρ•]‰Ώ—L–³ 0:–Ά“ό—Ν 1:—L‚θ 2:–³‚µ
000900       07 ‘O‰ρ•]‰Ώ—L–³‹ζ•ªθI        PIC 9(2).
000910*      ‘O‰ρ‚Μσ‘Τ‚©‚η‚Μ‰ό‘P‚β•Ο‰» 0:–Ά“ό—Ν 1:«‰» 2:Ϋ 3:‰ό‘P¬ 4:‰ό‘P’† 5:‰ό‘P‘ε
000920       07 ‰ό‘P•Ο‰»‹ζ•ªθI            PIC 9(2).
000930*      {p‚ª•K—v‚Θ——R
000940       07 ——R•¶θI                  PIC X(1000).
000950       07 FILLER                    PIC X(987).
000960*
000970*    ***************************************************
000980*    * —p†‹ζ•ª:3 ‚P”N‚P‚U‰ρ——R‘iƒ}ƒbƒT[ƒWκ—pj   *
000990*    ***************************************************
001000     05 ——R‘ƒ}ƒbƒT[ƒW REDEFINES ƒRƒƒ“ƒg.
001010       07 Ησƒ}.
001020*        Ησ@1:‹Ψ–ƒαƒ 2:ΦίSk 3:‚»‚Μ‘Ό 4:‹Ψ–ƒαƒEΦίSk 5:‹Ψ–ƒαƒE‚»‚Μ‘Ό 6:ΦίSkE‚»‚Μ‘Ό 7:‹Ψ–ƒαƒEΦίSkE‚»‚Μ‘Ό
001030         09 Ησ‹ζ•ªƒ}              PIC 9(1).
001040         09 ‚»‚Μ‘ΌΗσƒ}            PIC X(100).
001050       07 •]‰Ώa—ο”N“ϊƒ}.
001060         09 •]‰Ώa—ο”Nƒ}.
001070           11 •]‰Ώa—οƒ}            PIC 9.
001080           11 •]‰Ώ”Nƒ}.
001090             13 •]‰Ώ”Nƒ}            PIC 9(2).
001100             13 •]‰Ώƒ}            PIC 9(2).
001110         09 •]‰Ώ“ϊƒ}                PIC 9(2).
001120*      ξ–{“®μ Q•Τ‚θ     0:–Ά“ό—Ν 1:©—§ 2:κ•”‰ξ• 3:‘S‰ξ• 
001130       07 Q•Τ‚θ‹ζ•ªƒ}              PIC 9(1).
001140*      ξ–{“®μ ‹N‚«γ‚ª‚θ 0:–Ά“ό—Ν 1:©—§ 2:κ•”‰ξ• 3:‘S‰ξ• 
001150       07 ‹N‚«γ‚ª‚θ‹ζ•ªƒ}          PIC 9(1).
001160*      ξ–{“®μ ΐΚ       0:–Ά“ό—Ν 1:©—§ 2:κ•”‰ξ• 3:‘S‰ξ• 
001170       07 ΐΚ‹ζ•ªƒ}                PIC 9(1).
001180*      ξ–{“®μ —§‚Ώγ‚ª‚θ 0:–Ά“ό—Ν 1:©—§ 2:κ•”‰ξ• 3:‘S‰ξ• 
001190       07 —§‚Ώγ‚ª‚θ‹ζ•ªƒ}          PIC 9(1).
001200*      ξ–{“®μ —§Κ       0:–Ά“ό—Ν 1:©—§ 2:κ•”‰ξ• 3:‘S‰ξ• 
001210       07 —§Κ‹ζ•ªƒ}                PIC 9(1).
001220*      ‘O‰ρ•]‰Ώ—L–³ 0:–Ά“ό—Ν 1:—L‚θ 2:–³‚µ
001230       07 ‘O‰ρ•]‰Ώ—L–³‹ζ•ªƒ}        PIC 9(2).
001240*      ‘O‰ρ‚Μσ‘Τ‚©‚η‚Μ‰ό‘P‚β•Ο‰» 0:–Ά“ό—Ν 1:«‰» 2:Ϋ 3:‰ό‘P¬ 4:‰ό‘P’† 5:‰ό‘P‘ε
001250       07 ‰ό‘P•Ο‰»‹ζ•ªƒ}            PIC 9(2).
001260*      {p‚ª•K—v‚Θ——R
001270       07 ——R•¶ƒ}                  PIC X(1000).
001280       07 FILLER                    PIC X(883).
001290*
001300*    *********************************************
001310*    * —p†‹ζ•ª:4 ‰—Γ——R                       *
001320*    *********************************************
001330     05 ‰—Γ——R REDEFINES ƒRƒƒ“ƒg.
001340*      ‰—Γ‚Μ•K—v 1:•K—v‚Ζ‚·‚ι
001350       07 ‰—Γ•K—v‹ζ•ª              PIC 9(1).
001360*      ‰—Γ‚π•K—v‚Ζ‚·‚ι——R
001370       07 ‰—Γ——R—v‰ξμ“x          PIC X(40).
001380       07 ‰—Γ——R‹ζ•ª              PIC 9(1).
001390       07 ‰—Γ——R‚»‚Μ‘Ό            PIC X(300).
001400       07 FILLER                    PIC X(1658).
001410*
001420*    σό“ϊ
001430     05 σόa—ο”N“ϊ.
001440       07 σόa—ο”N.
001450         09 σόa—ο                 PIC 9.
001460         09 σό”N.
001470           11 σό”N                 PIC 9(2).
001480           11 σό                 PIC 9(2).
001490       07 σό“ϊ                     PIC 9(2).
001500
001510     05 FILLER                       PIC X(535).
