000001*****************************************************************
000002* ‚g—¿‹àƒ}ƒXƒ^@H_ryokin.dat mRL=384BYTEn                     *
000003*****************************************************************
000004* SYSYTEM NAME:èI‹„ƒ}ƒbƒT[ƒW                                   *
000005* LANGUAGE PG :NetCOBOL                                         *
000006* PRODUCT DATE:2009.03.31                                       *
000008* PURPOSE     :—¿‹àî•ñ‚ð‹L˜^                                   *
000009*****************************************************************
000010* RECORD    KEY  : ‹æ•ªƒR[ƒh + ŠJŽn˜a—ï”NŒŽ
000011*
000013*
000014* ‹æ•ªƒR[ƒhF1iŒ’•Ûj
000015* ƒvƒŠƒtƒBƒbƒNƒX‚ð‚g—¿‚P|‚É‚·‚é
000016*
000026*------------------------------------------------*
000027* Šî–{“I‚É•ÏX‚È‚µ FILLER‚É€–Ú’Ç‰Á
000028*------------------------------------------------*
000130*****************************************************************
000140 01  ƒŒƒR[ƒh.
000150     03  ƒŒƒR[ƒhƒL[.
000154*----------------------------------------------------------*
000156*     1:Œ’•ÛA4:˜JÐA5:Ž©”…ÓA6:Ž©”ï iŽÀÛ‚Í1:Œ’•Û‚Ì‚ÝŽg—pj
000160         05  ‹æ•ªƒR[ƒh                      PIC 9.
000161*----------------------------------------------------------*
000220         05  ŠJŽn˜a—ï”NŒŽ.
000230           07  ŠJŽn˜a—ï                      PIC 9.
000240           07  ŠJŽn”NŒŽ.
000250             09  ŠJŽn”N                      PIC 9(2).
000260             09  ŠJŽnŒŽ                      PIC 9(2).
000270     03  ‚Í‚è‚«‚ã‚¤ƒŒƒR[ƒhƒf[ƒ^.
000280         05  ‚g‚Pp‰‰ñ                      PIC 9(5).
000330         05  ‚g‚Qp‰‰ñ                      PIC 9(5).
000331         05  ‚g‚Pp                          PIC 9(5).
000332         05  ‚g‚Qp                          PIC 9(5).
000333         05  ‚g“d—Ã—¿                        PIC 9(4).
000334         05  ‚g‰—Ã—¿.
000335           07  ‚g‰—ÃŠî–{—¿‹à                PIC 9(4).
000336           07  ‚g‰—Ã’Ç‰Á—¿‹à                PIC 9(4).
000350*’Ç‰Á
000331         05  ‚g‚Pp–K–âŽ{p—¿‚P              PIC 9(5).
000332         05  ‚g‚Qp–K–âŽ{p—¿‚P              PIC 9(5).
000331         05  ‚g‚Pp–K–âŽ{p—¿‚Q              PIC 9(5).
000332         05  ‚g‚Qp–K–âŽ{p—¿‚Q              PIC 9(5).
000331         05  ‚g‚Pp–K–âŽ{p—¿‚R              PIC 9(5).
000332         05  ‚g‚Qp–K–âŽ{p—¿‚R              PIC 9(5).
000331         05  ‚g‚Pp–K–âŽ{p—¿‚S              PIC 9(5).
000332         05  ‚g‚Qp–K–âŽ{p—¿‚S              PIC 9(5).
000337         05  FILLER                          PIC X(60).
000338     03  ƒ}ƒbƒT[ƒWƒŒƒR[ƒhƒf[ƒ^.
000339         05  ‚l‚P‹ÇŠ                        PIC 9(5).
000340         05  ‚l•ÏŒ`“kŽè‹¸³p                PIC 9(5).
000344         05  ‚l‰·ãª–@—¿                      PIC 9(4).
000345         05  ‚l“d—Ã—¿                        PIC 9(4).
000346         05  ‚l‰—Ã—¿.
000347           07  ‚l‰—ÃŠî–{—¿‹à                PIC 9(4).
000348           07  ‚l‰—Ã’Ç‰Á—¿‹à                PIC 9(4).
000350*’Ç‰Á
000339         05  ‚l‚P‹ÇŠŽ{p—¿                  PIC 9(4).
000339         05  ‚l‚Q‹ÇŠŽ{p—¿                  PIC 9(4).
000339         05  ‚l‚R‹ÇŠŽ{p—¿                  PIC 9(4).
000339         05  ‚l‚S‹ÇŠŽ{p—¿                  PIC 9(4).
000339         05  ‚l‚T‹ÇŠŽ{p—¿                  PIC 9(4).
000339         05  ‚l‚P‹ÇŠ–K–âŽ{p—¿‚P            PIC 9(4).
000339         05  ‚l‚Q‹ÇŠ–K–âŽ{p—¿‚P            PIC 9(4).
000339         05  ‚l‚R‹ÇŠ–K–âŽ{p—¿‚P            PIC 9(4).
000339         05  ‚l‚S‹ÇŠ–K–âŽ{p—¿‚P            PIC 9(4).
000339         05  ‚l‚T‹ÇŠ–K–âŽ{p—¿‚P            PIC 9(4).
000339         05  ‚l‚P‹ÇŠ–K–âŽ{p—¿‚Q            PIC 9(4).
000339         05  ‚l‚Q‹ÇŠ–K–âŽ{p—¿‚Q            PIC 9(4).
000339         05  ‚l‚R‹ÇŠ–K–âŽ{p—¿‚Q            PIC 9(4).
000339         05  ‚l‚S‹ÇŠ–K–âŽ{p—¿‚Q            PIC 9(4).
000339         05  ‚l‚T‹ÇŠ–K–âŽ{p—¿‚Q            PIC 9(4).
000339         05  ‚l‚P‹ÇŠ–K–âŽ{p—¿‚R            PIC 9(4).
000339         05  ‚l‚Q‹ÇŠ–K–âŽ{p—¿‚R            PIC 9(4).
000339         05  ‚l‚R‹ÇŠ–K–âŽ{p—¿‚R            PIC 9(4).
000339         05  ‚l‚S‹ÇŠ–K–âŽ{p—¿‚R            PIC 9(4).
000339         05  ‚l‚T‹ÇŠ–K–âŽ{p—¿‚R            PIC 9(4).
000339         05  ‚l‚P‹ÇŠ–K–âŽ{p—¿‚S            PIC 9(4).
000339         05  ‚l‚Q‹ÇŠ–K–âŽ{p—¿‚S            PIC 9(4).
000339         05  ‚l‚R‹ÇŠ–K–âŽ{p—¿‚S            PIC 9(4).
000339         05  ‚l‚S‹ÇŠ–K–âŽ{p—¿‚S            PIC 9(4).
000339         05  ‚l‚T‹ÇŠ–K–âŽ{p—¿‚S            PIC 9(4).
000350*’Ç‰Á
000351     03  ‰—ÃŠî–{‹——£                        PIC 9(2)V9.
000362*
000372*’Ç‰Á H30/10/01‚©‚çŽZ’è‰Â”\
000382     03  Ž{p•ñ‘Œð•t—¿                    PIC 9(4).
000392*
000402*    03 ¬‡ƒŒƒR[ƒhƒf[ƒ^ ‚ÍƒRƒƒ“ƒgƒAƒEƒg‚µAFILLER‚ðƒŒƒxƒ‹ã‚°
000382     03  “Á•Ê’nˆæ‰ÁŽZ—¿                      PIC 9(4).
000403     03  FILLER                              PIC X(109).
000412*
000422*
