000090*****************************************************************
000091* 保険会社マスタ　HOKENCOM.dat ［RL=1024BYTE］                  *
000093*****************************************************************
000094* SYSYTEM NAME:共通                                             *
000095* LANGUAGE PG :NetCOBOL                                         *
000096* PRODUCT DATE:2009.09.07                                       *
000097* PURPOSE     :保険会社情報を記録                               *
000098*****************************************************************
000099* RECORD    KEY  : 保険会社番号
000100*
000101*
000102*     SELECT  保険会社マスタ     ASSIGN      TO           HOKCOML
000103*                                ORGANIZATION             IS  INDEXED
000104*                                ACCESS MODE              IS  DYNAMIC
000105*                                RECORD KEY               IS  保険会－保険会社番号
000108*                                ALTERNATE RECORD KEY     IS  保険会－保険会社カナ
000110*                                                             保険会－保険会社番号
000112*                                FILE STATUS              IS  状態キー
000113*                                LOCK        MODE         IS  AUTOMATIC.
000114*
000115* FD  保険会社マスタ   BLOCK   CONTAINS   1   RECORDS.
000116*     COPY HOKENCOM    OF  XFDLIB  JOINING   保険会   AS  PREFIX.
000117*
000118*****************************************************************
000119*
000120 01  レコード.
000121     03  レコードキー.
000131         05 保険会社番号         PIC 9(3).
000151     03  レコードデータ.
000160         05 保険会社カナ         PIC X(50).
000170         05 保険会社名           PIC X(50).
000210         05 郵便番号.
000220           07 郵便番号１         PIC X(3).
000230           07 郵便番号２         PIC X(4).
000240         05 住所.
000250           07 住所１             PIC X(50).
000260           07 住所２             PIC X(50).
000261         05  電話番号１          PIC X(50).
000262         05  電話番号２          PIC X(50).
000263         05  電話番号３          PIC X(50).
000273         05  備考                PIC X(100).
000290         05  FILLER              PIC X(564).
