000010*****************************************************************
000020* ＨＯＫＥＮＥＸ：保険者拡張マスタ［ＲＬ＝８００］              *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2002.02.18                                       *
000080* PURPOSE     :保険者・市町村の追加情報を管理                   *
000090*                                                               *
000091*****************************************************************
000092*まったく変更なし
000100*****************************************************************
000110 01  レコード.
000120     03  レコードキー.
000130         05  保険種別                   PIC 9(2).
000140         05  保険者番号                 PIC X(10).
000150     03  レコードデータ.
000160         05 振込番号                    PIC X(10).
000170         05 コメント                    PIC X(480).
000180         05 FILLER                      PIC X(298).
