000010*****************************************************************
000020* 負傷データＦ　ＨＵＳＹＯＵ．ＤＡＴ ［ＲＬ＝６４０BYTE］       *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.11.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :月毎＋患者＋部位毎の負傷情報を記録               *
000090*              主として負傷部位・負傷日・診療開始日・診療終了日 *
000100*              転帰区分を管理する                               *
000110*****************************************************************
000120 01 レコード.
000130   03 レコードキー.
000140     05 施術和暦年月.
000150       07 施術和暦                     PIC 9.
000160       07 施術年月.
000170         09 施術年                     PIC 9(2).
000180         09 施術月                     PIC 9(2).
000190     05 患者コード.
000200       07 患者番号                     PIC 9(6).
000210       07 枝番                         PIC X.
000220   03 レコードデータ.
000230     05 初検和暦年月日.
000240       07 初検和暦年月.
000250         09 初検和暦                   PIC 9.
000260         09 初検年月.
000270           11 初検年                   PIC 9(2).
000280           11 初検月                   PIC 9(2).
000290       07 初検日                       PIC 9(2).
000300     05 FILLER                         PIC X(2).
000310     05 部位数                         PIC 9.
000320     05 負傷データ      OCCURS   9.
000330       07 部位コード.
000340         09 負傷種別                   PIC 9(2).
000350         09 部位                       PIC 9(2).
000360         09 左右区分                   PIC 9.
000370         09 負傷位置番号               PIC 9(2).
000380       07 負傷和暦年月日.
000390         09 負傷和暦年月.
000400           11 負傷和暦                 PIC 9.
000410           11 負傷年月.
000420             13 負傷年                 PIC 9(2).
000430             13 負傷月                 PIC 9(2).
000440         09 負傷日                     PIC 9(2).
000450       07 負傷時間.
000460         09 負傷時                     PIC 9(2).
000470         09 負傷分                     PIC 9(2).
000480       07 開始和暦年月日.
000490         09 開始和暦年月.
000500           11 開始和暦                 PIC 9.
000510           11 開始年月.
000520             13 開始年                 PIC 9(2).
000530             13 開始月                 PIC 9(2).
000540         09 開始日                     PIC 9(2).
000550       07 終了和暦年月日.
000560         09 終了和暦年月.
000570           11 終了和暦                 PIC 9.
000580           11 終了年月.
000590             13 終了年                 PIC 9(2).
000600             13 終了月                 PIC 9(2).
000610         09 終了日                     PIC 9(2).
000620*
000630*****************************************************************
000640*      　１：治癒　２：全治　３：中止  ４：転医　５．自然治癒
000650*        ９：継続
000660       07 転帰区分                     PIC 9.
000670*****************************************************************
000680*
000690*****************************************************************
000700*         ０：通常　１：初回処置料請求なし
000710       07 算定区分                     PIC 9.
000720*****************************************************************
000730*
000740*****************************************************************
000750*         ０：通常請求　１：請求しない
000760       07 電療請求区分                 PIC 9.
000770*****************************************************************
000780*
000790* 下記項目は、当面使用しない予定
000800       07 包帯交換数                   PIC 9(2).
000810*
000820* 部位毎の金属副子
000830       07 金属副子数.
000840         09 大                         PIC 9.
000850         09 中                         PIC 9.
000860         09 小                         PIC 9.
000870* 部位毎の負傷原因を記録
000880       07 負傷原因コード.
000890         09 負傷患者番号               PIC 9(6).
000900         09 負傷連番                   PIC 9(4).
000910*         09 負傷時期                   PIC 9(2).
000920*         09 負傷場所                   PIC 9(2).
000930*         09 負傷状況                   PIC 9(2).
000940*         09 負傷部位                   PIC 9(2).
000950*         09 負傷動作                   PIC 9(2).
000960* 部位毎の経過状況を記録
000970       07 経過コード                   PIC 9(4).
000980* 下記は、当面使用しない予定
000990     05 全体経過コード                 PIC 9(2).
001000*****************************************************************
001010*         ０：通常            　１：初検・再検・初回処置料なし
001020*         ２：初検・再検料なし　３：初回処置料なし
001030*         ４：初検加算・時間外　５：初検加算・休日
001040*         ６：初検加算・深夜
001050     05 初検請求区分                   PIC 9.
001060*****************************************************************
001070*
001080     05 往療距離                       PIC 9(3)V9.
001090* 初検加算の時刻
001100     05 初検加算時間.
001110       07 診療時                       PIC 9(2).
001120       07 診療分                       PIC 9(2).
001130* 部位毎の情報提供料
001140     05 情報提供区分                   PIC 9  OCCURS 9.
001150*
001160* 開始診療日手動で登録したか   0:自動 1:手動
001170     05 開始診療日手動区分             PIC 9.
001180*
001190* ０：算定なし　１：算定あり
001200     05 運動療法算定区分               PIC 9.
001210* 自賠責のその他金額
001220     05 自賠責その他金額               PIC 9(6).
001230*
001240* ０：レセ署名なし　１：署名あり
001250     05 レセ署名区分                   PIC 9.
001260* ０：レセ負傷原因印刷する　１：印刷しない
001270     05 レセ負傷原因印刷区分           PIC 9.
001280*
001290* 部位毎の後療区分（管理用）
001300     05 後療区分                       PIC 9  OCCURS 9.
001310* ０：算定なし　１：算定あり
001320     05 指導管理算定区分               PIC 9.
001330* ０：算定なし　１：算定あり
001340     05 包帯交換算定区分               PIC 9.
001350* ０：加算あり　１：加算なし
001360     05 初検時相談料区分               PIC 9.
001370* ０：あり １：なし
001380     05 拘縮後療区分                   PIC 9.
001382* ０：レセ長期理由印刷する　１：印刷しない
001383     05 レセ長期理由印刷区分           PIC 9.
001384*  労災自賠責で文書不要の時0、いる時はSPACE
001385     05 労災自賠施術証明無区分         PIC X.
001386     05 労災自賠施術明細無区分         PIC X.
001387* ０：更新する、１：更新しない
           05 運動更新区分                   PIC 9(1).
           05 指導更新区分                   PIC 9(1).
           05 包帯更新区分                   PIC 9(1) OCCURS 7.
002832*/明細書発行体制加算 ０：算定する １：算定しない
           05 明細書算定区分                 PIC 9(1).
001390     05 FILLER                         PIC X(76).
001400*
