000010*****************************************************************
000020* ＨＵＴＡＮＲＩ：負担率マスタ［ＲＬ＝128］
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.03.23                                       *
000083* PURPOSE     :開始年月毎に保険種別（健康保険）毎の負担率を管理 *
000084*****************************************************************
000086*まったく変更なし
000101*****************************************************************
000281 01  レコード.
000282     03  レコードキー.
000283         05  保険種別                  PIC 9(2).
000284         05  開始和暦年月.
000285           07  開始和暦                PIC 9.
000286           07  開始年月.
000287             09  開始年                PIC 9(2).
000288             09  開始月                PIC 9(2).
000289     03  レコードデータ.
000290         05  終了和暦年月.
000291           07  終了和暦                PIC 9.
000292           07  終了年月.
000293             09  終了年                PIC 9(2).
000294             09  終了月                PIC 9(2).
000295         05  本人負担率                PIC 9(3).
000296         05  家族負担率                PIC 9(3).
000297         05  FILLER                    PIC X(110).
000298*
