      *****************************************************************
      * ＫＡＲＥＮＤ：カレンダマスタ ［ＲＬ＝６４BYTE］
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.06.24                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :年月日ＡＬＬ　ＺＥＲＯで制御情報を管理           *
      *             :曜日・祝日・休診日を管理                         *
      *****************************************************************
      * プレフィクス:カ－
      *****************************************************************
       01 レコード.
         03 レコードキー.
           05 カレンダ年月日.
             07 カレンダ年月.
               09 カレンダ年                 PIC 9(4).
               09 カレンダ月                 PIC 9(2).
             07 カレンダ日                   PIC 9(2).
         03 レコードデータ.
           05 FILLER                         PIC X(56).
