      *****************************************************************
      * ＫＥＩＳＡＰＧ：計算ＰＧマスタ ［ＲＬ＝１２８BYTE］           *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.04.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :区分コード（健保01・労災02・自賠03）毎＋開始年月 *
      *              毎 に計算ＰＧを管理                              *
      *****************************************************************
       01 レコード.
         03 レコードキー.
      *****************************************************************
      * 健康保険（老人助成含む）：０１　労災：０２　自賠責：０３
           05  区分コード                  PIC 9(2).
      *****************************************************************
           05  開始和暦年月.
             07  開始和暦                  PIC 9.
             07  開始年月.
               09  開始年                  PIC 9(2).
               09  開始月                  PIC 9(2).
         03  レコードデータ.
           05  終了和暦年月.
             07  終了和暦                  PIC 9.
             07  終了年月.
               09  終了年                  PIC 9(2).
               09  終了月                  PIC 9(2).
      * 以下、日計用ＰＧ
           05  費用額ＰＧ                  PIC X(8).
           05  負担額ＰＧ                  PIC X(8).
           05  負担額ＰＧ老人              PIC X(8).
           05  負担額ＰＧ助成              PIC X(8).
      *
           05  レセプトＰＧ                PIC X(8).
           05  費用額ＰＧ月計              PIC X(8).
           05  労災日計ＰＧ                PIC X(8).
           05  労災月計ＰＧ                PIC X(8).
           05  自賠責日計ＰＧ              PIC X(8).
           05  自賠責月計ＰＧ              PIC X(8).
           05  レセプト日計ＰＧ            PIC X(8).
      */老人保険の改正の対応0101
           05  負担額ＰＧ老人２            PIC X(8).
           05  FILLER                      PIC X(20).
