      *****************************************************************
      * ＫＥＩＳＡＮ：計算マスタ ［ＲＬ＝２５６BYTE］                 *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.04.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :制御区分（健保01・労災02・自賠03）毎＋開始年月毎 *
      *              に計算に必要な情報を管理                         *
      *****************************************************************
       01 レコード.
         03 レコードキー.
           05 制御区分                       PIC 9(2).
           05  開始和暦年月.
             07  開始和暦                    PIC 9.
             07  開始年月.
               09  開始年                    PIC 9(2).
               09  開始月                    PIC 9(2).
         03  レコードデータ.
           05  終了和暦年月.
             07  終了和暦                    PIC 9.
             07  終了年月.
               09  終了年                    PIC 9(2).
               09  終了月                    PIC 9(2).
           05 FILLER                         PIC X(244).
