000010*****************************************************************
000020* 受診者情報Ｆ　ＪＵＳＩＮＪ．ＤＡＴ ［ＲＬ＝７６８BYTE］       *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.11.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :月毎＋患者毎の保険情報を記録                     *
000090*              主として保険証情報・保険詳細情報（甲乙区分・請求 *
000100*              区分）等を管理する。                             *
000110*              又、患者毎に最新レコード（キー：施術年月ALL ZERO *
000120*              + 患者コード）を管理し、常に、最新の月情報での   *
000130*              月次更新が可能。                                 *
000140*****************************************************************
000150* RECORD    KEY  : 施術和暦年月 + 患者コード
000160* ALTERNATE KEY1 : 施術和暦年月 + 患者カナ + 患者コード
000170* ALTERNATE KEY2 : 患者コード   + 施術和暦年月
000180* ALTERNATE KEY3 : 施術和暦年月 + 保険種別 + 保険者番号 + 
000190*                  患者コード
000200* ALTERNATE KEY4 : 施術和暦年月 + 公費種別 + 費用負担者番号 + 
000210*                  患者コード
000220* ALTERNATE KEY5 : 施術和暦年月 + 助成種別 + 費用負担者番号助成 +
000230*                  患者コード
000240*****************************************************************
000250 01 レコード.
000260   03 レコードキー.
000270     05 施術和暦年月.
000280       07 施術和暦                     PIC 9.
000290       07 施術年月.
000300         09 施術年                     PIC 9(2).
000310         09 施術月                     PIC 9(2).
000320     05 患者コード.
000330       07 患者番号                     PIC 9(6).
000340       07 枝番                         PIC X.
000350   03 レコードデータ.
000360     05 患者氏名                       PIC N(10).
000370     05 患者カナ                       PIC X(20).
000380     05 患者性別                       PIC 9.
000390     05 患者生年月日.
000400       07 患者和暦                     PIC 9.
000410       07 患者年                       PIC 9(2).
000420       07 患者月                       PIC 9(2).
000430       07 患者日                       PIC 9(2).
000440     05 患者郵便番号.
000450       07 患者郵便番号１               PIC X(3).
000460       07 患者郵便番号２               PIC X(4).
000470     05 患者住所１                     PIC X(40).
000480     05 患者住所２                     PIC X(40).
000490     05 患者電話番号                   PIC X(15).
000500     05 本人家族区分                   PIC 9.
000510     05 続柄                           PIC 9(2).
000520*
000530     05 保険種別                       PIC 9(2).
000540     05 保険者番号.
000550       07 法別番号                     PIC X(2).
000560       07 保番.
000570         09 都道府県番号               PIC X(2).
000580         09 保険番号                   PIC X(3).
000590         09 検証番号                   PIC X.
000600         09 FILLER                     PIC X(2).
000610     05 記号                           PIC N(12).
000620     05 番号                           PIC X(30).
000630     05 被保険者氏名                   PIC N(10).
000640     05 被保険者カナ                   PIC X(20).
000650     05 被保険者性別                   PIC 9.
000660     05 被保険者生年月日.
000670       07 被保険者和暦                 PIC 9.
000680       07 被保険者年                   PIC 9(2).
000690       07 被保険者月                   PIC 9(2).
000700       07 被保険者日                   PIC 9(2).
000710     05 郵便番号.
000720       07 郵便番号１                   PIC X(3).
000730       07 郵便番号２                   PIC X(4).
000740     05 住所１                         PIC X(40).
000750     05 住所２                         PIC X(40).
000760     05 電話番号                       PIC X(15).
000770     05 事業所名称                     PIC N(20).
000780     05 事業所住所１                   PIC X(40).
000790     05 事業所住所２                   PIC X(40).
000800     05 資格取得年月日.
000810       07 資格和暦                     PIC 9.
000820       07 資格年                       PIC 9(2).
000830       07 資格月                       PIC 9(2).
000840       07 資格日                       PIC 9(2).
000850     05 有効年月日.
000860       07 有効和暦                     PIC 9.
000870       07 有効年                       PIC 9(2).
000880       07 有効月                       PIC 9(2).
000890       07 有効日                       PIC 9(2).
000900* ２７老人として使用
000910*（３ペアの４１老人として使用する場合は保留）
000920* 助成の番号が入力されていても公費２にＷＲＩＴＥするようにする。
000930* 　　　　　　　　　　　　　　　　　　（公費２が空白の場合のみ）
000940     05 公費種別                       PIC 9(2).
000950     05 費用負担者番号.
000960       07 法別番号老人                 PIC X(2).
000970       07 助保険老人.
000980         09 府県老人                   PIC X(2).
000990         09 助番老人                   PIC X(3).
001000         09 助ＣＤ老人                 PIC X.
001010       07 FILLER                       PIC X(2).
001020     05 受益者番号老人                 PIC X(20).
001030     05 国保番号老人.
001040         09 府県番号老人               PIC X(2).
001050         09 保険番号老人               PIC X(3).
001060         09 検証番号老人               PIC X.
001070         09 FILLER                     PIC X(4).
001080* 市町村マスタにも助成負担率をもつ
001090* 助成区分１＋市町村番号により自動入力
001100     05 FILLER                         PIC X(3).
001110     05 有効年月日老人.
001120       07 有効和暦老人                 PIC 9.
001130       07 有効年老人                   PIC 9(2).
001140       07 有効月老人                   PIC 9(2).
001150       07 有効日老人                   PIC 9(2).
001160* 助成として使用。
001170     05 助成種別                       PIC 9(2).
001180     05 費用負担者番号助成.
001190       07 法別番号助成                 PIC X(2).
001200       07 助保険助成.
001210         09 府県助成                   PIC X(2).
001220         09 助番助成                   PIC X(3).
001230         09 助ＣＤ助成                 PIC X.
001240       07 FILLER                       PIC X(2).
001250     05 受益者番号助成                 PIC X(20).
001260     05 FILLER                         PIC X(10).
001270* 市町村マスタにも助成負担率をもつ
001280* 助成区分２＋市町村番号により自動入力
001290     05 負担率助成                     PIC 9(3).
001300     05 有効年月日助成.
001310       07 有効和暦助成                 PIC 9.
001320       07 有効年助成                   PIC 9(2).
001330       07 有効月助成                   PIC 9(2).
001340       07 有効日助成                   PIC 9(2).
001350*********************************************************
001360* ○擬の保険証で被保険者が受診者の時、世帯主を仮の被保険者とする
001370* 場合に２をたてる。家族　名称マスタに
001380* （世帯主区分を作成：レセプト印字のため）
001390* ○擬の保険証でなく、受診者と被保険者が一致する場合、１：世帯主
001400* 退職者国保で受診者が扶養家族の場合：未入力で続柄を使用
001410* 退職者国保以外は：０
001420     05 世帯主続柄                     PIC 9.
001430*********************************************************
001440* 最新受診者情報がある月の情報
001450* （最新レコードのみにＷＲＩＴＥ）
001460     05 最新キー情報.
001470       07 施術和暦年月Ｎ.
001480         09 施術和暦Ｎ                 PIC 9.
001490         09 施術年月Ｎ.
001500           11 施術年Ｎ                 PIC 9(2).
001510           11 施術月Ｎ                 PIC 9(2).
001520*********************************************************
001530* 患者コードを継続使用するかのフラグ　使用：０　不使用：１
001540* はりきゅうシステムで、枝番作成時に９をセット
001550     05 継続区分                       PIC 9.
001560*********************************************************
001570* 国保（国保組合）の場合　０：なし　１：甲　２：乙
001580* 社保（船員）　　の場合　０：通常　１：公傷
001590     05 甲乙区分                       PIC 9.
001600*********************************************************
001610* ０：通常請求　１：免除あり　（レセプト印刷には影響なし）
001620     05 老人負担金免除                 PIC 9.
001630     05 助成負担金免除                 PIC 9.
001640*********************************************************
001650* 下記の項目は、月次更新時に初期化する項目
001660*********************************************************
001670     05 初期化項目.
001680* ０：請求　１：請求しない
001690         07 請求区分                   PIC 9.
001700* 
001710* 下記項目は、当面使用しない予定。
001720* 請求区分で”請求しない”の場合、請求年月予定を入力しておく
001730         07 請求和暦年月.
001740           09 請求和暦                 PIC 9.
001750           09 請求年月.
001760             11 請求年                 PIC 9(2).
001770             11 請求月                 PIC 9(2).
001780* 下記項目は、当面使用しない予定。負傷データＦの実日数で代用
001790         07 老人負担回数月計           PIC 9(2).
001800*********************************************************
001810* 以上、初期化項目
001820*********************************************************
001830     05 備考                           PIC X(60).
001840     05 返戻区分                       PIC 9.
001850*********************************************************
001860* ０：はりきゅうを使用しない １：はりきゅうを使用する
001870     05 はり区分                       PIC 9.
001880* ０：あんまマッサージを使用しない １：あんまマッサージを使用する
001890     05 あんま区分                     PIC 9.
001900*********************************************************
001910* ０：レセプト印刷前    １：レセプト印刷した
001920     05 レセ印刷区分                   PIC 9.
001930     05 レセ印刷区分助成               PIC 9.
001940*********************************************************
001950* カルテ裏の印刷行数(各会用)
001960     05 カルテ裏印刷行数               PIC 9(2).
001970*
001980*     05 FILLER                         PIC X(64).
001990*/老人保険の改正の対応。0101
002000     05 老人負担回数                   PIC 9(2).
002010     05 老人負担額累計                 PIC 9(5).
002020     05 老人最終負担日                 PIC 9(2).
002030     05 老人負担額端数                 PIC 9(5).
002040     05 老人負担無し                   PIC 9.
002050*/資格証明の対応
002060     05 資格証明区分                   PIC 9.
002070* カルテ裏の印刷行数(一般用)
002080     05 カルテ一般裏印刷行数           PIC 9(2).
002090*/３歳未満・７０以上の対応 H14/10～
002100* 1:７０～７４歳一般 , 2:７０～７４歳高額  3:３歳未満
002110     05 特別区分                       PIC 9.
002120*/カルテ裏印刷列数(中央用)
002130     05 カルテ裏印刷列数               PIC 9.
002140*/返戻時の請求額（山口用）
002150     05 返戻時請求額                   PIC 9(6).
002160     05 返戻時請求額助成               PIC 9(5).
002170     05 返戻時請求額助成入力済         PIC 9.
002180*/自費で入力した時用 1:学校共済（負担０円）
002190     05 保険外区分                     PIC 9.
002200*/はりきゅうシステム用（枝番作成時に枝番SPACEのレコード側に作成した枝番をセット）
002210     05 枝番作成時枝番                 PIC X.
002220*/事業所郵便番号を追加/0508
002230     05 事業所郵便番号.
002240       07 事業所郵便番号１             PIC X(3).
002250       07 事業所郵便番号２             PIC X(4).
002251*/75未満の後期高齢者区分　0:なし、1:後期高齢者
002252     05 後期高齢者特別区分             PIC 9.
002260     05 FILLER                         PIC X(22).
