000010*****************************************************************
000020* 労災情報Ｆ　ROUSAIJ.DAT ［ＲＬ＝1024BYTE］     *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.07.08                                       *
000083* PURPOSE     :月毎＋患者毎の労災情報を記録                     *
000140*****************************************************************
000150*---------------------------------------------------------------*
000160*	新規ファイル
000170*---------------------------------------------------------------*
000240**
000241*     SELECT  労災情報Ｆ      ASSIGN      TO        ROUSAIJL
000242*                             ORGANIZATION             IS INDEXED
000243*                             ACCESS MODE              IS DYNAMIC
000244*                             RECORD KEY               IS 労災－施術和暦年月
000245*                                                         労災－患者コード
000255*                             ALTERNATE RECORD KEY     IS 労災－患者コード
000265*                                                         労災－施術和暦年月
000277*                             FILE STATUS              IS 状態キー
000278*                             LOCK        MODE         IS AUTOMATIC.
000279***
000280* FD  労災情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000281*     COPY ROUSAIJ      OF  XFDLIB  JOINING   労災   AS  PREFIX.
000282*
000283*****************************************************************
000284 01 レコード.
000285   03 レコードキー.
000286     05 施術和暦年月.
000287       07 施術和暦                     PIC 9.
000290       07 施術年月.
000300         09 施術年                     PIC 9(2).
000310         09 施術月                     PIC 9(2).
000320     05 患者コード.
000330       07 患者番号                     PIC 9(6).
000340       07 枝番                         PIC X.
000350   03 レコードデータ.
000493     05 労災種別                       PIC 9(2).
000494     05 労働保険番号                   PIC X(20).
000495     05 労災事業所名称                 PIC X(50).
000496     05 労災事業所郵便番号.
000497       07 労災事業所郵便番号１         PIC X(3).
000498       07 労災事業所郵便番号２         PIC X(4).
000499     05 労災事業所住所１               PIC X(50).
000500     05 労災事業所住所２               PIC X(50).
000502     05 労災事業所電話番号             PIC X(40).
000503     05 労災事業主氏名                 PIC X(80).
000504     05 労災備考                       PIC X(400).
000511*
002278     05 FILLER                         PIC X(313).
002280*
