000090*****************************************************************
000091* システム更新履歴Ｆ　sysupd.dat ［RL=640BYTE］                 *
000092*****************************************************************
000093* SYSYTEM NAME:共通                                             *
000094* LANGUAGE PG :NetCOBOL                                         *
000095* PRODUCT DATE:2009.04.02                                       *
000097* PURPOSE     :システム更新履歴を記録                           *
000098*****************************************************************
000099*---------------------------------------------------------------*
000100*	新規ファイル
000101*---------------------------------------------------------------*
000102*
000103*     SELECT  システム更新履歴Ｆ  ASSIGN      TO        SYSUPDL
000104*                                 ORGANIZATION             IS  INDEXED
000105*                                 ACCESS MODE              IS  DYNAMIC
000106*                                 RECORD KEY               IS  更履－定期修正日時
000107*                                                              更履－定期修正番号
000108*                                                              更履－枝番
000109*                                 ALTERNATE RECORD KEY     IS  更履－定期修正種類
000110*                                                              更履－定期修正日時
000111*                                                              更履－定期修正番号
000112*                                                              更履－枝番
000113*                                 FILE STATUS              IS  状態キー
000114*                                 LOCK        MODE         IS  AUTOMATIC.
000115*
000116* FD  システム更新履歴Ｆ    BLOCK   CONTAINS   1   RECORDS.
000117*     COPY SYSUPD          OF  XFDLIB  JOINING   更履   AS  PREFIX.
000118*
000119*****************************************************************
000120*****************************************************************
000121*****************************************************************
000122 01 レコード.
000123   03 レコードキー.
000124      05 定期修正日時.
000125        07 定期修正年月日.
000126          09 定期修正年                    PIC 9(4).
000127          09 定期修正月                    PIC 9(2).
000128          09 定期修正日                    PIC 9(2).
000129        07 定期修正時間.
000130          09 定期修正時                    PIC 9(2).
000131          09 定期修正分                    PIC 9(2).
000132          09 定期修正秒                    PIC 9(4).
000133      05 定期修正番号                      PIC 9(8).
000134      05 枝番                              PIC 9.
000135   03 レコードデータ.
000136*    / 1:柔、2:快癒、10:保険者マスタ
000137      05 定期修正種類                      PIC X(2).
000138*
000139*    / 1:CDバージョンアップ、2:インターネット
000140      05 定期修正更新区分                  PIC X.
000141*
000142      05 バージョン                        PIC X(10).
000143      05 定期修正タイトル                  PIC X(50).
000144      05 定期修正内容                      PIC X(200).
000145*
000146      05 FILLER                            PIC X(352).
000147*
