000120*****************************************************************
000121* 祝日マスタ　syuku.dat ［RL=64BYTE］                          *
000122*****************************************************************
000123* SYSYTEM NAME:共通                                             *
000124* LANGUAGE PG :NetCOBOL                                         *
000125* PRODUCT DATE:2009.03.18                                       *
000127* PURPOSE     :祝日を記録                                       *
000128*****************************************************************
000135*---------------------------------------------------------------*
000136*	新規マスタ
000137*---------------------------------------------------------------*
000138***
000139*
000140*     SELECT  祝日マスタ      ASSIGN      TO        SYUKUL
000141*                             ORGANIZATION             IS  INDEXED
000142*                             ACCESS MODE              IS  DYNAMIC
000143*                             RECORD KEY               IS  祝－施術和暦年月日
000144*                             FILE STATUS              IS  状態キー
000145*                             LOCK        MODE         IS  AUTOMATIC.
000146***
000147* FD  祝日マスタ        BLOCK   CONTAINS   1   RECORDS.
000148*     COPY SYUKU        OF  XFDLIB  JOINING   祝   AS  PREFIX.
000149*
000150*****************************************************************
000151 01 レコード.
000152   03 レコードキー.
000153     05 施術和暦年月日.
000154       07 施術和暦年月.
000160         09 施術和暦                   PIC 9.
000170         09 施術年月.
000180           11 施術年                   PIC 9(2).
000190           11 施術月                   PIC 9(2).
000200       07 施術日                       PIC 9(2).
000233**
000250   03 レコードデータ.
000305     05 備考                           PIC X(40).
001080     05 FILLER                         PIC X(17).
