      *****************************************************************
      * ＴＥＲＩＲＥＫ：定期修正履歴Ｆ  ［ＲＬ＝２５６]
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.10.07                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :定期修正の履歴ファイル　　　　　　　　　         *
      *              実行日時を管理　　　　　　　　　　　　　　　　　 *
      *****************************************************************
       01 レコード.
         03 レコードキー.
            05 定期修正日時.
              07 定期修正年月日.
                09 定期修正年                    PIC 9(4).
                09 定期修正月                    PIC 9(2).
                09 定期修正日                    PIC 9(2).
              07 定期修正時間.
                09 定期修正時                    PIC 9(2).
                09 定期修正分                    PIC 9(2).
                09 定期修正秒                    PIC 9(4).
            05 定期修正番号                      PIC 9(8).
            05 ＦＤ番号                          PIC 9(2).
         03 レコードデータ.
            05 定期修正区分                      PIC 9(2).
            05 定期修正曜日                      PIC 9.
            05 定期修正ＣＭ                      PIC N(50).
            05 バージョン番号                    PIC 9(2).
            05 レベル番号                        PIC X(3).
            05 FILLER                            PIC X(122).
