000010*****************************************************************
000020* 受付項目マスタ　Ukeitem.dat ［RL=128BYTE］                    *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2010.04.15                                       *
000070* PURPOSE     :受付画面表示項目の管理                           *
000080*****************************************************************
000090*     SELECT  受付項目マスタ  ASSIGN      TO        UKEITEML
000100*                             ORGANIZATION             IS  INDEXED
000110*                             ACCESS MODE              IS  DYNAMIC
000120*                             RECORD      KEY          IS  受付項－ＴＢＬ内容設定区分
000130*                                                          受付項－項目番号
000140*                             ALTERNATE RECORD KEY     IS  受付項－ＴＢＬ内容設定区分
000150*                                                          受付項－表示順
000160*                                                          受付項－項目番号
000170*                             FILE STATUS              IS  状態キー
000180*                             LOCK        MODE         IS  AUTOMATIC.
000190*
000200***
000210* FD  受付項目マスタ   BLOCK   CONTAINS   1   RECORDS.
000220*     COPY UKEITEM      OF  XFDLIB  JOINING   受付項   AS  PREFIX.
000230*
000240*****************************************************************
000250 01 レコード.
000260   03 レコードキー.
000270*----------------------------------------------------*
000280* 01:固定 10:受付標準 11:受付個別設定
000290*
000300     05 ＴＢＬ内容設定区分             PIC 9(2).
000310*----------------------------------------------------*
000320     05 項目番号                       PIC 9(2).
000330   03 レコードデータ.
000340     05 項目名                         PIC X(30).
000350     05 項目幅                         PIC 9(4).
000360     05 項目配置                       PIC 9(1).
000370     05 テキスト種別                   PIC 9(1).
000380     05 ＰＩＣ文字列                   PIC X(20).
000390*
000400     05 表示順                         PIC 9(2).
000410*
000420     05 FILLER                         PIC X(66).
000430*
