000010*****************************************************************
000020* 郵便マスタ yuubin.dat ［RL=256BYTE］
000030*****************************************************************
000090* SYSYTEM NAME:共通                                             *
000091* LANGUAGE PG :NetCOBOL                                         *
000092* PRODUCT DATE:2009.03.18                                       *
000093* PURPOSE     :郵便番号（郵政省データ）を記録                   *
000094*****************************************************************
000097*---------------------------------------------------------------*
000098*	SELECT文変更あり(キー変更)、項目変更あり
000099*---------------------------------------------------------------*
000100*
000104*     SELECT  郵便マスタ    ASSIGN    TO          YUUBINL
000105*                           ORGANIZATION             IS  INDEXED
000106*                           ACCESS MODE              IS  DYNAMIC
000107*                           RECORD KEY               IS  郵－郵便番号
000111*                           ALTERNATE RECORD KEY     IS  郵－市区町カナ
000112*                                                        郵－郵便番号
000113*                           ALTERNATE RECORD KEY     IS  郵－都道府県コード
000114*                                                        郵－市区カナ
000115*                                                        郵－町村カナ
000116*                                                        郵－郵便番号
000121*                           ALTERNATE RECORD KEY     IS  郵－市区名
000122*                                                        郵－町村名
000123*                                                        郵－郵便番号
000124*                           FILE STATUS              IS  状態キー
000125*                           LOCK        MODE         IS  AUTOMATIC.
000126***
000127* FD  郵便マスタ          BLOCK   CONTAINS   1   RECORDS.
000128*     COPY YUUBIN          OF  XFDLIB  JOINING   郵 AS  PREFIX.
000129*
000130*****************************************************************
000131 01  レコード.
000132     03  レコードキー.
000133         05  郵便番号.
000134           07  郵便番号１               PIC X(3).
000140           07  郵便番号２               PIC X(4).
000150     03  レコードデータ.
000160         05  住所.
000170           07  都道府県名               PIC X(10).
000180           07  市区名                   PIC X(40).
000190           07  町村名                   PIC X(40).
000200         05  住所カナ.
000210           07  都道府県カナ             PIC X(10).
000220           07  市区カナ                 PIC X(40).
000230           07  町村カナ                 PIC X(40).
000240         05  公共団体コード.
000250           07  都道府県コード           PIC X(2).
000260           07  地方公共団体コード       PIC X(3).
000280         05  市区町カナ                 PIC X(60).
000290         05  FILLER                     PIC X(4).
