      *****************************************************************
      * ＢＡＮＧＯＫ：番号管理Ｆ［ＲＬ＝１２８］
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.11.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :バーコードの整理番号管理ファイル                 *
      *****************************************************************
       01  レコード.
           03  現在番号                  PIC 9(6).
           03  FILLER                    PIC X(122).
