000010*****************************************************************
000020* ＣＨＯＲＩＹＵ：長期理由マスタ［ＲＬ＝３４６BYTE］            *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINDOWS                                   *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1998.06.18                                       *
000070* AUTHOR      :上田　育正                                       *
000080* PURPOSE     :長期理由マスタ                                   *
000090*              デフォルトの理由文は更新も削除もさせないように   *
000100*              更新区分持つ。                               *
000110*              更新区分 ＺＥＲＯ：更新可  １(!ZERO)：更新不可 *
000120*****************************************************************
000121*****************************************************************
000122* 変更なし（理由文N160をX320に変更）
000123*****************************************************************
000130 01 レコード.
000140   03 レコードキー.
000150     05 部位コード.
000160       07 負傷種別                   PIC 9(2).
000170       07 部位                       PIC 9(2).
000180     05 理由コード                   PIC 9(3).
000190   03 レコードデータ.
000200     05 更新区分                     PIC 9.
000210     05 転帰区分                     PIC 9.
000220     05 理由文                       PIC X(320).
000230     05 頻回区分                     PIC 9(1).
000240   03 FILLER                         PIC X(16).
