000090*****************************************************************
000091* Ｈ情報マスタ　H_info.dat ［RL=128BYTE］                       *
000092*****************************************************************
000093* SYSYTEM NAME:鍼灸マッサージ                                   *
000094* LANGUAGE PG :NetCOBOL                                         *
000095* PRODUCT DATE:2004.10.29                                       *
000097* PURPOSE     :システム情報を記録                               *
000098*****************************************************************
000099* RECORD    KEY  : 情報区分 (0:快癒、1:柔)
000100*
000101*****************************************************************
000102*まったく変更なし
000103*****************************************************************
000104*****************************************************************
000105 01  レコード.
000110     03  レコードキー.
000150         05 情報区分             PIC 9(2).
000151     03  レコードデータ.
000152         05 バージョン           PIC X(10).
000161         05 更新年月日.
000171           07 更新年             PIC 9(4).
000181           07 更新月             PIC 9(2).
000191           07 更新日             PIC 9(2).
000280         05  FILLER              PIC X(108).
