000090*****************************************************************
000091* Ｈ医師マスタ　H_ishi.dat ［RL=384BYTE］                       *
000092*****************************************************************
000093* SYSYTEM NAME:鍼灸マッサージ                                   *
000094* LANGUAGE PG :NetCOBOL                                         *
000095* PRODUCT DATE:2004.08.03                                       *
000097* PURPOSE     :同意医師情報を記録                               *
000098*****************************************************************
000099* RECORD    KEY  : 医師コード
000100*
000101*****************************************************************
000102*まったく変更なし
000103*****************************************************************
000105 01  レコード.
000110     03  レコードキー.
000150         05 医師コード           PIC 9(3).
000151     03  レコードデータ.
000160         05 カナ                 PIC X(30).
000170         05 氏名                 PIC X(30).
000180         05 医療機関名           PIC X(60).
000210         05 郵便番号.
000220           07 郵便番号１         PIC X(3).
000230           07 郵便番号２         PIC X(4).
000240         05 住所.
000250           07 住所１             PIC X(40).
000260           07 住所２             PIC X(40).
000261         05  電話番号            PIC X(15).
000270         05  表示順              PIC 999V999.
000280         05  FILLER              PIC X(153).
