000001*****************************************************************
000002* Ｈ名称マスタ　H_meisyo.dat ［RL=256BYTE］                     *
000003*****************************************************************
000004* SYSYTEM NAME:鍼灸マッサージ                                   *
000005* LANGUAGE PG :NetCOBOL                                         *
000006* PRODUCT DATE:2009.03.26                                       *
000080* PURPOSE     :区分コード毎に＋名称・略称を管理                 *
000081*****************************************************************
000082* RECORD    KEY  : 区分コード + 名称コード
000083*
000084*-------------------------*
000085*まったく変更なし
000086*-------------------------*
000087*
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000140*******************************************************************
000150* 区分コード体系                                                  
000160* ０１：施術区分
000161* ０２：はりきゅう施術内容区分
000170* ０３：マッサージ施術内容区分
000180* ０４：はりきゅう傷病名
000190* ０５：協会コード
000191* ０６：施術区分処理対象（0:鍼灸・マッサージ両方、1:鍼灸のみ、2:マッサージのみ）
000200*
000280*******************************************************************
000290*
000300         05  名称コード                PIC 9(3).
000310     03  レコードデータ.
000320         05  名称                      PIC X(100).
000340         05  略称                      PIC X(30).
000350         05  備考                      PIC X(20).
000351         05  数字パラ１                PIC 9(6).
000352         05  数字パラ２                PIC 9(6).
000370         05  FILLER                    PIC X(89).
