000120*****************************************************************
000121* Ｈ日計データＦ　H_nikei.dat ［RL=512BYTE］                    *
000122*****************************************************************
000123* SYSYTEM NAME:鍼灸マッサージ                                   *
000124* LANGUAGE PG :NetCOBOL                                         *
000125* PRODUCT DATE:2009.03.26                                       *
000127* PURPOSE     :日々の情報を記録                                 *
000128*****************************************************************
000129*---------------------------------------------------------------*
000130*	SELECT文変更なし、項目変更あり(領収書関係はRYOYUへ移動)
000131*---------------------------------------------------------------*
000132*
000133*     SELECT  Ｈ日計データＦ  ASSIGN      TO        HNIKEIL
000134*                             ORGANIZATION             IS  INDEXED
000135*                             ACCESS MODE              IS  DYNAMIC
000136*                             RECORD KEY               IS  Ｈ日－施術区分
000137*                                                          Ｈ日－施術和暦年月日
000138*                                                          Ｈ日－患者コード
000139*                             ALTERNATE RECORD KEY     IS  Ｈ日－施術区分
000140*                                                          Ｈ日－患者コード
000141*                                                          Ｈ日－施術和暦年月日
000142*                             ALTERNATE RECORD KEY     IS  Ｈ日－施術和暦年月日
000143*                                                          Ｈ日－登録順
000144*                             FILE STATUS              IS  状態キー
000145*                             LOCK        MODE         IS  AUTOMATIC.
000146***
000147* FD  Ｈ日計データＦ      BLOCK   CONTAINS   1   RECORDS.
000148*     COPY H_NIKEI    OF  XFDLIB  JOINING   Ｈ日   AS  PREFIX.
000149*
000150*****************************************************************
000151 01 レコード.
000152   03 レコードキー.
000153*-----------------------------------------------*
000154* 1:鍼灸、2:あんま・マッサージ、3:両方（労災）
000155     05 施術区分                       PIC 9.
000156*-----------------------------------------------*
000157     05 施術和暦年月日.
000158       07 施術和暦年月.
000160         09 施術和暦                   PIC 9.
000170         09 施術年月.
000180           11 施術年                   PIC 9(2).
000190           11 施術月                   PIC 9(2).
000200       07 施術日                       PIC 9(2).
000210     05 患者コード.
000220       07 患者番号                     PIC 9(6).
000230       07 枝番                         PIC X.
000233**
000250   03 レコードデータ.
000251     05 負傷主キー                     PIC 9(8).
000252     05 登録順                         PIC 9(4)V9.
000253     05 施術内容区分                   PIC 9(2).
000258*-----------------------------------------------*
000259*  1：後療　2:初検
000260     05 診療区分                       PIC 9.
000261*-----------------------------------------------*
000262*  初検関係 使用しない
000263     05 初検関係.
000264*     （0：請求なし　1：請求あり）
000265       07 初検料請求区分               PIC 9.
000266       07 初検加算                     PIC 9.
000267*   使用しない
000268     05 施術加算                       PIC 9.
000269*
000270     05 往料.
000271* 　　 0：なし　1：あり
000272       07 往療日区分                   PIC 9.
000273       07 往療距離                     PIC 9(2)V9.
000274*      使用しない
000275       07 往療加算                     PIC 9.
000276*
000277     05 費用額                         PIC 9(6).
000278     05 入金額                         PIC 9(6).
000279     05 一部負担金                     PIC 9(6).
000280     05 自費額                         PIC 9(6).
000281     05 助成計算負担額                 PIC 9(6).
000282*
000283*****
000284**//RYOYUへ移動
000285*     05 自費分明細  OCCURS 5.
000286*       07 費目番号                     PIC 9(3).
000287*       07 数量                         PIC 9(2).
000288*       07 金額                         PIC 9(6).
000289*     05 領収書摘要                     PIC X(60).
000290*     05 領収書印刷区分                 PIC 9.
000295*****
000296*
000305     05 施術メモ                       PIC X(100).
000340*
000410**
000413*●追加-----------------------------------------*
000414*
000415     05 施術者番号                     PIC 9(4).
000416*
000417     05 FILLER                         PIC X(131).
000427     05 往療データ.
000432       07 按分.
000433*        / 0なし、1あり /
000434         09 往療按分区分               PIC 9.
000436         09 FILLER                     PIC X(3).
000437         09 往療按分金額               PIC 9(6).
000438**
000439     05 例外レセ用金額欄.
000440       07 例外一部負担金               PIC 9(6).
000441       07 例外助成計算負担額           PIC 9(6).
000445*
000446     05 入力時間.
000447       07 入力時                       PIC X(2).
000448       07 入力分                       PIC X(2).
000449*
000450*マッサージ・変形徒手の重複対応追加-------------*
000455*
001083*    特殊施術画面で手動変更を行ったら：１（標準戻しボタン以外ではクリアされない）
001084     05 特殊施術区分                   PIC 9.
001086*
001087*    マッサージ固有の並びがＨレセと異なるので注意
001088     05 マッサージ固有.
001089       07 マッサージ数                 PIC 9.
001090       07 マッサージ施術.
001091          09 マッサージ体幹            PIC 9.
001092          09 マッサージ右上肢          PIC 9.
001093          09 マッサージ左上肢          PIC 9.
001094          09 マッサージ右下肢          PIC 9.
001095          09 マッサージ左下肢          PIC 9.
001096       07 変形徒手矯正術数             PIC 9.
001097       07 変形徒手矯正術施術.
001098          09 変形徒手矯正術右上肢      PIC 9.
001099          09 変形徒手矯正術左上肢      PIC 9.
001100          09 変形徒手矯正術右下肢      PIC 9.
001101          09 変形徒手矯正術左下肢      PIC 9.
001102       07 FILLER                       PIC 9.
001103       07 FILLER                       PIC 9.
001104       07 FILLER                       PIC 9.
001105*
001106*    施術報告書交付区分　0：なし　1：あり
001107     05 施術報告書交付区分             PIC 9.
002830*/20240601（1,2,3,4）
001107     05 訪問施術料区分                 PIC X.
002830*/20240601（1：あり）
001107     05 突発往療区分                   PIC X.
002830*/20240601（1：あり）
001107     05 特別地域加算区分               PIC X.
001107     05 同一建物患者数                 PIC 9(3).
      */同一日同一患者に鍼マの施術が重複している場合、訪問施術料算定不可/20240830
           05 訪問重複Ｆ                     PIC 9.
001108*----------------------------------------------*
001109     05 FILLER                         PIC X(159).
