000010*****************************************************************
000020* Ｈ往療実績Ｆ　H_nouryo.dat ［RL=256BYTE］                     *
000030*****************************************************************
000040* SYSYTEM NAME:鍼灸マッサージ                                   *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.11.13                                       *
000070* PURPOSE     :日々の往療情報を記録                             *
000080*****************************************************************
000090*
000100*     SELECT  Ｈ往療実績Ｆ    ASSIGN      TO        HNOURYOL
000110*                             ORGANIZATION             IS  INDEXED
000120*                             ACCESS MODE              IS  DYNAMIC
000130*                             RECORD KEY               IS  Ｈ往実－施術区分
000140*                                                          Ｈ往実－施術和暦年月日
000150*                                                          Ｈ往実－患者コード
000160*                             ALTERNATE RECORD KEY     IS  Ｈ往実－施術区分
000170*                                                          Ｈ往実－患者コード
000180*                                                          Ｈ往実－施術和暦年月日
000190*                             ALTERNATE RECORD KEY     IS  Ｈ往実－施術和暦年月日
000200*                                                          Ｈ往実－施術者番号
000210*                                                          Ｈ往実－登録順
000220*                             ALTERNATE RECORD KEY     IS  Ｈ往実－施術和暦年月日
000230*                                                          Ｈ往実－施術開始時間
000240*                                                          Ｈ往実－施術者番号
000250*                                                          Ｈ往実－登録順
000260*                             FILE STATUS              IS  状態キー
000270*                             LOCK        MODE         IS  AUTOMATIC.
000280***
000290* FD  Ｈ往療実績Ｆ   BLOCK   CONTAINS   1   RECORDS.
000300*     COPY H_NOURYO   OF  XFDLIB  JOINING   Ｈ往実   AS  PREFIX.
000310*
000320*****************************************************************
000330 01 レコード.
000340   03 レコードキー.
000350*-----------------------------------------------*
000360* 1:鍼灸、2:あんま・マッサージ、3:両方（労災）
000370     05 施術区分                       PIC 9.
000380*-----------------------------------------------*
000390     05 施術和暦年月日.
000400       07 施術和暦年月.
000410         09 施術和暦                   PIC 9.
000420         09 施術年月.
000430           11 施術年                   PIC 9(2).
000440           11 施術月                   PIC 9(2).
000450       07 施術日                       PIC 9(2).
000460     05 患者コード.
000470       07 患者番号                     PIC 9(6).
000480       07 枝番                         PIC X.
000490**
000500   03 レコードデータ.
000510     05 施術者番号                     PIC 9(4).
000520     05 登録順                         PIC 9(4)V9(3).
000530*
000540     05 施術内容区分                   PIC 9(2).
000550     05 施術開始時間.
000560       07 施術開始時                   PIC X(2).
000570       07 施術開始分                   PIC X(2).
000580*
000590*    / 1:自宅 2:施設 3:同上 /
000600     05 往療場所区分                   PIC 9(1).
000610     05 往療場所.
000620       07 往療場所施設コード           PIC 9(3).
000630       07 往療場所患者コード.
000640         09 往療場所患者番号           PIC 9(6).
000650         09 往療場所枝番               PIC X.
000660       07 往療緯度                     PIC 9(3)V9(7).
000670       07 往療経度                     PIC 9(3)V9(7).
000680*
000690     05 往療.
000700*      / 0:なし 1:あり /
000710       07 往療日区分                   PIC 9(1).
000720       07 往療距離                     PIC 9(2)V9.
000730*
000740     05 往療金額                       PIC 9(6).
000750     05 往療内訳.
000760       07 往療基本料金                 PIC 9(6).
000770       07 往療加算料金                 PIC 9(6).
000780*
000790     05 按分データ.
000800*      / 0:なし 1:あり /
000810       07 往療按分区分                 PIC 9.
000820       07 往療按分金額                 PIC 9(6).
000830*    / 往療金額を按分せず特定の患者につける場合、1:対象者 /
000840       07 按分なし特定区分             PIC 9(1).
000850*
000860     05 先順データ.
000870*      / 0:治療院 1:患者 2:施設 /
000880       07 先順区分                     PIC 9(1).
000890       07 先順施設コード               PIC 9(3).
000900       07 先順患者コード.
000910         09 先順患者番号               PIC 9(6).
000920         09 先順枝番                   PIC X.
000930*
000940*-----------------------------------------------*
000950*    / 治療院からの距離を優先した場合、1:優先
000960     05 治療院距離優先区分             PIC 9.
000970*-----------------------------------------------*
000980     05 往療按分内訳.
000981       07 往療按分基本料金             PIC 9(6).
000982       07 往療按分加算料金             PIC 9(6).
000983*
000985     05 施術終了時間.
000986       07 施術終了時                   PIC X(2).
000987       07 施術終了分                   PIC X(2).
000988*
000990     05 FILLER                         PIC X(135).
001000*
