000010*********************************************************************
000020* Ｈ入金情報Ｆ　Ｈ＿ＮＹＵＫＩＮ．ＤＡＴ ［ＲＬ＝３２０BYTE］       *
000030*********************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                      *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                                  *
000060* PRODUCT DATE:2001.08.02                                           *
000070* AUTHOR      :宮原  睦美                                           *
000080* PURPOSE     :保険者毎＋日毎の入金済情報・入金情報を記録           *
000090*              又、患者毎のコメント・保険者毎のコメントを記録       *
000100*                                                                   *
000110*  (管理区分コードには、入金済情報 の場合、「０」                   *
000120*                       入金明細   の場合、「１」                   *
000130*                       患者明細   の場合、「２」                   *
000140*                       保険者明細 の場合、「３」を設定)            *
000150*                                                                   *
000160*  (管理区分コード＝０ (入金済情報) の場合、                        *
000170*     レコードキーには、請求保険種別・請求保険者・請求年月 を設定 ) *
000180*                                                                   *
000190*  (管理区分コード＝１ (入金明細) の場合、                          *
000200*     レコードキーには、請求保険種別・請求保険者・請求年月          *
000210*                     ・入金年月日・入金区分コード を設定 )         *
000220*                                                                   *
000230*  (管理区分コード＝２ (患者明細) の場合、                          *
000240*     レコードキーには、請求保険種別・請求保険者・施術年月          *
000250*                     ・患者コード を設定 )                         *
000260*                                                                   *
000270*  (管理区分コード＝３ (保険者明細) の場合、                        *
000280*     レコードキーには、請求保険種別・請求保険者を設定 )            *
000290*-------------------------------------------------------------------*
000300*  (請求保険種別には、公費種別・助成種別も含む)                     *
000310*  (請求保険者には、  公費負担者・助成公費負担者・ラベル番号も含む  *
000320*     但し、管理区分コード＝２の場合、ラベル番号はなし)             *
000330*  (入金区分コードには、                                            *
000340*     合算入力・月単位入力の合計行 (保険者単位入金) の場合、「１」  *
000350*     月単位入力の月行             (請求月単位入金) の場合、「２」) *
000360*  (請求年月には、                                                  *
000370*     合算入力・月単位入力の合計行の場合、                          *
000380*                 入金入力時に存在するレセプトの最終請求年月を設定  *
000390*     月単位入力の月行の場合、対象の請求年月を設定 )                *
000400*                                                                   *
000410*********************************************************************
000420* RECORD    KEY  : 管理区分コード + 請求保険種別   + 請求保険者番号 *
000430*                + 請求和暦年月   + 入金年月日     + 入金区分コード *
000440*                + 施術和暦年月   + 患者コード                      *
000450* ALTERNATE KEY1 : 管理区分コード + 請求和暦年月                    *
000460*                + 請求保険種別   + 請求保険者番号 + 入金年月日     *
000470*                + 入金区分コード + 施術和暦年月   + 患者コード     *
000480* ALTERNATE KEY2 : 管理区分コード + 請求保険種別   + 請求保険者番号 *
000490*                + 入金年月日     + 請求和暦年月   + 入金区分コード *
000500*                + 施術和暦年月   + 患者コード                      *
000510* ALTERNATE KEY3 : 管理区分コード + 入金年月日                      *
000520*                + 請求保険種別   + 請求保険者番号 + 請求和暦年月   *
000530*                + 入金区分コード + 施術和暦年月   + 患者コード     *
000540*********************************************************************
000550 01 レコード.
000560   03 レコードキー.
000570     05 管理区分コード                 PIC 9.
000580     05 請求保険種別                   PIC 9(2).
000590     05 請求保険者番号                 PIC X(10).
000600     05 請求和暦年月.
000610       07 請求和暦                     PIC 9.
000620       07 請求年月.
000630         09 請求年                     PIC 9(2).
000640         09 請求月                     PIC 9(2).
000650     05 入金年月日.
000660       07 入金和暦                     PIC 9.
000670       07 入金年                       PIC 9(2).
000680       07 入金月                       PIC 9(2).
000690       07 入金日                       PIC 9(2).
000700     05 入金区分コード                 PIC 9.
000710     05 施術和暦年月.
000720       07 施術和暦                     PIC 9.
000730       07 施術年月.
000740         09 施術年                     PIC 9(2).
000750         09 施術月                     PIC 9(2).
000760     05 患者コード.
000770       07 患者番号                     PIC 9(6).
000780       07 枝番                         PIC X.
000790     05 施術区分                       PIC 9.
000791   03 入金明細レコードデータ.
000800     05 入金額                         PIC 9(8).
000810     05 入金済区分                     PIC 9.
000820   03 患者明細レコードデータ.
000830     05 患者明細１.
000840        07 区分コード１                PIC 9(2).
000850        07 コメント１.
000860           09 コメント１１             PIC X(40).
000870           09 コメント１２             PIC X(40).
000880        07 患者入金額                  PIC 9(8).
000890     05 患者明細２.
000900        07 区分コード２                PIC 9(2).
000910        07 コメント２.
000920           09 コメント２１             PIC X(40).
000930           09 コメント２２             PIC X(40).
000940     05 患者請求和暦年月.
000950       07 患者請求和暦                 PIC 9.
000960       07 患者請求年月.
000970         09 患者請求年                 PIC 9(2).
000980         09 患者請求月                 PIC 9(2).
000990***
001000*/ 保険者マスタ・市町村マスタ・ラベルマスタのラベル番号を設定
001010   03 ラベル番号                       PIC X(5).
001020**
001030   03 FILLER                           PIC X(90).
