000001*****************************************************************
000003* Ｈ施術所情報マスタ　H_sejoho.dat ［RL=1536BYTE］              *
000004*****************************************************************
000005* SYSYTEM NAME:鍼灸マッサージ                                   *
000006* LANGUAGE PG :NetCOBOL                                         *
000007* PRODUCT DATE:2018.11.16                                       *
000010* PURPOSE     :施術所毎に施術所情報を管理                       *
000011*****************************************************************
000012* RECORD    KEY  : 施術所番号 41:施術管理者情報用
000013*
000017* プリフィックスをＨ施情４１－にする
000019*
000029*	SELECT文変更なし、桁数変更あり
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120*****************************************************************
000130* 39
000140         05  施術所番号                PIC 9(2).
000150*****************************************************************
000160     03  レコードデータ.
000170         05 はりきゅう情報.
000171            07 登録記号番号はりきゅう     PIC X(20).
000173            07 施術管理者名はりきゅう     PIC X(50).
000175            07 FILLER                     PIC X(400).
000176         05 マッサージ情報.
000177            07 登録記号番号マッサージ     PIC X(20).
000178            07 施術管理者名マッサージ     PIC X(50).
000179            07 FILLER                     PIC X(400).
000180*
000181         05 FILLER                        PIC X(594).
