000001*****************************************************************
000003* Ｈ施術所情報マスタ　H_sejoho.dat ［RL=1536BYTE］              *
000004*****************************************************************
000005* SYSYTEM NAME:鍼灸マッサージ                                   *
000006* LANGUAGE PG :NetCOBOL                                         *
000007* PRODUCT DATE:2009.03.27                                       *
000010* PURPOSE     :施術所毎に施術所情報を管理                       *
000011*****************************************************************
000012* RECORD    KEY  : 施術所番号 39:後期高齢者登録番号用
000013*
000017* プリフィックスをＨ施情３９－にする
000019*
000029*	SELECT文変更なし、桁数変更あり
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120*****************************************************************
000130* 39
000140         05  施術所番号                PIC 9(2).
000150*****************************************************************
000160     03  レコードデータ.
000161         05  後期高齢者登録番号               PIC X(16) OCCURS 47.
000170         05  マッサージ後期高齢者登録番号     PIC X(16) OCCURS 47.
000650         05  大阪市会員番号共通               PIC X(15).
000660         05  大阪市会員番号マッサージ         PIC X(15).
