000001*****************************************************************
000002* Çgé{èpé“É}ÉXÉ^Å@H_setant.dat ÅmRL=1920BYTEÅn              *
000003*****************************************************************
000004* SYSYTEM NAME:ËIãÑÉ}ÉbÉTÅ[ÉW                                   *
000005* LANGUAGE PG :NetCOBOL                                         *
000006* PRODUCT DATE:2009.03.27                                       *
000010* PURPOSE     :é{èpé“èÓïÒÇä«óù                                 *
000011*****************************************************************
000015*
000016*     SELECT  Çgé{èpé“É}ÉXÉ^     ASSIGN      TO       HSETANTL
000017*                                ORGANIZATION             IS  INDEXED
000018*                                ACCESS MODE              IS  DYNAMIC
000019*                                RECORD KEY               IS  Çgé{é“Å|é{èpé“î‘çÜ
000020*                                ALTERNATE RECORD KEY     IS  Çgé{é“Å|ë∂ç›ãÊï™
000021*                                                             Çgé{é“Å|é{èpé“î‘çÜ
000022*                                ALTERNATE RECORD KEY     IS  Çgé{é“Å|ë∂ç›ãÊï™
000023*                                                             Çgé{é“Å|é{èpé“ÉJÉi
000024*                                                             Çgé{é“Å|é{èpé“î‘çÜ
000025*                                FILE STATUS              IS  èÛë‘ÉLÅ[
000026*                                LOCK        MODE         IS  AUTOMATIC.
000027*
000028* FD  Çgé{èpé“É}ÉXÉ^  BLOCK   CONTAINS   1   RECORDS.
000029*     COPY H_SETANT    OF  XFDLIB  JOINING   Çgé{é“   AS  PREFIX.
000030*
000031*---------------------------------------------------------------*
000035*	SELECTï∂ïœçXÇ»ÇµÅAåÖêîïœçXÇ†ÇË
000045*---------------------------------------------------------------*
000090*****************************************************************
000100 01  ÉåÉRÅ[Éh.
000110     03  ÉåÉRÅ[ÉhÉLÅ[.
000140         05  é{èpé“î‘çÜ                PIC 9(4).
000160     03  ÉåÉRÅ[ÉhÉfÅ[É^.
000161         05  ë∂ç›ãÊï™                  PIC 9.
000170         05  é{èpé“ñº                  PIC X(50).
000171         05  é{èpé“ÉJÉi                PIC X(50).
000172         05  ÉåÉxÉã                    PIC 9(2).
000181         05  é{èpé“ìoò^î‘çÜ            PIC X(16).
000182         05  îıçl                      PIC X(100).
000192*
000193         05  ã@ä÷î‘çÜä÷òA  OCCURS 15.
000195            07 ìsìπï{åßÇiÇhÇr                PIC X(2).
000198            07 ËIãÑçëï€ã@ä÷î‘çÜ              PIC X(16).
000201            07 É}ÉbÉTÅ[ÉWçëï€ã@ä÷î‘çÜ        PIC X(16).
000204            07 ËIãÑå„ä˙çÇóÓé“ìoò^î‘çÜ        PIC X(16).
000207            07 É}ÉbÉTÅ[ÉWå„ä˙çÇóÓé“ìoò^î‘çÜ  PIC X(16).
000208*
000209         05  ÇÕÇËñ∆ãñî‘çÜ              PIC X(20).
000210         05  Ç´Ç„Ç§ñ∆ãñî‘çÜ            PIC X(20).
000211         05  Ç†ÇÒÇ‹ñ∆ãñî‘çÜ            PIC X(20).
000212
000213         05  FILLER                    PIC X(647).
