000010*****************************************************************
000020* Ｈ送付先ＴＥＭＰ　H_souhut.dat ［RL=64BYTE］                  *
000030*****************************************************************
000040* SYSYTEM NAME:鍼灸マッサージ                                   *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2018.12.21                                       *
000070* PURPOSE     :送付先を施術所で登録するためのファイル           *
000080*              (Ｈ送付先Ｋマスタと比較し新しい日付を優先し、    *
000090*               送付先を決定する)                               *
000100*****************************************************************
000110* RECORD    KEY  : 保険種別 + 県ＪＩＳ + 保険者番号
000120*
000130*-------------------------*
000140*Ｈ送付先Ｋマスタと同様
000150*-------------------------*
000160*****************************************************************
000170 01  レコード.
000180     03  レコードキー.
000190         05 保険種別                    PIC 9(2).
000200         05 県ＪＩＳ                    PIC X(2).
000210*-----------------------------------------------*
000220* 県ＪＩＳで総括表を印刷する場合は空白
000230* 複数の保険者番号を一箇所に送付する場合に使用
000240         05 保険者番号.
000250           07 法別番号                  PIC X(2).
000260           07 保番.
000270             09 都道府県番号            PIC X(2).
000280             09 保険番号                PIC X(3).
000290             09 検証番号                PIC X.
000300             09 FILLER                  PIC X(2).
000310*-----------------------------------------------*
000320     03  レコードデータ.
000330*-----------------------------------------------*
000340*        0：なし　1：対象
000350         05 総括表区分                  PIC 9.
000360*-----------------------------------------------*
000370*-----------------------------------------------*
000380*        1：不要
000390         05 請求書区分                  PIC 9.
000400*-----------------------------------------------*
000410         05  送付先番号                 PIC X(5).
000420
000430         05  更新日付時間.
000440             07 更新西暦年月日.
000450                09 更新西暦年月.
000460                    11 更新西暦年       PIC 9(4).
000470                    11 更新西暦月       PIC 9(2).
000480                09 更新西暦日           PIC 9(2).
000490             07 更新時間.
000500                09 更新時               PIC 9(2).
000510                09 更新分               PIC 9(2).
000520                09 更新秒               PIC 9(4).
000530*
000540*/ ↓使用しない(2019.01.17) /*
000550*-----------------------------------------------*
000560         05 変更後送付先情報.
000570            07 変更開始和暦年月.
000580               09 変更開始和暦          PIC 9.
000590               09 変更開始年月.
000600                  11 変更開始年         PIC 9(2).
000610                  11 変更開始月         PIC 9(2).
000620*-----------------------------------------------*
000630*           0：なし　1：対象
000640            07 総括表区分後             PIC 9.
000650*-----------------------------------------------*
000660*           1：不要
000670            07 請求書区分後             PIC 9.
000680*-----------------------------------------------*
000690            07 送付先番号後             PIC X(5).
000700*/ ↑使用しない(2019.01.17) /*
000710*
000720         05  FILLER                     PIC X(15).
