000010*****************************************************************
000020* HOKENTK：保険者特別負担マスタ［ＲＬ＝256］                   *
000030*****************************************************************
000086* LANGUAGE PG :NetCOBOL                                         *
000087* PRODUCT DATE:2009.03.27                                       *
000088* PURPOSE     :保険者特別負担率を管理                           *
000089*              市町村マスタの特別負担も管理                     *
000091*---------------------------------------------------------------*
000093*	新規ファイル
000096*---------------------------------------------------------------*
000097*
000098*     SELECT  保険者特別負担マスタ   ASSIGN      TO        HOKENTKL
000099*                                    ORGANIZATION             IS  INDEXED
000100*                                    ACCESS MODE              IS  DYNAMIC
000101*                                    RECORD KEY               IS  保特－保険種別
000102*                                                                 保特－保険者番号
000103*                                                                 保特－開始和暦年月
000105*                                    FILE STATUS              IS  状態キー
000106*                                    LOCK        MODE         IS  AUTOMATIC.
000107*
000108* FD  保険者特別負担マスタ  BLOCK   CONTAINS   1   RECORDS.
000109*     COPY HOKENTK         OF  XFDLIB  JOINING   保特 AS PREFIX.
000112*
000113*****************************************************************
000114 01  レコード.
000120     03  レコードキー.
000122         05  保険種別                   PIC 9(2).
000123         05  保険者番号                 PIC X(10).
000128         05  開始和暦年月.
000129           07  開始和暦                 PIC 9.
000130           07  開始年月.
000131             09  開始年                 PIC 9(2).
000132             09  開始月                 PIC 9(2).
000133*
000150     03  レコードデータ.
000151*-----------------------------------------------------*
000160* 保険者マスタ用
000170* 特別負担率は1、通常は0
000180         05  負担率区分                 PIC 9.
000190*
000360         05  本人負担率                 PIC 9(3).
000370         05  家族負担率                 PIC 9(3).
000380         05  本人負担率乙               PIC 9(3).
000390         05  家族負担率乙               PIC 9(3).
000400*-----------------------------------------------------*
000780*
000781*-----------------------------------------------------*
000790* 市町村マスタ用
000801*************************************************
000802* 助成負担金の算出する算定方法
000803*　０：通常請求（保険者全額負担）
000804* 以下は、患者の負担する額の算定基準
000805*　１：初検料(初検料が発生する日)に対する負担率
000806*　２：初検料(初検料が発生する日)に対する一定金額
000807*　３：初検日(初検料の発生する日)の費用額の本体負担率分
000808*      に対する負担率
000809*　４：初検日(初検料の発生する日)の費用額の本体負担率分
000810*      に対する一定金額
000811*　５：毎月一定金額を負担（窓口会計では月の初回に換算？）
000812*  ６：毎月一定回数、一定金額を負担
000813      05 負担区分                      PIC 9(2).
000814*************************************************
000815* 負担率
000816      05 負担率１                      PIC 9(3).
000818      05 負担率２                      PIC 9(3).
000819* 金額負担の場合の単価
000820      05 負担一定金額                  PIC 9(5).
000823* 低所得者用の単価
000824      05 事務手数料                    PIC 9(4).
000826*
000827      05 助成負担回数                  PIC 9(2).
000837* 低所得者用の回数
000846      05 助成負担回数２                PIC 9(2).
000861*
000862* 限度額
000863      05 限度額１                      PIC 9(5).
000864      05 限度額２                      PIC 9(5).
000865      05 限度額３                      PIC 9(5).
000872*-----------------------------------------------------*
000873*
000880      05  FILLER                       PIC X(190).
000890*
