000010*****************************************************************
000020* ＨＵＧＥＩＮ２：負傷原因Ｆ２   ［ＲＬ＝６４０BYTE］           *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2010.10.18                                       *
000070* AUTHOR      :岡田  憲和                                       *
000080* PURPOSE     :負傷原因Ｆより負傷原因ＣＭ全体を再定義           *
000090*              負傷原因検索(YAW0253)で使用                      *
000100*****************************************************************
000110 01 レコード.
000120   03 レコードキー.
000130*****************************************************************
000140* 独自負傷原因コード(１０桁)の区分コード                        *
000150* 通常：０１　労災：０２　第三者行為：０３                      *
000160* 雛形用 通常：１１　労災：１２　第三者行為：１３               *
000170     05 区分コード                     PIC 9(2).
000180*****************************************************************
000190     05 負傷原因コード.
000200       07 患者番号                     PIC 9(6).
000210       07 負傷原因連番                 PIC 9(4).
000220   03 レコードデータ.
000230     05 負傷原因ＣＭ全体.
000240       07 負傷原因ＣＭ                 PIC X(60) OCCURS 5.
000241*    !!! HUGEIN.CBLからの変更部分 ↓ !!!
000250     05 負傷原因ＣＭ全体Ｒ REDEFINES 負傷原因ＣＭ全体.
000251       07 負傷原因ＣＭ１               PIC X(250).
000252       07 負傷原因ＣＭ２               PIC X(50).
000254*    !!! HUGEIN.CBLからの変更部分 ↑ !!!
000255*    1:５行自由パターン
000260     05 負傷原因入力区分               PIC 9.
000270     05 負傷種別部位全体.
000280       07 負傷種別全体.
000290         09 負傷種別                   PIC 9(2)  OCCURS 7.
000300       07 負傷部位全体.
000310         09 負傷部位                   PIC 9(2)  OCCURS 7.
000320     05 負傷和暦年月日.
000330       07 負傷和暦年月.
000340         09 負傷和暦                   PIC 9.
000350         09 負傷年月.
000360           11 負傷年                   PIC 9(2).
000370           11 負傷月                   PIC 9(2).
000380       07 負傷日                       PIC 9(2).
000390     05 負傷年齢                       PIC 9(3).
000400     05 開始施術和暦年月.
000410       07 開始施術和暦                 PIC 9.
000420       07 開始施術年月.
000430         09 開始施術年                 PIC 9(2).
000440         09 開始施術月                 PIC 9(2).
000460     05 開始枝番                       PIC X.
000470     05 更新施術和暦年月.
000480       07 更新施術和暦                 PIC 9.
000490       07 更新施術年月.
000500         09 更新施術年                 PIC 9(2).
000510         09 更新施術月                 PIC 9(2).
000520     05 更新和暦日時.
000530       07 更新和暦年月日.
000540         09 更新和暦年月.
000550           11 更新和暦                 PIC 9.
000560           11 更新年月.
000570             13 更新年                 PIC 9(2).
000580             13 更新月                 PIC 9(2).
000590         09 更新日                     PIC 9(2).
000600       07 更新時間.
000610         09 更新時                     PIC 9(2).
000620         09 更新分                     PIC 9(2).
000630         09 更新秒                     PIC 9(4).
000640     05 FILLER                         PIC X(263).
