000010*****************************************************************
000020* ＨＵＫＯＳＥＩ：負傷構成マスタ ［ＲＬ＝１２８BYTE］           *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.11.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :区分コード毎の、原因構成コメントを管理           *
000090*****************************************************************
000100 01 レコード.
000110   03 レコードキー.
000120*****************************************************************
000130* 負傷時期：０１ 負傷場所：０２ 負傷状況：０３ 負傷部位：０４   *
000140* 負傷動作：０５                                                *
000150     05 区分コード                     PIC 9(2).
000160*****************************************************************
000170     05 原因コード                     PIC 9(3).
000180   03 レコードデータ.
000190     05 負傷原因ＣＭ                   PIC X(60).
000200     05 FILLER                         PIC X(63).
