      *****************************************************************
      * ＩＤＫＡＮＲ：ＩＤ管理マスタ［ＲＬ＝１２８］                  *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.10.29                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :施術所毎に都道府県や市町村から配布される施術ＩＤ *
      *              を管理                                           *
      *****************************************************************
       01  レコード.
           03  レコードキー.
      *****************************************************************
      * 都道府県配布：０１　市町村配布：０２
               05  ＩＤ区分                  PIC 9(2).
      *****************************************************************
      * 本院は、００。支所は、０１～。
               05  施術所番号                PIC 9(2).
      *****************************************************************
               05  保険種別                  PIC 9(2).
               05  保険者番号                PIC X(10).
           03  レコードデータ.
               05  施術ＩＤ番号              PIC X(12).
               05  FILLER                    PIC X(100).
