      *****************************************************************
      * ININSHA：委任者情報マスタ［ＲＬ＝1024］                       *
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:2011.03.22                                       *
      * AUTHOR      :山田 浩之                                        *
      * PURPOSE     :委任団体、委任者名、振込先                       *
      *****************************************************************
000100 01  レコード.
000110     03  レコードキー.
               05  保険種別                  PIC 9(2).
           03  レコードデータ.
               05  委任会情報.
                 07  団体名                  PIC X(60).
                 07  団体名カナ              PIC X(60).
                 07  委任者名                PIC X(60).
                 07  委任者カナ              PIC X(60).
                 07  郵便番号.
                   09  郵便番号１            PIC X(3).
                   09  郵便番号２            PIC X(4).
                 07  住所.
                   09  住所１                PIC X(40).
                   09  住所２                PIC X(40).
                 07  電話番号１              PIC X(20).
                 07  電話番号２              PIC X(20).
               05  取引先情報.
                 07  取引先銀行名            PIC X(40).
                 07  取引先銀行支店名        PIC X(40).
                 07  預金種別                PIC 9.
                 07  銀行番号                PIC X(4).
                 07  店番号                  PIC X(3).
                 07  口座番号                PIC X(10).
                 07  口座名義人              PIC X(120).
                 07  口座名義人カナ          PIC X(120).
               05  FILLER                    PIC X(317).
