000010*****************************************************************
000020* 自賠責情報Ｆ　JIBAIJ.DAT ［ＲＬ＝1024BYTE］     *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.07.14                                       *
000083* PURPOSE     :月毎＋患者毎の自賠責情報を記録                   *
000140*****************************************************************
000150*---------------------------------------------------------------*
000160*	新規ファイル
000170*---------------------------------------------------------------*
000240**
000241*     SELECT  自賠責情報Ｆ    ASSIGN      TO        JIBAIJL
000242*                             ORGANIZATION             IS INDEXED
000243*                             ACCESS MODE              IS DYNAMIC
000244*                             RECORD KEY               IS 自賠－施術和暦年月
000245*                                                         自賠－患者コード
000277*                             ALTERNATE RECORD KEY     IS 自賠－患者コード
000278*                                                         自賠－施術和暦年月
000279*                             FILE STATUS              IS 状態キー
000280*                             LOCK        MODE         IS AUTOMATIC.
000281***
000282* FD  自賠責情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000283*     COPY JIBAIJ      OF  XFDLIB  JOINING   自賠   AS  PREFIX.
000284*
000285*****************************************************************
000286 01 レコード.
000287   03 レコードキー.
000288     05 施術和暦年月.
000289       07 施術和暦                     PIC 9.
000290       07 施術年月.
000300         09 施術年                     PIC 9(2).
000310         09 施術月                     PIC 9(2).
000320     05 患者コード.
000330       07 患者番号                     PIC 9(6).
000340       07 枝番                         PIC X.
000350   03 レコードデータ.
000493     05 保険会社番号                   PIC 9(3).
000499     05 保険会社拠点名                 PIC X(40).
000500     05 保険会社電話番号               PIC X(40).
000501     05 保険会社担当者                 PIC X(40).
000502     05 保険会社送付先郵便番号.
000503       07 保険会社送付先郵便番号１     PIC X(3).
000504       07 保険会社送付先郵便番号２     PIC X(4).
000505     05 保険会社送付先住所１           PIC X(50).
000506     05 保険会社送付先住所２           PIC X(50).
000507     05 保険会社送付先宛名             PIC X(60).
000510     05 自賠責備考                     PIC X(300).
000517***
000527*    / 0:使用なし、1:使用する
000529     05 固有単価使用区分                PIC 9.
000530     05 初検料                          PIC 9(4).
000531     05 初検加算料.
000532        07 時間外                       PIC 9(4).
000533        07 休日                         PIC 9(4).
000534        07 深夜                         PIC 9(4).
000535     05 再検料                          PIC 9(4).
000543     05 指導管理料                      PIC 9(4).
000544     05 運動療法料                      PIC 9(4).
000547     05 施術情報提供料                  PIC 9(4).
000548     05 施術証明書料                    PIC 9(4).
000549     05 施術明細書料                    PIC 9(4).
000550*
000551     05 冷罨法料                        PIC 9(4).
000552     05 冷罨法料３０                    PIC 9(4).
000553     05 温罨法料２３                    PIC 9(4).
000554     05 温罨法料２４骨折                PIC 9(4).
000555     05 温罨法料２４他                  PIC 9(4).
000556     05 温罨法料３０                    PIC 9(4).
000557*
000558     05 電療料２３                      PIC 9(4).
000559     05 電療料２４骨折                  PIC 9(4).
000560     05 電療料２４他                    PIC 9(4).
000561     05 電療料３０                      PIC 9(4).
000562*
000566     05 運動算定間隔                    PIC 9(2).
000568     05 運動上限回数                    PIC 9(1).
000570     05 指導算定間隔                    PIC 9(2).
000572     05 指導上限回数                    PIC 9(1).
000574     05 月基準区分                      PIC 9(1).
000575*
000576     05 初検時相談料                    PIC 9(4).
000578*
000581     05 部位別料金 OCCURS   7.
000582        07 整復料                       PIC 9(5).
000583        07 後療料２０                   PIC 9(4).
000584        07 後療料２３                   PIC 9(4).
000585        07 後療料２４                   PIC 9(4).
000586        07 後療料３０                   PIC 9(4).
000587        07 特別材料費                   PIC 9(4).
000588        07 交換包帯料                   PIC 9(4).
000590        07 拘縮後療料２０               PIC 9(4).
000591        07 拘縮後療料３０               PIC 9(4).
000592*
000595     05 長期逓減月数                    PIC 9(2).
000597     05 多部位逓減部位数                PIC 9.
000629**
002278     05 FILLER                          PIC X(68).
002280*
