000010*****************************************************************
000020* 受診者情報Ｆ　ＪＵＳＩＮＪ．ＤＡＴ ［ＲＬ＝1024BYTE］       *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.03.23                                       *
000070* PURPOSE     :月毎＋患者毎の保険情報を記録                     *
000080*              主として保険証情報・保険詳細情報（甲乙区分・請求 *
000090*              区分）等を管理する。                             *
000100*              又、患者毎に最新レコード（キー：施術年月ALL ZERO *
000110*              + 患者コード）を管理し、常に、最新の月情報での   *
000120*              月次更新が可能。                                 *
000130*****************************************************************
000140*---------------------------------------------------------------*
000150*	SELECT文変更なし、項目変更あり（項目をJUSINJ2へ移動）
000160*---------------------------------------------------------------*
000170**
000180*     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000190*                             ORGANIZATION             IS  INDEXED
000200*                             ACCESS MODE              IS  DYNAMIC
000210*                             RECORD KEY               IS  受－施術和暦年月
000220*                                                          受－患者コード
000230*                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000240*                                                          受－患者カナ
000250*                                                          受－患者コード
000260*                             ALTERNATE RECORD KEY     IS  受－患者コード
000270*                                                          受－施術和暦年月
000280*                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000290*                                                          受－保険種別
000300*                                                          受－保険者番号
000310*                                                          受－患者コード
000320*                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000330*                                                          受－公費種別
000340*                                                          受－費用負担者番号
000350*                                                          受－患者コード
000360*                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000370*                                                          受－助成種別
000380*                                                          受－費用負担者番号助成
000390*                                                          受－患者コード
000400*                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000410*                                                          受－施術和暦年月
000420*                                                          受－患者コード
000430*                             FILE STATUS              IS  状態キー
000440*                             LOCK        MODE         IS  AUTOMATIC.
000450***
000460* FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000470*     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
000480*
000490*****************************************************************
000500 01 レコード.
000510   03 レコードキー.
000520     05 施術和暦年月.
000530       07 施術和暦                     PIC 9.
000540       07 施術年月.
000550         09 施術年                     PIC 9(2).
000560         09 施術月                     PIC 9(2).
000570     05 患者コード.
000580       07 患者番号                     PIC 9(6).
000590       07 枝番                         PIC X.
000600   03 レコードデータ.
000610**
000620*-----------------------------------------------*
000630*使用しない（施術年月と同じ値）/
000640     05 請求年月情報.
000650        07 請求区分                    PIC 9.
000660        07 請求和暦年月.
000670           09 請求和暦                 PIC 9.
000680           09 請求年月.
000690             11 請求年                 PIC 9(2).
000700             11 請求月                 PIC 9(2).
000710*-----------------------------------------------*
000720*
000730*●追加-----------------------------------------*
000740* 1:健康保険、2:労災、3:自賠責、4:生保、5:自費、6:保険証忘れ
000750     05 保険分類                       PIC 9(2).
000760* 0:併用あり、1:併用なし(併用区分は使用なし。0固定)
000770     05 併用区分                       PIC 9.
000780     05 保険変更情報.
000790       07 変更開始日                   PIC 9(2).
000800       07 変更終了日                   PIC 9(2).
000810*      1:本体保険証、2:助成のみ
000820       07 保険変更区分                 PIC 9.
000830       07 FILLER                       PIC 9(2).
000840*-----------------------------------------------*
000850**
000860     05 患者氏名                       PIC X(50).
000870     05 患者カナ                       PIC X(50).
000880     05 患者性別                       PIC 9.
000890     05 患者生年月日.
000900       07 患者和暦                     PIC 9.
000910       07 患者年                       PIC 9(2).
000920       07 患者月                       PIC 9(2).
000930       07 患者日                       PIC 9(2).
000940     05 患者郵便番号.
000950       07 患者郵便番号１               PIC X(3).
000960       07 患者郵便番号２               PIC X(4).
000970     05 患者住所１                     PIC X(50).
000980     05 患者住所２                     PIC X(50).
000990     05 患者電話番号                   PIC X(30).
001000**
001010     05 本人家族区分                   PIC 9.
001020     05 続柄                           PIC 9(2).
001030* 1:世帯主、2:家族（退職のみ使用）
001040     05 世帯主続柄                     PIC 9.
001050*
001060* 1:７０～７４歳一般 , 2:７０～７４歳高額  6:就学前
001070     05 特別区分                       PIC 9.
001080**
001090* 助成
001100     05 助成種別                       PIC 9(2).
001110     05 費用負担者番号助成.
001120       07 法別番号助成                 PIC X(2).
001130       07 助保険助成.
001140         09 府県助成                   PIC X(2).
001150         09 助番助成                   PIC X(3).
001160         09 助ＣＤ助成                 PIC X.
001170       07 FILLER                       PIC X(2).
001180     05 受益者番号助成                 PIC X(20).
001190* 0:通常、1:免除、2:２割
001200     05 助成負担金免除                 PIC 9.
001210*●追加-----------------------------------------*
001220* 0:通常、1:鍼灸のみ償還払い、2:柔整のみ償還払い、3:両方償還払い
001230     05 助成償還払い区分               PIC 9.
001240* 0:対象、1:鍼灸のみ本体まとめ、2:柔整のみ本体まとめ、3:両方本体まとめ、4:鍼灸のみレセ印刷なし、5:柔整のみレセ印刷なし、6:両方印刷なし（0以外はレセ印刷なし）
001250     05 助成レセ印刷対象区分           PIC 9.
001260*
001270     05 資格取得年月日助成.
001280       07 資格和暦助成                 PIC 9.
001290       07 資格年助成                   PIC 9(2).
001300       07 資格月助成                   PIC 9(2).
001310       07 資格日助成                   PIC 9(2).
001320*-----------------------------------------------*
001330     05 有効年月日助成.
001340       07 有効和暦助成                 PIC 9.
001350       07 有効年助成                   PIC 9(2).
001360       07 有効月助成                   PIC 9(2).
001370       07 有効日助成                   PIC 9(2).
001380**
001390     05 公費種別                       PIC 9(2).
001400     05 費用負担者番号.
001410       07 法別番号老人                 PIC X(2).
001420       07 助保険老人.
001430         09 府県老人                   PIC X(2).
001440         09 助番老人                   PIC X(3).
001450         09 助ＣＤ老人                 PIC X.
001460       07 FILLER                       PIC X(2).
001470     05 受益者番号老人                 PIC X(20).
001480* ０：通常請求　１：免除あり
001490     05 老人負担金免除                 PIC 9.
001500     05 有効年月日老人.
001510       07 有効和暦老人                 PIC 9.
001520       07 有効年老人                   PIC 9(2).
001530       07 有効月老人                   PIC 9(2).
001540       07 有効日老人                   PIC 9(2).
001550*
001560**********************************************************
001570     05 保険種別                       PIC 9(2).
001580     05 保険者番号.
001590       07 法別番号                     PIC X(2).
001600       07 保番.
001610         09 都道府県番号               PIC X(2).
001620         09 保険番号                   PIC X(3).
001630         09 検証番号                   PIC X.
001640         09 FILLER                     PIC X(2).
001650     05 記号                           PIC X(24).
001660     05 番号                           PIC X(30).
001670     05 被保険者氏名                   PIC X(50).
001680     05 被保険者カナ                   PIC X(50).
001690     05 被保険者性別                   PIC 9.
001700     05 被保険者生年月日.
001710       07 被保険者和暦                 PIC 9.
001720       07 被保険者年                   PIC 9(2).
001730       07 被保険者月                   PIC 9(2).
001740       07 被保険者日                   PIC 9(2).
001750     05 郵便番号.
001760       07 郵便番号１                   PIC X(3).
001770       07 郵便番号２                   PIC X(4).
001780     05 住所１                         PIC X(50).
001790     05 住所２                         PIC X(50).
001800*●追加-----------------------------------------*
001810     05 被保険者住所カナ               PIC X(80).
001820*-----------------------------------------------*
001830     05 電話番号                       PIC X(30).
001840     05 資格取得年月日.
001850       07 資格和暦                     PIC 9.
001860       07 資格年                       PIC 9(2).
001870       07 資格月                       PIC 9(2).
001880       07 資格日                       PIC 9(2).
001890     05 有効年月日.
001900       07 有効和暦                     PIC 9.
001910       07 有効年                       PIC 9(2).
001920       07 有効月                       PIC 9(2).
001930       07 有効日                       PIC 9(2).
001940*
001950* 国保（国保組合）の場合　０：なし　１：甲　２：乙
001960* 社保（船員）　　の場合　０：通常　１：公傷
001970     05 甲乙区分                       PIC 9.
001980* 資格証明の対応
001990     05 資格証明区分                   PIC 9.
002000*
002010*●追加-----------------------------------------*
002020* 0:通常、1:鍼灸のみ償還払い、2:柔整のみ償還払い、3:両方償還払い
002030     05 保険証償還払い区分             PIC 9.
002040*-----------------------------------------------*
002050*
002060* 75未満の後期高齢者区分　0:なし、1:後期高齢者
002070     05 後期高齢者特別区分             PIC 9.
002080*
002090*********************************************************
002100* 最新受診者情報がある月の情報
002110* （最新レコードのみにＷＲＩＴＥ）
002120     05 最新キー情報.
002130       07 施術和暦年月Ｎ.
002140         09 施術和暦Ｎ                 PIC 9.
002150         09 施術年月Ｎ.
002160           11 施術年Ｎ                 PIC 9(2).
002170           11 施術月Ｎ                 PIC 9(2).
002180*********************************************************
002190* 患者コードを継続使用するかのフラグ　使用：０　不使用：１
002200* はりきゅうシステムで、枝番作成時に９をセット
002210     05 継続区分                       PIC 9.
002220*********************************************************
002230     05 返戻区分                       PIC 9.
002240*********************************************************
002250* ０：はりきゅうを使用しない １：はりきゅうを使用する
002260     05 はり区分                       PIC 9.
002270* ０：あんまマッサージを使用しない １：あんまマッサージを使用する
002280     05 あんま区分                     PIC 9.
002290*********************************************************
002300* ０：レセプト印刷前    １：レセプト印刷した
002310     05 レセ印刷区分                   PIC 9.
002320     05 レセ印刷区分助成               PIC 9.
002330*********************************************************
002340* カルテ裏の印刷行数(各会用)
002350     05 カルテ裏印刷行数               PIC 9(2).
002360*
002370*/老人保険の改正の対応。0101
002380     05 老人負担回数                   PIC 9(2).
002390     05 老人負担額累計                 PIC 9(5).
002400     05 老人最終負担日                 PIC 9(2).
002410     05 老人負担額端数                 PIC 9(5).
002420     05 老人負担無し                   PIC 9.
002430* カルテ裏の印刷行数(一般用)
002440     05 カルテ一般裏印刷行数           PIC 9(2).
002450*/カルテ裏印刷列数(中央用)
002460     05 カルテ裏印刷列数               PIC 9.
002470*/返戻時の請求額（山口用）
002480     05 返戻時請求額                   PIC 9(6).
002490     05 返戻時請求額助成               PIC 9(5).
002500     05 返戻時請求額助成入力済         PIC 9.
002510*/自費で入力した時用 1:学校共済（負担０円） 9:健保料金適用
002520     05 保険外区分                     PIC 9.
002530*/はりきゅうシステム用（枝番作成時に枝番SPACEのレコード側に作成した枝番をセット）
002540     05 枝番作成時枝番                 PIC X.
002550*
002560* 0：柔整通院なし 1：柔整通院あり
002570     05 柔整有区分                     PIC 9.
002580* 0：鍼灸通院なし 1：鍼灸通院あり
002590     05 鍼灸有区分                     PIC 9.
002600* 0：マッサージ通院なし 1：マッサージ通院あり
002610     05 マッサージ有区分               PIC 9.
002620*
002630* 0:対象、1:鍼灸のみ印刷なし、2:柔整のみ印刷なし、3:両方印刷なし（0以外は印刷なし）
002640     05 助成レセ会総括表印刷対象区分   PIC 9.
002650*
002660* ０：指定なし、１：日毎、２：月毎、３：不要。領収証を日毎に必要か月毎に必要か不要か。
002670     05 領収証必要区分                 PIC 9.
002680*
002690     05 助成月途中開始日               PIC 9(2).
002700*
002710* 受診者検索画面で ０：表示する、１：表示しない
002720     05 表示対象外区分                 PIC 9.
002730*
002740* 暗号化項目郡
002750     05 暗号化項目.
002760       07 暗号患者番号                 PIC X(6).
002770       07 暗号判定記号                 PIC X.
002780       07 暗号判定番号                 PIC X.
002790       07 暗号記号                     PIC X(24).
002800       07 暗号番号                     PIC X(30).
002810*/郵便・電話番号印刷区分 ０：印刷する、１：印刷しない、２：郵便番号のみ印刷、３：電話番号のみ印刷
002811     05 柔整郵便電話番号印刷           PIC 9.
002820     05 鍼灸郵便電話番号印刷           PIC 9.
002830*
002831     05 患者職業                       PIC 9(1).
002830*
002831     05 保険証枝番                     PIC X(2).
002832*
002830*/20240601
002831     05 鍼灸特別地域区分               PIC X.
002832*
002840     05 FILLER                         PIC X(127).
002850*
