000010*****************************************************************
000020* ＫＡＩＪＯＨＯ：会情報マスタ［ＲＬ＝896］                     *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.03.23                                       *
000083* PURPOSE     :会情報を管理                                     *
000090*****************************************************************
000120*
000121*---------------------------------------------------------------*
000122*	SELECT文変更あり(キー変更)、桁数変更あり
000124*---------------------------------------------------------------*
000126*
000127*     SELECT  会情報マスタ    ASSIGN      TO        KAIJOHOL
000128*                             ORGANIZATION             IS  INDEXED
000129*                             ACCESS MODE              IS  DYNAMIC
000130*                             RECORD KEY               IS  会情－柔整鍼灸区分
000131*                                                          会情－協会コード
000132*                                                          会情－保険種別
000133*                                                          会情－変更和暦年月
000134*                             ALTERNATE RECORD KEY     IS  会情－柔整鍼灸区分
000135*                                                          会情－接骨師会カナ
000136*                                                          会情－協会コード
000137*                                                          会情－保険種別
000138*                                                          会情－変更和暦年月
000139*                             FILE STATUS              IS  状態キー
000140*                             LOCK        MODE         IS  AUTOMATIC.
000141***
000142* FD  会情報マスタ        BLOCK   CONTAINS   1   RECORDS.
000143*     COPY KAIJOHO         OF  XFDLIB  JOINING   会情   AS  PREFIX.
000144*
000145*****************************************************************
000146 01  レコード.
000150     03  レコードキー.
000152*●追加-------------------------------------------*
000153*        / 0柔整、1鍼灸マッサージ /
000154         05  柔整鍼灸区分              PIC 9.
000155*-------------------------------------------------*
000160         05  協会コード                PIC 9(3).
000170         05  保険種別                  PIC 9(2).
000182         05  変更和暦年月.
000183           07  変更和暦                PIC 9.
000184           07  変更年月.
000185             09  変更年                PIC 9(2).
000186             09  変更月                PIC 9(2).
000200     03  レコードデータ.
000210         05  会情報.
000220           07  接骨師会名              PIC X(50).
000230           07  接骨師会カナ            PIC X(50).
000240           07  接骨師会会長名          PIC X(50).
000250           07  接骨師会会長カナ        PIC X(50).
000260           07  会郵便番号.
000270             09  会郵便番号１          PIC X(3).
000280             09  会郵便番号２          PIC X(4).
000290           07  会住所.
000300             09  会住所１              PIC X(50).
000310             09  会住所２              PIC X(50).
000311           07  会住所カナ              PIC X(100).
000312           07  会電話番号              PIC X(40).
000320           07  会電話番号２            PIC X(40).
000348         05  取引先情報.
000350           07  取引先銀行名            PIC X(40).
000360           07  取引先銀行支店名        PIC X(40).
000370           07  預金種別                PIC 9.
000380           07  銀行番号                PIC X(4).
000390           07  店番号                  PIC X(3).
000400           07  口座番号                PIC X(10).
000410           07  口座名義人              PIC X(100).
000420           07  口座名義人カナ          PIC X(100).
000430         05  FILLER                    PIC X(100).
