000010*****************************************************************
000020* ‰ïŒvƒf[ƒ^‚e@KAIKEI.DAT m‚q‚k‚T‚P‚QBYTEn                 *
000030*****************************************************************
000040* SYSYTEM NAME:_ FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2010.03.05                                       *
000070* AUTHOR      :ŽR“c _”V                                        *
000080* PURPOSE     :“ú–ˆ{Š³ŽÒ–ˆ‚ÌƒŒƒZƒvƒg“à—e‚ð‹L˜^                 *
000090*****************************************************************
000100*---------------------------------------------------------------*
000110*	SELECT•¶•ÏX‚ ‚èA€–Ú•ÏX‚ ‚è
000120*---------------------------------------------------------------*
000130*     SELECT  ‰ïŒvƒf[ƒ^‚e    ASSIGN      TO        KAIKEIL
000140*                             ORGANIZATION             IS  INDEXED
000150*                             ACCESS MODE              IS  DYNAMIC
000160*                             RECORD KEY               IS  ‰ï|Ž{p˜a—ï”NŒŽ“ú
000170*                                                          ‰ï|Š³ŽÒƒR[ƒh
000180*                             ALTERNATE RECORD KEY     IS  ‰ï|Š³ŽÒƒR[ƒh
000190*                                                          ‰ï|Ž{p˜a—ï”NŒŽ“ú
000200*                             FILE STATUS              IS  ó‘ÔƒL[
000210*                             LOCK        MODE         IS  AUTOMATIC.
000220*
000230* FD  ‰ïŒvƒf[ƒ^‚e        BLOCK   CONTAINS   1   RECORDS.
000240*     COPY KAIKEI     OF  XFDLIB  JOINING   ‰ï   AS  PREFIX.
000250*
000260*****************************************************************
000270 01 ƒŒƒR[ƒh.
000280   03 ƒŒƒR[ƒhƒL[.
000290     05 Ž{p˜a—ï”NŒŽ“ú.
000300       07 Ž{p˜a—ï”NŒŽ.
000310         09 Ž{p˜a—ï                   PIC 9.
000320         09 Ž{p”NŒŽ.
000330           11 Ž{p”N                   PIC 9(2).
000340           11 Ž{pŒŽ                   PIC 9(2).
000350       07 Ž{p“ú                       PIC 9(2).
000360     05 Š³ŽÒƒR[ƒh.
000370       07 Š³ŽÒ”Ô†                     PIC 9(6).
000380       07 Ž}”Ô                         PIC X.
000390   03 ƒŒƒR[ƒhƒf[ƒ^.
000400     05 ‡Œv—“.
000410       07 ”ï—pŠz                       PIC 9(6).
000420       07 “ü‹àŠz                       PIC 9(6).
000430       07 ˆê•”•‰’S‹à                   PIC 9(6).
000440       07 Ž©”ïŠz                       PIC 9(6).
000450       07 •¬ŒvŽZ•‰’SŠz               PIC 9(6).
000460       07 —áŠOƒŒƒZ—p‹àŠz—“.
000470         09 —áŠOˆê•”•‰’S‹à             PIC 9(6).
000480         09 —áŠO•¬ŒvŽZ•‰’SŠz         PIC 9(6).
000490*
000500     05 —¿‹à‚P.
000510        07 ‰ŒŸ—¿                      PIC 9(5).
000520        07 ‰ŒŸ‰ÁŽZ—¿                  PIC 9(5).
000530        07 ‰ŒŸ‰ÁŽZ.
000540          09 ŽžŠÔŠO                    PIC 9.
000550          09 ‹x“ú                      PIC 9.
000560          09 [–é                      PIC 9.
000570        07 ‰ŒŸŽž‘Š’k—¿                PIC 9(4).
000580        07 ÄŒŸ—¿                      PIC 9(5).
000590        07 ‰—Ã.
000600          09 ‰—Ã‹——£                  PIC 9(2)V9.
000610          09 ‰—Ã‰ñ”                  PIC 9(2).
000620          09 ‰—Ã—¿                    PIC 9(6).
000630          09 ‰—Ã‰ÁŽZ—¿                PIC 9(5).
000640          09 –éŠÔ                      PIC 9.
000650          09 –\•—‰Já                  PIC 9.
000660          09 “ï˜H                      PIC 9.
000670        07 ‹à‘®•›Žq.
000680          09 ‘å                        PIC 9.
000690          09 ’†                        PIC 9.
000700          09 ¬                        PIC 9.
000710        07 ‹à‘®•›Žq‰ÁŽZ—¿              PIC 9(5).
000720        07 Ž{pî•ñ’ñ‹Ÿ—¿              PIC 9(5).
000730        07 ¬Œv                        PIC 9(6).
000740        07 ‰‰ñˆ’u—¿                  PIC 9(5) OCCURS 7.
000750        07 ‰‰ñˆ’u—¿‡Œv              PIC 9(6).
000760*
000770     05 •”ˆÊ‚P.
000780        07 Œã—Ã‚P.
000790           09 Œã—Ã—¿‚P                 PIC 9(5).
000800        07 —âãª–@‚P.
000810           09 —âãª–@—¿‚P               PIC 9(4).
000820        07 ‰·ãª–@‚P.
000830           09 ‰·ãª–@—¿‚P               PIC 9(4).
000840        07 “d—Ã‚P.
000850           09 “d—Ã—¿‚P                 PIC 9(4).
000860     05 •”ˆÊ‚Q.
000870        07 Œã—Ã‚Q.
000880           09 Œã—Ã—¿‚Q                 PIC 9(5).
000890        07 —âãª–@‚Q.
000900           09 —âãª–@—¿‚Q               PIC 9(4).
000910        07 ‰·ãª–@‚Q.
000920           09 ‰·ãª–@—¿‚Q               PIC 9(4).
000930        07 “d—Ã‚Q.
000940           09 “d—Ã—¿‚Q                 PIC 9(4).
000950     05 •”ˆÊ‚R‚W.
000960        07 Œã—Ã‚R‚W.
000970           09 Œã—Ã—¿‚R‚W               PIC 9(5).
000980        07 —âãª–@‚R‚W.
000990           09 —âãª–@—¿‚R‚W             PIC 9(4).
001000        07 ‰·ãª–@‚R‚W.
001010           09 ‰·ãª–@—¿‚R‚W             PIC 9(4).
001020        07 “d—Ã‚R‚W.
001030           09 “d—Ã—¿‚R‚W               PIC 9(4).
001040     05 •”ˆÊ‚R‚O.
001050        07 Œã—Ã‚R‚O.
001060           09 Œã—Ã—¿‚R‚O               PIC 9(5).
001070        07 —âãª–@‚R‚O.
001080           09 —âãª–@—¿‚R‚O             PIC 9(4).
001090        07 ‰·ãª–@‚R‚O.
001100           09 ‰·ãª–@—¿‚R‚O             PIC 9(4).
001110        07 “d—Ã‚R‚O.
001120           09 “d—Ã—¿‚R‚O               PIC 9(4).
001130     05 •”ˆÊ‚S‚T.
001140        07 Œã—Ã‚S‚T.
001150           09 Œã—Ã—¿‚S‚T               PIC 9(5).
001160        07 —âãª–@‚S‚T.
001170           09 —âãª–@—¿‚S‚T             PIC 9(4).
001180        07 ‰·ãª–@‚S‚T.
001190           09 ‰·ãª–@—¿‚S‚T             PIC 9(4).
001200        07 “d—Ã‚S‚T.
001210           09 “d—Ã—¿‚S‚T               PIC 9(4).
001220     05 •”ˆÊ‚S‚W.
001230        07 Œã—Ã‚S‚W.
001240           09 Œã—Ã—¿‚S‚W               PIC 9(5).
001250        07 —âãª–@‚S‚W.
001260           09 —âãª–@—¿‚S‚W             PIC 9(4).
001270        07 ‰·ãª–@‚S‚W.
001280           09 ‰·ãª–@—¿‚S‚W             PIC 9(4).
001290        07 “d—Ã‚S‚W.
001300           09 “d—Ã—¿‚S‚W               PIC 9(4).
001310     05 •”ˆÊ‚S‚O.
001320        07 Œã—Ã‚S‚O.
001330           09 Œã—Ã—¿‚S‚O               PIC 9(5).
001340        07 —âãª–@‚S‚O.
001350           09 —âãª–@—¿‚S‚O             PIC 9(4).
001360        07 ‰·ãª–@‚S‚O.
001370           09 ‰·ãª–@—¿‚S‚O             PIC 9(4).
001380        07 “d—Ã‚S‚O.
001390           09 “d—Ã—¿‚S‚O               PIC 9(4).
001400     05 •”ˆÊ‚T‚Q.
001410        07 Œã—Ã‚T‚Q.
001420           09 Œã—Ã—¿‚T‚Q               PIC 9(5).
001430        07 —âãª–@‚T‚Q.
001440           09 —âãª–@—¿‚T‚Q             PIC 9(4).
001450        07 ‰·ãª–@‚T‚Q.
001460           09 ‰·ãª–@—¿‚T‚Q             PIC 9(4).
001470        07 “d—Ã‚T‚Q.
001480           09 “d—Ã—¿‚T‚Q               PIC 9(4).
001490     05 •”ˆÊ‚T‚T.
001500        07 Œã—Ã‚T‚T.
001510           09 Œã—Ã—¿‚T‚T               PIC 9(5).
001520        07 —âãª–@‚T‚T.
001530           09 —âãª–@—¿‚T‚T             PIC 9(4).
001540        07 ‰·ãª–@‚T‚T.
001550           09 ‰·ãª–@—¿‚T‚T             PIC 9(4).
001560        07 “d—Ã‚T‚T.
001570           09 “d—Ã—¿‚T‚T               PIC 9(4).
001580     05 •”ˆÊ‚T‚W.
001590        07 Œã—Ã‚T‚W.
001600           09 Œã—Ã—¿‚T‚W               PIC 9(5).
001610        07 —âãª–@‚T‚W.
001620           09 —âãª–@—¿‚T‚W             PIC 9(4).
001630        07 ‰·ãª–@‚T‚W.
001640           09 ‰·ãª–@—¿‚T‚W             PIC 9(4).
001650        07 “d—Ã‚T‚W.
001660           09 “d—Ã—¿‚T‚W               PIC 9(4).
001670     05 •”ˆÊ‚T‚O.
001680        07 Œã—Ã‚T‚O.
001690           09 Œã—Ã—¿‚T‚O               PIC 9(5).
001700        07 —âãª–@‚T‚O.
001710           09 —âãª–@—¿‚T‚O             PIC 9(4).
001720        07 ‰·ãª–@‚T‚O.
001730           09 ‰·ãª–@—¿‚T‚O             PIC 9(4).
001740        07 “d—Ã‚T‚O.
001750           09 “d—Ã—¿‚T‚O               PIC 9(4).
001790*
      */‚U•”ˆÊ–Ú
001580     05 •”ˆÊ‚U‚W.
001590        07 Œã—Ã‚U‚W.
001600           09 Œã—Ã—¿‚U‚W               PIC 9(5).
001610        07 —âãª–@‚U‚W.
001620           09 —âãª–@—¿‚U‚W             PIC 9(4).
001630        07 ‰·ãª–@‚U‚W.
001640           09 ‰·ãª–@—¿‚U‚W             PIC 9(4).
001650        07 “d—Ã‚U‚W.
001660           09 “d—Ã—¿‚U‚W               PIC 9(4).
001670     05 •”ˆÊ‚U‚O.
001680        07 Œã—Ã‚U‚O.
001690           09 Œã—Ã—¿‚U‚O               PIC 9(5).
001700        07 —âãª–@‚U‚O.
001710           09 —âãª–@—¿‚U‚O             PIC 9(4).
001720        07 ‰·ãª–@‚U‚O.
001730           09 ‰·ãª–@—¿‚U‚O             PIC 9(4).
001740        07 “d—Ã‚U‚O.
001750           09 “d—Ã—¿‚U‚O               PIC 9(4).
      */‚V•”ˆÊ–Ú
001580     05 •”ˆÊ‚V‚W.
001590        07 Œã—Ã‚V‚W.
001600           09 Œã—Ã—¿‚V‚W               PIC 9(5).
001610        07 —âãª–@‚V‚W.
001620           09 —âãª–@—¿‚V‚W             PIC 9(4).
001630        07 ‰·ãª–@‚V‚W.
001640           09 ‰·ãª–@—¿‚V‚W             PIC 9(4).
001650        07 “d—Ã‚V‚W.
001660           09 “d—Ã—¿‚V‚W               PIC 9(4).
001670     05 •”ˆÊ‚V‚O.
001680        07 Œã—Ã‚V‚O.
001690           09 Œã—Ã—¿‚V‚O               PIC 9(5).
001700        07 —âãª–@‚V‚O.
001710           09 —âãª–@—¿‚V‚O             PIC 9(4).
001720        07 ‰·ãª–@‚V‚O.
001730           09 ‰·ãª–@—¿‚V‚O             PIC 9(4).
001740        07 “d—Ã‚V‚O.
001750           09 “d—Ã—¿‚V‚O               PIC 9(4).
001791*     05 FILLER                         PIC X(168).
      */•¬Žž‚Ì–{‘Ì•ª‚Ì‘‹Œû‹à
           05 –{‘Ìˆê•”•‰’S‹à                 PIC 9(6).
      */’S“–Ž{pŽÒƒR[ƒh  /140717
           05 Ž{pŽÒ”Ô†                     PIC 9(3).
      */‰^“®Œã—Ã—¿/20180507
           05 ‰^“®Œã—Ã—¿                     PIC 9(4).
      */20220420
           05 –¾×‘”­s‰ÁŽZ—¿               PIC 9(4).
001791     05 FILLER                         PIC X(83).
001800*
