000010*****************************************************************
000020* ＫＩＮＳＥＴＵ　近接部位マスタ［ＲＬ＝1560]                   *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2000.10.11                                       *
000070* AUTHOR      :佐野  誠                                         *
000080* PURPOSE     :部位コード毎の組み合わせによる                   *
000090*              近接部位の相関関係を管理                         *
000100*****************************************************************
000110*****************************************************************
000140* 判定  組み合わせ禁止      ：１                                *
000150*   　  避けたほうがよいもの：２                                *
000151*   　  ３つの組み合わせ　　：３  特殊対部位コードの入力        *
000170*****************************************************************
000180*
000190 01  レコード.
000200   03  レコードキー.
000210     05  区分コード                 PIC 9(2).
000242     05  部位コード.
000243       07  負傷種別                 PIC 9(2).
000244       07  部位                     PIC 9(2).
000245       07  左右区分                 PIC 9.
000246       07  負傷位置番号             PIC 9(2).
000251   03  レコードデータ.
000260     05  近接データ   OCCURS 100.
000261       07  判定                     PIC 9.
000270       07  対部位コード.
000271         09  対負傷種別             PIC 9(2).
000272         09  対部位                 PIC 9(2).
000273         09  対左右区分             PIC 9.
000274         09  対負傷位置番号         PIC 9(2).
000276       07  特殊対部位コード.
000277         09  特殊対負傷種別         PIC 9(2).
000278         09  特殊対部位             PIC 9(2).
000279         09  特殊対左右区分         PIC 9.
000280         09  特殊対負傷位置番号     PIC 9(2).
000310     05  FILLER                     PIC X(51).
