      *****************************************************************
      * ＫＯＫＹＡＫＵ：顧客管理Ｆ［ＲＬ＝６４］
      *****************************************************************
      * SYSYTEM NAME:柔＋ FOR WINNDOWS                                *
      * LANGUAGE PG :NetCOBOL FOR WINDOWS                             *
      * PRODUCT DATE:2014.12.22                                       *
      * AUTHOR      :池田　幸子                                       *
      * PURPOSE     :顧客管理番号と使用期限・停止日ファイル           *
      *              区分　0:柔 1:快癒                                *
      *****************************************************************
       01 レコード.
000140    03 レコードキー.
000150       05 区分                         PIC 9(2).
000160    03 レコードデータ.
             05 顧客番号                     PIC 9(5).
      */使用期限
000180       05 期限年月日.
000190          07 期限年月.
000200             09 期限年                 PIC 9(4).
000210             09 期限月                 PIC 9(2).
000220          07 期限日                    PIC 9(2).
      */期限お知らせメッセージを出す
             05 警告月前                     PIC 9(2).
      */期限お知らせした日
000230       05 警告年月日.
000240          07 警告年月.
000250             09 警告年                 PIC 9(4).
000260             09 警告月                 PIC 9(2).
000270          07 警告日                    PIC 9(2).
      */契約満了年月日
000230       05 契約年月日.
000240          07 契約年月.
000250             09 契約年                 PIC 9(4).
000260             09 契約月                 PIC 9(2).
000270          07 契約日                    PIC 9(2).
      */0:使用可 1:未収金 2:期限切れ
             05 使用状態                     PIC 9(1).
             05 使用期限使用フラグ           PIC 9(1).
             05 オンラインＤＬ               PIC 9(1).
000230       05 最終起動年月日.
000240          07 最終起動年月.
000250             09 最終起動年             PIC 9(4).
000260             09 最終起動月             PIC 9(2).
000270          07 最終起動日                PIC 9(2).
             05 FILLER                       PIC X(20).
