000010*****************************************************************
000020* MASRIREK：マスタ更新履歴Ｆ  ［ＲＬ＝２５６]
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2006.08.31                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :マスタ更新の履歴ファイル　　  　　　　　         *
000100*****************************************************************
000110 01 レコード.
000120   03 レコードキー.
000121      05 定期修正番号                  PIC 9(8).
000122      05 連番                          PIC 9(2).
000240   03 レコードデータ.
000241      05 実行日時.
000242        07 実行年月日.
000243          09 実行年                    PIC 9(4).
000244          09 実行月                    PIC 9(2).
000245          09 実行日                    PIC 9(2).
000246        07 実行時間.
000247          09 実行時                    PIC 9(2).
000248          09 実行分                    PIC 9(2).
000249          09 実行秒                    PIC 9(4).
000250      05 内容区分                      PIC 9(2).
000270      05 内容                          PIC X(100).
000300      05 FILLER                        PIC X(128).
