000010*****************************************************************
000020* ＭＥＭＯ：メモファイル ［ＲＬ＝1024 BYTE］                    *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2001.03.15                                       *
000070* AUTHOR      :山田浩之                                         *
000080* PURPOSE     :区分１：メモ                                     *
000090*****************************************************************
000091*---------------------------------------------------------------*
000092*	SELECT文変更なし、項目変更あり
000093*---------------------------------------------------------------*
000094*     SELECT  メモファイル    ASSIGN      TO        MEMOL
000095*                             ORGANIZATION             IS  INDEXED
000096*                             ACCESS MODE              IS  DYNAMIC
000097*                             RECORD KEY               IS  メモ－制御区分
000098*                                                          メモ－患者コード
000099*                                                          メモ－施術和暦年月日
000100*                             ALTERNATE RECORD KEY     IS  メモ－制御区分
000101*                                                          メモ－施術和暦年月日
000102*                                                          メモ－患者コード
000103*                             ALTERNATE RECORD KEY     IS  メモ－患者コード
000104*                                                          メモ－施術和暦年月日
000105*                                                          メモ－制御区分
000106*                             FILE STATUS              IS  状態キー
000107*                             LOCK        MODE         IS  AUTOMATIC.
000108*
000109* FD  メモファイル        BLOCK CONTAINS 1     RECORDS.
000110*     COPY MEMO           OF    XFDLIB JOINING メモ AS PREFIX.
000111*
000112*****************************************************************
000115 01 レコード.
000116   03 レコードキー.
      */1:柔メモ 2:自賠責負傷の経過 3:労災の負傷経過 4:自賠責明細その他
      */11:鍼灸メモ 12:マッサージメモ
000120     05 制御区分                       PIC 9(2).
000130     05 患者コード.
000140       07 患者番号                     PIC 9(6).
000150       07 枝番                         PIC X.
000160     05 施術和暦年月日.
000170       07 施術和暦年月.
000180         09 施術和暦                   PIC 9.
000190         09 施術年月.
000200           11 施術年                   PIC 9(2).
000210           11 施術月                   PIC 9(2).
000220       07 施術日                       PIC 9(2).
000230   03 レコードデータ.
000240     05 コメント                       PIC X(600).
000241     05 添付ファイル名                 PIC X(150).
000250     05 施術コメント                   PIC X(200).
000260     05 FILLER                         PIC X(58).
