      *****************************************************************
      * Œ»Ý“o˜^”Ô†‚e@‚m‚d‚v‚b‚m‚sD‚c‚`‚s m‚q‚k‚P‚Q‚WBYTEn     *
      *****************************************************************
      * SYSYTEM NAME:_ FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.11.15                                       *
      * AUTHOR      :ã“c  ˆç³                                       *
      * PURPOSE     :ŽófŽÒ“o˜^‚Å‚ÌV‹K“o˜^‚Ì”Ô†‚ðŠÇ—‚·‚é           *
      *****************************************************************
       01  ƒŒƒR[ƒh.
           03  Œ»Ý”Ô†                  PIC 9(6).
           03  FILLER                    PIC X(122).
