000010*****************************************************************
000020* ƒŒƒZƒvƒg˜JÐŽ©”…Ó‚e@ RECERJ.DAT m‚q‚k3840n              *
000030*****************************************************************
000040* SYSYTEM NAME:_ FOR WINNDOWS                                  *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2011.09.09                                       *
000070* PURPOSE     :ŒŽ–ˆ{Š³ŽÒ{Ží•Ê–ˆ‚ÌƒŒƒZƒvƒg“à—e‚ð‹L˜^           *
000080*
000090*---------------------------------------------------------------*
000100*	SELECT•¶•ÏX‚ ‚èA€–Ú•ÏX‚ ‚è
000110*---------------------------------------------------------------*
000120*
000201*     SELECT  ƒŒƒZƒvƒg˜JŽ©‚e  ASSIGN      TO        RECERJL
000202*                             ORGANIZATION             IS  INDEXED
000203*                             ACCESS MODE              IS  DYNAMIC
000204*                             RECORD KEY               IS  ƒŒƒZ˜JŽ©|Ž{p˜a—ï”NŒŽ
000205*                                                          ƒŒƒZ˜JŽ©|Š³ŽÒƒR[ƒh
000206*                                                          ƒŒƒZ˜JŽ©|ƒŒƒZŽí•Ê
000210*                             FILE STATUS              IS  ó‘ÔƒL[
000211*                             LOCK        MODE         IS  AUTOMATIC.
000212*
000213* FD  ƒŒƒZƒvƒg˜JŽ©‚e      BLOCK   CONTAINS   1   RECORDS.
000214*     COPY RECERJ          OF  XFDLIB  JOINING   ƒŒƒZ˜JŽ© AS  PREFIX.
000220*
000221*****************************************************************
000230 01 ƒŒƒR[ƒh.
000240   03 ƒŒƒR[ƒhƒL[.
000250     05 Ž{p˜a—ï”NŒŽ.
000260       07 Ž{p˜a—ï                     PIC 9.
000270       07 Ž{p”NŒŽ.
000280         09 Ž{p”N                     PIC 9(2).
000290         09 Ž{pŒŽ                     PIC 9(2).
000300     05 Š³ŽÒƒR[ƒh.
000310       07 Š³ŽÒ”Ô†                     PIC 9(6).
000320       07 Ž}”Ô                         PIC X.
000330*   / 1:ˆê”Ê,2:˜Vl,3:•¬,4:˜JÐ,5:Ž©”…Ó,6:Ž©”ï,7:¶•Û’P“Æ,8•ÛŒ¯Ø–Y‚ê /
000340     05 ƒŒƒZŽí•Ê                       PIC 9(2).
000350*
000360   03 ƒŒƒR[ƒhƒf[ƒ^.
000370*
000380     05 —¿‹à‚P.
000390        07 ‰ŒŸ.
000400           09 •‰’S—¦                       PIC 9(3).
000410           09 ‰ŒŸ—¿                       PIC 9(5).
000420           09 ‰ŒŸ‰ñ”                     PIC 9.
000430           09 ‰ŒŸ’P‰¿                     PIC 9(5).
000440           09 ‰ŒŸ‰ÁŽZ.
000450              11 ‰ŒŸŽžŠÔŠO                PIC 9.
000460              11 ‰ŒŸ‹x“ú                  PIC 9.
000470              11 ‰ŒŸ[–é                  PIC 9.
000480           09 ‰ŒŸ‰ÁŽZ—¿                   PIC 9(5).
000490        07 ‰ŒŸŽž‘Š’k—¿                    PIC 9(4).
000500        07 ÄŒŸ.
000510           09 ÄŒŸ—¿                       PIC 9(5).
000520           09 ÄŒŸ‰ñ”                     PIC 9.
000530           09 ÄŒŸ’P‰¿                     PIC 9(5).
000540        07 ‰—Ã.
000550           09 ‰—Ã‹——£                     PIC 9(2)V9.
000560           09 ‰—Ã‰ñ”                     PIC 9(2).
000570           09 ‰—Ã’P‰¿                     PIC 9(5).
000580           09 ‰—Ã—¿                       PIC 9(6).
000590           09 ‰—Ã‰ÁŽZ—¿                   PIC 9(5).
000600           09 ‰—Ã‰ÁŽZ.
000610              11 ‰—Ã–éŠÔ                  PIC 9.
000620              11 ‰—Ã“ï˜H                  PIC 9.
000630              11 ‰—Ã–\•—‰J                PIC 9.
000640              11 ‰—ÃŽžŠÔŠO                PIC 9.
000650        07 ‹à‘®•›Žq‰ÁŽZ—¿                  PIC 9(5).
000660        07 ‹à‘®•›Žq”.
000670           09 ‘å                           PIC 9.
000680           09 ’†                           PIC 9.
000690           09 ¬                           PIC 9.
000700        07 î•ñ’ñ‹Ÿ.
000710           09 î•ñ’ñ‹Ÿ‰ñ”                 PIC 9(2).
000720           09 î•ñ’ñ‹Ÿ’P‰¿                 PIC 9(4).
000730           09 Ž{pî•ñ’ñ‹Ÿ—¿               PIC 9(5).
000740        07 ¬Œv                            PIC 9(7).
000750        07 ”ï—pŠz                          PIC 9(6).
000760        07 ˆê•”•‰’S‹à                      PIC 9(6).
000770        07 ¿‹Šz                          PIC 9(6).
000780        07 ‹‹•tŠ„‡                        PIC 9(3).
000790        07 Žó‹‹ŽÒ•‰’SŠz                    PIC 9(6).
000800        07 •¬¿‹‹àŠz                    PIC 9(6).
000810        07 Žw“±ŠÇ—.
000820           09 Žw“±ŠÇ—‰ñ”                 PIC 9.
000830           09 Žw“±ŠÇ—’P‰¿                 PIC 9(4).
000840           09 Žw“±ŠÇ——¿                   PIC 9(4).
000850        07 ‰^“®—Ã–@.
000860           09 ‰^“®—Ã–@‰ñ”                 PIC 9.
000870           09 ‰^“®—Ã–@’P‰¿                 PIC 9(4).
000880           09 ‰^“®—Ã–@—¿                   PIC 9(4).
000890        07 ‹x‹Æ•âžØ–¾‘.
000900           09 ‹x‹Æ•âžØ–¾‰ñ”             PIC 9(2).
000910           09 ‹x‹Æ•âžØ–¾’P‰¿             PIC 9(4).
000920           09 ‹x‹Æ•âžØ–¾‘—¿             PIC 9(5).
000930        07 h”‘.
000940           09 h”‘‰ñ”                     PIC 9(2).
000950           09 h”‘’P‰¿                     PIC 9(4).
000960           09 h”‘—¿                       PIC 9(5).
000970        07 HŽ–.
000980           09 HŽ–‰ñ”                     PIC 9(2).
000990           09 HŽ–’P‰¿                     PIC 9(4).
001000           09 HŽ–—¿                       PIC 9(5).
001010*/Ž©”…Ó•ÛŒ¯‚Ì‚Ý
001020        07 Ž{pØ–¾‘.
001030           09 Ž{pØ–¾‰ñ”                 PIC 9(2).
001040           09 Ž{pØ–¾’P‰¿                 PIC 9(4).
001050           09 Ž{pØ–¾‘—¿                 PIC 9(5).
001060        07 Ž{p–¾×‘.
001070           09 Ž{p–¾×‰ñ”                 PIC 9(2).
001080           09 Ž{p–¾×’P‰¿                 PIC 9(4).
001090           09 Ž{p–¾×‘—¿                 PIC 9(5).
001100        07 Ž©”…Ó‚»‚Ì‘¼‹àŠz                PIC 9(6).
001110        07 Žó‹‹ŽÒ•‰’SŠz“à–ó   OCCURS  10.
001120           09 “–“ú•ª•‰’SŠz                 PIC 9(4).
001130     05 —¿‹à‚Q.
001140        07 ‰‰ñˆ’u    OCCURS   7.
001150           09 ‰‰ñˆ’u—¿                   PIC 9(5).
001160        07 ‰‰ñˆ’u—¿Œv                    PIC 9(6).
001170        07 Þ—¿”ï                          PIC 9(5) OCCURS 7.
001180        07 •ï‘ÑŒðŠ·“ú OCCURS 7.
001190           09 •ï‘ÑŒðŠ·“ú‚P                 PIC 9(2).
001200           09 •ï‘ÑŒðŠ·“ú‚Q                 PIC 9(2).
001210           09 •ï‘ÑŒðŠ·“ú‚R                 PIC 9(2).
001220           09 •ï‘ÑŒðŠ·“ú‚S                 PIC 9(2).
001230           09 •ï‘ÑŒðŠ·“ú‚T                 PIC 9(2).
001240           09 •ï‘ÑŒðŠ·“ú‚U                 PIC 9(2).
001250        07 •ï‘ÑŒðŠ·—¿                      PIC 9(5) OCCURS 7.
001260        07 •ï‘ÑŒðŠ·’P‰¿                    PIC 9(4) OCCURS 7.
001270        07 •ï‘ÑŒðŠ·‰ñ”                    PIC 9    OCCURS 7.
001280     05 —¿‹à‚R.
001290        07 •”ˆÊ‚P.
001300           09 Œã—Ã‚P.
001310              11 Œã—Ã’P‰¿‚P                PIC 9(4).
001320              11 Œã—Ã‰ñ”‚P                PIC 9(2).
001330              11 Œã—Ã—¿‚P                  PIC 9(5).
001340           09 —âãª–@‚P.
001350              11 —âãª–@’P‰¿‚P              PIC 9(4).
001360              11 —âãª–@‰ñ”‚P              PIC 9(2).
001370              11 —âãª–@—¿‚P                PIC 9(4).
001380           09 ‰·ãª–@‚P.
001390              11 ‰·ãª–@’P‰¿‚P              PIC 9(4).
001400              11 ‰·ãª–@‰ñ”‚P              PIC 9(2).
001410              11 ‰·ãª–@—¿‚P                PIC 9(4).
001420           09 “d—Ã‚P.
001430              11 “d—Ã’P‰¿‚P                PIC 9(4).
001440              11 “d—Ã‰ñ”‚P                PIC 9(2).
001450              11 “d—Ã—¿‚P                  PIC 9(5).
001460           09 ¬Œv‚P                       PIC 9(6).
001470           09 ’·Šú’üŒ¸—¦‚P                 PIC 9(3).
001480           09 ’·Šúž¬Œv‚P                 PIC 9(6).
001490        07 •”ˆÊ‚PSk.
001500           09 Œã—Ã‚PSk.
001510              11 Œã—Ã’P‰¿‚PSk            PIC 9(4).
001520              11 Œã—Ã‰ñ”‚PSk            PIC 9(2).
001530              11 Œã—Ã—¿‚PSk              PIC 9(5).
001540           09 —âãª–@‚PSk.
001550              11 —âãª–@’P‰¿‚PSk          PIC 9(4).
001560              11 —âãª–@‰ñ”‚PSk          PIC 9(2).
001570              11 —âãª–@—¿‚PSk            PIC 9(4).
001580           09 ‰·ãª–@‚PSk.
001590              11 ‰·ãª–@’P‰¿‚PSk          PIC 9(4).
001600              11 ‰·ãª–@‰ñ”‚PSk          PIC 9(2).
001610              11 ‰·ãª–@—¿‚PSk            PIC 9(4).
001620           09 “d—Ã‚PSk.
001630              11 “d—Ã’P‰¿‚PSk            PIC 9(4).
001640              11 “d—Ã‰ñ”‚PSk            PIC 9(2).
001650              11 “d—Ã—¿‚PSk              PIC 9(5).
001660           09 ¬Œv‚PSk                   PIC 9(6).
001670           09 ’·Šú’üŒ¸—¦‚PSk             PIC 9(3).
001680           09 ’·Šúž¬Œv‚PSk             PIC 9(6).
001690           09 ‘½•”ˆÊŒã—Ã’P‰¿‚P             PIC 9(4).
001700           09 ‘½•”ˆÊŒã—Ã‰ñ”‚P             PIC 9(2).
001710           09 ‘½•”ˆÊŒã—Ã—¿‚P               PIC 9(5).
001720           09 ’·ŠúŒã—Ã’P‰¿‚P               PIC 9(4).
001730           09 ’·ŠúŒã—Ã‰ñ”‚P               PIC 9(2).
001740           09 ’·ŠúŒã—Ã—¿‚P                 PIC 9(5).
001750           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚P         PIC 9(4).
001760           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚P         PIC 9(2).
001770           09 ‘½•”ˆÊSkŒã—Ã—¿‚P           PIC 9(5).
001780        07 •”ˆÊ‚Q.
001790           09 Œã—Ã‚Q.
001800              11 Œã—Ã’P‰¿‚Q                PIC 9(4).
001810              11 Œã—Ã‰ñ”‚Q                PIC 9(2).
001820              11 Œã—Ã—¿‚Q                  PIC 9(5).
001830           09 —âãª–@‚Q.
001840              11 —âãª–@’P‰¿‚Q              PIC 9(4).
001850              11 —âãª–@‰ñ”‚Q              PIC 9(2).
001860              11 —âãª–@—¿‚Q                PIC 9(4).
001870           09 ‰·ãª–@‚Q.
001880              11 ‰·ãª–@’P‰¿‚Q              PIC 9(4).
001890              11 ‰·ãª–@‰ñ”‚Q              PIC 9(2).
001900              11 ‰·ãª–@—¿‚Q                PIC 9(4).
001910           09 “d—Ã‚Q.
001920              11 “d—Ã’P‰¿‚Q                PIC 9(4).
001930              11 “d—Ã‰ñ”‚Q                PIC 9(2).
001940              11 “d—Ã—¿‚Q                  PIC 9(5).
001950           09 ¬Œv‚Q                       PIC 9(6).
001960           09 ’·Šú’üŒ¸—¦‚Q                 PIC 9(3).
001970           09 ’·Šúž¬Œv‚Q                 PIC 9(6).
001980        07 •”ˆÊ‚QSk.
001990           09 Œã—Ã‚QSk.
002000              11 Œã—Ã’P‰¿‚QSk            PIC 9(4).
002010              11 Œã—Ã‰ñ”‚QSk            PIC 9(2).
002020              11 Œã—Ã—¿‚QSk              PIC 9(5).
002030           09 —âãª–@‚QSk.
002040              11 —âãª–@’P‰¿‚QSk          PIC 9(4).
002050              11 —âãª–@‰ñ”‚QSk          PIC 9(2).
002060              11 —âãª–@—¿‚QSk            PIC 9(4).
002070           09 ‰·ãª–@‚QSk.
002080              11 ‰·ãª–@’P‰¿‚QSk          PIC 9(4).
002090              11 ‰·ãª–@‰ñ”‚QSk          PIC 9(2).
002100              11 ‰·ãª–@—¿‚QSk            PIC 9(4).
002110           09 “d—Ã‚QSk.
002120              11 “d—Ã’P‰¿‚QSk            PIC 9(4).
002130              11 “d—Ã‰ñ”‚QSk            PIC 9(2).
002140              11 “d—Ã—¿‚QSk              PIC 9(5).
002150           09 ¬Œv‚QSk                   PIC 9(6).
002160           09 ’·Šú’üŒ¸—¦‚QSk             PIC 9(3).
002170           09 ’·Šúž¬Œv‚QSk             PIC 9(6).
002180           09 ‘½•”ˆÊŒã—Ã’P‰¿‚Q             PIC 9(4).
002190           09 ‘½•”ˆÊŒã—Ã‰ñ”‚Q             PIC 9(2).
002200           09 ‘½•”ˆÊŒã—Ã—¿‚Q               PIC 9(5).
002210           09 ’·ŠúŒã—Ã’P‰¿‚Q               PIC 9(4).
002220           09 ’·ŠúŒã—Ã‰ñ”‚Q               PIC 9(2).
002230           09 ’·ŠúŒã—Ã—¿‚Q                 PIC 9(5).
002240           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚Q         PIC 9(4).
002250           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚Q         PIC 9(2).
002260           09 ‘½•”ˆÊSkŒã—Ã—¿‚Q           PIC 9(5).
002270        07 •”ˆÊ‚R.
002280           09 Œã—Ã‚R.
002290              11 Œã—Ã’P‰¿‚R                PIC 9(4).
002300              11 Œã—Ã‰ñ”‚R                PIC 9(2).
002310              11 Œã—Ã—¿‚R                  PIC 9(5).
002320           09 —âãª–@‚R.
002330              11 —âãª–@’P‰¿‚R              PIC 9(4).
002340              11 —âãª–@‰ñ”‚R              PIC 9(2).
002350              11 —âãª–@—¿‚R                PIC 9(4).
002360           09 ‰·ãª–@‚R.
002370              11 ‰·ãª–@’P‰¿‚R              PIC 9(4).
002380              11 ‰·ãª–@‰ñ”‚R              PIC 9(2).
002390              11 ‰·ãª–@—¿‚R                PIC 9(4).
002400           09 “d—Ã‚R.
002410              11 “d—Ã’P‰¿‚R                PIC 9(4).
002420              11 “d—Ã‰ñ”‚R                PIC 9(2).
002430              11 “d—Ã—¿‚R                  PIC 9(5).
002440           09 ¬Œv‚R                       PIC 9(6).
002450           09 ’·Šú’üŒ¸—¦‚R                 PIC 9(3).
002460           09 ’·Šúž¬Œv‚R                 PIC 9(6).
002470        07 •”ˆÊ‚RSk.
002480           09 Œã—Ã‚RSk.
002490              11 Œã—Ã’P‰¿‚RSk            PIC 9(4).
002500              11 Œã—Ã‰ñ”‚RSk            PIC 9(2).
002510              11 Œã—Ã—¿‚RSk              PIC 9(5).
002520           09 —âãª–@‚RSk.
002530              11 —âãª–@’P‰¿‚RSk          PIC 9(4).
002540              11 —âãª–@‰ñ”‚RSk          PIC 9(2).
002550              11 —âãª–@—¿‚RSk            PIC 9(4).
002560           09 ‰·ãª–@‚RSk.
002570              11 ‰·ãª–@’P‰¿‚RSk          PIC 9(4).
002580              11 ‰·ãª–@‰ñ”‚RSk          PIC 9(2).
002590              11 ‰·ãª–@—¿‚RSk            PIC 9(4).
002600           09 “d—Ã‚RSk.
002610              11 “d—Ã’P‰¿‚RSk            PIC 9(4).
002620              11 “d—Ã‰ñ”‚RSk            PIC 9(2).
002630              11 “d—Ã—¿‚RSk              PIC 9(5).
002640           09 ¬Œv‚RSk                   PIC 9(6).
002650           09 ’·Šú’üŒ¸—¦‚RSk             PIC 9(3).
002660           09 ’·Šúž¬Œv‚RSk             PIC 9(6).
002670           09 ‘½•”ˆÊŒã—Ã’P‰¿‚R             PIC 9(4).
002680           09 ‘½•”ˆÊŒã—Ã‰ñ”‚R             PIC 9(2).
002690           09 ‘½•”ˆÊŒã—Ã—¿‚R               PIC 9(5).
002700           09 ’·ŠúŒã—Ã’P‰¿‚R               PIC 9(4).
002710           09 ’·ŠúŒã—Ã‰ñ”‚R               PIC 9(2).
002720           09 ’·ŠúŒã—Ã—¿‚R                 PIC 9(5).
002730           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚R         PIC 9(4).
002740           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚R         PIC 9(2).
002750           09 ‘½•”ˆÊSkŒã—Ã—¿‚R           PIC 9(5).
002760        07 •”ˆÊ‚S.
002770           09 Œã—Ã‚S.
002780              11 Œã—Ã’P‰¿‚S                PIC 9(4).
002790              11 Œã—Ã‰ñ”‚S                PIC 9(2).
002800              11 Œã—Ã—¿‚S                  PIC 9(5).
002810           09 —âãª–@‚S.
002820              11 —âãª–@’P‰¿‚S              PIC 9(4).
002830              11 —âãª–@‰ñ”‚S              PIC 9(2).
002840              11 —âãª–@—¿‚S                PIC 9(4).
002850           09 ‰·ãª–@‚S.
002860              11 ‰·ãª–@’P‰¿‚S              PIC 9(4).
002870              11 ‰·ãª–@‰ñ”‚S              PIC 9(2).
002880              11 ‰·ãª–@—¿‚S                PIC 9(4).
002890           09 “d—Ã‚S.
002900              11 “d—Ã’P‰¿‚S                PIC 9(4).
002910              11 “d—Ã‰ñ”‚S                PIC 9(2).
002920              11 “d—Ã—¿‚S                  PIC 9(5).
002930           09 ¬Œv‚S                       PIC 9(6).
002940           09 ’·Šú’üŒ¸—¦‚S                 PIC 9(3).
002950           09 ’·Šúž¬Œv‚S                 PIC 9(6).
002960        07 •”ˆÊ‚SSk.
002970           09 Œã—Ã‚SSk.
002980              11 Œã—Ã’P‰¿‚SSk            PIC 9(4).
002990              11 Œã—Ã‰ñ”‚SSk            PIC 9(2).
003000              11 Œã—Ã—¿‚SSk              PIC 9(5).
003010           09 —âãª–@‚SSk.
003020              11 —âãª–@’P‰¿‚SSk          PIC 9(4).
003030              11 —âãª–@‰ñ”‚SSk          PIC 9(2).
003040              11 —âãª–@—¿‚SSk            PIC 9(4).
003050           09 ‰·ãª–@‚SSk.
003060              11 ‰·ãª–@’P‰¿‚SSk          PIC 9(4).
003070              11 ‰·ãª–@‰ñ”‚SSk          PIC 9(2).
003080              11 ‰·ãª–@—¿‚SSk            PIC 9(4).
003090           09 “d—Ã‚SSk.
003100              11 “d—Ã’P‰¿‚SSk            PIC 9(4).
003110              11 “d—Ã‰ñ”‚SSk            PIC 9(2).
003120              11 “d—Ã—¿‚SSk              PIC 9(5).
003130           09 ¬Œv‚SSk                   PIC 9(6).
003140           09 ’·Šú’üŒ¸—¦‚SSk             PIC 9(3).
003150           09 ’·Šúž¬Œv‚SSk             PIC 9(6).
003160           09 ‘½•”ˆÊŒã—Ã’P‰¿‚S             PIC 9(4).
003170           09 ‘½•”ˆÊŒã—Ã‰ñ”‚S             PIC 9(2).
003180           09 ‘½•”ˆÊŒã—Ã—¿‚S               PIC 9(5).
003190           09 ’·ŠúŒã—Ã’P‰¿‚S               PIC 9(4).
003200           09 ’·ŠúŒã—Ã‰ñ”‚S               PIC 9(2).
003210           09 ’·ŠúŒã—Ã—¿‚S                 PIC 9(5).
003220           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚S         PIC 9(4).
003230           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚S         PIC 9(2).
003240           09 ‘½•”ˆÊSkŒã—Ã—¿‚S           PIC 9(5).
003250        07 •”ˆÊ‚T.
003260           09 Œã—Ã‚T.
003270              11 Œã—Ã’P‰¿‚T                PIC 9(4).
003280              11 Œã—Ã‰ñ”‚T                PIC 9(2).
003290              11 Œã—Ã—¿‚T                  PIC 9(5).
003300           09 —âãª–@‚T.
003310              11 —âãª–@’P‰¿‚T              PIC 9(4).
003320              11 —âãª–@‰ñ”‚T              PIC 9(2).
003330              11 —âãª–@—¿‚T                PIC 9(4).
003340           09 ‰·ãª–@‚T.
003350              11 ‰·ãª–@’P‰¿‚T              PIC 9(4).
003360              11 ‰·ãª–@‰ñ”‚T              PIC 9(2).
003370              11 ‰·ãª–@—¿‚T                PIC 9(4).
003380           09 “d—Ã‚T.
003390              11 “d—Ã’P‰¿‚T                PIC 9(4).
003400              11 “d—Ã‰ñ”‚T                PIC 9(2).
003410              11 “d—Ã—¿‚T                  PIC 9(5).
003420           09 ¬Œv‚T                       PIC 9(6).
003430           09 ’·Šú’üŒ¸—¦‚T                 PIC 9(3).
003440           09 ’·Šúž¬Œv‚T                 PIC 9(6).
003450        07 •”ˆÊ‚TSk.
003460           09 Œã—Ã‚TSk.
003470              11 Œã—Ã’P‰¿‚TSk            PIC 9(4).
003480              11 Œã—Ã‰ñ”‚TSk            PIC 9(2).
003490              11 Œã—Ã—¿‚TSk              PIC 9(5).
003500           09 —âãª–@‚TSk.
003510              11 —âãª–@’P‰¿‚TSk          PIC 9(4).
003520              11 —âãª–@‰ñ”‚TSk          PIC 9(2).
003530              11 —âãª–@—¿‚TSk            PIC 9(4).
003540           09 ‰·ãª–@‚TSk.
003550              11 ‰·ãª–@’P‰¿‚TSk          PIC 9(4).
003560              11 ‰·ãª–@‰ñ”‚TSk          PIC 9(2).
003570              11 ‰·ãª–@—¿‚TSk            PIC 9(4).
003580           09 “d—Ã‚TSk.
003590              11 “d—Ã’P‰¿‚TSk            PIC 9(4).
003600              11 “d—Ã‰ñ”‚TSk            PIC 9(2).
003610              11 “d—Ã—¿‚TSk              PIC 9(5).
003620           09 ¬Œv‚TSk                   PIC 9(6).
003630           09 ’·Šú’üŒ¸—¦‚TSk             PIC 9(3).
003640           09 ’·Šúž¬Œv‚TSk             PIC 9(6).
003650           09 ‘½•”ˆÊŒã—Ã’P‰¿‚T             PIC 9(4).
003660           09 ‘½•”ˆÊŒã—Ã‰ñ”‚T             PIC 9(2).
003670           09 ‘½•”ˆÊŒã—Ã—¿‚T               PIC 9(5).
003680           09 ’·ŠúŒã—Ã’P‰¿‚T               PIC 9(4).
003690           09 ’·ŠúŒã—Ã‰ñ”‚T               PIC 9(2).
003700           09 ’·ŠúŒã—Ã—¿‚T                 PIC 9(5).
003710           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚T         PIC 9(4).
003720           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚T         PIC 9(2).
003730           09 ‘½•”ˆÊSkŒã—Ã—¿‚T           PIC 9(5).
003740        07 •”ˆÊ‚U.
003750           09 Œã—Ã‚U.
003760              11 Œã—Ã’P‰¿‚U                PIC 9(4).
003770              11 Œã—Ã‰ñ”‚U                PIC 9(2).
003780              11 Œã—Ã—¿‚U                  PIC 9(5).
003790           09 —âãª–@‚U.
003800              11 —âãª–@’P‰¿‚U              PIC 9(4).
003810              11 —âãª–@‰ñ”‚U              PIC 9(2).
003820              11 —âãª–@—¿‚U                PIC 9(4).
003830           09 ‰·ãª–@‚U.
003840              11 ‰·ãª–@’P‰¿‚U              PIC 9(4).
003850              11 ‰·ãª–@‰ñ”‚U              PIC 9(2).
003860              11 ‰·ãª–@—¿‚U                PIC 9(4).
003870           09 “d—Ã‚U.
003880              11 “d—Ã’P‰¿‚U                PIC 9(4).
003890              11 “d—Ã‰ñ”‚U                PIC 9(2).
003900              11 “d—Ã—¿‚U                  PIC 9(5).
003910           09 ¬Œv‚U                       PIC 9(6).
003920           09 ’·Šú’üŒ¸—¦‚U                 PIC 9(3).
003930           09 ’·Šúž¬Œv‚U                 PIC 9(6).
003940        07 •”ˆÊ‚USk.
003950           09 Œã—Ã‚USk.
003960              11 Œã—Ã’P‰¿‚USk            PIC 9(4).
003970              11 Œã—Ã‰ñ”‚USk            PIC 9(2).
003980              11 Œã—Ã—¿‚USk              PIC 9(5).
003990           09 —âãª–@‚USk.
004000              11 —âãª–@’P‰¿‚USk          PIC 9(4).
004010              11 —âãª–@‰ñ”‚USk          PIC 9(2).
004020              11 —âãª–@—¿‚USk            PIC 9(4).
004030           09 ‰·ãª–@‚USk.
004040              11 ‰·ãª–@’P‰¿‚USk          PIC 9(4).
004050              11 ‰·ãª–@‰ñ”‚USk          PIC 9(2).
004060              11 ‰·ãª–@—¿‚USk            PIC 9(4).
004070           09 “d—Ã‚USk.
004080              11 “d—Ã’P‰¿‚USk            PIC 9(4).
004090              11 “d—Ã‰ñ”‚USk            PIC 9(2).
004100              11 “d—Ã—¿‚USk              PIC 9(5).
004110           09 ¬Œv‚USk                   PIC 9(6).
004120           09 ’·Šú’üŒ¸—¦‚USk             PIC 9(3).
004130           09 ’·Šúž¬Œv‚USk             PIC 9(6).
004140           09 ‘½•”ˆÊŒã—Ã’P‰¿‚U             PIC 9(4).
004150           09 ‘½•”ˆÊŒã—Ã‰ñ”‚U             PIC 9(2).
004160           09 ‘½•”ˆÊŒã—Ã—¿‚U               PIC 9(5).
004170           09 ’·ŠúŒã—Ã’P‰¿‚U               PIC 9(4).
004180           09 ’·ŠúŒã—Ã‰ñ”‚U               PIC 9(2).
004190           09 ’·ŠúŒã—Ã—¿‚U                 PIC 9(5).
004200           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚U         PIC 9(4).
004210           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚U         PIC 9(2).
004220           09 ‘½•”ˆÊSkŒã—Ã—¿‚U           PIC 9(5).
004230        07 •”ˆÊ‚V.
004240           09 Œã—Ã‚V.
004250              11 Œã—Ã’P‰¿‚V                PIC 9(4).
004260              11 Œã—Ã‰ñ”‚V                PIC 9(2).
004270              11 Œã—Ã—¿‚V                  PIC 9(5).
004280           09 —âãª–@‚V.
004290              11 —âãª–@’P‰¿‚V              PIC 9(4).
004300              11 —âãª–@‰ñ”‚V              PIC 9(2).
004310              11 —âãª–@—¿‚V                PIC 9(4).
004320           09 ‰·ãª–@‚V.
004330              11 ‰·ãª–@’P‰¿‚V              PIC 9(4).
004340              11 ‰·ãª–@‰ñ”‚V              PIC 9(2).
004350              11 ‰·ãª–@—¿‚V                PIC 9(4).
004360           09 “d—Ã‚V.
004370              11 “d—Ã’P‰¿‚V                PIC 9(4).
004380              11 “d—Ã‰ñ”‚V                PIC 9(2).
004390              11 “d—Ã—¿‚V                  PIC 9(5).
004400           09 ¬Œv‚V                       PIC 9(6).
004410           09 ’·Šú’üŒ¸—¦‚V                 PIC 9(3).
004420           09 ’·Šúž¬Œv‚V                 PIC 9(6).
004430        07 •”ˆÊ‚VSk.
004440           09 Œã—Ã‚VSk.
004450              11 Œã—Ã’P‰¿‚VSk            PIC 9(4).
004460              11 Œã—Ã‰ñ”‚VSk            PIC 9(2).
004470              11 Œã—Ã—¿‚VSk              PIC 9(5).
004480           09 —âãª–@‚VSk.
004490              11 —âãª–@’P‰¿‚VSk          PIC 9(4).
004500              11 —âãª–@‰ñ”‚VSk          PIC 9(2).
004510              11 —âãª–@—¿‚VSk            PIC 9(4).
004520           09 ‰·ãª–@‚VSk.
004530              11 ‰·ãª–@’P‰¿‚VSk          PIC 9(4).
004540              11 ‰·ãª–@‰ñ”‚VSk          PIC 9(2).
004550              11 ‰·ãª–@—¿‚VSk            PIC 9(4).
004560           09 “d—Ã‚VSk.
004570              11 “d—Ã’P‰¿‚VSk            PIC 9(4).
004580              11 “d—Ã‰ñ”‚VSk            PIC 9(2).
004590              11 “d—Ã—¿‚VSk              PIC 9(5).
004600           09 ¬Œv‚VSk                   PIC 9(6).
004610           09 ’·Šú’üŒ¸—¦‚VSk             PIC 9(3).
004620           09 ’·Šúž¬Œv‚VSk             PIC 9(6).
004630           09 ‘½•”ˆÊŒã—Ã’P‰¿‚V             PIC 9(4).
004640           09 ‘½•”ˆÊŒã—Ã‰ñ”‚V             PIC 9(2).
004650           09 ‘½•”ˆÊŒã—Ã—¿‚V               PIC 9(5).
004660           09 ’·ŠúŒã—Ã’P‰¿‚V               PIC 9(4).
004670           09 ’·ŠúŒã—Ã‰ñ”‚V               PIC 9(2).
004680           09 ’·ŠúŒã—Ã—¿‚V                 PIC 9(5).
004690           09 ‘½•”ˆÊSkŒã—Ã’P‰¿‚V         PIC 9(4).
004700           09 ‘½•”ˆÊSkŒã—Ã‰ñ”‚V         PIC 9(2).
004710           09 ‘½•”ˆÊSkŒã—Ã—¿‚V           PIC 9(5).
004720*/—âãª–@‚Æ‰·ãª–@‚Ì’P‰¿‚ªˆá‚¤ê‡‚Ì–¾×‘AŒvŽZ‘‚Ì‹L“ü‚Ìˆ×‚Ì‘Î‰žB
004730      05 —¿‹à‚S.
004740         07 ãª–@’P‰¿‰ñ” OCCURS 7.
004750            09 ãª–@’P‰¿                    PIC 9(5) OCCURS 6.
004760            09 ãª–@‰ñ”                    PIC 9(2) OCCURS 6.
004770         07 “d—Ã’P‰¿‰ñ” OCCURS 7.
004780            09 “d—Ã’P‰¿                    PIC 9(5) OCCURS 2.
004790            09 “d—Ã‰ñ”                    PIC 9(2) OCCURS 2.
004800*
      */œÜ•s‘SœÜ’E‰PA“Á•ÊÞ—¿‚Í‚R‰ñŽZ’è‚Å‚«‚éB/20180830
           05 “Á•ÊÞ—¿”ï                         OCCURS 7.
               07 Þ—¿”ï’P‰¿                     PIC 9(5).
               07 Þ—¿”ï‰ñ”                     PIC 9(1).
004810*     05 FILLER                         PIC X(1935).
004820*
004810     05 FILLER                         PIC X(1893).
004820*
