000010*****************************************************************
000020* ＲＥＩＧＡＩ：例外マスタ［ＲＬ＝６４０］                      *
000021* 一般(キー用)
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1999.05.18                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :区分コード毎に 例外 を管理                       *
000081***                                                             *
000082* プリフィックスを例－にする                                    *
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000140*******************************************************************
000150* ００：区分コード体系                                            *
000160* ０１：福岡総括表　           ０２：        ０３：               *
000280*******************************************************************
000290*
000300         05  番号コード                PIC 9(3).
000310     03  レコードデータ.
000370         05  FILLER                    PIC X(635).
