000010*****************************************************************
000020* ＲＥＩＧＡＩ０８：例外マスタ［ＲＬ＝６４０］                  *
000021*                   ※ 新システム料金再計算用                   *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000060* PRODUCT DATE:2009.10.30                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :区分コード毎に 例外 を管理                       *
000081***                                                             *
000082* プリフィックスを例０８－にする                                *
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000120         05  区分コード                PIC 9(2).
000130*
000140*******************************************************************
000150* ００：区分コード体系                                            *
000160* ０１：福岡総括表　  ０２：診察券用         ０３：               *
000170* ０８：新システム料金再計算用                                    *
000280*******************************************************************
000290*
000300         05  番号コード                PIC 9(3).
000310     03  レコードデータ.
000311*        快癒でメニュー立ち上げ時に料金再計算必要な施術和暦年月
000312         05 快癒料金再計算年月         PIC X(5).
000313*        柔でメニュー立ち上げ時に料金再計算必要な施術和暦年月
000314         05 柔料金再計算年月           PIC X(5).
000315*
000350*
000370         05  FILLER                    PIC X(625).
