000010*****************************************************************
000020* ＲＥＩＧＡＩ０９：例外マスタ［ＲＬ＝６４０］                  *
000030*                   ※ 予約システム連携用                       *
000040*****************************************************************
000050* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000060* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000070* PRODUCT DATE:2015.05.18                                       *
000080* AUTHOR      :佐野　誠                                         *
000090* PURPOSE     :区分コード毎に 例外 を管理                       *
000100***                                                             *
000110* プリフィックスを例０９－にする                                *
000120*****************************************************************
000130 01  レコード.
000140     03  レコードキー.
000150         05  区分コード                PIC 9(2).
000160*
000170*******************************************************************
000180* ００：区分コード体系                                            *
000190* ０１：福岡総括表　  ０２：診察券用         ０３：東京都総括票用 *
000200* ０４：その他料金    ０５：パスワード用                          *
000210* ０６：診察カードレイアウト用  ０７：書替フリーエリア設定用      *
000220* ０８：新システム料金再計算用  ０９：予約システム連携用          *
000230*******************************************************************
000240*
000250         05  番号コード                PIC 9(3).
000260     03  レコードデータ.
000270         05  治療院ＩＤ                PIC X(10).
000280         05  柔識別ＩＤ                PIC X(20).
000290         05  治療院ＩＤ２              PIC X(10).
000300         05  FILLER                    PIC X(595).
