000010*****************************************************************
000020* ＲＥＩＧＡＩ０７：例外マスタ［ＲＬ＝６４０］                  *
000030*                   ※ 書替フリーエリア設定用                   *
000040*****************************************************************
000050* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000060* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000070* PRODUCT DATE:2006.07.03                                       *
000080* AUTHOR      :佐野　誠                                         *
000090* PURPOSE     :区分コード毎に 例外 を管理                       *
000100***                                                             *
000110* プリフィックスを例０７－にする                                *
000120*****************************************************************
000130 01  レコード.
000140     03  レコードキー.
000150         05  区分コード                PIC 9(2).
000160*
000170*******************************************************************
000180* ００：区分コード体系                                            *
000190* ０１：福岡総括表    ０２：診察券用   ０３：東京都総括票用       *
000200* ０４：その他料金    ０５：パスワード用                          *
000210* ０６：診察カードレイアウト用   ０７：書替フリーエリア設定用     *
000220*******************************************************************
000230*
000240         05  番号コード                PIC 9(3).
000250     03  レコードデータ.
000260*******************************************************************
000270* ０１：本日・前回通院日  ０２：当月通院日  ０３：コメント例文    *
000280* ０４：カレンダー  ０５：一部負担金・当月累計                    *
000290*******************************************************************
000300         05  書替内容  OCCURS 10.
000310            07  表示順                 PIC 9(2).
000320            07  初期値                 PIC 9(1).
000330            07  初検日                 PIC 9(1).
000340*
000350         05  FILLER                    PIC X(595).
000360*
