000010*****************************************************************
000020* 会計領収Ｆ　ryosyu.dat ［RL=640BYTE］                           *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.03.26                                       *
000070* PURPOSE     :日の入金詳細と領収書情報を管理                   *
000080*              ※自費分明細を入力時にデータ作成                 *
000090*              ※日・月・年の領収書発行時にデータ作成           *
000100*****************************************************************
000110*---------------------------------------------------------------*
000120*	新規ファイル
000130*---------------------------------------------------------------*
000140*
000150*     SELECT  会計領収Ｆ      ASSIGN      TO        RYOSYUL
000160*                             ORGANIZATION             IS  INDEXED
000170*                             ACCESS MODE              IS  DYNAMIC
000180*                             RECORD KEY               IS  領－施術区分
000190*                                                          領－会計領収区分
000200*                                                          領－施術和暦年月日
000210*                                                          領－患者コード
000220*                             ALTERNATE RECORD KEY     IS  領－施術区分
000230*                                                          領－患者コード
000240*                                                          領－会計領収区分
000250*                                                          領－施術和暦年月日
000260*                             FILE STATUS              IS  状態キー
000270*                             LOCK        MODE         IS  AUTOMATIC.
000280***
000290* FD  会計領収Ｆ     BLOCK   CONTAINS   1   RECORDS.
000300*     COPY RYOSYU    OF  XFDLIB  JOINING   領  AS  PREFIX.
000310*
000320*****************************************************************
000330 01 レコード.
000340   03 レコードキー.
000350*-----------------------------------------------*
000360* 0:柔整、1:鍼灸、2:あんま・マッサージ、3:自費の別領収書
000370     05 施術区分                       PIC 9.
000380*-----------------------------------------------*
000390* 1:日、2:月、3:年
000400     05 会計領収区分                   PIC 9.
000410*-----------------------------------------------*
000420     05 施術和暦年月日.
000430       07 施術和暦年月.
000440         09 施術和暦                   PIC 9.
000450         09 施術年月.
000460           11 施術年                   PIC 9(2).
000470           11 施術月                   PIC 9(2).
000480       07 施術日                       PIC 9(2).
000490     05 患者コード.
000500       07 患者番号                     PIC 9(6).
000510       07 枝番                         PIC X.
000520**
000530   03 レコードデータ.
000540     05 入金額                         PIC 9(8).
000550     05 一部負担金                     PIC 9(7).
000560     05 自費額                         PIC 9(8).
000570     05 日の自費分明細  OCCURS 5.
000580       07 自費項目内容                 PIC X(50).
000590       07 自費項目単価                 PIC 9(6).
000600       07 自費項目数量                 PIC 9(3).
000610       07 自費項目金額                 PIC 9(7).
000620*   / 領収書用 /
000630     05 領収書印刷区分                 PIC 9.
000640     05 領収書摘要                     PIC X(100).
000650     05 発行和暦年月日.
000660       07 発行和暦年月.
000670         09 発行和暦                   PIC 9.
000680         09 発行年月.
000690           11 発行年                   PIC 9(2).
000700           11 発行月                   PIC 9(2).
000710       07 発行日                       PIC 9(2).
000720*
000730     05 費用額                         PIC 9(8).
000740*
000750     05 領収書摘要２                   PIC X(100).
000760*/自費を項目ごとに集計する/1312
000570     05 日の自費コード  OCCURS 5.
000580       07 自費コード                   PIC 9(3).
      *
      */担当施術者コード  /140717
           05 施術者番号                     PIC 9(3).
      *
000770     05 FILLER                         PIC X(37).
000780*
