000010*****************************************************************
000020* ＲＹＯＵＫＮＡ：料金マスタ（基本健保料金用）［ＲＬ＝２５６］  *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:1997.04.15                                       *
000070* AUTHOR      :上田  育正                                       *
000080* PURPOSE     :区分コード（健保01）毎＋開始年月 *
000090*              毎 に料金を管理                                  *
000100*****************************************************************
000110* 区分コード：０１・部位コード：ZERO
000120* プリフィックスを料Ａ－にする
000130*****************************************************************
000140 01  レコード.
000150     03  レコードキー.
000160         05  区分コード                      PIC 9(2).
000170         05  部位コード.
000180           07  負傷種別                      PIC 9(2).
000190           07  部位                          PIC 9(2).
000200           07  左右区分                      PIC 9.
000210           07  負傷位置番号                  PIC 9(2).
000220         05  開始和暦年月.
000230           07  開始和暦                      PIC 9.
000240           07  開始年月.
000250             09  開始年                      PIC 9(2).
000260             09  開始月                      PIC 9(2).
000270     03  レコードデータ.
000280         05  終了和暦年月.
000290           07  終了和暦                      PIC 9.
000300           07  終了年月.
000310             09  終了年                      PIC 9(2).
000320             09  終了月                      PIC 9(2).
000330         05  初検料                          PIC 9(4).
000340         05  初検加算料.
000350           07  時間外                        PIC 9(4).
000360           07  休日                          PIC 9(4).
000370           07  深夜                          PIC 9(4).
000380         05  往療料.
000390           07  往療基本料金                  PIC 9(4).
000400           07  往療追加料金                  PIC 9(4).
000410* 加算率：２倍の場合は、２００と入力する
000420* 将来、往療加算率が加算項目毎変わる？事を考慮
000430* 時間外と、往療加算率は兼用
000440           07  往療加算率                    PIC 9(3).
000450           07  往療深夜加算率                PIC 9(3).
000460           07  往療難路加算率                PIC 9(3).
000470           07  往療暴風雨加算率              PIC 9(3).
000480         05  再検料                          PIC 9(4).
000490         05  冷罨法料                        PIC 9(4).
000500         05  温罨法料                        PIC 9(4).
000510         05  電療料                          PIC 9(4).
000520         05  金属副子加算.
000530           07  大                            PIC 9(4).
000540           07  中                            PIC 9(4).
000550           07  小                            PIC 9(4).
000560         05  老人負担金.
000570           07  老人一部負担金                PIC 9(4).
000580         05  施術情報提供料                  PIC 9(4).
000590         05  長期多部位定額料                PIC 9(4).
000600*/0101老人保険改正の対応
000610         05  老人負担額上限                  PIC 9(5).
000621         05  初検時相談料                    PIC 9(4).
      */平成30年6月1日より運動後療料を新設/20180424
               05  運動後療料                      PIC 9(4).
      */令和4年10月1日より明細書発行加算料を新設/20220424
               05  明細書発行加算料                PIC 9(4).
000630         05  FILLER                          PIC X(144).
