      *****************************************************************
      * ＲＹＯＵＫＮＣ：料金マスタ（基本労災料金用）［ＲＬ＝２５６］
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.04.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :区分コード（労災03）毎＋開始年月 *
      *              毎 に料金を管理                                  *
      *****************************************************************
      * 区分コード：０３・部位コード：ZERO
      * プリフィックスを料Ｃ－にする
      *****************************************************************
       01  レコード.
           03  レコードキー.
               05  区分コード                      PIC 9(2).
               05  部位コード.
                 07  負傷種別                      PIC 9(2).
                 07  部位                          PIC 9(2).
                 07  左右区分                      PIC 9.
                 07  負傷位置番号                  PIC 9(2).
               05  開始和暦年月.
                 07  開始和暦                      PIC 9.
                 07  開始年月.
                   09  開始年                      PIC 9(2).
                   09  開始月                      PIC 9(2).
           03  レコードデータ.
               05  終了和暦年月.
                 07  終了和暦                      PIC 9.
                 07  終了年月.
                   09  終了年                      PIC 9(2).
                   09  終了月                      PIC 9(2).
      *
               05  初検料                          PIC 9(4).
               05  初検加算料.
                 07  時間外                        PIC 9(4).
                 07  休日                          PIC 9(4).
                 07  深夜                          PIC 9(4).
               05  再検料                          PIC 9(4).
               05  往療料.
                 07  基本料金                      PIC 9(4).
                 07  追加料金                      PIC 9(4).
                 07  夜間加算率                    PIC 9(3).
                 07  深夜加算率                    PIC 9(3).
                 07  難路加算率                    PIC 9(3).
                 07  暴風雨加算率                  PIC 9(3).
               05  指導管理料                      PIC 9(4).
               05  運動療法料                      PIC 9(4).
               05  宿泊料                          PIC 9(4).
               05  食事料                          PIC 9(4).
               05  施術情報提供料                  PIC 9(4).
               05  休業証明書料                    PIC 9(4).
               05  冷罨法料                        PIC 9(4).
               05  温罨法料                        PIC 9(4).
               05  電療料                          PIC 9(4).
               05  初検時相談料                    PIC 9(4).
               05  FILLER                          PIC X(157).
