      *****************************************************************
      * ＲＹＯＵＫＮＢ：料金マスタ（負傷別健保料金用）［ＲＬ＝２５６］
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1997.04.15                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :区分コード（健保02）毎＋開始年月 *
      *              毎 に料金を管理                                  *
      *****************************************************************
      *区分コードに０２を指定
      * プリフィックスを料Ｂ－にする
      *****************************************************************
       01  レコード.
           03  レコードキー.
               05  区分コード                PIC 9(2).
               05  部位コード.
                 07  負傷種別                PIC 9(2).
                 07  部位                    PIC 9(2).
                 07  左右区分                PIC 9.
                 07  負傷位置番号            PIC 9(2).
               05  開始和暦年月.
                 07  開始和暦                PIC 9.
                 07  開始年月.
                   09  開始年                PIC 9(2).
                   09  開始月                PIC 9(2).
           03  レコードデータ.
               05  終了和暦年月.
                 07  終了和暦                PIC 9.
                 07  終了年月.
                   09  終了年                PIC 9(2).
                   09  終了月                PIC 9(2).
               05  健保料金.
                 07  整復料                  PIC 9(5).
                 07  後療料                  PIC 9(4).
                 07  拘縮後療料              PIC 9(4).
               05  自由診療料金.
                 07  FILLER                  PIC X(224).
