000010*****************************************************************
000020* 生保情報Ｆ　SEIHOJ.DAT ［ＲＬ＝1024BYTE］     *
000030*****************************************************************
000080* SYSYTEM NAME:共通                                             *
000081* LANGUAGE PG :NetCOBOL                                         *
000082* PRODUCT DATE:2009.07.14                                       *
000083* PURPOSE     :月毎＋患者毎の生保情報を記録                     *
000140*****************************************************************
000150*---------------------------------------------------------------*
000160*	新規ファイル
000170*---------------------------------------------------------------*
000240**
000241*     SELECT  生保情報Ｆ      ASSIGN      TO        SEIHOJL
000242*                             ORGANIZATION             IS INDEXED
000243*                             ACCESS MODE              IS DYNAMIC
000244*                             RECORD KEY               IS 生保－施術和暦年月
000245*                                                         生保－患者コード
000255*                             ALTERNATE RECORD KEY     IS 生保－患者コード
000265*                                                         生保－施術和暦年月
000277*                             FILE STATUS              IS 状態キー
000278*                             LOCK        MODE         IS AUTOMATIC.
000279***
000280* FD  生保情報Ｆ       BLOCK   CONTAINS   1   RECORDS.
000281*     COPY SEIHOJ      OF  XFDLIB  JOINING   生保   AS  PREFIX.
000282*
000283*****************************************************************
000284 01 レコード.
000285   03 レコードキー.
000286     05 施術和暦年月.
000287       07 施術和暦                     PIC 9.
000290       07 施術年月.
000300         09 施術年                     PIC 9(2).
000310         09 施術月                     PIC 9(2).
000320     05 患者コード.
000330       07 患者番号                     PIC 9(6).
000340       07 枝番                         PIC X.
000350   03 レコードデータ.
000499     05 生保市町村名                   PIC X(40).
000501     05 負担者番号                     PIC X(10).
000502     05 生保記号番号                   PIC X(40).
000505     05 FILLER                         PIC X(50).
000537     05 生保送付先郵便番号.
000547       07 生保送付先郵便番号１         PIC X(3).
000557       07 生保送付先郵便番号２         PIC X(4).
000567     05 生保送付先住所１               PIC X(50).
000577     05 生保送付先住所２               PIC X(50).
000587     05 生保送付先宛名                 PIC X(80).
000588     05 生保電話番号                   PIC X(40).
000597     05 生保備考                       PIC X(400).
000607*
002278     05 FILLER                         PIC X(245).
002280*
