000010*****************************************************************
000020* ＳＥＩＫＹＵＳ：請求先マスタ［ＲＬ＝２５６］                  *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000080* PURPOSE     :保険種別（健保区分）＋保険者毎に保険者マスタと   *
000090*              異なる住所を使用する場合の情報を管理             *
000091*****************************************************************
000092*まったく変更なし
000100*****************************************************************
000110 01  レコード.
000120     03  レコードキー.
000130         05  保険種別                   PIC 9(2).
000140         05  保険者番号                 PIC X(10).
000150     03  レコードデータ.
000160         05  保険者カナ                 PIC X(40).
000170         05  保険者名称                 PIC X(40).
000180         05  支部部署名.
000190           07  支部名                   PIC X(20).
000200           07  部署名                   PIC X(20).
000210         05  郵便番号.
000220           07  郵便番号１               PIC X(3).
000230           07  郵便番号２               PIC X(4).
000240         05  保険者住所.
000250           07  保険者住所１             PIC X(40).
000260           07  保険者住所２             PIC X(40).
000270         05  電話番号                   PIC X(15).
000280         05  都道府県                   PIC X(2).
000290         05  請求先市町村               PIC X(10).
000300         05  FILLER                     PIC X(10).
