000010*****************************************************************
000020* 施設受診者マスタ　sisetju.dat ［RL=128BYTE］                  *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.11.13                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :施設に属する受診者を記録                         *
000090*****************************************************************
000101*
000102*     SELECT  施設受診者マスタ   ASSIGN      TO       SISETJUL
000103*                                ORGANIZATION             IS  INDEXED
000104*                                ACCESS MODE              IS  DYNAMIC
000105*                                RECORD KEY               IS  施設受－施設コード
000106*                                                             施設受－患者コード
000107*                                ALTERNATE RECORD KEY     IS  施設受－施設コード
000108*                                                             施設受－存在区分
000109*                                                             施設受－患者コード
000110*                                ALTERNATE RECORD KEY     IS  施設受－患者コード
000111*                                                             施設受－施設コード
000112*                                FILE STATUS              IS  状態キー
000113*                                LOCK        MODE         IS  AUTOMATIC.
000114*
000115* FD  施設受診者マスタ  BLOCK   CONTAINS   1   RECORDS.
000116*     COPY SISETJU    OF  XFDLIB  JOINING   施設受   AS  PREFIX.
000117*
000120*****************************************************************
000130 01  レコード.
000140     03  レコードキー.
000150         05 施設コード          PIC 9(3).
000151         05 患者コード.
000152           07 患者番号          PIC 9(6).
000153           07 枝番              PIC X.
000160     03  レコードデータ.
000161         05 存在区分            PIC 9.
000162         05 備考                PIC X(50).
000170         05 FILLER              PIC X(67).
