000010*****************************************************************
000020* 施設マスタ　sisetu.dat ［RL=512BYTE］                         *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.11.13                                       *
000070* AUTHOR      :佐野　誠                                         *
000080* PURPOSE     :往療先施設情報を記録                             *
000090*****************************************************************
000101*
000102*     SELECT  施設マスタ         ASSIGN      TO       SISETUL
000103*                                ORGANIZATION             IS  INDEXED
000104*                                ACCESS MODE              IS  DYNAMIC
000105*                                RECORD KEY               IS  施設－施設コード
000111*                                FILE STATUS              IS  状態キー
000112*                                LOCK        MODE         IS  AUTOMATIC.
000113*
000114* FD  施設マスタ  BLOCK   CONTAINS   1   RECORDS.
000115*     COPY SISETU    OF  XFDLIB  JOINING   施設   AS  PREFIX.
000117*
000120*****************************************************************
000130 01  レコード.
000140     03  レコードキー.
000150         05  施設コード          PIC 9(3).
000160     03  レコードデータ.
000170         05  施設カナ            PIC X(60).
000180         05  施設名称            PIC X(60).
000190         05  郵便番号.
000200           07  郵便番号１        PIC X(3).
000210           07  郵便番号２        PIC X(4).
000220         05  住所.
000230           07  住所１            PIC X(50).
000240           07  住所２            PIC X(50).
000250         05  電話番号            PIC X(30).
000251         05  施設緯度            PIC 9(3)V9(7).
000252         05  施設経度            PIC 9(3)V9(7).
002830*/20240601（1：あり）
002831         05 鍼灸特別地域区分     PIC X.
002832*
000260         05  FILLER              PIC X(231).
