000010*****************************************************************
000020* ＳＩＴＹＯＳＮ：市町村マスタ  ［ＲＬ＝３２０]
000030*****************************************************************
000110* SYSYTEM NAME:共通                                             *
000111* LANGUAGE PG :NetCOBOL                                         *
000112* PRODUCT DATE:2009.03.27                                       *
000113* PURPOSE     :公費市町村情報を管理                             *
000114*****************************************************************
000115*基本的に変更なし
000116*---------------------------------------------------------------*
000117*	SELECT文変更なし、桁数位置変更なし、不用（移動）項目FILLER（空き）化
000118*---------------------------------------------------------------*
000119*****************************************************************
000120 01 レコード.
000130   03 レコードキー.
000140      05 公費種別                      PIC 9(2).
000150      05 市町村番号                    PIC X(10).
000160   03 レコードデータ.
000170      05 保険者番号                    PIC X(10).
000180      05 市町村名称                    PIC X(40).
000190      05 支部部署名.
000200         07 支部名                     PIC X(20).
000210         07 部署名                     PIC X(20).
000220      05 市町村カナ                    PIC X(40).
000260      05 請求先区分                    PIC 9.
000280      05 郵便番号.
000290         07 郵便番号１                 PIC X(3).
000300         07 郵便番号２                 PIC X(4).
000310      05 住所.
000320         07 住所１                     PIC X(40).
000330         07 住所２                     PIC X(40).
000340      05 電話番号                      PIC X(15).
000350      05 都道府県ＪＩＳ                PIC X(2).
000360**
000457*     変更予定の受領委任情報 （空き１を再利用）
000458      05 変更後委任情報.
000459*        受領委任開始年月
000460         07 受領委任開始和暦年月.
000461            09 受領委任開始和暦        PIC 9.
000462            09 受領委任開始年月.
000463               11 受領委任開始年       PIC 9(2).
000464               11 受領委任開始月       PIC 9(2).
000465*        開始日付後の受領委任区分
000466         07 受領委任区分後             PIC X(1).
000467*
000468      05 空き１                        PIC X(13).
000490**
000612      05 共済区分                      PIC 9.
000616**
000617**    / 新設 /
000618      05 助成名称エリア.
000619         07 助成種類名称               PIC N(8).
000620         07 助成種類略称               PIC X(6).
000621         05 FILLER                     PIC X(33).
000624**
000960      05 ラベル番号                    PIC X(5).
000961      05 レセまとめ区分                PIC 9.
000962*
000963* 追加
000964      05 レセ宛名                      PIC X(40).
000965*
000970*     現在の受領委任区分(1:受領委任払い　2：償還払い　その他：代理受領(従来請求))
000972      05 受領委任区分                  PIC X(1).
000973*
000974      05 FILLER                        PIC X(11).
000980*
