      *****************************************************************
      * ＴＥＩＫＩＮＯ：定期修正番号Ｆ  ［ＲＬ＝１２８]
      *****************************************************************
      * SYSYTEM NAME:柔 FOR WINNDOWS                                  *
      * LANGUAGE PG :COBOL97 FOR WINDOWS                              *
      * PRODUCT DATE:1998.10.07                                       *
      * AUTHOR      :上田  育正                                       *
      * PURPOSE     :定期修正を行う情報ファイル　　　　　　　         *
      *              フロッピィに定期修正ＰＧと同梱する　　　　　　　 *
      *****************************************************************
       01 レコード.
      *****************************************************************
      * ＣＤ対応：1998.11.04
      *---------------------------------------------------------------*
      * 解凍先を判別する定期修正番号のバイト位置
      * 解凍するバイト位置に１をたてる
      *
      * １：C:\YAW85\YAWOBJ\ ２：C:\YAW85\ ３：C:\YAW85\YAWDLIB\
      * ４：C:\YAW85\YAWDLIB\MASTER\ ５：C:\YAW85\YAWDLIB\COMMON\
      * ６：C:\YAW85\YAWOBJ\TEMP
      * ７：C:\PROGRAM FILES\
      * ８：C:\WINDOWS\
      * ９：C:\WINDOWS\SYSYTEM\
      * 10：C:\
      *
         03 定期修正区分                      PIC X(12).
      *****************************************************************
         03 定期修正番号                      PIC 9(8).
         03 ＦＤ番号                          PIC 9(2).
         03 定期修正ＣＭ                      PIC N(50).
         03 バージョン番号                    PIC 9(2).
         03 レベル番号                        PIC X(3).
         03 FILLER                            PIC X.
