000010*****************************************************************
000020* TEKIYO：摘要ファイル ［ＲＬ＝1920 BYTE］                      *
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000060* LANGUAGE PG :NetCOBOL                                         *
000061* PRODUCT DATE:2010.10.15                                       *
000080* PURPOSE :区分１：レセプト摘要、２：自賠責負傷経過、           *
000081*     ３：労災負傷経過、４：自賠責その他内容、 ５：頻回施術理由 *
000090*****************************************************************
000091*---------------------------------------------------------------*
000092*	新規ファイル
000093*---------------------------------------------------------------*
000094*     SELECT  摘要ファイル    ASSIGN      TO        TEKIYOL
000095*                             ORGANIZATION             IS  INDEXED
000096*                             ACCESS MODE              IS  DYNAMIC
000097*                             RECORD KEY               IS  摘要－制御区分
000098*                                                          摘要－患者コード
000099*                                                          摘要－施術和暦年月
000100*                             ALTERNATE RECORD KEY     IS  摘要－制御区分
000101*                                                          摘要－施術和暦年月
000102*                                                          摘要－患者コード
000106*                             FILE STATUS              IS  状態キー
000107*                             LOCK        MODE         IS  AUTOMATIC.
000108*
000109* FD  摘要ファイル        BLOCK CONTAINS 1     RECORDS.
000110*     COPY TEKIYO         OF    XFDLIB JOINING 摘要 AS PREFIX.
000111*
000112*****************************************************************
000113 01 レコード.
000114   03 レコードキー.
000120     05 制御区分                       PIC 9(2).
000130     05 患者コード.
000140       07 患者番号                     PIC 9(6).
000150       07 枝番                         PIC X.
000151     05 施術和暦年月.
000152       07 施術和暦                     PIC 9.
000153       07 施術年月.
000154         09 施術年                     PIC 9(2).
000155         09 施術月                     PIC 9(2).
000230   03 レコードデータ.
000240     05 摘要                           PIC X(1800).
           05 印刷区分                       PIC 9(1).
000260     05 FILLER                         PIC X(105).
