000010*****************************************************************
000020* ＴＩＫＵＣＯＤＥ：地区マスタ［ＲＬ＝２５６］
000030*****************************************************************
000040* SYSYTEM NAME:柔 FOR WINNDOWS                                  *
000050* LANGUAGE PG :COBOL97 FOR WINDOWS                              *
000060* PRODUCT DATE:2002.04.30                                       *
000080* PURPOSE     :郵便マスタの公共団体コードの地区データを管理     *
000081*****************************************************************
000082*まったく変更なし
000090*****************************************************************
000100 01  レコード.
000110     03  レコードキー.
000111         05  公共団体コード.
000112           07  都道府県コード           PIC 9(2).
000113           07  地方公共団体コード       PIC 9(3).
000150     03  レコードデータ.
000160         05  住所.
000170           07  都道府県名               PIC X(10).
000180           07  市区名                   PIC X(40).
000200         05  住所カナ.
000210           07  都道府県カナ             PIC X(10).
000220           07  市区カナ                 PIC X(40).
000230         05  国保保険者番号             PIC X(10).
000231         05  老人市町村番号             PIC X(10).
000240         05  後期高齢者保険者番号       PIC X(10).
000280         05  FILLER                     PIC X(121).
