000010*****************************************************************
000020* UMEISYO：ユーザ名称マスタ［ＲＬ＝832］                        *
000030*****************************************************************
000040* SYSYTEM NAME:共通                                             *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2009.03.23                                       *
000070* PURPOSE     :区分コード毎に＋名称・略称を管理                 *
000080*****************************************************************
000090*---------------------------------------------------------------*
000100*	新規マスタ（鍼灸のMEISYOから移動したものあり）
000110*---------------------------------------------------------------*
000120*
000130*     SELECT  ユーザ名称マスタ   ASSIGN      TO        UMEISYOL
000140*                                ORGANIZATION             IS  INDEXED
000150*                                ACCESS MODE              IS  DYNAMIC
000160*                                RECORD KEY               IS  ユ名－区分コード
000170*                                                             ユ名－名称コード
000180*                                FILE STATUS              IS  状態キー
000190*                                LOCK        MODE         IS  AUTOMATIC.
000200***
000210* FD  ユーザ名称マスタ      BLOCK   CONTAINS   1   RECORDS.
000220*     COPY UMEISYO          OF  XFDLIB  JOINING   ユ名   AS  PREFIX.
000230*
000240*******************************************************************
000250 01  レコード.
000260     03  レコードキー.
000270         05  区分コード                PIC 9(3).
000280*
000290*******************************************************************
000300* 00：区分コード体系                                            *
000310*1～499柔整
000320*
000330* 1：メモ、2：自賠責の負傷経過、3：レセ適用、4：労災の負傷経過、5：自賠責のその他内容
000331* 6：施術メモ、7：柔整の施術者
000340*REIGAI04 その他料金
000350*
000360*
000370****
000380*501～鍼灸マ
000390* 501：マッサージ傷病名
000400* 502：負傷原因
000410* 503：レセプト摘要
000420* 504：自費の項目
000430* 505：領収書摘要
000440* 506：施術備考
000440* 507：カルテ裏メモ
000450*
000460****
000470*701～共通
000480* 701：来院動機
000481* 702：ＤＭ分類
000490* 703：特殊プリンタ定義
000500*
000510*******************************************************************
000520*
000530         05  名称コード                PIC 9(6).
000540     03  レコードデータ.
000550         05  名称                      PIC X(600).
000560         05  備考                      PIC X(100).
000570         05  数字パラ１                PIC 9(6).
000580         05  数字パラ２                PIC 9(6).
000590         05  FILLER                    PIC X(111).
