#FILE P:\yawara\yaw.option\Powercob\yawpas\Release\Passset.PRC
000001 IDENTIFICATION  DIVISION.
000002* Passset.
000003 PROGRAM-ID.     Passset.
000004 ENVIRONMENT     DIVISION.
000005 CONFIGURATION   SECTION.
#LINE 13
000013 SPECIAL-NAMES.
000014 REPOSITORY.
000015 .
000016 INPUT-OUTPUT    SECTION.
000017 FILE-CONTROL.
000018 DATA            DIVISION.
#LINE 23
000023 LINKAGE         SECTION.
000024 01  POW-FORM IS GLOBAL.
000025   02  POW-SELF PIC S9(9) COMP-5.
000026   02  POW-SUPER  PIC X(4).
000027   02  POW-THIS PIC S9(9) COMP-5.
000028   02  旧パスワード PIC S9(9) COMP-5.
000029   02  新パスワード PIC S9(9) COMP-5.
000030   02  CmStatic1 PIC S9(9) COMP-5.
000031   02  CmStatic2 PIC S9(9) COMP-5.
000032   02  登録ボタン PIC S9(9) COMP-5.
000033   02  CmStatic5 PIC S9(9) COMP-5.
000034   02  戻るボタン PIC S9(9) COMP-5.
000035   02  レベル PIC S9(9) COMP-5.
000036   02  CmStatic6 PIC S9(9) COMP-5.
000037 01  Passset REDEFINES POW-FORM GLOBAL PIC S9(9) COMP-5.
000038 01  POW-CONTROL-ID PIC S9(9) COMP-5.
000039 01  POW-EVENT-ID   PIC S9(9) COMP-5.
000040 01  POW-OLE-PARAM  PIC X(4).
000041 01  POW-OLE-RETURN PIC X(4).
000042 PROCEDURE       DIVISION USING POW-FORM POW-CONTROL-ID POW-EVENT-ID POW-OLE-PARAM POW-OLE-RETURN.
000043     EVALUATE POW-CONTROL-ID
000044     WHEN 117440513
000045     EVALUATE POW-EVENT-ID
000046     WHEN 117440768
000047       CALL "POW-SCRIPTLET1"
000048     END-EVALUATE
000049     WHEN 117440514
000050     EVALUATE POW-EVENT-ID
000051     WHEN 134221827
000052       CALL "POW-SCRIPTLET4"
000053     END-EVALUATE
000054     WHEN 117440515
000055     EVALUATE POW-EVENT-ID
000056     WHEN 134221827
000057       CALL "POW-SCRIPTLET3"
000058     END-EVALUATE
000059     WHEN 117440520
000060     EVALUATE POW-EVENT-ID
000061     WHEN -600
000062       CALL "POW-SCRIPTLET5"
000063     END-EVALUATE
000064     WHEN 117440528
000065     EVALUATE POW-EVENT-ID
000066     WHEN -600
000067       CALL "POW-SCRIPTLET6"
000068     END-EVALUATE
000069     WHEN 117440530
000070     EVALUATE POW-EVENT-ID
000071     WHEN 134221827
000072       CALL "POW-SCRIPTLET2"
000073     END-EVALUATE
000074     END-EVALUATE
000075     EXIT PROGRAM.
000076 IDENTIFICATION  DIVISION.
000077* Passset-Opened.
000078 PROGRAM-ID.     POW-SCRIPTLET1.
000079*<SCRIPT DIVISION="PROCEDURE", CONTROL="Passset", EVENT="Opened", POW-NAME="SCRIPTLET1", TYPE="FORM">
000080 ENVIRONMENT     DIVISION.
000081 DATA            DIVISION.
000082 WORKING-STORAGE SECTION.
#LINE 83,#START,#OTHER
000083 01 POW-0000 PIC S9(18) COMP-5.
000083 01 POW-0001 PIC S9(9) COMP-5.
000083 01 POW-0002 PIC S9(9) COMP-5.
000083 01 POW-0003 PIC S9(9) COMP-5.
000083 01 POW-0004 PIC S9(9) COMP-5.
000083 01 POW-0005 PIC S9(9) COMP-5.
#LINE 82,#END
000083 PROCEDURE       DIVISION.
#LINE 84,#START,INVOKE(84,12)
000084     MOVE -2147409920 TO POW-0000 
000084     MOVE 1 TO POW-0001 
000084     MOVE 0 TO POW-0002 
000084     MOVE 0 TO POW-0003 
000084     MOVE 0 TO POW-0004 
000084     MOVE 0 TO POW-0005 
000084     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000084     POW-0000 VALUE POW-0001 POW-0002 POW-0003 POW-0004 POW-0005 
000084     END-CALL 
000084                                   .
#LINE 84,#END
000085     EXIT PROGRAM.
000086*</SCRIPT>
000087 END PROGRAM     POW-SCRIPTLET1.
000088 IDENTIFICATION  DIVISION.
000089* レベル-Return.
000090 PROGRAM-ID.     POW-SCRIPTLET2.
000091*<SCRIPT DIVISION="PROCEDURE", CONTROL="レベル", EVENT="Return", POW-NAME="SCRIPTLET2", TYPE="ETC">
000092 ENVIRONMENT     DIVISION.
000093 DATA            DIVISION.
000094 WORKING-STORAGE SECTION.
#LINE 95,#START,#OTHER
000095 01 POW-0006 PIC S9(18) COMP-5.
000095 01 POW-0007 PIC S9(9) COMP-5.
000095 01 POW-0008 PIC S9(9) COMP-5.
000095 01 POW-0009 PIC S9(9) COMP-5.
000095 01 POW-0010 PIC S9(9) COMP-5.
000095 01 POW-0011 PIC S9(9) COMP-5.
#LINE 94,#END
000095 PROCEDURE       DIVISION.
#LINE 96,#START,INVOKE(96,12)
000096     MOVE -2147409920 TO POW-0006 
000096     MOVE 1 TO POW-0007 
000096     MOVE 0 TO POW-0008 
000096     MOVE 0 TO POW-0009 
000096     MOVE 0 TO POW-0010 
000096     MOVE 0 TO POW-0011 
000096     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 登録ボタン REFERENCE 
000096     POW-0006 VALUE POW-0007 POW-0008 POW-0009 POW-0010 POW-0011 
000096     END-CALL 
000096                                  .
#LINE 96,#END
000097     EXIT PROGRAM.     
000098*</SCRIPT>
000099 END PROGRAM     POW-SCRIPTLET2.
000100 IDENTIFICATION  DIVISION.
000101* 新パスワード-Return.
000102 PROGRAM-ID.     POW-SCRIPTLET3.
000103*<SCRIPT DIVISION="PROCEDURE", CONTROL="新パスワード", EVENT="Return", POW-NAME="SCRIPTLET3", TYPE="ETC">
000104 ENVIRONMENT     DIVISION.
000105 DATA            DIVISION.
000106 WORKING-STORAGE SECTION.
#LINE 107,#START,#OTHER
000107 01 POW-0012 PIC S9(18) COMP-5.
000107 01 POW-0013 PIC S9(9) COMP-5.
000107 01 POW-0014 PIC S9(9) COMP-5.
000107 01 POW-0015 PIC S9(9) COMP-5.
000107 01 POW-0016 PIC S9(9) COMP-5.
000107 01 POW-0017 PIC S9(9) COMP-5.
#LINE 106,#END
000107 PROCEDURE       DIVISION.
#LINE 108,#START,INVOKE(108,12)
000108     MOVE -2147409920 TO POW-0012 
000108     MOVE 1 TO POW-0013 
000108     MOVE 0 TO POW-0014 
000108     MOVE 0 TO POW-0015 
000108     MOVE 0 TO POW-0016 
000108     MOVE 0 TO POW-0017 
000108     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0012 
000108     VALUE POW-0013 POW-0014 POW-0015 POW-0016 POW-0017 END-CALL 
000108                             .
#LINE 108,#END
000109     EXIT PROGRAM.     
000110*</SCRIPT>
000111 END PROGRAM     POW-SCRIPTLET3.
000112 IDENTIFICATION  DIVISION.
000113* 旧パスワード-Return.
000114 PROGRAM-ID.     POW-SCRIPTLET4.
000115*<SCRIPT DIVISION="PROCEDURE", CONTROL="旧パスワード", EVENT="Return", POW-NAME="SCRIPTLET4", TYPE="ETC">
000116 ENVIRONMENT     DIVISION.
000117 DATA            DIVISION.
000118 WORKING-STORAGE SECTION.
#LINE 119,#START,#OTHER
000119 01 POW-0018 PIC S9(18) COMP-5.
000119 01 POW-0019 PIC S9(9) COMP-5.
000119 01 POW-0020 PIC S9(9) COMP-5.
000119 01 POW-0021 PIC S9(9) COMP-5.
000119 01 POW-0022 PIC S9(9) COMP-5.
000119 01 POW-0023 PIC S9(9) COMP-5.
#LINE 118,#END
000119 PROCEDURE       DIVISION.
#LINE 120,#START,INVOKE(120,12)
000120     MOVE -2147409920 TO POW-0018 
000120     MOVE 1 TO POW-0019 
000120     MOVE 0 TO POW-0020 
000120     MOVE 0 TO POW-0021 
000120     MOVE 0 TO POW-0022 
000120     MOVE 0 TO POW-0023 
000120     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000120     POW-0018 VALUE POW-0019 POW-0020 POW-0021 POW-0022 POW-0023 
000120     END-CALL 
000120                                   .
#LINE 120,#END
000121     EXIT PROGRAM.
000122*</SCRIPT>
000123 END PROGRAM     POW-SCRIPTLET4.
000124 IDENTIFICATION  DIVISION.
000125* 登録ボタン-Click.
000126 PROGRAM-ID.     POW-SCRIPTLET5.
000127*<SCRIPT DIVISION="PROCEDURE", CONTROL="登録ボタン", EVENT="Click", POW-NAME="SCRIPTLET5", TYPE="ETC">
000128 ENVIRONMENT             DIVISION.
000129 INPUT-OUTPUT            SECTION.
000130 FILE-CONTROL.
000131     SELECT  例外マスタ      ASSIGN      TO        REIGAIL
000132                             ORGANIZATION             IS  INDEXED
000133                             ACCESS MODE              IS  DYNAMIC
000134                             RECORD KEY               IS  例０５－区分コード
000135                                                          例０５－番号コード
000136                             FILE STATUS              IS  状態キー
000137                             LOCK        MODE         IS  AUTOMATIC.
000138*****************************************************************
000139*                      DATA DIVISION                             *
000140******************************************************************
000141 DATA                    DIVISION.
000142 FILE                    SECTION.
000143** 例外05(パスワード用)
000144 FD  例外マスタ          BLOCK   CONTAINS   1   RECORDS.
000145     COPY REIGAI05       OF  XFDLIB  JOINING   例０５   AS  PREFIX.
000146*
000147******************************************************************
000148*                WORKING-STORAGE SECTION                         *
000149******************************************************************
000150 WORKING-STORAGE         SECTION.
000151 01 状態キー                      PIC X(2) VALUE SPACE.
000152 01 エラー内容                    PIC X(80) VALUE SPACE.
000153 01 終了フラグ                    PIC X(3) VALUE SPACE.
000154 01 存在フラグ                    PIC X(3) VALUE SPACE.
000155 01 パスワードＷ                  PIC X(6) VALUE SPACE.
000156 01 退避パスワードＷ              PIC X(6) VALUE SPACE.
000157 01 退避レベルＷ                  PIC X    VALUE SPACE.
000158*
000159 01 カウンタ                      PIC 9(3) VALUE ZERO.
000160 01 存在カウンタ                  PIC 9(3) VALUE ZERO.
000161 01 登録カウンタ                  PIC 9(3) VALUE ZERO.
000162*
000163******************************************************************
000164*                      PROCEDURE  DIVISION                       *
000165******************************************************************
#LINE 166,#START,#OTHER
000166 01 POW-0024 PIC S9(18) COMP-5.
000166 01 POW-0025 PIC S9(9) COMP-5.
000166 01 POW-0026 PIC X(8192).
000166 01 POW-0027 PIC S9(9) COMP-5.
000166 01 POW-0028 PIC S9(9) COMP-5.
000166 01 POW-0029 PIC S9(9) COMP-5.
000166 01 POW-0030 PIC S9(9) COMP-5.
000166 01 POW-0031 PIC S9(9) COMP-5.
000166 01 POW-0032 PIC X(8192).
000166 01 POW-0033 PIC S9(9) COMP-5.
000166 01 POW-0034 PIC S9(18) COMP-5.
000166 01 POW-0035 PIC S9(9) COMP-5.
#LINE 165,#END
000166 PROCEDURE               DIVISION.
000167*
000168     PERFORM 入力チェック.
000169     PERFORM ファイルオープン.
000170     PERFORM 情報更新. 
000171     PERFORM ファイル閉鎖.
000172*
000173     PERFORM 画面クリアー.
000174     EXIT PROGRAM.
000175*
000176*================================================================*
000177*================================================================*
000178 入力チェック SECTION.
000179*
#LINE 180,#START,IF(180,12)
000180     MOVE -517 TO POW-0024 
000180     MOVE 2 TO POW-0025 
000180     MOVE 16392 TO POW-0027 
000180     MOVE 3 TO POW-0028 
000180     MOVE 0 TO POW-0029 
000180     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000180     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000180     POW-0029 END-CALL 
000180     IF NOT ( ( POW-0026 = SPACE ) ) 
#LINE 180,#END
#LINE 181,#START,IF(181,15)
000181     MOVE -517 TO POW-0024 
000181     MOVE 2 TO POW-0025 
000181     MOVE 16392 TO POW-0027 
000181     MOVE 3 TO POW-0028 
000181     MOVE 0 TO POW-0029 
000181     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000181     VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 POW-0029 
000181     END-CALL 
000181     IF ( POW-0026 = SPACE ) 
#LINE 181,#END
#LINE 182,#START,INVOKE(182,18)
000182     MOVE 117441026 TO POW-0024 
000182     MOVE 1 TO POW-0025 
000182     MOVE 16387 TO POW-0028 
000182     MOVE 0 TO POW-0029 
000182     MOVE 2 TO POW-0030 
000182     MOVE "レベルを入力してください。" TO POW-0026 
000182     MOVE 33636360 TO POW-0031 
000182     MOVE "メッセージ" TO POW-0032 
000182     MOVE 50413576 TO POW-0033 
000182     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000182     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000182     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000182     END-CALL 
#LINE 182,#END
#LINE 183,#START,INVOKE(183,18)
000183     MOVE -2147409920 TO POW-0024 
000183     MOVE 1 TO POW-0025 
000183     MOVE 0 TO POW-0027 
000183     MOVE 0 TO POW-0028 
000183     MOVE 0 TO POW-0029 
000183     MOVE 0 TO POW-0030 
000183     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000183     VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 END-CALL 
#LINE 183,#END
000184           EXIT PROGRAM
000185        ELSE
#LINE 186,#START,IF(186,17)
000186     MOVE -517 TO POW-0024 
000186     MOVE 2 TO POW-0025 
000186     MOVE 16392 TO POW-0027 
000186     MOVE 3 TO POW-0028 
000186     MOVE 0 TO POW-0029 
000186     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000186     VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 POW-0029 
000186     END-CALL 
000186     MOVE -517 TO POW-0034 
000186     MOVE 2 TO POW-0030 
000186     MOVE 16392 TO POW-0031 
000186     MOVE 3 TO POW-0033 
000186     MOVE 0 TO POW-0035 
000186     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0034 
000186     VALUE POW-0030 POW-0031 REFERENCE POW-0032 VALUE POW-0033 POW-0035 
000186     END-CALL 
000186     IF ( ( POW-0026 < "0" ) OR ( POW-0032 > "5" ) ) 
#LINE 186,#END
#LINE 187,#START,INVOKE(187,20)
000187     MOVE 117441026 TO POW-0024 
000187     MOVE 1 TO POW-0025 
000187     MOVE 16387 TO POW-0028 
000187     MOVE 0 TO POW-0029 
000187     MOVE 2 TO POW-0030 
000187     MOVE "レベルは０から５までの数字を入力してください。" TO POW-0026 
000187     MOVE 33636360 TO POW-0031 
000187     MOVE "メッセージ" TO POW-0032 
000187     MOVE 50413576 TO POW-0033 
000187     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000187     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000187     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000187     END-CALL 
#LINE 187,#END
#LINE 188,#START,INVOKE(188,20)
000188     MOVE -2147409920 TO POW-0024 
000188     MOVE 1 TO POW-0025 
000188     MOVE 0 TO POW-0027 
000188     MOVE 0 TO POW-0028 
000188     MOVE 0 TO POW-0029 
000188     MOVE 0 TO POW-0030 
000188     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000188     VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 END-CALL 
#LINE 188,#END
000189             EXIT PROGRAM
000190          END-IF
000191        END-IF
000192     ELSE
#LINE 193,#START,IF(193,15)
000193     MOVE -517 TO POW-0024 
000193     MOVE 2 TO POW-0025 
000193     MOVE 16392 TO POW-0027 
000193     MOVE 3 TO POW-0028 
000193     MOVE 0 TO POW-0029 
000193     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 旧パスワード REFERENCE 
000193     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000193     POW-0029 END-CALL 
000193     IF NOT ( ( POW-0026 = SPACE ) ) 
#LINE 193,#END
#LINE 194,#START,INVOKE(194,18)
000194     MOVE 117441026 TO POW-0024 
000194     MOVE 1 TO POW-0025 
000194     MOVE 16387 TO POW-0028 
000194     MOVE 0 TO POW-0029 
000194     MOVE 2 TO POW-0030 
000194     MOVE "新しいパスワードを入力してください。" TO POW-0026 
000194     MOVE 33636360 TO POW-0031 
000194     MOVE "メッセージ" TO POW-0032 
000194     MOVE 50413576 TO POW-0033 
000194     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000194     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000194     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000194     END-CALL 
#LINE 194,#END
#LINE 195,#START,INVOKE(195,18)
000195     MOVE -2147409920 TO POW-0024 
000195     MOVE 1 TO POW-0025 
000195     MOVE 0 TO POW-0027 
000195     MOVE 0 TO POW-0028 
000195     MOVE 0 TO POW-0029 
000195     MOVE 0 TO POW-0030 
000195     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000195     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000195     END-CALL 
#LINE 195,#END
000196           EXIT PROGRAM
000197        ELSE
000198*         / 新旧パス未入力（戻る）
#LINE 199,#START,INVOKE(199,18)
000199     MOVE -2147409920 TO POW-0024 
000199     MOVE 1 TO POW-0025 
000199     MOVE 0 TO POW-0027 
000199     MOVE 0 TO POW-0028 
000199     MOVE 0 TO POW-0029 
000199     MOVE 0 TO POW-0030 
000199     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000199     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000199     END-CALL 
#LINE 199,#END
000200           EXIT PROGRAM
000201        END-IF
000202     END-IF.
000203*
000204*================================================================*
000205 ファイルオープン SECTION.
000206*
000207     OPEN I-O 例外マスタ.
000208     IF 状態キー  NOT =  "00"
000209        MOVE SPACE TO エラー内容
000210        STRING "例外マスタオープンエラー:"  DELIMITED BY SIZE
000211                状態キー                    DELIMITED BY SIZE
000212           INTO エラー内容
000213        END-STRING
#LINE 214,#START,INVOKE(214,15)
000214     MOVE 117441026 TO POW-0024 
000214     MOVE 1 TO POW-0025 
000214     MOVE 16387 TO POW-0028 
000214     MOVE 0 TO POW-0029 
000214     MOVE 2 TO POW-0030 
000214     MOVE エラー内容 TO POW-0026 
000214     MOVE 33636360 TO POW-0031 
000214     MOVE "メッセージ" TO POW-0032 
000214     MOVE 50413576 TO POW-0033 
000214     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000214     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000214     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000214     END-CALL 
#LINE 214,#END
000215        EXIT PROGRAM
000216     END-IF.
000217*
000218*================================================================*
000219 情報更新 SECTION.
000220*
#LINE 221,#START,IF(221,12)
000221     MOVE -517 TO POW-0024 
000221     MOVE 2 TO POW-0025 
000221     MOVE 16392 TO POW-0027 
000221     MOVE 3 TO POW-0028 
000221     MOVE 0 TO POW-0029 
000221     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 旧パスワード REFERENCE 
000221     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000221     POW-0029 END-CALL 
000221     IF ( POW-0026 = SPACE ) 
#LINE 221,#END
#LINE 222,#START,IF(222,15)
000222     MOVE -517 TO POW-0024 
000222     MOVE 2 TO POW-0025 
000222     MOVE 16392 TO POW-0027 
000222     MOVE 3 TO POW-0028 
000222     MOVE 0 TO POW-0029 
000222     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000222     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000222     POW-0029 END-CALL 
000222     IF NOT ( ( POW-0026 = SPACE ) ) 
#LINE 222,#END
000223            PERFORM 新規登録
000224        END-IF
000225     ELSE
#LINE 226,#START,IF(226,15)
000226     MOVE -517 TO POW-0024 
000226     MOVE 2 TO POW-0025 
000226     MOVE 16392 TO POW-0027 
000226     MOVE 3 TO POW-0028 
000226     MOVE 0 TO POW-0029 
000226     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000226     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000226     POW-0029 END-CALL 
000226     IF NOT ( ( POW-0026 = SPACE ) ) 
#LINE 226,#END
000227            PERFORM 修正登録
000228        END-IF
000229     END-IF.
000230*
000231*================================================================*
000232 新規登録 SECTION.
000233*
#LINE 234,#START,MOVE(234,12)
000234     MOVE -517 TO POW-0024 
000234     MOVE 2 TO POW-0025 
000234     MOVE 16392 TO POW-0027 
000234     MOVE 3 TO POW-0028 
000234     MOVE 0 TO POW-0029 
000234     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000234     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000234     POW-0029 END-CALL 
000234     MOVE POW-0026 TO パスワードＷ 
000234                                                .
#LINE 234,#END
000235     PERFORM 存在チェック.
000236     IF 存在フラグ = SPACE
000237        IF カウンタ > 90 
#LINE 238,#START,INVOKE(238,18)
000238     MOVE 117441026 TO POW-0024 
000238     MOVE 1 TO POW-0025 
000238     MOVE 16387 TO POW-0028 
000238     MOVE 0 TO POW-0029 
000238     MOVE 2 TO POW-0030 
000238     MOVE "これ以上登録できません。" TO POW-0026 
000238     MOVE 33636360 TO POW-0031 
000238     MOVE "メッセージ" TO POW-0032 
000238     MOVE 50413576 TO POW-0033 
000238     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000238     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000238     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000238     END-CALL 
#LINE 238,#END
000239        ELSE
000240           MOVE カウンタ TO 登録カウンタ
000241           PERFORM 登録処理
000242        END-IF
000243     ELSE
000244        MOVE 存在カウンタ TO 登録カウンタ
000245        PERFORM 登録処理
000246     END-IF.
000247*
000248*================================================================*
000249 修正登録 SECTION.
000250*
#LINE 251,#START,MOVE(251,12)
000251     MOVE -517 TO POW-0024 
000251     MOVE 2 TO POW-0025 
000251     MOVE 16392 TO POW-0027 
000251     MOVE 3 TO POW-0028 
000251     MOVE 0 TO POW-0029 
000251     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 旧パスワード REFERENCE 
000251     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000251     POW-0029 END-CALL 
000251     MOVE POW-0026 TO パスワードＷ 
000251                                                .
#LINE 251,#END
000252     PERFORM 存在チェック.
000253     IF 存在フラグ = SPACE
#LINE 254,#START,INVOKE(254,15)
000254     MOVE 117441026 TO POW-0024 
000254     MOVE 1 TO POW-0025 
000254     MOVE 16387 TO POW-0028 
000254     MOVE 0 TO POW-0029 
000254     MOVE 2 TO POW-0030 
000254     MOVE "古いパスワードが登録されていません。" TO POW-0026 
000254     MOVE 33636360 TO POW-0031 
000254     MOVE "メッセージ" TO POW-0032 
000254     MOVE 50413576 TO POW-0033 
000254     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000254     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000254     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000254     END-CALL 
#LINE 254,#END
#LINE 255,#START,INVOKE(255,15)
000255     MOVE -2147409920 TO POW-0024 
000255     MOVE 1 TO POW-0025 
000255     MOVE 0 TO POW-0027 
000255     MOVE 0 TO POW-0028 
000255     MOVE 0 TO POW-0029 
000255     MOVE 0 TO POW-0030 
000255     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 旧パスワード REFERENCE 
000255     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000255     END-CALL 
#LINE 255,#END
000256        PERFORM ファイル閉鎖
000257        EXIT PROGRAM
000258     ELSE
000259        MOVE 存在カウンタ TO 登録カウンタ
000260        PERFORM 登録処理
000261     END-IF.
000262*
000263*================================================================*
000264 登録処理 SECTION.
000265*
000266*--- 例外マスタ 05 -----*
000267     MOVE 05         TO 例０５－区分コード.
000268     MOVE ZERO       TO 例０５－番号コード.
000269     READ 例外マスタ
000270     INVALID KEY
000271         MOVE SPACE TO 例０５－レコード
000272         INITIALIZE 例０５－レコード
000273         MOVE 05    TO 例０５－区分コード
000274         MOVE ZERO  TO 例０５－番号コード
000275         PERFORM 情報セット
000276         WRITE 例０５－レコード
000277         IF 状態キー  NOT =  "00"
000278            MOVE SPACE TO エラー内容
000279            STRING "例外マスタ05書込みエラー:"  DELIMITED BY SIZE
000280                    状態キー                    DELIMITED BY SIZE
000281               INTO エラー内容
000282            END-STRING
#LINE 283,#START,INVOKE(283,19)
000283     MOVE 117441026 TO POW-0024 
000283     MOVE 1 TO POW-0025 
000283     MOVE 16387 TO POW-0028 
000283     MOVE 0 TO POW-0029 
000283     MOVE 2 TO POW-0030 
000283     MOVE エラー内容 TO POW-0026 
000283     MOVE 33636360 TO POW-0031 
000283     MOVE "メッセージ" TO POW-0032 
000283     MOVE 50413576 TO POW-0033 
000283     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000283     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000283     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000283     END-CALL 
#LINE 283,#END
000284            PERFORM ファイル閉鎖
000285            EXIT PROGRAM
000286         END-IF
000287     NOT INVALID KEY
000288         PERFORM 情報セット
000289         REWRITE 例０５－レコード
000290         IF 状態キー  NOT =  "00"
000291            MOVE SPACE TO エラー内容
000292            STRING "例外マスタ05更新エラー:"  DELIMITED BY SIZE
000293                    状態キー                  DELIMITED BY SIZE
000294               INTO エラー内容
000295            END-STRING
#LINE 296,#START,INVOKE(296,19)
000296     MOVE 117441026 TO POW-0024 
000296     MOVE 1 TO POW-0025 
000296     MOVE 16387 TO POW-0028 
000296     MOVE 0 TO POW-0029 
000296     MOVE 2 TO POW-0030 
000296     MOVE エラー内容 TO POW-0026 
000296     MOVE 33636360 TO POW-0031 
000296     MOVE "メッセージ" TO POW-0032 
000296     MOVE 50413576 TO POW-0033 
000296     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0024 
000296     VALUE POW-0025 POW-0028 REFERENCE POW-0027 VALUE POW-0029 POW-0030 
000296     POW-0031 REFERENCE POW-0026 VALUE POW-0033 REFERENCE POW-0032 
000296     END-CALL 
#LINE 296,#END
000297            PERFORM ファイル閉鎖
000298            EXIT PROGRAM
000299         END-IF
000300     END-READ.
000301*//
000302**
000303*================================================================*
000304 情報セット SECTION.
000305*
#LINE 306,#START,MOVE(306,12)
000306     MOVE -517 TO POW-0024 
000306     MOVE 2 TO POW-0025 
000306     MOVE 16392 TO POW-0027 
000306     MOVE 3 TO POW-0028 
000306     MOVE 0 TO POW-0029 
000306     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000306     POW-0024 VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 
000306     POW-0029 END-CALL 
000306     MOVE POW-0026 TO 退避パスワードＷ 
000306                                                     .
#LINE 306,#END
#LINE 307,#START,MOVE(307,12)
000307     MOVE -517 TO POW-0024 
000307     MOVE 2 TO POW-0025 
000307     MOVE 16392 TO POW-0027 
000307     MOVE 3 TO POW-0028 
000307     MOVE 0 TO POW-0029 
000307     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000307     VALUE POW-0025 POW-0027 REFERENCE POW-0026 VALUE POW-0028 POW-0029 
000307     END-CALL 
000307     MOVE POW-0026 TO 退避レベルＷ 
000307                                                 .
#LINE 307,#END
000308*
000309     MOVE 退避パスワードＷ  TO 例０５－パスワード(登録カウンタ).
000310     MOVE 退避レベルＷ      TO 例０５－レベル(登録カウンタ).
000311*
000312*================================================================*
000313 ファイル閉鎖 SECTION.
000314*
000315     CLOSE 例外マスタ.
000316*
000317*================================================================*
000318 画面クリアー SECTION.
000319*
#LINE 320,#START,MOVE(320,12)
000320     MOVE -517 TO POW-0024 
000320     MOVE 4 TO POW-0025 
000320     MOVE 0 TO POW-0027 
000320     MOVE 0 TO POW-0028 
000320     MOVE 0 TO POW-0029 
000320     MOVE 1 TO POW-0030 
000320     MOVE SPACE TO POW-0026 
000320     MOVE 33636360 TO POW-0031 
000320     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 旧パスワード REFERENCE 
000320     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000320     POW-0031 REFERENCE POW-0026 END-CALL 
000320                                         .
#LINE 320,#END
#LINE 321,#START,MOVE(321,12)
000321     MOVE -517 TO POW-0024 
000321     MOVE 4 TO POW-0025 
000321     MOVE 0 TO POW-0027 
000321     MOVE 0 TO POW-0028 
000321     MOVE 0 TO POW-0029 
000321     MOVE 1 TO POW-0030 
000321     MOVE SPACE TO POW-0026 
000321     MOVE 33636360 TO POW-0031 
000321     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000321     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000321     POW-0031 REFERENCE POW-0026 END-CALL 
000321                                         .
#LINE 321,#END
#LINE 322,#START,MOVE(322,12)
000322     MOVE -517 TO POW-0024 
000322     MOVE 4 TO POW-0025 
000322     MOVE 0 TO POW-0027 
000322     MOVE 0 TO POW-0028 
000322     MOVE 0 TO POW-0029 
000322     MOVE 1 TO POW-0030 
000322     MOVE SPACE TO POW-0026 
000322     MOVE 33636360 TO POW-0031 
000322     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE レベル REFERENCE POW-0024 
000322     VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 POW-0031 
000322     REFERENCE POW-0026 END-CALL 
000322                                   .
#LINE 322,#END
000323*
#LINE 324,#START,INVOKE(324,12)
000324     MOVE -2147409920 TO POW-0024 
000324     MOVE 1 TO POW-0025 
000324     MOVE 0 TO POW-0027 
000324     MOVE 0 TO POW-0028 
000324     MOVE 0 TO POW-0029 
000324     MOVE 0 TO POW-0030 
000324     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 新パスワード REFERENCE 
000324     POW-0024 VALUE POW-0025 POW-0027 POW-0028 POW-0029 POW-0030 
000324     END-CALL 
000324                                   .
#LINE 324,#END
000325*
000326*================================================================*
000327 存在チェック SECTION.
000328*
000329     MOVE SPACE      TO 存在フラグ.
000330     MOVE ZERO       TO 存在カウンタ.
000331     MOVE 1          TO カウンタ.
000332     MOVE 05         TO 例０５－区分コード.
000333     MOVE ZERO       TO 例０５－番号コード.
000334     READ 例外マスタ
000335     NOT INVALID KEY
000336        PERFORM UNTIL ( 存在フラグ                   = "YES" ) OR
000337                      ( 例０５－パスワード(カウンタ) = SPACE ) OR
000338                      ( カウンタ > 90 )
000339            IF 例０５－パスワード(カウンタ) = パスワードＷ
000340                MOVE "YES"    TO 存在フラグ
000341                MOVE カウンタ TO 存在カウンタ
000342            END-IF
000343            COMPUTE カウンタ = カウンタ + 1
000344        END-PERFORM
000345     END-READ
000346*
000347*================================================================*
000348*</SCRIPT>
000349 END PROGRAM     POW-SCRIPTLET5.
000350 IDENTIFICATION  DIVISION.
000351* 戻るボタン-Click.
000352 PROGRAM-ID.     POW-SCRIPTLET6.
000353*<SCRIPT DIVISION="PROCEDURE", CONTROL="戻るボタン", EVENT="Click", POW-NAME="SCRIPTLET6", TYPE="ETC">
000354 ENVIRONMENT     DIVISION.
000355 DATA            DIVISION.
000356 WORKING-STORAGE SECTION.
#LINE 357,#START,#OTHER
000357 01 POW-0036 PIC S9(18) COMP-5.
000357 01 POW-0037 PIC S9(9) COMP-5.
000357 01 POW-0038 PIC S9(9) COMP-5.
000357 01 POW-0039 PIC S9(9) COMP-5.
000357 01 POW-0040 PIC S9(9) COMP-5.
000357 01 POW-0041 PIC S9(9) COMP-5.
#LINE 356,#END
000357 PROCEDURE       DIVISION.
#LINE 358,#START,INVOKE(358,12)
000358     MOVE 117441025 TO POW-0036 
000358     MOVE 1 TO POW-0037 
000358     MOVE 16387 TO POW-0039 
000358     MOVE 0 TO POW-0040 
000358     MOVE 0 TO POW-0041 
000358     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0036 
000358     VALUE POW-0037 POW-0039 REFERENCE POW-0038 VALUE POW-0040 POW-0041 
000358     END-CALL 
000358                                .
#LINE 358,#END
000359*</SCRIPT>
000360 END PROGRAM     POW-SCRIPTLET6.
000361 END PROGRAM     Passset.
#FILE
