#FILE P:\yawara\yaw.option\Powercob\yawpas\Release\yawpas.PRC
000001 IDENTIFICATION  DIVISION.
000002* yawpas.
000003 PROGRAM-ID.     yawpas.
000004 ENVIRONMENT     DIVISION.
000005 CONFIGURATION   SECTION.
#LINE 13
000013 SPECIAL-NAMES.
000014 REPOSITORY.
000015 .
000016 INPUT-OUTPUT    SECTION.
000017 FILE-CONTROL.
000018 DATA            DIVISION.
#LINE 21
000021 WORKING-STORAGE SECTION.
000022*<SCRIPT DIVISION="DATA", SECTION="WORKING-STORAGE">
000023 01  リターンカウント     PIC 9  VALUE ZERO  GLOBAL.
000024*
000025*
000026*
000027********************
000028* システム用ワーク *
000029********************
000030*
000031 01 改行                    PIC X(2)  VALUE X"0D0A" GLOBAL.
000032 01 エラーフラグ            PIC X(3) VALUE SPACE GLOBAL.
000033*
000034 01 起動プログラム名        PIC X(20) VALUE SPACE GLOBAL.
000035*
000036****************************
000037* 特殊環境ファイル用ワーク *
000038*****************************
000039*YENV.DATの1行目情報
000040* 種類(LAN、DIR、NORMAL),会コード,データフォルダ,パスワード画面ありか
000041 01 特殊環境ファイル内容Ｗ GLOBAL.
000042    03 特殊－種類Ｗ             PIC X(10) VALUE SPACE.
000043    03 特殊－協会コードＷ       PIC X(2)  VALUE SPACE.
000044    03 特殊－データフォルダＷ   PIC X(150) VALUE SPACE.
000045    03 特殊－パスワード有Ｗ     PIC X(10) VALUE SPACE.
000046*
000047*</SCRIPT>
#LINE 49
000049 LINKAGE         SECTION.
000050 01  POW-FORM IS GLOBAL.
000051   02  POW-SELF PIC S9(9) COMP-5.
000052   02  POW-SUPER  PIC X(4).
000053   02  POW-THIS PIC S9(9) COMP-5.
000054   02  パスワード PIC S9(9) COMP-5.
000055   02  CmStatic1 PIC S9(9) COMP-5.
000056   02  実行ボタン PIC S9(9) COMP-5.
000057   02  設定ボタン PIC S9(9) COMP-5.
000058   02  起動中ラベル PIC S9(9) COMP-5.
000059 01  yawpas REDEFINES POW-FORM GLOBAL PIC S9(9) COMP-5.
000060 01  POW-CONTROL-ID PIC S9(9) COMP-5.
000061 01  POW-EVENT-ID   PIC S9(9) COMP-5.
000062 01  POW-OLE-PARAM  PIC X(4).
000063 01  POW-OLE-RETURN PIC X(4).
000064 PROCEDURE       DIVISION USING POW-FORM POW-CONTROL-ID POW-EVENT-ID POW-OLE-PARAM POW-OLE-RETURN.
000065     EVALUATE POW-CONTROL-ID
000066     WHEN 117440513
000067     EVALUATE POW-EVENT-ID
000068     WHEN 117440768
000069       CALL "POW-SCRIPTLET1"
000070     END-EVALUATE
000071     WHEN 117440518
000072     EVALUATE POW-EVENT-ID
000073     WHEN 134221827
000074       CALL "POW-SCRIPTLET2"
000075     END-EVALUATE
000076     WHEN 117440520
000077     EVALUATE POW-EVENT-ID
000078     WHEN -600
000079       CALL "POW-SCRIPTLET3"
000080     END-EVALUATE
000081     WHEN 117440521
000082     EVALUATE POW-EVENT-ID
000083     WHEN -600
000084       CALL "POW-SCRIPTLET4"
000085     END-EVALUATE
000086     END-EVALUATE
000087     EXIT PROGRAM.
000088 IDENTIFICATION  DIVISION.
000089* サブ－ＣＢＲデータ－作成.
000090 PROGRAM-ID.     "サブ－ＣＢＲデータ－作成" IS COMMON.
000091*<SCRIPT DIVISION="PROCEDURE", NAME="サブ－ＣＢＲデータ－作成">
000092 ENVIRONMENT     DIVISION.
000093 INPUT-OUTPUT    SECTION.
000094 FILE-CONTROL.
000095     SELECT  旧ファイル      ASSIGN      TO         "C:\MAKISHISYS\YAWOBJ\W85.CBR"
000096                             ORGANIZATION             IS  LINE SEQUENTIAL
000097                             ACCESS MODE              IS  SEQUENTIAL
000098                             FILE        STATUS       IS  状態キー
000099                             LOCK        MODE         IS  AUTOMATIC.
000100*
000101     SELECT  新ファイル      ASSIGN      TO         "C:\MAKISHISYS\YAWOBJ\COBOL85.CBR"
000102                             ORGANIZATION             IS  LINE SEQUENTIAL
000103                             ACCESS MODE              IS  SEQUENTIAL
000104                             FILE        STATUS       IS  状態キー
000105                             LOCK        MODE         IS  AUTOMATIC.
000106*
000107*------------------------------------------------------------------------------------*
000108 DATA            DIVISION.
000109 FILE            SECTION.
000110**
000111* 可変長
000112 FD  旧ファイル
000113      RECORD IS VARYING IN SIZE FROM  1 TO 256 CHARACTERS DEPENDING ON 旧レコード長.
000114 01  旧－レコード.
000115    03 旧－文字列.
000116      05 旧－文字     PIC X(1) OCCURS 1 TO 256 TIMES DEPENDING ON 旧レコード長.
000117*
000118 FD  新ファイル
000119      RECORD IS VARYING IN SIZE FROM  1 TO 256 CHARACTERS DEPENDING ON 新レコード長.
000120 01  新－レコード.
000121    03 新－文字列.
000122      05 新－文字     PIC X(1) OCCURS 1 TO 256 TIMES DEPENDING ON 新レコード長.
000123**
000124* 
000125*================================================================*
000126 WORKING-STORAGE SECTION.
000127*================================================================*
000128 01 状態キー     PIC X(2) VALUE SPACE.
000129 01 終了フラグ   PIC X(3)  VALUE SPACE.
000130 01 終了フラグ１ PIC X(3)  VALUE SPACE.
000131*
000132 01 旧レコード長 PIC 9(3) BINARY VALUE 256.
000133 01 新レコード長 PIC 9(3) BINARY VALUE 256.
000134*
000135 01 カウンタ     PIC S9(3) VALUE ZERO.
000136 01 文字数Ｗ     PIC S9(3) VALUE ZERO.
000137*
000138 01 分院情報内容Ｗ.
000139    03 パス名Ｗ  PIC X(150).
000140*
000141 01 元内容Ｗ     PIC X(256).
000142 01 新内容Ｗ     PIC X(256).
000143*
000144 01 ＬＡＮ区分   PIC 9 VALUE ZERO.
000145*
000146*================================================================*
#LINE 147,#START,#OTHER
000147 01 POW-0000 PIC S9(18) COMP-5.
000147 01 POW-0001 PIC S9(9) COMP-5.
000147 01 POW-0002 PIC S9(9) COMP-5.
000147 01 POW-0003 PIC S9(9) COMP-5.
000147 01 POW-0004 PIC S9(9) COMP-5.
000147 01 POW-0005 PIC S9(9) COMP-5.
000147 01 POW-0006 PIC X(8192).
000147 01 POW-0007 PIC S9(9) COMP-5.
000147 01 POW-0008 PIC X(8192).
000147 01 POW-0009 PIC S9(9) COMP-5.
#LINE 146,#END
000147 PROCEDURE       DIVISION.
000148*================================================================*
000149***********
000150* 初期処理 *
000151***********
000152     PERFORM 初期化.
000153***********
000154* 主処理   *
000155***********
000156     PERFORM ファイル作成処理.
000157***********
000158* 終了処理 *
000159***********
000160     PERFORM 終了処理.
000161     EXIT PROGRAM.
000162*
000163*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
000164*================================================================*
000165 初期化 SECTION.
000166*================================================================*
000167     PERFORM ファイルオープン.
000168*
000169*================================================================*
000170 ファイルオープン SECTION.
000171*
000172     OPEN OUTPUT 新ファイル.
000173     IF ( 状態キー  NOT =  "00" )
#LINE 174,#START,INVOKE(174,15)
000174     MOVE 117441026 TO POW-0000 
000174     MOVE 1 TO POW-0001 
000174     MOVE 16387 TO POW-0003 
000174     MOVE 0 TO POW-0004 
000174     MOVE 2 TO POW-0005 
000174     MOVE "新ファイルが異常です（ＯＰ）" TO POW-0006 
000174     MOVE 33636360 TO POW-0007 
000174     MOVE "メッセージ" TO POW-0008 
000174     MOVE 50413576 TO POW-0009 
000174     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0000 
000174     VALUE POW-0001 POW-0003 REFERENCE POW-0002 VALUE POW-0004 POW-0005 
000174     POW-0007 REFERENCE POW-0006 VALUE POW-0009 REFERENCE POW-0008 
000174     END-CALL 
#LINE 174,#END
000175        PERFORM ファイル閉鎖
000176        MOVE "YES" TO エラーフラグ
000177        EXIT PROGRAM
000178     END-IF.
000179     OPEN INPUT  旧ファイル.
000180     IF ( 状態キー  NOT =  "00" )
#LINE 181,#START,INVOKE(181,15)
000181     MOVE 117441026 TO POW-0000 
000181     MOVE 1 TO POW-0001 
000181     MOVE 16387 TO POW-0003 
000181     MOVE 0 TO POW-0004 
000181     MOVE 2 TO POW-0005 
000181     MOVE "旧ファイルが異常です（ＯＰ）" TO POW-0006 
000181     MOVE 33636360 TO POW-0007 
000181     MOVE "メッセージ" TO POW-0008 
000181     MOVE 50413576 TO POW-0009 
000181     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0000 
000181     VALUE POW-0001 POW-0003 REFERENCE POW-0002 VALUE POW-0004 POW-0005 
000181     POW-0007 REFERENCE POW-0006 VALUE POW-0009 REFERENCE POW-0008 
000181     END-CALL 
#LINE 181,#END
000182        PERFORM ファイル閉鎖
000183        MOVE "YES" TO エラーフラグ
000184        EXIT PROGRAM
000185     END-IF.
000186*
000187*================================================================*
000188 ファイル作成処理 SECTION.
000189*================================================================*
000190*
000191     IF 特殊－種類Ｗ = "LAN"
000192        MOVE 1    TO ＬＡＮ区分
000193     ELSE
000194        MOVE ZERO TO ＬＡＮ区分
000195     END-IF.
000196*   
000197     INITIALIZE 分院情報内容Ｗ.
000198*
000199     MOVE 特殊－データフォルダＷ TO パス名Ｗ.
000200*
000201     IF ( パス名Ｗ = SPACE )
#LINE 202,#START,INVOKE(202,18)
000202     MOVE 117441026 TO POW-0000 
000202     MOVE 1 TO POW-0001 
000202     MOVE 16387 TO POW-0003 
000202     MOVE 0 TO POW-0004 
000202     MOVE 2 TO POW-0005 
000202     MOVE "データフォルダが指定されていません。" TO POW-0006 
000202     MOVE 33636360 TO POW-0007 
000202     MOVE "メッセージ" TO POW-0008 
000202     MOVE 50413576 TO POW-0009 
000202     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0000 
000202     VALUE POW-0001 POW-0003 REFERENCE POW-0002 VALUE POW-0004 POW-0005 
000202     POW-0007 REFERENCE POW-0006 VALUE POW-0009 REFERENCE POW-0008 
000202     END-CALL 
#LINE 202,#END
000203           MOVE "YES" TO エラーフラグ
000204     ELSE
000205           PERFORM VARYING 文字数Ｗ FROM 150 BY -1 
000206                   UNTIL ( 文字数Ｗ <= ZERO ) OR ( パス名Ｗ(文字数Ｗ:1) NOT = SPACE )
000207              CONTINUE
000208           END-PERFORM         
000209           PERFORM ファイル更新処理
000210     END-IF.
000211*
000212*================================================================*
000213 ファイル更新処理 SECTION.
000214*================================================================*
000215** 旧ファイルの内容を転記
000216     MOVE SPACE TO 終了フラグ１.
000217     PERFORM  旧ファイル読込.
000218*
000219     PERFORM UNTIL ( 終了フラグ１ = "YES" )
000220         MOVE SPACE        TO 元内容Ｗ
000221         MOVE 旧－レコード TO 元内容Ｗ
000222         MOVE SPACE        TO 新内容Ｗ
000223         PERFORM パス変更処理
000224         MOVE 新内容Ｗ     TO 新－レコード
000225         PERFORM 新データ書込
000226*
000227         PERFORM  旧ファイル読込
000228     END-PERFORM.
000229*
000230*================================================================*
000231 旧ファイル読込 SECTION.
000232*================================================================*
000233     READ 旧ファイル NEXT
000234     AT END
000235         MOVE "YES" TO 終了フラグ１
000236     END-READ.
000237*
000238*================================================================*
000239 パス変更処理 SECTION.
000240*================================================================*
000241     EVALUATE 元内容Ｗ(1:6)
000242     WHEN "JUSINJ"
000243         IF 元内容Ｗ(1:7) = "JUSINJ2"
000244            STRING "JUSINJ2L="            DELIMITED BY SIZE
000245                   パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000246                   "DATA\JUSINJ2.DAT"   DELIMITED BY SIZE
000247                INTO 新内容Ｗ
000248            END-STRING
000249         ELSE
000250            STRING "JUSINJL="             DELIMITED BY SIZE
000251                   パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000252                   "DATA\JUSINJ.DAT"   DELIMITED BY SIZE
000253                INTO 新内容Ｗ
000254            END-STRING
000255         END-IF
000256     WHEN "UKETUK"
000257         STRING "UKETUKEL="            DELIMITED BY SIZE
000258                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000259                "DATA\UKETUKE.DAT"  DELIMITED BY SIZE
000260             INTO 新内容Ｗ
000261         END-STRING
000262     WHEN "SEKIRO"
000263         STRING "SEKIROKL="            DELIMITED BY SIZE
000264                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000265                "DATA\SEKIROK.DAT"  DELIMITED BY SIZE
000266             INTO 新内容Ｗ
000267         END-STRING
000268     WHEN "HUSYOU"
000269         STRING "HUSYOUL="             DELIMITED BY SIZE
000270                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000271                "DATA\HUSYOU.DAT"   DELIMITED BY SIZE
000272             INTO 新内容Ｗ
000273         END-STRING
000274     WHEN "HUGEIN"
000275         STRING "HUGEINL="             DELIMITED BY SIZE
000276                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000277                "DATA\HUGEIN.DAT"   DELIMITED BY SIZE
000278             INTO 新内容Ｗ
000279         END-STRING
000280     WHEN "CHOKEI"
000281         STRING "CHOKEIL="             DELIMITED BY SIZE
000282                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000283                "DATA\CHOKEI.DAT"   DELIMITED BY SIZE
000284             INTO 新内容Ｗ
000285         END-STRING
000286     WHEN "KAIKEI"
000287         STRING "KAIKEIL="             DELIMITED BY SIZE
000288                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000289                "DATA\KAIKEI.DAT"   DELIMITED BY SIZE
000290             INTO 新内容Ｗ
000291         END-STRING
000292     WHEN "MEMOL="
000293         STRING "MEMOL="               DELIMITED BY SIZE
000294                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000295                "DATA\MEMO.DAT"     DELIMITED BY SIZE
000296             INTO 新内容Ｗ
000297         END-STRING
000298     WHEN "RECEPT"
000299         STRING "RECEPTL="             DELIMITED BY SIZE
000300                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000301                "DATA\RECEPT.DAT"   DELIMITED BY SIZE
000302             INTO 新内容Ｗ
000303         END-STRING
000304     WHEN "NYUKIN"
000305         STRING "NYUKINL="             DELIMITED BY SIZE
000306                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000307                "DATA\NYUKIN.DAT"   DELIMITED BY SIZE
000308             INTO 新内容Ｗ
000309         END-STRING
000310     WHEN "KARUTE"
000311         STRING "KARUTEL="             DELIMITED BY SIZE
000312                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000313                "DATA\KARUTE.DAT"   DELIMITED BY SIZE
000314             INTO 新内容Ｗ
000315         END-STRING
000316     WHEN "SYOMEI"
000317         STRING "SYOMEIRL="            DELIMITED BY SIZE
000318                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000319                "DATA\SYOMEIRR.DAT"    DELIMITED BY SIZE
000320             INTO 新内容Ｗ
000321         END-STRING
000322     WHEN "JIGYOS"
000323         STRING "JIGYOSL="                    DELIMITED BY SIZE
000324                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000325                "DATA\MASTER\JIGYOS.DAT"   DELIMITED BY SIZE
000326             INTO 新内容Ｗ
000327         END-STRING
000328     WHEN "SEIGYO"
000329         IF ＬＡＮ区分 = 1
000330            MOVE "SEIGYOL=C:\MAKISHISYS\DATA\MASTER\SEIGYO.DAT" TO 新内容Ｗ      
000331         ELSE
000332           STRING "SEIGYOL="                    DELIMITED BY SIZE
000333                  パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000334                  "DATA\MASTER\SEIGYO.DAT"   DELIMITED BY SIZE
000335               INTO 新内容Ｗ
000336           END-STRING
000337         END-IF
000338     WHEN "SEJOHO"
000339         STRING "SEJOHOL="                    DELIMITED BY SIZE
000340                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000341                "DATA\MASTER\SEJOHO.DAT"   DELIMITED BY SIZE
000342             INTO 新内容Ｗ
000343         END-STRING
000344     WHEN "IDKANR"
000345         STRING "IDKANRL="                    DELIMITED BY SIZE
000346                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000347               "DATA\MASTER\IDKANR.DAT"   DELIMITED BY SIZE
000348            INTO 新内容Ｗ
000349         END-STRING
000350     WHEN "CHORIY"
000351         STRING "CHORIYUL="                   DELIMITED BY SIZE
000352                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000353                "DATA\MASTER\CHORIYU.DAT"   DELIMITED BY SIZE
000354             INTO 新内容Ｗ
000355         END-STRING
000356     WHEN "REIGAI"
000357         STRING "REIGAIL="                   DELIMITED BY SIZE
000358                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000359                "DATA\MASTER\REIGAI.DAT"   DELIMITED BY SIZE
000360             INTO 新内容Ｗ
000361         END-STRING
000362     WHEN "HOKENE"
000363         STRING "HOKENEXL="                   DELIMITED BY SIZE
000364                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000365                "DATA\MASTER\HOKENEX.DAT"   DELIMITED BY SIZE
000366             INTO 新内容Ｗ
000367         END-STRING
000368     WHEN "BARKAN"
000369         STRING "BARKANRL="                   DELIMITED BY SIZE
000370                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000371                "DATA\MASTER\BARKANR.DAT"  DELIMITED BY SIZE
000372             INTO 新内容Ｗ
000373         END-STRING
000374     WHEN "BANGOK"
000375         STRING "BANGOKL="                    DELIMITED BY SIZE
000376                パス名Ｗ(1:文字数Ｗ)          DELIMITED BY SIZE
000377                "DATA\MASTER\BANGOK.DAT"   DELIMITED BY SIZE
000378             INTO 新内容Ｗ
000379         END-STRING
000380*
000381     WHEN "HHUSYO"
000382         STRING "HHUSYOUL="             DELIMITED BY SIZE
000383                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000384                "DATA\H_HUSYOU.DAT"  DELIMITED BY SIZE
000385             INTO 新内容Ｗ
000386         END-STRING
000387     WHEN "HRECEL"
000388         STRING "HRECEL="               DELIMITED BY SIZE
000389                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000390                "DATA\H_RECE.DAT"    DELIMITED BY SIZE
000391             INTO 新内容Ｗ
000392         END-STRING
000393     WHEN "HNIKEI"
000394         STRING "HNIKEIL="              DELIMITED BY SIZE
000395                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000396                "DATA\H_NIKEI.DAT"   DELIMITED BY SIZE
000397             INTO 新内容Ｗ
000398         END-STRING
000399     WHEN "HSEJOH"
000400         STRING "HSEJOHOL="                     DELIMITED BY SIZE
000401                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000402                "DATA\MASTER\H_SEJOHO.DAT"   DELIMITED BY SIZE
000403             INTO 新内容Ｗ
000404         END-STRING
000405     WHEN "HSETAN"
000406         STRING "HSETANTL="                     DELIMITED BY SIZE
000407                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000408                "DATA\MASTER\H_SETANT.DAT"   DELIMITED BY SIZE
000409             INTO 新内容Ｗ
000410         END-STRING
000411*
000412     WHEN "RYOSYU"
000413         STRING "RYOSYUL="              DELIMITED BY SIZE
000414                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000415                "DATA\RYOSYU.DAT"   DELIMITED BY SIZE
000416             INTO 新内容Ｗ
000417         END-STRING
000418     WHEN "ROUSAI"
000419         STRING "ROUSAIJL="              DELIMITED BY SIZE
000420                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000421                "DATA\ROUSAIJ.DAT"   DELIMITED BY SIZE
000422             INTO 新内容Ｗ
000423         END-STRING
000424     WHEN "JIBAIJ"
000425         STRING "JIBAIJL="              DELIMITED BY SIZE
000426                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000427                "DATA\JIBAIJ.DAT"   DELIMITED BY SIZE
000428             INTO 新内容Ｗ
000429         END-STRING
000430     WHEN "SEIHOJ"
000431         STRING "SEIHOJL="              DELIMITED BY SIZE
000432                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000433                "DATA\SEIHOJ.DAT"   DELIMITED BY SIZE
000434             INTO 新内容Ｗ
000435         END-STRING
000436     WHEN "DMKIRO"
000437         STRING "DMKIROKL="              DELIMITED BY SIZE
000438                パス名Ｗ(1:文字数Ｗ)     DELIMITED BY SIZE
000439                "DATA\DMKIROK.DAT"   DELIMITED BY SIZE
000440             INTO 新内容Ｗ
000441         END-STRING
000442     WHEN "HNOURY"
000443         STRING "HNOURYOL="             DELIMITED BY SIZE
000444                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000445                "DATA\H_NOURYO.DAT"   DELIMITED BY SIZE
000446             INTO 新内容Ｗ
000447         END-STRING
000448     WHEN "TEKIYO"
000449         STRING "TEKIYOL="             DELIMITED BY SIZE
000450                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000451                "DATA\TEKIYO.DAT"   DELIMITED BY SIZE
000452             INTO 新内容Ｗ
000453         END-STRING
000454     WHEN "HNOYOT"
000455         STRING "HNOYOTEL="             DELIMITED BY SIZE
000456                パス名Ｗ(1:文字数Ｗ)    DELIMITED BY SIZE
000457                "DATA\H_NOYOTE.DAT"   DELIMITED BY SIZE
000458             INTO 新内容Ｗ
000459         END-STRING
000460     WHEN "RECERJ"
000461         STRING "RECERJL="             DELIMITED BY SIZE
000462                パス名Ｗ(1:文字数Ｗ)   DELIMITED BY SIZE
000463                "DATA\RECERJ.DAT"   DELIMITED BY SIZE
000464             INTO 新内容Ｗ
000465         END-STRING
000466**
000467     WHEN "KINRIN"
000468         STRING "KINRINL="                     DELIMITED BY SIZE
000469                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000470                "DATA\MASTER\KINRIN.DAT"   DELIMITED BY SIZE
000471             INTO 新内容Ｗ
000472         END-STRING
000473     WHEN "KENSAK"
000474         IF ＬＡＮ区分 = 1
000475            MOVE "KENSAKUL=C:\MAKISHISYS\DATA\MASTER\KENSAKU.DAT" TO 新内容Ｗ      
000476         ELSE
000477            STRING "KENSAKUL="                     DELIMITED BY SIZE
000478                   パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000479                   "DATA\MASTER\KENSAKU.DAT"   DELIMITED BY SIZE
000480                INTO 新内容Ｗ
000481            END-STRING
000482         END-IF
000483     WHEN "HISHIL"
000484         STRING "HISHIL="                       DELIMITED BY SIZE
000485                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000486                "DATA\MASTER\H_ISHI.DAT"     DELIMITED BY SIZE
000487             INTO 新内容Ｗ
000488         END-STRING
000489     WHEN "UMEISY"
000490         STRING "UMEISYOL="                     DELIMITED BY SIZE
000491                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000492                "DATA\MASTER\UMEISYO.DAT"   DELIMITED BY SIZE
000493             INTO 新内容Ｗ
000494         END-STRING
000495     WHEN "HSEIGY"
000496         IF ＬＡＮ区分 = 1
000497            MOVE "HSEIGYOL=C:\MAKISHISYS\DATA\MASTER\H_SEIGYO.DAT" TO 新内容Ｗ      
000498         ELSE
000499             STRING "HSEIGYOL="                     DELIMITED BY SIZE
000500                    パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000501                    "DATA\MASTER\H_SEIGYO.DAT"   DELIMITED BY SIZE
000502                 INTO 新内容Ｗ
000503             END-STRING
000504         END-IF        
000505     WHEN "SISETJ"
000506         STRING "SISETJUL="                     DELIMITED BY SIZE
000507                パス名Ｗ(1:文字数Ｗ)            DELIMITED BY SIZE
000508                "DATA\MASTER\SISETJU.DAT"   DELIMITED BY SIZE
000509             INTO 新内容Ｗ
000510         END-STRING
000511     WHEN "SISETU"
000512         STRING "SISETUL="                     DELIMITED BY SIZE
000513                パス名Ｗ(1:文字数Ｗ)           DELIMITED BY SIZE
000514                "DATA\MASTER\SISETU.DAT"   DELIMITED BY SIZE
000515             INTO 新内容Ｗ
000516         END-STRING
000517**
000518     WHEN OTHER
000519         MOVE 元内容Ｗ TO 新内容Ｗ
000520     END-EVALUATE.
000521*
000522     PERFORM VARYING カウンタ FROM 256 BY -1 
000523             UNTIL ( カウンタ <= ZERO ) OR ( 新内容Ｗ(カウンタ:1) NOT = SPACE )
000524        CONTINUE
000525     END-PERFORM.
000526     MOVE カウンタ TO 新レコード長.
000527*
000528*================================================================*
000529 新データ書込 SECTION.
000530*================================================================*
000531     WRITE 新－レコード.
000532     IF ( 状態キー NOT = "00" )
#LINE 533,#START,INVOKE(533,15)
000533     MOVE 117441026 TO POW-0000 
000533     MOVE 1 TO POW-0001 
000533     MOVE 16387 TO POW-0003 
000533     MOVE 0 TO POW-0004 
000533     MOVE 2 TO POW-0005 
000533     MOVE "新ファイルが異常です（ＷＲ）" TO POW-0006 
000533     MOVE 33636360 TO POW-0007 
000533     MOVE "メッセージ" TO POW-0008 
000533     MOVE 50413576 TO POW-0009 
000533     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0000 
000533     VALUE POW-0001 POW-0003 REFERENCE POW-0002 VALUE POW-0004 POW-0005 
000533     POW-0007 REFERENCE POW-0006 VALUE POW-0009 REFERENCE POW-0008 
000533     END-CALL 
#LINE 533,#END
000534        MOVE "YES" TO エラーフラグ
000535     END-IF.
000536*
000537*================================================================*
000538 終了処理 SECTION.
000539*================================================================*
000540     PERFORM ファイル閉鎖.
000541*
000542*================================================================*
000543 ファイル閉鎖 SECTION.
000544*
000545     CLOSE 旧ファイル 新ファイル.
000546*
000547*</SCRIPT>
000548 END PROGRAM     "サブ－ＣＢＲデータ－作成".
000549 IDENTIFICATION  DIVISION.
000550* yawpas-Opened.
000551 PROGRAM-ID.     POW-SCRIPTLET1.
000552*<SCRIPT DIVISION="PROCEDURE", CONTROL="yawpas", EVENT="Opened", POW-NAME="SCRIPTLET1", TYPE="FORM">
000553 ENVIRONMENT             DIVISION.
000554 INPUT-OUTPUT            SECTION.
000555 FILE-CONTROL.
000556*
000557     SELECT  特殊環境ファイル    ASSIGN      TO       "C:\MAKISHISYS\DATA\COMMON\YENV.DAT"
000558                             ORGANIZATION             IS  LINE SEQUENTIAL
000559                             ACCESS MODE              IS  SEQUENTIAL
000560                             FILE        STATUS       IS  状態キー
000561                             LOCK        MODE         IS  AUTOMATIC.
000562*
000563*****************************************************************
000564*                      DATA DIVISION                             *
000565******************************************************************
000566 DATA                    DIVISION.
000567 FILE                    SECTION.
000568* 可変長
000569 FD 特殊環境ファイル
000570      RECORD IS VARYING IN SIZE FROM  1 TO 500 CHARACTERS DEPENDING ON レコード長.
000571 01 入－レコード.
000572    03 文字列.
000573       05 文字 PIC X OCCURS 1 TO 500 TIMES DEPENDING ON レコード長.
000574*
000575******************************************************************
000576*                WORKING-STORAGE SECTION                         *
000577******************************************************************
000578 WORKING-STORAGE         SECTION.
000579 01 状態キー                      PIC X(2) VALUE SPACE.
000580 01 エラー内容                    PIC X(80) VALUE SPACE.
000581 01 レコード長                    PIC 9(4) BINARY VALUE 500.
000582 01 終了フラグ                    PIC X(3) VALUE SPACE.
000583*
000584 01 内容Ｗ            PIC X(500) VALUE SPACE.
000585*
000586*--- Msgbox用 ---*
000587 01  STYL           PIC S9(9) COMP-5.
000588 01  RET            PIC S9(9) COMP-5.
000589 01  メッセージＷ   PIC X(128) VALUE SPACE.
000590*
000591*--- コピーC 連携用 ---*
000592 01  元ファイル名Ｗ PIC X(80) VALUE "C:\MAKISHISYS\YAWOBJ\COBOL85.CBR".
000593 01  先ファイル名Ｗ PIC X(80) VALUE "C:\MAKISHISYS\YAWOBJ\W85.CBR".
000594 01  プログラム名Ｗ PIC X(8)  VALUE "filsave".
000595*
000596******************************************************************
000597*                      PROCEDURE  DIVISION                       *
000598******************************************************************
#LINE 599,#START,#OTHER
000599 01 POW-0010 PIC S9(18) COMP-5.
000599 01 POW-0011 PIC S9(9) COMP-5.
000599 01 POW-0012 PIC S9(9) COMP-5.
000599 01 POW-0013 PIC S9(9) COMP-5.
000599 01 POW-0014 PIC S9(9) COMP-5.
000599 01 POW-0015 PIC S9(9) COMP-5.
000599 01 POW-0016 PIC S9(9) COMP-5.
000599 01 POW-0017 PIC S9(9) COMP-5.
000599 01 POW-0018 PIC X(8192).
000599 01 POW-0019 PIC X(8192).
000599 01 POW-0020 PIC S9(4) COMP-5.
000599 01 POW-0021 PIC S9(9) COMP-5.
000599 01 POW-0022 PIC S9(9) COMP-5.
#LINE 598,#END
000599 PROCEDURE               DIVISION.
000600*------------------------------------------------------------------------------*
000601* 特殊環境ファイル YENV.DAT
000602*
000603* 種類(LAN、DIR、NORMAL),会コード,データフォルダ,パスワード画面ありか
000604*
000605*※会コードは意味なし
000606*
000607*
000608*LAN
000609* LAN,01,\\HOST\,
#LINE 611
000611*LANでパスワードあり
000612* LAN,01,\\HOST\,PASS
#LINE 614
000614*別フォルダ
000615* DIR,01,c:\makishisys\柔個別\,
#LINE 617
000617*別フォルダでパスワードあり
000618* DIR,01,c:\makishisys\柔個別\,PASS
#LINE 620
000620*ノーマルでパスワードあり
000621* NORMAL,01,,PASS
000622*
000623*------------------------------------------------------------------------------*
000624**
000625** 起動中ラベルの位置を中心にする。
#LINE 626,#START,MOVE(626,12)
000626     MOVE -2147414016 TO POW-0010 
000626     MOVE 4 TO POW-0011 
000626     MOVE 0 TO POW-0012 
000626     MOVE 0 TO POW-0013 
000626     MOVE 0 TO POW-0014 
000626     MOVE 1 TO POW-0015 
000626     MOVE 210 TO POW-0016 
000626     MOVE 33636355 TO POW-0017 
000626     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 起動中ラベル REFERENCE 
000626     POW-0010 VALUE POW-0011 POW-0012 POW-0013 POW-0014 POW-0015 
000626     POW-0017 REFERENCE POW-0016 END-CALL 
000626                                       .
#LINE 626,#END
#LINE 627,#START,MOVE(627,12)
000627     MOVE -2147414015 TO POW-0010 
000627     MOVE 4 TO POW-0011 
000627     MOVE 0 TO POW-0012 
000627     MOVE 0 TO POW-0013 
000627     MOVE 0 TO POW-0014 
000627     MOVE 1 TO POW-0015 
000627     MOVE 255 TO POW-0016 
000627     MOVE 33636355 TO POW-0017 
000627     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 起動中ラベル REFERENCE 
000627     POW-0010 VALUE POW-0011 POW-0012 POW-0013 POW-0014 POW-0015 
000627     POW-0017 REFERENCE POW-0016 END-CALL 
000627                                      .
#LINE 627,#END
000628**
000629**
000630     OPEN INPUT 特殊環境ファイル.
000631     IF 状態キー  =  "35"
#LINE 632,#START,INVOKE(632,15)
000632     MOVE 117441026 TO POW-0010 
000632     MOVE 1 TO POW-0011 
000632     MOVE 16387 TO POW-0013 
000632     MOVE 0 TO POW-0014 
000632     MOVE 2 TO POW-0015 
000632     MOVE "特殊環境ファイルが無いので起動できません。" TO POW-0018 
000632     MOVE 33636360 TO POW-0016 
000632     MOVE "メッセージ" TO POW-0019 
000632     MOVE 50413576 TO POW-0017 
000632     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000632     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000632     POW-0016 REFERENCE POW-0018 VALUE POW-0017 REFERENCE POW-0019 
000632     END-CALL 
#LINE 632,#END
000633        PERFORM 異常終了
000634     ELSE
000635        IF 状態キー  NOT =  "00"
#LINE 636,#START,INVOKE(636,18)
000636     MOVE 117441026 TO POW-0010 
000636     MOVE 1 TO POW-0011 
000636     MOVE 16387 TO POW-0013 
000636     MOVE 0 TO POW-0014 
000636     MOVE 2 TO POW-0015 
000636     MOVE "特殊環境ファイルOPENエラー。起動できません。" TO POW-0018 
000636     MOVE 33636360 TO POW-0016 
000636     MOVE "メッセージ" TO POW-0019 
000636     MOVE 50413576 TO POW-0017 
000636     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000636     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000636     POW-0016 REFERENCE POW-0018 VALUE POW-0017 REFERENCE POW-0019 
000636     END-CALL 
#LINE 636,#END
000637           PERFORM 異常終了
000638        END-IF   
000639     END-IF.
000640**
000641*     
000642** // 特殊環境ファイル１行目読込み //
000643     MOVE SPACE  TO 内容Ｗ 特殊環境ファイル内容Ｗ.
000644     MOVE SPACE  TO 終了フラグ.
000645     PERFORM 特殊環境ファイル読込.
000646*
000647     IF 終了フラグ NOT = "YES"
000648        MOVE 入－レコード TO 内容Ｗ
000649        IF 内容Ｗ NOT = SPACE
000650*         GLOBALへセット
000651            UNSTRING  内容Ｗ  DELIMITED BY "," 
000652                      INTO  特殊－種類Ｗ
000653                            特殊－協会コードＷ
000654                            特殊－データフォルダＷ
000655                            特殊－パスワード有Ｗ
000656            END-UNSTRING
000657        END-IF
000658     END-IF.   
000659*
000660     CLOSE 特殊環境ファイル.
000661*
000662*     IF 特殊－協会コードＷ = SPACE
000663*        INVOKE POW-SELF "DisplayMessage" USING "特殊環境ファイルの内容が異常です。起動できません。" "メッセージ"
000664*        PERFORM 異常終了
000665*     END-IF.   
000666*
000667*     STRING "YAWARA"             DELIMITED BY SIZE
000668*            特殊－協会コードＷ  DELIMITED BY SIZE
000669*            ".EXE"              DELIMITED BY SIZE
000670*     INTO 起動プログラム名.
000671*
000672      MOVE "YAWARA01" TO 起動プログラム名.
000673*
000674*------------------------------------------------------*
000675*
000676     IF 特殊－種類Ｗ  = "LAN" OR "DIR"
000677*
000678*---    ＣＢＲ退避 (元ファイル → 先ファイル) ---*
000679         CALL プログラム名Ｗ WITH C LINKAGE
000680               USING BY REFERENCE 元ファイル名Ｗ
000681                     BY REFERENCE 先ファイル名Ｗ
000682*
000683         IF ( PROGRAM-STATUS = ZERO )
000684*---        ＣＢＲ作成 ---*
000685            MOVE SPACE TO エラーフラグ
000686            CALL "サブ－ＣＢＲデータ－作成"
000687*
000688            IF ( エラーフラグ NOT = SPACE )
000689*---           ＣＢＲ復元 (先ファイル → 元ファイル) ---*
000690               CALL プログラム名Ｗ WITH C LINKAGE
000691                         USING BY REFERENCE 先ファイル名Ｗ
000692                               BY REFERENCE 元ファイル名Ｗ
#LINE 693,#START,INVOKE(693,22)
000693     MOVE 117441026 TO POW-0010 
000693     MOVE 1 TO POW-0011 
000693     MOVE 16387 TO POW-0013 
000693     MOVE 0 TO POW-0014 
000693     MOVE 2 TO POW-0015 
000693     MOVE "ＣＢＲ作成に失敗しました。起動できません。" TO POW-0018 
000693     MOVE 33636360 TO POW-0016 
000693     MOVE "メッセージ" TO POW-0019 
000693     MOVE 50413576 TO POW-0017 
000693     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000693     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000693     POW-0016 REFERENCE POW-0018 VALUE POW-0017 REFERENCE POW-0019 
000693     END-CALL 
#LINE 693,#END
000694               PERFORM 異常終了
000695            END-IF
000696*
000697         ELSE
000698            PERFORM データ退避エラー
000699         END-IF
000700     END-IF.
000701*
000702*------------------------------------------------------*
000703*
000704*    パスワード画面ありか
000705     IF 特殊－パスワード有Ｗ  = "PASS"
#LINE 706,#START,MOVE(706,15)
000706     MOVE -2147418105 TO POW-0010 
000706     MOVE 4 TO POW-0011 
000706     MOVE 0 TO POW-0012 
000706     MOVE 0 TO POW-0013 
000706     MOVE 0 TO POW-0014 
000706     MOVE 1 TO POW-0015 
000706     MOVE 0 TO POW-0020 
000706     MOVE 33636363 TO POW-0016 
000706     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 起動中ラベル REFERENCE 
000706     POW-0010 VALUE POW-0011 POW-0012 POW-0013 POW-0014 POW-0015 
000706     POW-0016 REFERENCE POW-0020 END-CALL 
#LINE 706,#END
000707     ELSE
#LINE 708,#START,MOVE(708,15)
000708     MOVE -518 TO POW-0010 
000708     MOVE 4 TO POW-0011 
000708     MOVE 0 TO POW-0012 
000708     MOVE 0 TO POW-0013 
000708     MOVE 0 TO POW-0014 
000708     MOVE 1 TO POW-0015 
000708     MOVE "起動中" TO POW-0018 
000708     MOVE 33636360 TO POW-0016 
000708     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000708     VALUE POW-0011 POW-0012 POW-0013 POW-0014 POW-0015 POW-0016 
000708     REFERENCE POW-0018 END-CALL 
#LINE 708,#END
#LINE 711
#LINE 711,#START,INVOKE(711,15)
000711     MOVE 117441034 TO POW-0010 
000711     MOVE 1 TO POW-0011 
000711     MOVE 0 TO POW-0012 
000711     MOVE 0 TO POW-0013 
000711     MOVE 0 TO POW-0014 
000711     MOVE 2 TO POW-0015 
000711     MOVE 起動プログラム名 TO POW-0018 
000711     MOVE 33636360 TO POW-0016 
000711     MOVE 1 TO POW-0017 
000711     MOVE 50413571 TO POW-0021 
000711     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000711     VALUE POW-0011 POW-0012 POW-0013 POW-0014 POW-0015 POW-0016 
000711     REFERENCE POW-0018 VALUE POW-0021 REFERENCE POW-0017 END-CALL 
#LINE 711,#END
#LINE 712,#START,INVOKE(712,15)
000712     MOVE 117441025 TO POW-0010 
000712     MOVE 1 TO POW-0011 
000712     MOVE 16387 TO POW-0013 
000712     MOVE 0 TO POW-0014 
000712     MOVE 0 TO POW-0015 
000712     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000712     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000712     END-CALL 
#LINE 712,#END
000713        EXIT PROGRAM
000714*
000715     END-IF.
000716*
000717     EXIT PROGRAM.     
000718*      
000719*================================================================*
000720 特殊環境ファイル読込 SECTION.
000721*
000722     READ 特殊環境ファイル NEXT
000723     AT END
000724         MOVE "YES" TO 終了フラグ
000725     END-READ.
000726*
000727*================================================================*
000728 データ退避エラー SECTION.
000729*
000730     MOVE SPACE TO メッセージＷ.
000731     STRING "退避失敗："    DELIMITED BY SIZE
000732            元ファイル名Ｗ  DELIMITED BY SIZE
000733            INTO メッセージＷ
000734     END-STRING.
000735*/ 警告アイコン /*
000736     COMPUTE STYL = 0         + 48                  + 0                .
#LINE 737,#START,INVOKE(737,12)
000737     MOVE 117441026 TO POW-0010 
000737     MOVE 1 TO POW-0011 
000737     MOVE 16387 TO POW-0013 
000737     MOVE 0 TO POW-0014 
000737     MOVE 3 TO POW-0015 
000737     MOVE メッセージＷ TO POW-0018 
000737     MOVE 33636360 TO POW-0016 
000737     MOVE "警告" TO POW-0019 
000737     MOVE 50413576 TO POW-0017 
000737     MOVE STYL TO POW-0021 
000737     MOVE 50413571 TO POW-0022 
000737     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000737     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000737     POW-0016 REFERENCE POW-0018 VALUE POW-0017 REFERENCE POW-0019 VALUE 
000737     POW-0022 REFERENCE POW-0021 END-CALL 
000737                                                                    .
#LINE 737,#END
000738     PERFORM 異常終了.
000739*
000740*================================================================*
000741 異常終了 SECTION.
000742*
#LINE 743,#START,INVOKE(743,12)
000743     MOVE 117441025 TO POW-0010 
000743     MOVE 1 TO POW-0011 
000743     MOVE 16387 TO POW-0013 
000743     MOVE 0 TO POW-0014 
000743     MOVE 0 TO POW-0015 
000743     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0010 
000743     VALUE POW-0011 POW-0013 REFERENCE POW-0012 VALUE POW-0014 POW-0015 
000743     END-CALL 
000743                                .
#LINE 743,#END
000744     EXIT PROGRAM.
000745*
000746*================================================================*
000747*    
000748*</SCRIPT>
000749 END PROGRAM     POW-SCRIPTLET1.
000750 IDENTIFICATION  DIVISION.
000751* パスワード-Return.
000752 PROGRAM-ID.     POW-SCRIPTLET2.
000753*<SCRIPT DIVISION="PROCEDURE", CONTROL="パスワード", EVENT="Return", POW-NAME="SCRIPTLET2", TYPE="ETC">
000754 ENVIRONMENT     DIVISION.
000755 DATA            DIVISION.
000756 WORKING-STORAGE SECTION.
#LINE 757,#START,#OTHER
000757 01 POW-0023 PIC S9(18) COMP-5.
000757 01 POW-0024 PIC S9(9) COMP-5.
000757 01 POW-0025 PIC S9(9) COMP-5.
000757 01 POW-0026 PIC S9(9) COMP-5.
000757 01 POW-0027 PIC S9(9) COMP-5.
000757 01 POW-0028 PIC S9(9) COMP-5.
000757 01 POW-0029 PIC S9(4) COMP-5.
000757 01 POW-0030 PIC S9(9) COMP-5.
#LINE 756,#END
000757 PROCEDURE       DIVISION.
000758*
000759     IF リターンカウント = ZERO
000760        MOVE 1   TO リターンカウント 
#LINE 761,#START,MOVE(761,15)
000761     MOVE -514 TO POW-0023 
000761     MOVE 4 TO POW-0024 
000761     MOVE 0 TO POW-0025 
000761     MOVE 0 TO POW-0026 
000761     MOVE 0 TO POW-0027 
000761     MOVE 1 TO POW-0028 
000761     MOVE 0 TO POW-0029 
000761     MOVE 33636363 TO POW-0030 
000761     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 実行ボタン REFERENCE 
000761     POW-0023 VALUE POW-0024 POW-0025 POW-0026 POW-0027 POW-0028 
000761     POW-0030 REFERENCE POW-0029 END-CALL 
#LINE 761,#END
000762        CALL "チェックサブ"
#LINE 763,#START,MOVE(763,15)
000763     MOVE -514 TO POW-0023 
000763     MOVE 4 TO POW-0024 
000763     MOVE 0 TO POW-0025 
000763     MOVE 0 TO POW-0026 
000763     MOVE 0 TO POW-0027 
000763     MOVE 1 TO POW-0028 
000763     MOVE -1 TO POW-0029 
000763     MOVE 33636363 TO POW-0030 
000763     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 実行ボタン REFERENCE 
000763     POW-0023 VALUE POW-0024 POW-0025 POW-0026 POW-0027 POW-0028 
000763     POW-0030 REFERENCE POW-0029 END-CALL 
#LINE 763,#END
000764        MOVE ZERO TO リターンカウント 
000765     END-IF.   
000766*
000767     EXIT PROGRAM.
000768*</SCRIPT>
000769 END PROGRAM     POW-SCRIPTLET2.
000770 IDENTIFICATION  DIVISION.
000771* 実行ボタン-Click.
000772 PROGRAM-ID.     POW-SCRIPTLET3.
000773*<SCRIPT DIVISION="PROCEDURE", CONTROL="実行ボタン", EVENT="Click", POW-NAME="SCRIPTLET3", TYPE="ETC">
000774 ENVIRONMENT     DIVISION.
000775 DATA            DIVISION.
000776 WORKING-STORAGE SECTION.
#LINE 777,#START,#OTHER
000777 01 POW-0031 PIC S9(18) COMP-5.
000777 01 POW-0032 PIC S9(9) COMP-5.
000777 01 POW-0033 PIC S9(9) COMP-5.
000777 01 POW-0034 PIC S9(9) COMP-5.
000777 01 POW-0035 PIC S9(9) COMP-5.
000777 01 POW-0036 PIC S9(9) COMP-5.
000777 01 POW-0037 PIC S9(4) COMP-5.
000777 01 POW-0038 PIC S9(9) COMP-5.
#LINE 776,#END
000777 PROCEDURE       DIVISION.
000778*
#LINE 779,#START,MOVE(779,12)
000779     MOVE -514 TO POW-0031 
000779     MOVE 4 TO POW-0032 
000779     MOVE 0 TO POW-0033 
000779     MOVE 0 TO POW-0034 
000779     MOVE 0 TO POW-0035 
000779     MOVE 1 TO POW-0036 
000779     MOVE 0 TO POW-0037 
000779     MOVE 33636363 TO POW-0038 
000779     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 実行ボタン REFERENCE 
000779     POW-0031 VALUE POW-0032 POW-0033 POW-0034 POW-0035 POW-0036 
000779     POW-0038 REFERENCE POW-0037 END-CALL 
000779                                                .
#LINE 779,#END
000780     CALL "チェックサブ".
#LINE 781,#START,MOVE(781,12)
000781     MOVE -514 TO POW-0031 
000781     MOVE 4 TO POW-0032 
000781     MOVE 0 TO POW-0033 
000781     MOVE 0 TO POW-0034 
000781     MOVE 0 TO POW-0035 
000781     MOVE 1 TO POW-0036 
000781     MOVE -1 TO POW-0037 
000781     MOVE 33636363 TO POW-0038 
000781     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE 実行ボタン REFERENCE 
000781     POW-0031 VALUE POW-0032 POW-0033 POW-0034 POW-0035 POW-0036 
000781     POW-0038 REFERENCE POW-0037 END-CALL 
000781                                                 .
#LINE 781,#END
000782*
000783     EXIT PROGRAM.
000784*</SCRIPT>
000785 END PROGRAM     POW-SCRIPTLET3.
000786 IDENTIFICATION  DIVISION.
000787* チェックサブ.
000788 PROGRAM-ID.     "チェックサブ" IS COMMON.
000789*<SCRIPT DIVISION="PROCEDURE", NAME="チェックサブ">
000790 ENVIRONMENT             DIVISION.
000791 INPUT-OUTPUT            SECTION.
000792 FILE-CONTROL.
000793     SELECT  例外マスタ      ASSIGN      TO        REIGAIL
000794                             ORGANIZATION             IS  INDEXED
000795                             ACCESS MODE              IS  DYNAMIC
000796                             RECORD KEY               IS  例０５－区分コード
000797                                                          例０５－番号コード
000798                             FILE STATUS              IS  状態キー
000799                             LOCK        MODE         IS  AUTOMATIC.
000800*
000801     SELECT  連携ファイル    ASSIGN      TO        W001L
000802                             ORGANIZATION             IS  SEQUENTIAL
000803                             ACCESS MODE              IS  SEQUENTIAL
000804                             FILE        STATUS       IS  状態キー
000805                             LOCK        MODE         IS  AUTOMATIC.
000806*
000807*****************************************************************
000808*                      DATA DIVISION                             *
000809******************************************************************
000810 DATA                    DIVISION.
000811 FILE                    SECTION.
000812*
000813** 例外05(パスワード用)
000814 FD  例外マスタ          BLOCK   CONTAINS   1   RECORDS.
000815     COPY REIGAI05       OF  XFDLIB  JOINING   例０５   AS  PREFIX.
000816*
000817 FD  連携ファイル  RECORD  CONTAINS 16 CHARACTERS.
000818 01  連携－レコード.
000819     03  連携－パスワード       PIC X(6).
000820     03  連携－レベル           PIC X.
000821     03  FILLER                 PIC X(9).
000822*
000823*
000824******************************************************************
000825*                WORKING-STORAGE SECTION                         *
000826******************************************************************
000827 WORKING-STORAGE         SECTION.
000828 01 状態キー                      PIC X(2) VALUE SPACE.
000829 01 エラー内容                    PIC X(80) VALUE SPACE.
000830 01 終了フラグ                    PIC X(3) VALUE SPACE.
000831 01 存在フラグ                    PIC X(3) VALUE SPACE.
000832 01 パスワードＷ                  PIC X(6) VALUE SPACE.
000833 01 退避パスワードＷ              PIC X(6) VALUE SPACE.
000834 01 退避レベルＷ                  PIC X    VALUE SPACE.
000835*
000836 01 カウンタ                      PIC 9(3) VALUE ZERO.
000837*
000838*
000839******************************************************************
000840*                      PROCEDURE  DIVISION                       *
000841******************************************************************
#LINE 842,#START,#OTHER
000842 01 POW-0039 PIC S9(18) COMP-5.
000842 01 POW-0040 PIC S9(9) COMP-5.
000842 01 POW-0041 PIC X(8192).
000842 01 POW-0042 PIC S9(9) COMP-5.
000842 01 POW-0043 PIC S9(9) COMP-5.
000842 01 POW-0044 PIC S9(9) COMP-5.
000842 01 POW-0045 PIC S9(9) COMP-5.
000842 01 POW-0046 PIC S9(9) COMP-5.
000842 01 POW-0047 PIC X(8192).
000842 01 POW-0048 PIC S9(9) COMP-5.
000842 01 POW-0049 PIC S9(9) COMP-5.
#LINE 841,#END
000842 PROCEDURE               DIVISION.
000843*
000844     PERFORM 入力チェック.
000845     PERFORM ファイルオープン.
000846     PERFORM パスワードチェック. 
000847*
000848*================================================================*
000849*================================================================*
000850 入力チェック SECTION.
000851*
#LINE 852,#START,IF(852,12)
000852     MOVE -517 TO POW-0039 
000852     MOVE 2 TO POW-0040 
000852     MOVE 16392 TO POW-0042 
000852     MOVE 3 TO POW-0043 
000852     MOVE 0 TO POW-0044 
000852     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE パスワード REFERENCE 
000852     POW-0039 VALUE POW-0040 POW-0042 REFERENCE POW-0041 VALUE POW-0043 
000852     POW-0044 END-CALL 
000852     IF ( POW-0041 = SPACE ) 
#LINE 852,#END
#LINE 853,#START,INVOKE(853,16)
000853     MOVE 117441026 TO POW-0039 
000853     MOVE 1 TO POW-0040 
000853     MOVE 16387 TO POW-0043 
000853     MOVE 0 TO POW-0044 
000853     MOVE 2 TO POW-0045 
000853     MOVE "パスワードを入力してください。" TO POW-0041 
000853     MOVE 33636360 TO POW-0046 
000853     MOVE "メッセージ" TO POW-0047 
000853     MOVE 50413576 TO POW-0048 
000853     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000853     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000853     POW-0046 REFERENCE POW-0041 VALUE POW-0048 REFERENCE POW-0047 
000853     END-CALL 
#LINE 853,#END
#LINE 854,#START,INVOKE(854,16)
000854     MOVE -2147409920 TO POW-0039 
000854     MOVE 1 TO POW-0040 
000854     MOVE 0 TO POW-0042 
000854     MOVE 0 TO POW-0043 
000854     MOVE 0 TO POW-0044 
000854     MOVE 0 TO POW-0045 
000854     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE パスワード REFERENCE 
000854     POW-0039 VALUE POW-0040 POW-0042 POW-0043 POW-0044 POW-0045 
000854     END-CALL 
#LINE 854,#END
000855         EXIT PROGRAM
000856     END-IF.
000857*
000858*================================================================*
000859 ファイルオープン SECTION.
000860*
000861     OPEN INPUT 例外マスタ.
000862     IF 状態キー  NOT =  "00"
000863        MOVE SPACE TO エラー内容
000864        STRING "例外マスタオープンエラー:"  DELIMITED BY SIZE
000865                状態キー                    DELIMITED BY SIZE
000866           INTO エラー内容
000867        END-STRING
#LINE 868,#START,INVOKE(868,15)
000868     MOVE 117441026 TO POW-0039 
000868     MOVE 1 TO POW-0040 
000868     MOVE 16387 TO POW-0043 
000868     MOVE 0 TO POW-0044 
000868     MOVE 2 TO POW-0045 
000868     MOVE エラー内容 TO POW-0041 
000868     MOVE 33636360 TO POW-0046 
000868     MOVE "メッセージ" TO POW-0047 
000868     MOVE 50413576 TO POW-0048 
000868     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000868     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000868     POW-0046 REFERENCE POW-0041 VALUE POW-0048 REFERENCE POW-0047 
000868     END-CALL 
#LINE 868,#END
000869        EXIT PROGRAM
000870     END-IF.
000871*
000872*================================================================*
000873 パスワードチェック SECTION.
000874*
#LINE 875,#START,MOVE(875,12)
000875     MOVE -517 TO POW-0039 
000875     MOVE 2 TO POW-0040 
000875     MOVE 16392 TO POW-0042 
000875     MOVE 3 TO POW-0043 
000875     MOVE 0 TO POW-0044 
000875     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE パスワード REFERENCE 
000875     POW-0039 VALUE POW-0040 POW-0042 REFERENCE POW-0041 VALUE POW-0043 
000875     POW-0044 END-CALL 
000875     MOVE POW-0041 TO パスワードＷ 
000875                                              .
#LINE 875,#END
000876     PERFORM 存在チェック.
000877     IF 存在フラグ = SPACE
#LINE 878,#START,INVOKE(878,15)
000878     MOVE 117441026 TO POW-0039 
000878     MOVE 1 TO POW-0040 
000878     MOVE 16387 TO POW-0043 
000878     MOVE 0 TO POW-0044 
000878     MOVE 2 TO POW-0045 
000878     MOVE "パスワードが登録されていません。" TO POW-0041 
000878     MOVE 33636360 TO POW-0046 
000878     MOVE "メッセージ" TO POW-0047 
000878     MOVE 50413576 TO POW-0048 
000878     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000878     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000878     POW-0046 REFERENCE POW-0041 VALUE POW-0048 REFERENCE POW-0047 
000878     END-CALL 
#LINE 878,#END
#LINE 879,#START,INVOKE(879,15)
000879     MOVE -2147409920 TO POW-0039 
000879     MOVE 1 TO POW-0040 
000879     MOVE 0 TO POW-0042 
000879     MOVE 0 TO POW-0043 
000879     MOVE 0 TO POW-0044 
000879     MOVE 0 TO POW-0045 
000879     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE パスワード REFERENCE 
000879     POW-0039 VALUE POW-0040 POW-0042 POW-0043 POW-0044 POW-0045 
000879     END-CALL 
#LINE 879,#END
000880        PERFORM ファイル閉鎖
000881        EXIT PROGRAM
000882     ELSE
000883        PERFORM 連携処理
000884     END-IF.
000885*
000886*================================================================*
000887 ファイル閉鎖 SECTION.
000888*
000889     CLOSE 例外マスタ.
000890*
000891*================================================================*
000892 存在チェック SECTION.
000893*
000894     MOVE SPACE      TO 存在フラグ.
000895     MOVE 1          TO カウンタ.
000896     MOVE 05         TO 例０５－区分コード.
000897     MOVE ZERO       TO 例０５－番号コード.
000898     READ 例外マスタ
000899     NOT INVALID KEY
000900        PERFORM UNTIL ( 存在フラグ                   = "YES" ) OR
000901                      ( 例０５－パスワード(カウンタ) = SPACE ) OR
000902                      ( カウンタ > 90 )
000903            IF 例０５－パスワード(カウンタ) = パスワードＷ
000904                MOVE "YES"                    TO 存在フラグ
000905                MOVE パスワードＷ             TO 退避パスワードＷ
000906                MOVE 例０５－レベル(カウンタ) TO 退避レベルＷ
000907            END-IF
000908            COMPUTE カウンタ = カウンタ + 1
000909        END-PERFORM
000910     END-READ.
000911*
000912*================================================================*
000913 連携処理 SECTION.
000914*
000915*--- ワークＦにパスワード・レベルを書き込む -----*
000916     OPEN OUTPUT 連携ファイル.
000917     IF 状態キー  NOT =  "00"
000918        MOVE SPACE TO エラー内容
000919        STRING "連携ファイルオープンエラー:"  DELIMITED BY SIZE
000920                状態キー                      DELIMITED BY SIZE
000921           INTO エラー内容
000922        END-STRING
#LINE 923,#START,INVOKE(923,15)
000923     MOVE 117441026 TO POW-0039 
000923     MOVE 1 TO POW-0040 
000923     MOVE 16387 TO POW-0043 
000923     MOVE 0 TO POW-0044 
000923     MOVE 2 TO POW-0045 
000923     MOVE エラー内容 TO POW-0041 
000923     MOVE 33636360 TO POW-0046 
000923     MOVE "メッセージ" TO POW-0047 
000923     MOVE 50413576 TO POW-0048 
000923     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000923     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000923     POW-0046 REFERENCE POW-0041 VALUE POW-0048 REFERENCE POW-0047 
000923     END-CALL 
#LINE 923,#END
000924        PERFORM ファイル閉鎖
000925        EXIT PROGRAM
000926     END-IF.
000927*
000928     MOVE SPACE             TO 連携－レコード.
000929     MOVE 退避パスワードＷ  TO 連携－パスワード.
000930     MOVE 退避レベルＷ      TO 連携－レベル.
000931     WRITE 連携－レコード.
000932     IF 状態キー  NOT =  "00"
000933        MOVE SPACE TO エラー内容
000934        STRING "連携ファイル書込みエラー:"  DELIMITED BY SIZE
000935                状態キー                    DELIMITED BY SIZE
000936           INTO エラー内容
000937        END-STRING
#LINE 938,#START,INVOKE(938,15)
000938     MOVE 117441026 TO POW-0039 
000938     MOVE 1 TO POW-0040 
000938     MOVE 16387 TO POW-0043 
000938     MOVE 0 TO POW-0044 
000938     MOVE 2 TO POW-0045 
000938     MOVE エラー内容 TO POW-0041 
000938     MOVE 33636360 TO POW-0046 
000938     MOVE "メッセージ" TO POW-0047 
000938     MOVE 50413576 TO POW-0048 
000938     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000938     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000938     POW-0046 REFERENCE POW-0041 VALUE POW-0048 REFERENCE POW-0047 
000938     END-CALL 
#LINE 938,#END
000939        PERFORM ファイル閉鎖
000940        CLOSE 連携ファイル
000941        EXIT PROGRAM
000942     END-IF.
000943*
000944     CLOSE 連携ファイル.
000945*
000946     PERFORM ファイル閉鎖.
000947*
000948*--------------------------------------------------------
000949*
000950*    / YAWARAを呼出して終了 /
#LINE 951,#START,INVOKE(951,12)
000951     MOVE 117441034 TO POW-0039 
000951     MOVE 1 TO POW-0040 
000951     MOVE 0 TO POW-0042 
000951     MOVE 0 TO POW-0043 
000951     MOVE 0 TO POW-0044 
000951     MOVE 2 TO POW-0045 
000951     MOVE 起動プログラム名 TO POW-0041 
000951     MOVE 33636360 TO POW-0046 
000951     MOVE 1 TO POW-0048 
000951     MOVE 50413571 TO POW-0049 
000951     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000951     VALUE POW-0040 POW-0042 POW-0043 POW-0044 POW-0045 POW-0046 
000951     REFERENCE POW-0041 VALUE POW-0049 REFERENCE POW-0048 END-CALL 
000951                                                                       .
#LINE 951,#END
000952*
000953* MainFormを閉じます。
#LINE 954,#START,INVOKE(954,12)
000954     MOVE 117441025 TO POW-0039 
000954     MOVE 1 TO POW-0040 
000954     MOVE 16387 TO POW-0043 
000954     MOVE 0 TO POW-0044 
000954     MOVE 0 TO POW-0045 
000954     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0039 
000954     VALUE POW-0040 POW-0043 REFERENCE POW-0042 VALUE POW-0044 POW-0045 
000954     END-CALL 
#LINE 954,#END
#LINE 957
000957     EXIT PROGRAM.
000958*
000959*================================================================*
000960*</SCRIPT>
000961 END PROGRAM     "チェックサブ".
000962 IDENTIFICATION  DIVISION.
000963* 設定ボタン-Click.
000964 PROGRAM-ID.     POW-SCRIPTLET4.
000965*<SCRIPT DIVISION="PROCEDURE", CONTROL="設定ボタン", EVENT="Click", POW-NAME="SCRIPTLET4", TYPE="ETC">
000966 ENVIRONMENT     DIVISION.
000967 DATA            DIVISION.
000968 WORKING-STORAGE SECTION.
000969 01 ReturnValue  PIC S9(9) COMP-5.
#LINE 970,#START,#OTHER
000970 01 POW-0050 PIC S9(18) COMP-5.
000970 01 POW-0051 PIC S9(9) COMP-5.
000970 01 POW-0052 PIC S9(9) COMP-5.
000970 01 POW-0053 PIC S9(9) COMP-5.
000970 01 POW-0054 PIC S9(9) COMP-5.
000970 01 POW-0055 PIC S9(9) COMP-5.
000970 01 POW-0056 PIC X(8192).
000970 01 POW-0057 PIC S9(9) COMP-5.
#LINE 969,#END
000970 PROCEDURE       DIVISION.
000971* フォームを開きます
#LINE 972,#START,INVOKE(972,12)
000972     MOVE 117441042 TO POW-0050 
000972     MOVE 1 TO POW-0051 
000972     MOVE 16387 TO POW-0053 
000972     MOVE 2 TO POW-0054 
000972     MOVE 1 TO POW-0055 
000972     MOVE "Passset" TO POW-0056 
000972     MOVE 33636360 TO POW-0057 
000972     CALL "XPOW_INVOKE_BY_ID_2" USING VALUE POW-SELF REFERENCE POW-0050 
000972     VALUE POW-0051 POW-0053 REFERENCE POW-0052 VALUE POW-0054 POW-0055 
000972     POW-0057 REFERENCE POW-0056 END-CALL 
000972     MOVE POW-0052 TO RETURNVALUE 
000972                                                                      .
#LINE 972,#END
000973*</SCRIPT>
000974 END PROGRAM     POW-SCRIPTLET4.
000975 END PROGRAM     yawpas.
#FILE
