000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             NJY582.
000060 AUTHOR.                 池田  幸子
000070*
000080*----------------------------------------------------------------*
000090*        【療養費請求総括票 印刷】
000110*         MED = NJY580 NJY582P 
      *    出力内容変更　071016
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2019-10-24
000140 DATE-COMPILED.          2019-10-24
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS  元－元号区分
000310                             FILE STATUS              IS  状態キー
000320                             LOCK        MODE         IS  AUTOMATIC.
000330     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS  制－制御区分
000370                             FILE STATUS              IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000390     SELECT  施術所情報マスタ ASSIGN     TO        SEJOHOL
000400                             ORGANIZATION             IS  INDEXED
000410                             ACCESS MODE              IS  DYNAMIC
000420                             RECORD KEY               IS  施情－施術所番号
000430                             FILE STATUS              IS  状態キー
000440                             LOCK        MODE         IS  AUTOMATIC.
000450     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W58021L.DAT"
000460                             ORGANIZATION             IS  INDEXED
000470                             ACCESS                   IS  DYNAMIC
000480                             RECORD      KEY          IS  作１－保険区分
000490                             FILE        STATUS       IS  状態キー
000500                             LOCK        MODE         IS  AUTOMATIC.
000510     SELECT  印刷ファイル    ASSIGN      TO     GS-PRTF001
000520                             SYMBOLIC    DESTINATION  IS "PRT"
000530                             FORMAT                   IS  定義体名Ｐ
000540                             GROUP                    IS  項目群名Ｐ
000550                             PROCESSING  MODE         IS  処理種別Ｐ
000560                             UNIT        CONTROL      IS  拡張制御Ｐ
000570                             FILE        STATUS       IS  通知情報Ｐ.
000580******************************************************************
000590*                      DATA DIVISION                             *
000600******************************************************************
000610 DATA                    DIVISION.
000620 FILE                    SECTION.
000630*                           ［ＲＬ＝  １２８］
000640 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
000650     COPY GENGOU         OF  XFDLIB  JOINING    元   AS  PREFIX.
000660*                           ［ＲＬ＝  ２５６］
000670 FD  制御情報マスタ      BLOCK   CONTAINS   1   RECORDS.
000680     COPY SEIGYO         OF  XFDLIB  JOINING    制   AS  PREFIX.
000690*                           ［ＲＬ＝  ６４０］
000700 FD  施術所情報マスタ    BLOCK   CONTAINS   1   RECORDS.
000710     COPY SEJOHO         OF  XFDLIB  JOINING    施情 AS  PREFIX.
000720*
000721**
001320 FD  作業ファイル１ RECORD  CONTAINS 32 CHARACTERS.
001330 01  作１－レコード.
001340   03  作１－レコードキー.
001350     05  作１－保険区分                PIC 9(2).
001360   03  作１－レコードデータ.
001370     05  作１－件数                    PIC 9(4).
001380     05  作１－費用額                  PIC 9(8).
001390     05  作１－請求額                  PIC 9(8).
001400     05  FILLER                        PIC X(10).
000820*
000830 FD  印刷ファイル.
000840     COPY NJY582P        OF  XMDLIB.
000850*
000860******************************************************************
000870*                WORKING-STORAGE SECTION                         *
000880******************************************************************
000890 WORKING-STORAGE         SECTION.
000900 01 キー入力                           PIC X    VALUE SPACE.
000910 01 状態キー                           PIC X(2) VALUE SPACE.
000920 01 終了フラグ                         PIC X(3) VALUE SPACE.
000930 01 終了フラグ２                       PIC X(3) VALUE SPACE.
000940 01 終了フラグ３                       PIC X(3) VALUE SPACE.
000950 01 確認入力Ｗ                         PIC X(1) VALUE SPACE.
000960 01 ファイル名Ｗ                       PIC N(2) VALUE SPACE.
000970 01 カレント元号Ｗ                     PIC 9(1) VALUE ZERO.
000980 01 実行キーＷ                         PIC X(4) VALUE SPACE.
000990 01 前和暦Ｗ                           PIC 9 VALUE ZERO.
001000 01 行桁フラグ                         PIC X(3) VALUE SPACE.
001210 01 オープンフラグ                     PIC X(3)   VALUE SPACE.
001010 01 処理移動キー                       PIC X(4) VALUE SPACE.
001020 01 施術和暦年月Ｗ.
001030     03 施術和暦Ｗ                     PIC 9.
001040     03 施術年月Ｗ.
001050        05 施術年Ｗ                    PIC 9(2).
001060        05 施術月Ｗ                    PIC 9(2).
001070 01 施術日Ｗ                           PIC 9(2).
001080 01 請求和暦年月Ｗ.
001090    03 請求和暦Ｗ                      PIC 9     VALUE ZERO.
001100    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
001110    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
001120 01 請求日Ｗ                           PIC 9(2).
001130 01 請求和暦名称Ｗ                     PIC N(2) VALUE SPACE.
001140 01 元号名称Ｗ                         PIC N(2) VALUE SPACE.
001150 01 カウンタ                           PIC 9(2) VALUE ZERO.
001160 01 印刷枚数ＣＮＴ                     PIC 9(2) VALUE ZERO.
001170 01 総括表Ｗ.
001180    03 会員番号Ｗ                      PIC X(10) VALUE SPACE.
001180    03 施術所住所Ｗ                    PIC X(50) VALUE SPACE.
001190    03 施術所住所１Ｗ                  PIC X(50) VALUE SPACE.
001200    03 施術所住所２Ｗ                  PIC X(50) VALUE SPACE.
001210    03 接骨院名Ｗ                      PIC X(50) VALUE SPACE.
001220    03 代表者名Ｗ                      PIC X(50) VALUE SPACE.
001230    03 施術所電話番号Ｗ                PIC X(15) VALUE SPACE.
001240    03 施術所郵便番号Ｗ.
001250       05 施術所郵便番号１Ｗ           PIC X(3)   VALUE SPACE.
001260       05 施術所郵便番号２Ｗ           PIC X(4)   VALUE SPACE.
001270    03 明細行.
001280       05 国保件数Ｗ                   PIC 9(4)  VALUE ZERO.
001290       05 国保費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 国保請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 国保平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001310       05 社保件数Ｗ                   PIC 9(4)  VALUE ZERO.
001320       05 社保費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001330       05 社保請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 社保平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001310       05 日雇件数Ｗ                   PIC 9(4)  VALUE ZERO.
001320       05 日雇費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001330       05 日雇請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 日雇平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001310       05 船員件数Ｗ                   PIC 9(4)  VALUE ZERO.
001320       05 船員費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001330       05 船員請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 船員平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001370       05 組合件数Ｗ                   PIC 9(4)  VALUE ZERO.
001380       05 組合費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001390       05 組合請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 組合平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001340       05 共済件数Ｗ                   PIC 9(4)  VALUE ZERO.
001350       05 共済費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001360       05 共済請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 共済平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001280       05 退職件数Ｗ                   PIC 9(4)  VALUE ZERO.
001290       05 退職費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 退職請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 退職平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 後高件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 後高費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 後高請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 後高平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 福祉件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 福祉費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 福祉請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 福祉平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 障害件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 障害費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 障害請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 障害平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 母子件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 母子費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 母子請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 母子平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 乳児件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 乳児費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 乳児請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 乳児平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 被爆件数Ｗ                   PIC 9(4)  VALUE ZERO.
001440       05 被爆費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001450       05 被爆請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 被爆平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001430       05 その他件数Ｗ                 PIC 9(4)  VALUE ZERO.
001440       05 その他費用額Ｗ               PIC 9(8)  VALUE ZERO.
001450       05 その他請求額Ｗ               PIC 9(8)  VALUE ZERO.
001300       05 その他平均請求額Ｗ           PIC 9(8)  VALUE ZERO.
001460       05 労災件数Ｗ                   PIC 9(4)  VALUE ZERO.
001470       05 労災費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001480       05 労災請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 労災平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001460       05 自賠件数Ｗ                   PIC 9(4)  VALUE ZERO.
001470       05 自賠費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001480       05 自賠請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 自賠平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001280       05 生保件数Ｗ                   PIC 9(4)  VALUE ZERO.
001290       05 生保費用額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 生保請求額Ｗ                 PIC 9(8)  VALUE ZERO.
001300       05 生保平均請求額Ｗ             PIC 9(8)  VALUE ZERO.
001490    03 印刷データ.
001500       05 合計枚数Ｗ                   PIC 9(4)  VALUE ZERO.
001500       05 合計件数Ｗ                   PIC 9(5)  VALUE ZERO.
001510       05 合計費用額Ｗ                 PIC 9(9)  VALUE ZERO.
001520       05 合計請求額Ｗ                 PIC 9(9)  VALUE ZERO.
001500       05 他合計件数Ｗ                 PIC 9(5)  VALUE ZERO.
001520       05 他合計費用額Ｗ               PIC 9(9)  VALUE ZERO.
001520       05 他合計請求額Ｗ               PIC 9(9)  VALUE ZERO.
001500       05 総合計件数Ｗ                 PIC 9(5)  VALUE ZERO.
001520       05 総合計費用額Ｗ               PIC 9(9)  VALUE ZERO.
001520       05 総合計請求額Ｗ               PIC 9(9)  VALUE ZERO.
001530 01 頁数Ｗ                             PIC 9(1)  VALUE ZERO.
001540 01 全頁Ｗ                             PIC 9(1)  VALUE ZERO.
001550 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
001560 01 公費種別Ｗ                         PIC 9(2)  VALUE ZERO.
001570 01 給付割合Ｗ                         PIC 9(2)  VALUE ZERO.
001580 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
001590 01 施術所コードＷ                     PIC X(7)  VALUE SPACE.
001790*
001800 01 印刷制御.
001810     03 定義体名Ｐ                     PIC X(8) VALUE SPACE.
001820     03 項目群名Ｐ                     PIC X(8) VALUE SPACE.
001830     03 処理種別Ｐ                     PIC X(2) VALUE SPACE.
001840     03 拡張制御Ｐ.
001850         05 端末制御Ｐ.
001860             07 移動方向Ｐ             PIC X(1).
001870             07 移動行数Ｐ             PIC 9(3).
001880         05 詳細制御Ｐ                 PIC X(2).
001890     03 通知情報Ｐ                     PIC X(2) VALUE SPACE.
001900     03 ユニット名Ｐ                   PIC X(8) VALUE SPACE.
001910 01 計算機西暦年Ｗ                     PIC 9(2).
001920* 日付ＷＯＲＫ
001930 01 和暦終了年Ｗ                       PIC 9(4).
001940 01 計算機和暦年Ｗ                     PIC 9(2).
001950 01 計算機西暦.
001960    03 計算機西暦年                    PIC 9(4).
001970    03 計算機西暦月日                  PIC 9(4).
001980 01 計算機西暦Ｒ REDEFINES 計算機西暦.
001990    03 計算機世紀                      PIC 9(2).
002000    03 計算機日付                      PIC 9(6).
002010    03 計算機日付Ｒ REDEFINES 計算機日付.
002020       05 計算機年月                   PIC 9(4).
002030       05 計算機年月Ｒ REDEFINES 計算機年月.
002040         07 計算機年                   PIC 9(2).
002050         07 計算機月                   PIC 9(2).
002060       05 計算機日                     PIC 9(2).
002070 01 施術和暦年月ＷＲ.
002080    03 施術和暦ＷＲ                  PIC 9     VALUE ZERO.
002090    03 施術年ＷＲ                    PIC 9(2)  VALUE ZERO.
002100    03 施術月ＷＲ                    PIC 9(2)  VALUE ZERO.
002110*
002120******************************************************************
002130*                          連結項目                              *
002140******************************************************************
002260*
002494 01 連メ－キー IS EXTERNAL.
002495    03  連メ－メッセージ                 PIC N(20).
002150*
       01 連印－画面情報ＮＪＹ５８０ IS EXTERNAL GLOBAL.
          03 連印－請求和暦年月.
             05 連印－請求和暦               PIC 9.
             05 連印－請求年月.
                07 連印－請求年              PIC 9(2).
                07 連印－請求月              PIC 9(2).
          03 連印－プレビュー区分            PIC 9.
002220*
003090 01 連印－印刷データＮＪＹ５８０ IS EXTERNAL.
003100   03 連印－合計.
003110     05 連印－合計枚数                 PIC 9(4).
003110     05 連印－合計件数                 PIC 9(5).
003120     05 連印－合計費用額               PIC 9(9).
003130     05 連印－合計請求額               PIC 9(9).
003110     05 連印－他合計件数               PIC 9(5).
003130     05 連印－他合計費用額             PIC 9(9).
003130     05 連印－他合計請求額             PIC 9(9).
003110     05 連印－総合計件数               PIC 9(5).
003120     05 連印－総合計費用額             PIC 9(9).
003130     05 連印－総合計請求額             PIC 9(9).
002560*
000540************************************
000550* プリンタファイル作成用           *
000560************************************
000570 01 Ｈ連ＰＲＴＦ－作成データ IS EXTERNAL.
000580     03 Ｈ連ＰＲＴＦ－ファイル名           PIC X(8).
000590     03 Ｈ連ＰＲＴＦ－プレビュー区分       PIC 9.
000600     03 Ｈ連ＰＲＴＦ－帳票プログラム名     PIC X(8).
000610     03 Ｈ連ＰＲＴＦ－オーバレイ名         PIC X(8).
002271*
002280******************************************************************
002290*                      PROCEDURE  DIVISION                       *
002300******************************************************************
002310 PROCEDURE               DIVISION.
002320************
002330*           *
002340* 初期処理   *
002350*           *
002360************
002560     MOVE SPACE TO オープンフラグ.
002570     PERFORM プリンタファイル作成.
002370     PERFORM 初期化.
002380************
002390*           *
002400* 主処理     *
002410*           *
002420************
002430     PERFORM 連結項目待避.
002440     PERFORM 施術所情報マスタ読込.
002450     PERFORM 金額集計.
002460     PERFORM 印刷レコードセット.
002470     PERFORM 印刷処理.
002480************
002490*           *
002500* 終了処理   *
002510*           *
002520************
002530     PERFORM 終了処理.
002540     EXIT PROGRAM.
002550*
002560*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002860*================================================================*
002870 プリンタファイル作成 SECTION.
002880*================================================================*
002890*   / 初期化 /
002900     MOVE SPACE TO Ｈ連ＰＲＴＦ－作成データ.
002910     INITIALIZE Ｈ連ＰＲＴＦ－作成データ.
002920*
002930*
002940*--↓↓ 変更箇所 ↓↓--------------------------------------*
002970*   使用するプリンタファイル名セット
      *   印字調整有り
002971     MOVE "PRTF001"             TO Ｈ連ＰＲＴＦ－ファイル名.
002972*
002973*   使用する帳票プログラム名セット
002974     MOVE "NJY582"             TO Ｈ連ＰＲＴＦ－帳票プログラム名.
002975*
002976*--↑↑-----------------------------------------------------*
002980*
002990*   / プレビュー区分セット /
003000     MOVE 連印－プレビュー区分 TO Ｈ連ＰＲＴＦ－プレビュー区分.
003010*
003020     CALL   "CRTPRTF".
003030     CANCEL "CRTPRTF".
003040*
002570*================================================================*
002580 初期化 SECTION.
002590*
002600     OPEN INPUT 元号マスタ.
002610             MOVE NC"元号" TO ファイル名Ｗ.
002620             PERFORM オープンチェック.
002630     OPEN INPUT 制御情報マスタ.
002640             MOVE NC"制御" TO ファイル名Ｗ.
002650             PERFORM オープンチェック.
002660     OPEN INPUT 施術所情報マスタ.
002670             MOVE NC"施情" TO ファイル名Ｗ.
002680             PERFORM オープンチェック.
002710*
002870* 連結項目の待避
002880     MOVE 連印－請求和暦 TO 請求和暦Ｗ.
002890     MOVE 連印－請求年   TO 請求年Ｗ.
002900     MOVE 連印－請求月   TO 請求月Ｗ.
002910     MOVE 請求和暦Ｗ  TO 元－元号区分.
002920     READ 元号マスタ
002930     INVALID KEY
002940         MOVE SPACE         TO 請求和暦名称Ｗ
002950     NOT INVALID KEY
002960         MOVE 元－元号名称  TO 請求和暦名称Ｗ
002970     END-READ.
002980*
002990*================================================================*
003000 オープンチェック SECTION.
003010*
003020     IF 状態キー  NOT =  "00"
003030         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
003040         DISPLAY NC"状態キー：" 状態キー           UPON CONS
003050         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003060                                                   UPON CONS
000080*-----------------------------------------*
000090         CALL "actcshm"  WITH C LINKAGE
000100*-----------------------------------------*
003070         ACCEPT  キー入力 FROM CONS
003080         PERFORM ファイル閉鎖
003090         EXIT PROGRAM.
003530*================================================================*
003540 施術所情報マスタ読込 SECTION.
003550*
003560     MOVE ZERO TO 施情－施術所番号.
003570     READ 施術所情報マスタ
003580     INVALID KEY
003590         MOVE NC"施情" TO ファイル名Ｗ
003600         PERFORM エラー表示Ｒ
003610         PERFORM ファイル閉鎖
003620         MOVE 99 TO PROGRAM-STATUS
003630         EXIT PROGRAM
003640     NOT INVALID KEY
003650         MOVE 施情－接骨師会会員番号  TO 会員番号Ｗ
003720         MOVE 施情－接骨院名         TO 接骨院名Ｗ
003730         MOVE 施情－代表者名         TO 代表者名Ｗ
003750     END-READ.
003760*
003770*================================================================*
003810*================================================================*
003820 ファイル閉鎖 SECTION.
003830*
003570     IF ( オープンフラグ = "YES" )
003580         CLOSE 印刷ファイル
003590     ELSE
003600         MOVE  NC"　　データが０件です。確認して下さい。" TO 連メ－メッセージ
003610         CALL   "MSG001"
003620         CANCEL "MSG001"
003630     END-IF.
003640*
003840     CLOSE  元号マスタ   制御情報マスタ 施術所情報マスタ.
003860*================================================================*
003870 終了処理 SECTION.
003880*
003890     PERFORM ファイル閉鎖.
003900*================================================================*
003910 連結項目待避 SECTION.
003920*
003930     MOVE SPACE TO 総括表Ｗ.
003940     INITIALIZE    総括表Ｗ.
003950     MOVE  連印－合計枚数         TO 合計枚数Ｗ.
003950     MOVE  連印－合計件数         TO 合計件数Ｗ.
003960     MOVE  連印－合計費用額       TO 合計費用額Ｗ.
003970     MOVE  連印－合計請求額       TO 合計請求額Ｗ.
003950     MOVE  連印－他合計件数       TO 他合計件数Ｗ.
003970     MOVE  連印－他合計費用額     TO 他合計費用額Ｗ.
003970     MOVE  連印－他合計請求額     TO 他合計請求額Ｗ.
003970     MOVE  連印－総合計件数       TO 総合計件数Ｗ.
003970     MOVE  連印－総合計費用額     TO 総合計費用額Ｗ.
003970     MOVE  連印－総合計請求額     TO 総合計請求額Ｗ.
003980*================================================================*
003990 金額集計 SECTION.
004000*
004010     OPEN INPUT 作業ファイル１.
004020         MOVE NC"作１" TO ファイル名Ｗ.
004030         PERFORM オープンチェック.
004040     MOVE SPACE TO 終了フラグ２.
004050     MOVE SPACE TO 終了フラグ３.
004060     PERFORM 作業ファイル１読込.
004070     PERFORM UNTIL ( 終了フラグ２ NOT = SPACE )
004080         PERFORM 集計処理１
004090         PERFORM 作業ファイル１読込
004100     END-PERFORM.
004110     CLOSE 作業ファイル１.
004120*================================================================*
004130 作業ファイル１読込 SECTION.
004140*
004150     READ 作業ファイル１ NEXT
004160     AT END
004170         MOVE "YES" TO 終了フラグ２
004180         INITIALIZE 作１－レコード
004190     END-READ.
004200*================================================================*
004210 集計処理１ SECTION.
004220*
004230     EVALUATE 作１－保険区分
004360     WHEN 1
004290         MOVE 作１－件数       TO 社保件数Ｗ  
004300         MOVE 作１－費用額     TO 社保費用額Ｗ
004310         MOVE 作１－請求額     TO 社保請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 社保平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004280     WHEN 3
004290         MOVE 作１－件数       TO 日雇件数Ｗ  
004300         MOVE 作１－費用額     TO 日雇費用額Ｗ
004310         MOVE 作１－請求額     TO 日雇請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 日雇平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004240     WHEN 2
004290         MOVE 作１－件数       TO 船員件数Ｗ  
004300         MOVE 作１－費用額     TO 船員費用額Ｗ
004310         MOVE 作１－請求額     TO 船員請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 船員平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004240     WHEN 4
004370         MOVE 作１－件数       TO 組合件数Ｗ  
004380         MOVE 作１－費用額     TO 組合費用額Ｗ
004390         MOVE 作１－請求額     TO 組合請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 組合平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004240     WHEN 5
004330         MOVE 作１－件数       TO 共済件数Ｗ  
004340         MOVE 作１－費用額     TO 共済費用額Ｗ
004350         MOVE 作１－請求額     TO 共済請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 共済平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004320     WHEN 6
004250         MOVE 作１－件数       TO 国保件数Ｗ  
004260         MOVE 作１－費用額     TO 国保費用額Ｗ
004270         MOVE 作１－請求額     TO 国保請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 国保平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004440     WHEN 7
004410         MOVE 作１－件数       TO 退職件数Ｗ  
004420         MOVE 作１－費用額     TO 退職費用額Ｗ
004430         MOVE 作１－請求額     TO 退職請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 退職平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 8
004410         MOVE 作１－件数       TO 後高件数Ｗ  
004420         MOVE 作１－費用額     TO 後高費用額Ｗ
004430         MOVE 作１－請求額     TO 後高請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 後高平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 9
004410         MOVE 作１－件数       TO 被爆件数Ｗ  
004420         MOVE 作１－費用額     TO 被爆費用額Ｗ
004430         MOVE 作１－請求額     TO 被爆請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 被爆平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 10
004410         MOVE 作１－件数       TO 障害件数Ｗ  
004420         MOVE 作１－費用額     TO 障害費用額Ｗ
004430         MOVE 作１－請求額     TO 障害請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 障害平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 11
004410         MOVE 作１－件数       TO 乳児件数Ｗ  
004420         MOVE 作１－費用額     TO 乳児費用額Ｗ
004430         MOVE 作１－請求額     TO 乳児請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 乳児平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 12
004410         MOVE 作１－件数       TO 母子件数Ｗ  
004420         MOVE 作１－費用額     TO 母子費用額Ｗ
004430         MOVE 作１－請求額     TO 母子請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 母子平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 13
004410         MOVE 作１－件数       TO 福祉件数Ｗ
004420         MOVE 作１－費用額     TO 福祉費用額Ｗ
004430         MOVE 作１－請求額     TO 福祉請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 福祉平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004400     WHEN 14
004410         MOVE 作１－件数       TO その他件数Ｗ  
004420         MOVE 作１－費用額     TO その他費用額Ｗ
004430         MOVE 作１－請求額     TO その他請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE その他平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004480     WHEN 21
004490         MOVE 作１－件数       TO 労災件数Ｗ  
004500         MOVE 作１－費用額     TO 労災費用額Ｗ
004510         MOVE 作１－請求額     TO 労災請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 労災平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004480     WHEN 22
004490         MOVE 作１－件数       TO 自賠件数Ｗ  
004500         MOVE 作１－費用額     TO 自賠費用額Ｗ
004510         MOVE 作１－請求額     TO 自賠請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 自賠平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004480     WHEN 23
004490         MOVE 作１－件数       TO 生保件数Ｗ  
004500         MOVE 作１－費用額     TO 生保費用額Ｗ
004510         MOVE 作１－請求額     TO 生保請求額Ｗ
               IF 作１－件数 NOT = ZERO
                   COMPUTE 生保平均請求額Ｗ = 作１－請求額 / 作１－件数
               END-IF
004520     END-EVALUATE.
004530*================================================================*
004540 印刷レコードセット SECTION.
004550*
004560     MOVE SPACE TO NJY582P.
004570*     INITIALIZE NJY582P.
004580     MOVE 請求和暦名称Ｗ       TO 請求和暦.
004590     MOVE 請求年Ｗ             TO 請求年.
004600     MOVE 請求月Ｗ             TO 請求月.
004610*     MOVE 施術所コードＷ       TO 施術機関番号.
004620*     MOVE 施術所郵便番号１Ｗ   TO 郵便番号１.
004630*     MOVE 施術所郵便番号２Ｗ   TO 郵便番号２.
004640*     MOVE 施術所住所Ｗ         TO 住所.
004870     MOVE 合計枚数Ｗ           TO 枚数.
004650     MOVE 会員番号Ｗ           TO 会員番号.
004650     MOVE 接骨院名Ｗ           TO 施術所名.
004650     MOVE 代表者名Ｗ           TO 氏名.
004660     MOVE 国保件数Ｗ           TO 国保件数  .
004670     MOVE 国保費用額Ｗ         TO 国保費用額.
004680     MOVE 国保請求額Ｗ         TO 国保請求額.
004680     MOVE 国保平均請求額Ｗ     TO 国保平均請求額.
004690     MOVE 社保件数Ｗ           TO 社保件数  .
004700     MOVE 社保費用額Ｗ         TO 社保費用額.
004710     MOVE 社保請求額Ｗ         TO 社保請求額.
004680     MOVE 社保平均請求額Ｗ     TO 社保平均請求額.
004690     MOVE 日雇件数Ｗ           TO 日雇件数  .
004700     MOVE 日雇費用額Ｗ         TO 日雇費用額.
004710     MOVE 日雇請求額Ｗ         TO 日雇請求額.
004680     MOVE 日雇平均請求額Ｗ     TO 日雇平均請求額.
004690     MOVE 船員件数Ｗ           TO 船員件数  .
004700     MOVE 船員費用額Ｗ         TO 船員費用額.
004710     MOVE 船員請求額Ｗ         TO 船員請求額.
004680     MOVE 船員平均請求額Ｗ     TO 船員平均請求額.
004750     MOVE 組合件数Ｗ           TO 組合件数  .
004760     MOVE 組合費用額Ｗ         TO 組合費用額.
004770     MOVE 組合請求額Ｗ         TO 組合請求額.
004680     MOVE 組合平均請求額Ｗ     TO 組合平均請求額.
004720     MOVE 共済件数Ｗ           TO 共済件数  .
004730     MOVE 共済費用額Ｗ         TO 共済費用額.
004740     MOVE 共済請求額Ｗ         TO 共済請求額.
004680     MOVE 共済平均請求額Ｗ     TO 共済平均請求額.
004660     MOVE 退職件数Ｗ           TO 退職件数  .
004670     MOVE 退職費用額Ｗ         TO 退職費用額.
004680     MOVE 退職請求額Ｗ         TO 退職請求額.
004680     MOVE 退職平均請求額Ｗ     TO 退職平均請求額.
004810     MOVE 後高件数Ｗ           TO 後高件数  .
004820     MOVE 後高費用額Ｗ         TO 後高費用額.
004830     MOVE 後高請求額Ｗ         TO 後高請求額.
004680     MOVE 後高平均請求額Ｗ     TO 後高平均請求額.
004810     MOVE 福祉件数Ｗ           TO 福祉件数  .
004820     MOVE 福祉費用額Ｗ         TO 福祉費用額.
004830     MOVE 福祉請求額Ｗ         TO 福祉請求額.
004680     MOVE 福祉平均請求額Ｗ     TO 福祉平均請求額.
004810     MOVE 障害件数Ｗ           TO 障害件数  .
004820     MOVE 障害費用額Ｗ         TO 障害費用額.
004830     MOVE 障害請求額Ｗ         TO 障害請求額.
004680     MOVE 障害平均請求額Ｗ     TO 障害平均請求額.
004810     MOVE 母子件数Ｗ           TO 母子件数  .
004820     MOVE 母子費用額Ｗ         TO 母子費用額.
004830     MOVE 母子請求額Ｗ         TO 母子請求額.
004680     MOVE 母子平均請求額Ｗ     TO 母子平均請求額.
004810     MOVE 乳児件数Ｗ           TO 乳児件数  .
004820     MOVE 乳児費用額Ｗ         TO 乳児費用額.
004830     MOVE 乳児請求額Ｗ         TO 乳児請求額.
004680     MOVE 乳児平均請求額Ｗ     TO 乳児平均請求額.
004810     MOVE 被爆件数Ｗ           TO 被爆件数  .
004820     MOVE 被爆費用額Ｗ         TO 被爆費用額.
004830     MOVE 被爆請求額Ｗ         TO 被爆請求額.
004680     MOVE 被爆平均請求額Ｗ     TO 被爆平均請求額.
004810     MOVE その他件数Ｗ         TO その他件数  .
004820     MOVE その他費用額Ｗ       TO その他費用額.
004830     MOVE その他請求額Ｗ       TO その他請求額.
004680     MOVE その他平均請求額Ｗ   TO その他平均請求額.
004840     MOVE 労災件数Ｗ           TO 労災件数  .
004850     MOVE 労災費用額Ｗ         TO 労災費用額.
004850     MOVE 労災請求額Ｗ         TO 労災請求額.
004680     MOVE 労災平均請求額Ｗ     TO 労災平均請求額.
004840*     MOVE 自賠件数Ｗ           TO 自賠件数  .
004850*     MOVE 自賠費用額Ｗ         TO 自賠費用額.
004850*     MOVE 自賠請求額Ｗ         TO 自賠請求額.
004680*     MOVE 自賠平均請求額Ｗ     TO 自賠平均請求額.
004840*     MOVE 生保件数Ｗ           TO 生保件数  .
004850*     MOVE 生保費用額Ｗ         TO 生保費用額.
004850*     MOVE 生保請求額Ｗ         TO 生保請求額.
004680*     MOVE 生保平均請求額Ｗ     TO 生保平均請求額.
004870     MOVE 合計件数Ｗ           TO 合計件数.
004880     MOVE 合計費用額Ｗ         TO 合計費用額.
004890     MOVE 合計請求額Ｗ         TO 合計請求額.
           IF 合計件数Ｗ NOT = ZERO
               COMPUTE 合計平均請求額 = 合計請求額Ｗ / 合計件数Ｗ
           ELSE
               MOVE ZERO             TO 合計平均請求額
           END-IF.
004660     MOVE 他合計件数Ｗ         TO 他合計件数  .
004880     MOVE 他合計費用額Ｗ       TO 他合計費用額.
004680     MOVE 他合計請求額Ｗ       TO 他合計請求額.
           IF 他合計件数Ｗ NOT = ZERO
               COMPUTE 他合計平均請求額 = 他合計請求額Ｗ / 他合計件数Ｗ
           ELSE
               MOVE ZERO             TO 他合計平均請求額
           END-IF.
004880     MOVE 総合計件数Ｗ         TO 総合計件数.
004880     MOVE 総合計費用額Ｗ       TO 総合計費用額.
004890     MOVE 総合計請求額Ｗ       TO 総合計請求額.
           IF 総合計件数Ｗ NOT = ZERO
               COMPUTE 総合計平均請求額 = 総合計請求額Ｗ / 総合計件数Ｗ
           ELSE
               MOVE ZERO             TO 総合計平均請求額
           END-IF.
004900*================================================================*
004910 印刷処理 SECTION.
004920*
006050     IF ( オープンフラグ NOT = "YES" )
006060        MOVE "YES" TO オープンフラグ
006070        OPEN I-O  印刷ファイル
006080        PERFORM エラー処理Ｐ
006090     END-IF.
004930     MOVE "NJY582P"  TO  定義体名Ｐ.
004940     MOVE "SCREEN"   TO  項目群名Ｐ.
004950     MOVE SPACE      TO  処理種別Ｐ.
004960     MOVE SPACE      TO  拡張制御Ｐ.
004970     WRITE NJY582P.
004980     PERFORM エラー処理Ｐ.
004990*================================================================*
005000 エラー表示 SECTION.
005010*
005020     DISPLAY NC"ファイル書込エラー：" ファイル名Ｗ UPON CONS.
005030     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005040     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
005050     ACCEPT  キー入力 FROM CONS.
005060*================================================================*
005070 エラー処理Ｐ SECTION.
005080*
005090     IF 通知情報Ｐ NOT = "00"
005100         DISPLAY NC"帳票エラー"              UPON CONS
005110         DISPLAY NC"項目群名Ｐ：" 項目群名Ｐ UPON CONS
005120         DISPLAY NC"通知情報Ｐ：" 通知情報Ｐ UPON CONS
005130         DISPLAY NC"拡張制御Ｐ：" 拡張制御Ｐ UPON CONS
005140         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005150                                             UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
005160         ACCEPT  キー入力 FROM CONS
005170         PERFORM ファイル閉鎖
005180         MOVE 99 TO PROGRAM-STATUS
005190         EXIT PROGRAM
005200     END-IF.
005210*================================================================*
005220 エラー表示Ｒ SECTION.
005230*
005240     DISPLAY NC"ファイル読込エラー" ファイル名Ｗ UPON CONS.
005250     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
005260     ACCEPT  キー入力 FROM CONS.
005270     PERFORM ファイル閉鎖.
005280     EXIT PROGRAM.
005290*================================================================*
005300 エラー表示その他 SECTION.
005310*
005320     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
005330     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
005340                                                   UPON CONS.
000080*-----------------------------------------*
000090     CALL "actcshm"  WITH C LINKAGE.
000100*-----------------------------------------*
005350     ACCEPT  キー入力 FROM CONS.
005360     PERFORM ファイル閉鎖.
005370     EXIT PROGRAM.
005380*================================================================*
005390******************************************************************
005400 END PROGRAM NJY582.
005410******************************************************************
