000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJB101.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【ﾃﾞｰﾀ作成】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100*
000110* ※ 請求年月Verのみ. (並び順は、総括表581と同じ）
000120*　　画面を総括表と一緒にした
      */会依頼レセまとめの場合は費用１０割・負担０円・請求０円。とする。*/20170603
      */金属副子、運動後療、明細書発行を変更追加/220810
      *
000130*      MED = YJB100G 
000140*----------------------------------------------------------------*
000150 DATE-WRITTEN.           2010-04-08
000160 DATE-COMPILED.          2010-04-08
000170*----------------------------------------------------------------*
000180******************************************************************
000190*            ENVIRONMENT         DIVISION                        *
000200******************************************************************
000210 ENVIRONMENT             DIVISION.
000220 CONFIGURATION           SECTION.
000230 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000240 OBJECT-COMPUTER.        FMV-DESKPOWER.
000250 SPECIAL-NAMES.          CONSOLE  IS  CONS
000260                         SYSERR   IS  MSGBOX.
000270 INPUT-OUTPUT            SECTION.
000280 FILE-CONTROL.
000281     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000282                             ORGANIZATION             IS  INDEXED
000283                             ACCESS MODE              IS  DYNAMIC
000284                             RECORD KEY               IS  制－制御区分
000285                             FILE STATUS              IS  状態キー
000286                             LOCK        MODE         IS  AUTOMATIC.
000290     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000300                             ORGANIZATION             IS  INDEXED
000310                             ACCESS MODE              IS  DYNAMIC
000320                             RECORD KEY               IS  元－元号区分
000330                             FILE STATUS              IS  状態キー
000340                             LOCK        MODE         IS  AUTOMATIC.
000350     SELECT  名称マスタ      ASSIGN      TO        MEISYOL
000360                             ORGANIZATION             IS  INDEXED
000370                             ACCESS MODE              IS  DYNAMIC
000380                             RECORD KEY               IS  名－区分コード
000390                                                          名－名称コード
000400                             FILE STATUS              IS  状態キー
000410                             LOCK        MODE         IS  AUTOMATIC.
000420     SELECT  施術所情報マスタ ASSIGN      TO        SEJOHOL
000430                             ORGANIZATION             IS  INDEXED
000440                             ACCESS MODE              IS  DYNAMIC
000450                             RECORD KEY               IS 施情－施術所番号
000460                             FILE STATUS              IS  状態キー
000470                             LOCK        MODE         IS  AUTOMATIC.
000480     SELECT  施術記録Ｆ      ASSIGN      TO        SEKIROKL
000490                             ORGANIZATION             IS  INDEXED
000500                             ACCESS MODE              IS  DYNAMIC
000510                             RECORD KEY           IS 施記－施術和暦年月日
000520                                                     施記－患者コード
000530                             ALTERNATE RECORD KEY IS 施記－患者コード
000540                                                     施記－施術和暦年月日
000550                             FILE STATUS              IS  状態キー
000560                             LOCK        MODE         IS  AUTOMATIC.
000260     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000270                             ORGANIZATION             IS  INDEXED
000280                             ACCESS MODE              IS  DYNAMIC
000290                             RECORD KEY               IS  受－施術和暦年月
000300                                                          受－患者コード
000310                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000320                                                          受－患者カナ
000330                                                          受－患者コード
000340                             ALTERNATE RECORD KEY     IS  受－患者コード
000350                                                          受－施術和暦年月
000360                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000370                                                          受－保険種別
000380                                                          受－保険者番号
000390                                                          受－患者コード
000400                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000410                                                          受－公費種別
000420                                                          受－費用負担者番号
000430                                                          受－患者コード
000440                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000450                                                          受－助成種別
000460                                                          受－費用負担者番号助成
000470                                                          受－患者コード
000480                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000490                                                          受－施術和暦年月
000500                                                          受－患者コード
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
000840     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
000850                             ORGANIZATION             IS  INDEXED
000860                             ACCESS MODE              IS  DYNAMIC
000870                             RECORD KEY               IS 負－施術和暦年月
000880                                                         負－患者コード
000890                             ALTERNATE RECORD KEY     IS 負－患者コード
000900                                                         負－施術和暦年月
000910                             FILE STATUS              IS  状態キー
000920                             LOCK        MODE         IS  AUTOMATIC.
000921     SELECT  負傷原因Ｆ      ASSIGN      TO        HUGEINL
000922                             ORGANIZATION             IS  INDEXED
000923                             ACCESS MODE              IS  DYNAMIC
000924                             RECORD KEY               IS  負原－区分コード
000925                                                          負原－負傷原因コード
000926                             FILE STATUS              IS  状態キー
000927                             LOCK        MODE         IS  AUTOMATIC.
000930     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000940                             ORGANIZATION             IS  INDEXED
000950                             ACCESS MODE              IS  DYNAMIC
000960                             RECORD KEY               IS  市－公費種別
000970                                                          市－市町村番号
000980                             ALTERNATE RECORD KEY     IS  市－公費種別
000990                                                          市－市町村名称
001000                                                          市－市町村番号
001010                             FILE STATUS              IS  状態キー
001020                             LOCK        MODE         IS  AUTOMATIC.
000130     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
000140                             ORGANIZATION             IS  INDEXED
000150                             ACCESS MODE              IS  DYNAMIC
000160                             RECORD KEY               IS  レセ－施術和暦年月
000170                                                          レセ－患者コード
000180                                                          レセ－レセ種別
000190                             ALTERNATE RECORD KEY     IS  レセ－患者コード
000200                                                          レセ－施術和暦年月
000210                                                          レセ－レセ種別
000220                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000230                                                          レセ－施術和暦年月
000240                                                          レセ－患者コード
000250                                                          レセ－レセ種別
000260                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000270                                                          レセ－レセ種別
000280                                                          レセ－請求保険者番号
000290                                                          レセ－患者コード
000300                                                          レセ－施術和暦年月
000310                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
000320                                                          レセ－請求保険者番号
000330                                                          レセ－患者コード
000340                                                          レセ－レセ種別
000350                                                          レセ－施術和暦年月
000360                             FILE STATUS              IS  状態キー
000370                             LOCK        MODE         IS  AUTOMATIC.
000611     SELECT  会計データＦ    ASSIGN      TO        KAIKEIL
000612                             ORGANIZATION             IS  INDEXED
000613                             ACCESS MODE              IS  DYNAMIC
000089                             RECORD KEY               IS  会－施術和暦年月日
000090                                                          会－患者コード
000092                             ALTERNATE RECORD KEY     IS  会－患者コード
000093                                                          会－施術和暦年月日
000621                             FILE STATUS              IS  状態キー
000622                             LOCK        MODE         IS  AUTOMATIC.
001090     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
001100                             ORGANIZATION             IS  SEQUENTIAL
001110                             ACCESS                   IS  SEQUENTIAL
001120                             FILE        STATUS       IS  状態キー
001130                             LOCK        MODE         IS  AUTOMATIC.
001140*
001210*  総括表と同じ保険者番号順ﾌｧｲﾙ
001211     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5803L.DAT"
001212                             ORGANIZATION             IS  INDEXED
001213                             ACCESS                   IS  DYNAMIC
001214                             RECORD      KEY          IS  作３－請求和暦年月
001215                                                          作３－助成区分
001216                                                          作３－保険者番号
001217                                                          作３－本人家族区分
001218                                                          作３－施術和暦年月
001219                                                          作３－被保険者カナ
001220                                                          作３－患者コード
                                                                作３－親子区分
001221                             FILE        STATUS       IS  状態キー
001222                             LOCK        MODE         IS  AUTOMATIC.
001223*
001224******************************************************************
001230*                      DATA DIVISION                             *
001240******************************************************************
001250 DATA                    DIVISION.
001260 FILE                    SECTION.
001261*                           ［ＲＬ＝  ２５６］
001262 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001263     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001270*                           ［ＲＬ＝  １２８］
001280 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001290     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001300*                           ［ＲＬ＝  １２８］
001310 FD  名称マスタ          BLOCK   CONTAINS   1   RECORDS.
001320     COPY MEISYO          OF  XFDLIB  JOINING   名   AS  PREFIX.
001330*
001340 FD  施術所情報マスタ    BLOCK   CONTAINS   1   RECORDS.
001350     COPY SEJOHO         OF  XFDLIB  JOINING   施情   AS  PREFIX.
001360*                           ［ＲＬ＝  ２５６］
001370 FD  施術記録Ｆ          BLOCK   CONTAINS   1   RECORDS.
001380     COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001390*                           ［ＲＬ＝  ３２０］
001400 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001410     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001420*                           ［ＲＬ＝  １２８］
001430 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001440     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001441*                           ［ＲＬ＝  １２８］
001442 FD  負傷原因Ｆ         BLOCK   CONTAINS   1   RECORDS.
001443     COPY HUGEIN          OF  XFDLIB  JOINING   負原   AS  PREFIX.
001450*                           ［ＲＬ＝  ２５６］
001460 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
001470     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
      *                          ［ＲＬ＝  １５３６］
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
000981*                           ［ＲＬ＝  ５１２］
000982 FD  会計データＦ        BLOCK   CONTAINS   1   RECORDS.
000983     COPY KAIKEI          OF  XFDLIB  JOINING   会   AS  PREFIX.
001510**
001520 FD  作業ファイル１ RECORD  CONTAINS 896 CHARACTERS.
001530 01  作１－レコード.
001531*   / ヘッダ部は使用しない /
001540     03  作１－レコードヘッダ.
001550         05  作１－請求和暦年月キー.
001560             07  作１－請求和暦            PIC 9.
001570             07  作１－請求年              PIC 9(2).
001580             07  作１－請求月              PIC 9(2).
001590         05  作１－施術和暦年月キー.
001600             07  作１－施術和暦            PIC 9.
001610             07  作１－施術年              PIC 9(2).
001620             07  作１－施術月              PIC 9(2).
001630         05  作１－保険区分キー            PIC 9.
001640         05  作１－保険者番号キー          PIC 9(8).
001650         05  作１－本人家族区分キー        PIC 9.
001660         05  作１－被保険者カナキー        PIC X(20).
001670         05  作１－患者コードキー.
001680             07 作１－患者番号             PIC 9(6).
001690             07 作１－枝番                 PIC X(1).
001700     03  作１－レコードデータ.
001710         05  作１－会員番号                PIC 9(4).
001720         05  作１－定額制受理番号区分      PIC 9.
001730         05  作１－請求年月                PIC 9(6).
001740         05  作１－レセプト番号            PIC 9(4).
001750         05  作１－施術年月                PIC 9(6).
001760         05  作１－該当保険種別            PIC 9.
001770         05  作１－保険者番号              PIC 9(8).
001780         05  作１－記号                    PIC X(20).
001790         05  作１－番号                    PIC X(16).
001800         05  作１－老人市町村番号          PIC 9(8).
001810         05  作１－老人受給者番号          PIC 9(8).
001820         05  作１－助成負担者番号          PIC 9(8).
001830         05  作１－助成受給者番号          PIC X(16).
001840         05  作１－被保険者氏名            PIC N(10).
001850         05  作１－被保険者カナ            PIC X(16).
001860         05  作１－患者氏名                PIC N(10).
001870         05  作１－患者カナ                PIC X(16).
001880         05  作１－本人家族区分            PIC 9.
001890         05  作１－患者性別                PIC 9.
001900         05  作１－患者生年月日            PIC 9(8).
001910         05  作１－被保険者住所            PIC X(28).
001920         05  作１－合計金額                PIC 9(6).
001930         05  作１－助成用保険給付割合      PIC 9(2).
001940         05  作１－一部負担金              PIC 9(6).
001950         05  作１－請求金額                PIC 9(6).
001960         05  作１－部位数                  PIC 9.
001970         05  作１－負傷原因                PIC N(10).
001980         05  作１－長期理由                PIC N(16).
001990         05  作１－新規区分                PIC 9.
002000         05  作１－継続区分                PIC 9.
002010         05  作１－初検回数                PIC 9.
002020         05  作１－初検時間外加算回数      PIC 9.
002030         05  作１－初検休日加算回数        PIC 9.
002040         05  作１－初検深夜加算回数        PIC 9.
002050         05  作１－再検回数                PIC 9.
002060         05  作１－往療距離                PIC 9(3).
002070         05  作１－往療回数                PIC 9(2).
002080         05  作１－夜間加算往療回数        PIC 9.
002090         05  作１－難路加算往療回数        PIC 9(2).
002100         05  作１－暴風雨雪加算往療回数    PIC 9(2).
002110         05  作１－金属副子回数            PIC 9.
002120         05  作１－ダミー                  PIC X.
002130         05  作１－運動後療回数            PIC 9.
002140         05  作１－情報提供料回数          PIC 9.
002150*
002160         05  作１－負傷部位データ  OCCURS 6.
002170             07  作１－負傷区分            PIC 9.
002180             07  作１－負傷名              PIC N(16).
002190             07  作１－初回処置回数        PIC 9.
002200             07  作１－負傷年月日          PIC 9(8).
002210             07  作１－初検年月日          PIC 9(8).
002220             07  作１－施術開始年月日      PIC 9(8).
002230             07  作１－施術終了年月日      PIC 9(8).
002240             07  作１－実日数              PIC 9(2).
002250             07  作１－転帰区分            PIC 9.
002260             07  作１－後療回数            PIC 9(2).
002270             07  作１－冷罨法回数          PIC 9.
002280             07  作１－温罨法回数          PIC 9(2).
002290             07  作１－電療回数            PIC 9(2).
002300             07  作１－多部位逓減区分      PIC 9.
002310             07  作１－長期逓減区分        PIC 9.
      */追加110125
               05  作１－業者区分                PIC 9(2).
               05  作１－相談支援回数            PIC 9.
               05  作１－施術日                  PIC X(31).
      */追加220609
               05  作１－明細発行加算回数        PIC 9(1).
               05  作１－明細発行体制料          PIC 9(3).
               05  作１－明細書発行月日          PIC 9(4).
002320         05  FILLER                        PIC X(29).
002330***
002331* 保険者番号順ファイル
002332 FD  作業ファイル３ RECORD  CONTAINS 64 CHARACTERS.
002333 01  作３－レコード.
002334     03  作３－レコードキー.
002335         05  作３－請求和暦年月.
002336             07  作３－請求和暦            PIC 9.
002337             07  作３－請求年              PIC 9(2).
002338             07  作３－請求月              PIC 9(2).
002339         05  作３－助成区分                PIC 9.
002340         05  作３－保険者番号              PIC 9(8).
002341         05  作３－本人家族区分            PIC 9.
002342         05  作３－施術和暦年月.
002343             07  作３－施術和暦            PIC 9.
002344             07  作３－施術年              PIC 9(2).
002345             07  作３－施術月              PIC 9(2).
002346         05  作３－被保険者カナ            PIC X(20).
002347         05  作３－患者コード.
002348             07 作３－患者番号             PIC 9(6).
002349             07 作３－枝番                 PIC X(1).
002339         05  作３－親子区分                PIC 9.
002350     03  作３－レコードデータ.
002351         05  FILLER                        PIC X(16).
002352*
002353*----------------------------------------------------------------*
002354******************************************************************
002360*                WORKING-STORAGE SECTION                         *
002370******************************************************************
002380 WORKING-STORAGE         SECTION.
002390 01 キー入力                           PIC X    VALUE SPACE.
002400 01 状態キー                           PIC X(2) VALUE SPACE.
002410 01 初検フラグ                         PIC X(3) VALUE SPACE.
002420 01 終了フラグ                         PIC X(3) VALUE SPACE.
002430 01 終了フラグ２                       PIC X(3) VALUE SPACE.
001270 01 終了フラグ４                       PIC X(3) VALUE SPACE.
002440 01 実行キーＷ                         PIC X(3) VALUE SPACE.
002450 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002460 01 ファイル名                         PIC N(8) VALUE SPACE.
002470*
002480 01 保険種別ＷＲ                       PIC 9(2) VALUE ZERO.
002490 01 患者コードＷＲ.
002500    03 患者番号ＷＲ                    PIC 9(6) VALUE ZERO.
002510    03 枝番ＷＲ                        PIC X    VALUE SPACE.
002520*
002530 01 印刷形式ＷＲ                       PIC 9    VALUE ZERO.
002540 01 保険者番号ＷＲ                     PIC X(10) VALUE SPACE.
002550 01 レセプト種類ＷＲ                   PIC X(4) VALUE SPACE.
002560 01 本人家族区分ＷＲ                   PIC 9    VALUE ZERO.
002570 01 続柄Ｗ                             PIC N(2) VALUE SPACE.
002580 01 施術和暦年月ＷＲ.
002590    03 施術和暦ＷＲ                    PIC 9    VALUE ZERO.
002600    03 施術年ＷＲ                      PIC 9(2) VALUE ZERO.
002610    03 施術月ＷＲ                      PIC 9(2) VALUE ZERO.
002620 01 請求和暦年月ＷＲ.
002630    03 請求和暦ＷＲ                    PIC 9    VALUE ZERO.
002640    03 請求年ＷＲ                      PIC 9(2) VALUE ZERO.
002650    03 請求月ＷＲ                      PIC 9(2) VALUE ZERO.
002660**
002670 01 連番Ｗ                             PIC 9(4) VALUE ZERO.
002680 01 助成フラグ                         PIC X(3) VALUE SPACE.
002690 01 負傷名称Ｗ                         PIC N(6)  VALUE SPACE.
002700 01 負傷種別変換前Ｗ                   PIC 9(2)  VALUE ZERO.
002710 01 負傷種別変換後Ｗ                   PIC 9     VALUE ZERO.
002720 01 転帰変換前Ｗ                       PIC 9     VALUE ZERO.
002730 01 転帰変換後Ｗ                       PIC 9     VALUE ZERO.
002740**
002750 01 部位ＣＮＴ                         PIC 9     VALUE ZERO.
002760 01 カウンタ                           PIC 9(2)  VALUE ZERO.
002770 01 カウンタ２                         PIC 9(3)  VALUE ZERO.
002780 01 カウンタ３                         PIC 9(2)  VALUE ZERO.
002790 01 全角空白                           PIC X(2)  VALUE X"8140".
002800 01 半角空白                           PIC X(2)  VALUE X"2020".
002810**
       01 氏名Ｗ.
          03 全角氏名Ｗ                      PIC N(10) VALUE SPACE.
002820** エラーメッセージ用
002830 01 エラーメッセージＷ.
002840    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002850    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002860    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002870    03 FILLER                          PIC X(10) VALUE SPACE.
002880** 保険者番号右詰め用
002890 01 保険者番号ＷＴ.
002900    03 保険者番号左詰めＷ.
002910      05 保険者番号左詰めＷ１          PIC X OCCURS 8 VALUE SPACE.
002920    03 保険者番号右詰めＷ.
002930      05 保険者番号右詰めＷ１          PIC X OCCURS 8 VALUE ZERO.
002940    03 保険者番号数字Ｗ                PIC 9(8)  VALUE ZERO.
002950    03 保険者番号Ｗ                    PIC X(8)  VALUE SPACE.
002960** 会員番号右詰め用
002970 01 会員番号ＷＴ.
002980    03 会員番号左詰めＷ.
002990      05 会員番号左詰めＷ１            PIC X OCCURS 7 VALUE SPACE.
003000    03 会員番号右詰めＷ.
003010      05 会員番号右詰めＷ１            PIC X OCCURS 7 VALUE ZERO.
003020    03 会員番号数字Ｗ                  PIC 9(7)  VALUE ZERO.
003030    03 会員番号Ｗ                      PIC X(7)  VALUE SPACE.
003040** 西暦日付ワーク用
003050 01 西暦年月Ｗ.
003060    03 西暦年Ｗ                        PIC 9(4) VALUE ZERO.
003070    03 西暦月Ｗ                        PIC 9(2) VALUE ZERO.
003080** 西暦請求年月用
003090 01 西暦請求年月Ｗ.
003100    03 西暦請求年Ｗ                    PIC 9(4) VALUE ZERO.
003110    03 西暦請求月Ｗ                    PIC 9(2) VALUE ZERO.
003120** 西暦施術年月用
003130 01 西暦施術年月Ｗ.
003140    03 西暦施術年Ｗ                    PIC 9(4) VALUE ZERO.
003150    03 西暦施術月Ｗ                    PIC 9(2) VALUE ZERO.
003160** 記号左詰め用
003170 01 記号ＷＴ.
003180    03 記号元Ｗ.
003190      05 記号元Ｗ１                    PIC N OCCURS 12 VALUE SPACE.
003200    03 記号左詰めＷ.
003210      05 記号左詰めＷ１                PIC N OCCURS 12 VALUE SPACE.
003180    03 記号元ＸＷ.
003190      05 記号元ＸＷ１                  PIC X OCCURS 24 VALUE SPACE.
003200    03 記号左詰めＸＷ.
003210      05 記号左詰めＸＷ１              PIC X OCCURS 24 VALUE SPACE.
003220    03 記号Ｗ.
003230      05 記号ＮＷ                      PIC N(12) VALUE SPACE.
003240    03 記号ＰＷ.
003250      05 記号ＰＮＷ                    PIC X(24) VALUE SPACE.
003260** 助成負担者番号左詰め用
003270 01 助成番号ＷＴ.
003280    03 助成番号元Ｗ.
003290      05 助成番号元Ｗ１                PIC X OCCURS 10 VALUE SPACE.
003300    03 助成番号左詰めＷ.
003310      05 助成番号左詰めＷ１            PIC X OCCURS 10 VALUE SPACE.
003320    03 助成番号Ｗ                      PIC X(10) VALUE SPACE.
003330*
003340** 西暦年月日ワーク用
003350 01 計算西暦年月日Ｗ.
003360    03 計算西暦年Ｗ                    PIC 9(4) VALUE ZERO.
003370    03 計算西暦月Ｗ                    PIC 9(2) VALUE ZERO.
003380    03 計算西暦日Ｗ                    PIC 9(2) VALUE ZERO.
003390 01 計算和暦年月日Ｗ.
003400    03 計算和暦Ｗ                      PIC 9 VALUE ZERO.
003410    03 計算年Ｗ                        PIC 9(2) VALUE ZERO.
003420    03 計算月Ｗ                        PIC 9(2) VALUE ZERO.
003430    03 計算日Ｗ                        PIC 9(2) VALUE ZERO.
003440** 枝番判定用
003450 01 開始診療日手動区分Ｗ               PIC 9    VALUE ZERO.
003460*
003470* 終了日退避用
003480 01 終了年月日ＷＴ.
003490    03 終了和暦ＷＴ                    PIC 9     VALUE ZERO.
003500    03 終了年ＷＴ                      PIC 9(2)  VALUE ZERO.
003510    03 終了月ＷＴ                      PIC 9(2)  VALUE ZERO.
003520    03 終了日ＷＴ                      PIC 9(2)  VALUE ZERO.
003530* 初検日退避用
003540 01 初検年月日ＷＴ.
003550    03 初検和暦ＷＴ                    PIC 9     VALUE ZERO.
003560    03 初検年ＷＴ                      PIC 9(2)  VALUE ZERO.
003570    03 初検月ＷＴ                      PIC 9(2)  VALUE ZERO.
003580    03 初検日ＷＴ                      PIC 9(2)  VALUE ZERO.
003590*
003591* 連計の金額退避用
003592 01 連計金額Ｗ.
003593    03  費用額Ｗ                   PIC 9(6) VALUE ZERO.
003594    03  負担額Ｗ                   PIC 9(6) VALUE ZERO.
003595    03  請求額Ｗ                   PIC 9(6) VALUE ZERO.
003596    03  費用額老人Ｗ               PIC 9(6) VALUE ZERO.
003597    03  負担額老人Ｗ               PIC 9(6) VALUE ZERO.
003598    03  請求額老人Ｗ               PIC 9(6) VALUE ZERO.
003599    03  費用額助成Ｗ               PIC 9(6) VALUE ZERO.
003600    03  負担額助成Ｗ               PIC 9(5) VALUE ZERO.
003601    03  請求額助成Ｗ               PIC 9(5) VALUE ZERO.
003602    03  負担率Ｗ                   PIC 9(3) VALUE ZERO.
003603*
003604* 負傷原因用
003605 01 負傷原因ＷＴ.
003606    03 負傷原因１ＷＴ                  PIC X(60) VALUE SPACE.
003607    03 負傷原因２ＷＴ                  PIC X(60) VALUE SPACE.
003608    03 負傷原因３ＷＴ                  PIC X(60) VALUE SPACE.
003609    03 負傷原因４ＷＴ                  PIC X(60) VALUE SPACE.
003610    03 負傷原因５ＷＴ                  PIC X(60) VALUE SPACE.
003611    03 負傷原因ナンバーＷＴ.
003612       05 負傷原因ナンバーＷ１         PIC X(2)  OCCURS 9 VALUE SPACE.
003613    03 負傷原因ナンバーＮＷ  REDEFINES 負傷原因ナンバーＷＴ PIC X(18).
003614 01 負傷患者番号ＣＷ                   PIC 9(6)  VALUE ZERO.
003615 01 負傷連番ＣＷ                       PIC 9(4)  VALUE ZERO.
003616 01 負傷原因ＴＢＬ.
003617    03 負傷原因コードＴＢＬ            OCCURS 9.
003618       05 負傷患者番号Ｗ               PIC 9(6)  VALUE ZERO.
003619       05 負傷連番Ｗ                   PIC 9(4)  VALUE ZERO.
003620       05 負傷原因部位Ｗ               PIC 9  OCCURS 9 VALUE ZERO.
003621 01 負傷原因内容Ｗ.
003622    03 負傷原因内容合成Ｗ              PIC X(318) OCCURS 9 VALUE SPACE.
003623    03 負傷原因内容分解ＸＷ.
003624       05 負傷原因内容１ＸＷ           PIC X(74)  VALUE SPACE.
003625       05 負傷原因内容２ＸＷ           PIC X(74)  VALUE SPACE.
003626       05 負傷原因内容３ＸＷ           PIC X(74)  VALUE SPACE.
003650       05 負傷原因内容４ＸＷ           PIC X(96)  VALUE SPACE.
003627*
003628** 負傷原因・長期理由印刷区分用
003629 01 負傷原因印刷区分Ｗ                 PIC 9 VALUE ZERO.
003630 01 長期理由印刷区分Ｗ                 PIC 9 VALUE ZERO.
003631*
003632** 助成レセまとめ用
003633 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
003634*
003635**********************************************************************************
003636*
003637 01 退避項目ＧＷ.
003638   03 レセプト種類Ｗ                   PIC X(4).
003640   03 レセプト種類ＧＷ                 PIC X(4).
003650   03 レセプト種別ＧＷ                 PIC 9(2).
003660*
003670****************
003680* 負傷データＦ *
003690****************
003700 01 負傷情報Ｗ.
003710    03 部位数Ｗ                        PIC 9(1)  VALUE ZERO.
003720    03 部位情報Ｗ  OCCURS   9.
003730       05 部位ＣＮＴＷ                 PIC 9(1)  VALUE ZERO.
003740       05 部位コードＷ.
003750          07 負傷種別Ｗ                PIC 9(2)  VALUE ZERO.
003760          07 部位Ｗ                    PIC 9(2)  VALUE ZERO.
003770          07 左右区分Ｗ                PIC 9(1)  VALUE ZERO.
003780          07 負傷位置番号Ｗ            PIC 9(2)  VALUE ZERO.
003790       05 負傷名Ｗ                     PIC N(18) VALUE SPACE.
003800       05 負傷年月日Ｗ.
003810          07 負傷和暦Ｗ                PIC 9     VALUE ZERO.
003820          07 負傷年Ｗ                  PIC 9(2)  VALUE ZERO.
003830          07 負傷月Ｗ                  PIC 9(2)  VALUE ZERO.
003840          07 負傷日Ｗ                  PIC 9(2)  VALUE ZERO.
003850       05 初検年月日Ｗ.
003860          07 初検和暦Ｗ                PIC 9     VALUE ZERO.
003870          07 初検年Ｗ                  PIC 9(2)  VALUE ZERO.
003880          07 初検月Ｗ                  PIC 9(2)  VALUE ZERO.
003890          07 初検日Ｗ                  PIC 9(2)  VALUE ZERO.
003900       05 開始年月日Ｗ.
003910          07 開始和暦Ｗ                PIC 9     VALUE ZERO.
003920          07 開始年Ｗ                  PIC 9(2)  VALUE ZERO.
003930          07 開始月Ｗ                  PIC 9(2)  VALUE ZERO.
003940          07 開始日Ｗ                  PIC 9(2)  VALUE ZERO.
003950       05 終了年月日Ｗ.
003960          07 終了和暦Ｗ                PIC 9     VALUE ZERO.
003970          07 終了年Ｗ                  PIC 9(2)  VALUE ZERO.
003980          07 終了月Ｗ                  PIC 9(2)  VALUE ZERO.
003990          07 終了日Ｗ                  PIC 9(2)  VALUE ZERO.
004000       05 実日数Ｗ                     PIC 9(2)  VALUE ZERO.
004010       05 初回処置回数Ｗ               PIC 9     VALUE ZERO.
004020       05 転帰区分Ｗ                   PIC 9(1)  VALUE ZERO.
004030    03 新規区分Ｗ                      PIC 9(1)  VALUE ZERO.
004040    03 継続区分Ｗ                      PIC 9(1)  VALUE ZERO.
          03 負傷原因Ｗ OCCURS 27.
004041       05 負傷原因ＷＰ                 PIC X(74) VALUE SPACE.
004050*
004060*********************************************************************
004070*    ************
004080*    * 料金情報 *
004090*    ************
004100*    月毎の料金
004110***********************
004120 01 料金１ＷＲ.
004130   03 初検ＷＲ.
004140      05 初検回数Ｗ                 PIC 9(1)    VALUE ZERO.
004150      05 初検時間外回数Ｗ           PIC 9(1)    VALUE ZERO.
004160      05 初検休日回数Ｗ             PIC 9(1)    VALUE ZERO.
004170      05 初検深夜回数Ｗ             PIC 9(1)    VALUE ZERO.
004180   03 再検回数Ｗ                    PIC 9(1)    VALUE ZERO.
004190   03 往療ＷＲ.
004200      05 往療回数Ｗ                 PIC 9(2)    VALUE ZERO.
004210      05 往療距離Ｗ                 PIC 9(3)V9  VALUE ZERO.
004211      05 往療距離２Ｗ               PIC 9(3)    VALUE ZERO.
004220      05 往療夜間Ｗ                 PIC 9(1)    VALUE ZERO.
004230      05 往療難路Ｗ                 PIC 9(2)    VALUE ZERO.
004240      05 往療暴風Ｗ                 PIC 9(2)    VALUE ZERO.
004250   03 金属副子回数Ｗ                PIC 9(1)    VALUE ZERO.
004260   03 運動後療回数Ｗ                PIC 9(1)    VALUE ZERO.
004280   03 情報提供料回数Ｗ              PIC 9(1)    VALUE ZERO.
004270   03 明細発行加算回数Ｗ            PIC 9(1)    VALUE ZERO.
004270   03 明細発行体制料Ｗ              PIC 9(3)    VALUE ZERO.
004270   03 明細書発行月日Ｗ              PIC 9(4)    VALUE ZERO.
004270   03 明細月日Ｗ.
            05 明細月Ｗ                   PIC 9(2)    VALUE ZERO.
            05 明細日Ｗ                   PIC 9(2)    VALUE ZERO.
004290   03 一部負担金ＷＲ                PIC 9(6)    VALUE ZERO.
004300   03 請求金額ＷＲ                  PIC 9(6)    VALUE ZERO.
004310   03 給付割合ＷＲ                  PIC 9(1)    VALUE ZERO.
004320   03 受給者負担額ＷＲ              PIC 9(6)    VALUE ZERO.
004330   03 助成請求金額ＷＲ              PIC 9(6)    VALUE ZERO.
      */
         03 相談支援回数Ｗ                PIC 9(1)    VALUE ZERO.
         03 施術日ＴＷ.
            05 施術日Ｗ                   PIC 9(1) OCCURS 31 VALUE ZERO.
004340*
004350* 負傷部位毎の料金
004360***********************
004370 01 料金２ＷＲ.
004380   03 初回処置ＷＲ    OCCURS   9.
004390      05 初回処置料ＷＲ             PIC 9(5)    VALUE ZERO.
004400   03 多部位区分ＷＲ  OCCURS   9.
004410      05 多部位区分Ｗ               PIC 9(1)    VALUE ZERO.
004420   03 長期区分ＷＲ  OCCURS   9.
004430      05 長期区分Ｗ                 PIC 9(1)    VALUE ZERO.
004440*
004450* 逓減毎の料金
004460***********************
004470 01 料金３ＷＲ.
004480**********
004490* １部位 *
004500**********
004510   03 部位１ＷＲ.
004520      05 後療１ＷＲ.
004530         07 後療回数１ＷＲ              PIC 9(2)    VALUE ZERO.
004540      05 冷罨法１ＷＲ.
004550         07 冷罨法回数１ＷＲ            PIC 9(2)    VALUE ZERO.
004560      05 温罨法１ＷＲ.
004570         07 温罨法回数１ＷＲ            PIC 9(2)    VALUE ZERO.
004580      05 電療１ＷＲ.
004590         07 電療回数１ＷＲ              PIC 9(2)    VALUE ZERO.
004600**********
004610* ２部位 *
004620**********
004630   03 部位２ＷＲ.
004640      05 後療２ＷＲ.
004650         07 後療回数２ＷＲ              PIC 9(2)    VALUE ZERO.
004660      05 冷罨法２ＷＲ.
004670         07 冷罨法回数２ＷＲ            PIC 9(2)    VALUE ZERO.
004680      05 温罨法２ＷＲ.
004690         07 温罨法回数２ＷＲ            PIC 9(2)    VALUE ZERO.
004700      05 電療２ＷＲ.
004710         07 電療回数２ＷＲ              PIC 9(2)    VALUE ZERO.
004720******************
004730* ３部位／８割 *
004740******************
004750   03 部位３８ＷＲ.
004760      05 後療３８ＷＲ.
004770         07 後療回数３８ＷＲ              PIC 9(2)  VALUE ZERO.
004780      05 冷罨法３８ＷＲ.
004790         07 冷罨法回数３８ＷＲ            PIC 9(2)  VALUE ZERO.
004800      05 温罨法３８ＷＲ.
004810         07 温罨法回数３８ＷＲ            PIC 9(2)  VALUE ZERO.
004820      05 電療３８ＷＲ.
004830         07 電療回数３８ＷＲ              PIC 9(2)  VALUE ZERO.
004840******************
004850* ３部位／１０割 *
004860******************
004870   03 部位３０ＷＲ.
004880      05 後療３０ＷＲ.
004890         07 後療回数３０ＷＲ              PIC 9(2)  VALUE ZERO.
004900      05 冷罨法３０ＷＲ.
004910         07 冷罨法回数３０ＷＲ            PIC 9(2)  VALUE ZERO.
004920      05 温罨法３０ＷＲ.
004930         07 温罨法回数３０ＷＲ            PIC 9(2)  VALUE ZERO.
004940      05 電療３０ＷＲ.
004950         07 電療回数３０ＷＲ              PIC 9(2)  VALUE ZERO.
004960******************
004970* ３部位／合計　 *
004980******************
004990   03 部位３ＷＲ.
005000      05 後療３ＷＲ.
005010         07 後療回数３ＷＲ                PIC 9(2)  VALUE ZERO.
005020      05 冷罨法３ＷＲ.
005030         07 冷罨法回数３ＷＲ              PIC 9(2)  VALUE ZERO.
005040      05 温罨法３ＷＲ.
005050         07 温罨法回数３ＷＲ              PIC 9(2)  VALUE ZERO.
005060      05 電療３ＷＲ.
005070         07 電療回数３ＷＲ                PIC 9(2)  VALUE ZERO.
005080****************
005090* ４部位／５割 *
005100****************
005110   03 部位４５ＷＲ.
005120      05 後療４５ＷＲ.
005130         07 後療回数４５ＷＲ              PIC 9(2)  VALUE ZERO.
005140      05 冷罨法４５ＷＲ.
005150         07 冷罨法回数４５ＷＲ            PIC 9(2)  VALUE ZERO.
005160      05 温罨法４５ＷＲ.
005170         07 温罨法回数４５ＷＲ            PIC 9(2)  VALUE ZERO.
005180      05 電療４５ＷＲ.
005190         07 電療回数４５ＷＲ              PIC 9(2)  VALUE ZERO.
005200****************
005210* ４部位／８割 *
005220****************
005230   03 部位４８ＷＲ.
005240      05 後療４８ＷＲ.
005250         07 後療回数４８ＷＲ              PIC 9(2)  VALUE ZERO.
005260      05 冷罨法４８ＷＲ.
005270         07 冷罨法回数４８ＷＲ            PIC 9(2)  VALUE ZERO.
005280      05 温罨法４８ＷＲ.
005290         07 温罨法回数４８ＷＲ            PIC 9(2)  VALUE ZERO.
005300      05 電療４８ＷＲ.
005310         07 電療回数４８ＷＲ              PIC 9(2)  VALUE ZERO.
005320******************
005330* ４部位／１０割 *
005340******************
005350   03 部位４０ＷＲ.
005360      05 後療４０ＷＲ.
005370         07 後療回数４０ＷＲ              PIC 9(2)  VALUE ZERO.
005380      05 冷罨法４０ＷＲ.
005390         07 冷罨法回数４０ＷＲ            PIC 9(2)  VALUE ZERO.
005400      05 温罨法４０ＷＲ.
005410         07 温罨法回数４０ＷＲ            PIC 9(2)  VALUE ZERO.
005420      05 電療４０ＷＲ.
005430         07 電療回数４０ＷＲ              PIC 9(2)  VALUE ZERO.
005440******************
005450* ４部位／合計　 *
005460******************
005470   03 部位４ＷＲ.
005480      05 後療４ＷＲ.
005490         07 後療回数４ＷＲ                PIC 9(2)  VALUE ZERO.
005500      05 冷罨法４ＷＲ.
005510         07 冷罨法回数４ＷＲ              PIC 9(2)  VALUE ZERO.
005520      05 温罨法４ＷＲ.
005530         07 温罨法回数４ＷＲ              PIC 9(2)  VALUE ZERO.
005540      05 電療４ＷＲ.
005550         07 電療回数４ＷＲ                PIC 9(2)  VALUE ZERO.
005560********************
005570* ５部位／２．５割 *
005580********************
005590   03 部位５２ＷＲ.
005600      05 後療５２ＷＲ.
005610         07 後療回数５２ＷＲ              PIC 9(2)  VALUE ZERO.
005620      05 冷罨法５２ＷＲ.
005630         07 冷罨法回数５２ＷＲ            PIC 9(2)  VALUE ZERO.
005640      05 温罨法５２ＷＲ.
005650         07 温罨法回数５２ＷＲ            PIC 9(2)  VALUE ZERO.
005660      05 電療５２ＷＲ.
005670         07 電療回数５２ＷＲ              PIC 9(2)  VALUE ZERO.
005680****************
005690* ５部位／５割 *
005700****************
005710   03 部位５５ＷＲ.
005720      05 後療５５ＷＲ.
005730         07 後療回数５５ＷＲ              PIC 9(2)  VALUE ZERO.
005740      05 冷罨法５５ＷＲ.
005750         07 冷罨法回数５５ＷＲ            PIC 9(2)  VALUE ZERO.
005760      05 温罨法５５ＷＲ.
005770         07 温罨法回数５５ＷＲ            PIC 9(2)  VALUE ZERO.
005780      05 電療５５ＷＲ.
005790         07 電療回数５５ＷＲ              PIC 9(2)  VALUE ZERO.
005800****************
005810* ５部位／８割 *
005820****************
005830   03 部位５８ＷＲ.
005840      05 後療５８ＷＲ.
005850         07 後療回数５８ＷＲ              PIC 9(2)  VALUE ZERO.
005860      05 冷罨法５８ＷＲ.
005870         07 冷罨法回数５８ＷＲ            PIC 9(2)  VALUE ZERO.
005880      05 温罨法５８ＷＲ.
005890         07 温罨法回数５８ＷＲ            PIC 9(2)  VALUE ZERO.
005900      05 電療５８ＷＲ.
005910         07 電療回数５８ＷＲ              PIC 9(2)  VALUE ZERO.
005920******************
005930* ５部位／１０割 *
005940******************
005950   03 部位５０ＷＲ.
005960      05 後療５０ＷＲ.
005970         07 後療回数５０ＷＲ              PIC 9(2)  VALUE ZERO.
005980      05 冷罨法５０ＷＲ.
005990         07 冷罨法回数５０ＷＲ            PIC 9(2)  VALUE ZERO.
006000      05 温罨法５０ＷＲ.
006010         07 温罨法回数５０ＷＲ            PIC 9(2)  VALUE ZERO.
006020      05 電療５０ＷＲ.
006030         07 電療回数５０ＷＲ              PIC 9(2)  VALUE ZERO.
006040******************
006050* ５部位／合計　 *
006060******************
006070   03 部位５ＷＲ.
006080      05 後療５ＷＲ.
006090         07 後療回数５ＷＲ                PIC 9(2)  VALUE ZERO.
006100      05 冷罨法５ＷＲ.
006110         07 冷罨法回数５ＷＲ              PIC 9(2)  VALUE ZERO.
006120      05 温罨法５ＷＲ.
006130         07 温罨法回数５ＷＲ              PIC 9(2)  VALUE ZERO.
006140      05 電療５ＷＲ.
006150         07 電療回数５ＷＲ                PIC 9(2)  VALUE ZERO.
006160*
006170*****************************************************************
006180 01 計算機西暦年Ｗ                     PIC 9(2).
006190* 日付ＷＯＲＫ
006200 01 計算機西暦.
006210    03 計算機西暦年                    PIC 9(4).
006220    03 計算機西暦月日                  PIC 9(4).
006230 01 計算機西暦Ｒ REDEFINES 計算機西暦.
006240    03 計算機世紀                      PIC 9(2).
006250    03 計算機日付                      PIC 9(6).
006260    03 計算機日付Ｒ REDEFINES 計算機日付.
006270       05 計算機年月                   PIC 9(4).
006280       05 計算機年月Ｒ REDEFINES 計算機年月.
006290         07 計算機年                   PIC 9(2).
006300         07 計算機月                   PIC 9(2).
006310       05 計算機日                     PIC 9(2).
006320*
      * C 連携用
       01  文字１Ｗ        PIC X(4096).
       01  文字２Ｗ        PIC X(512).
       01  プログラム名Ｗ  PIC X(8)  VALUE "strmoji2".
      *
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
006330******************************************************************
006340*                          連結項目                              *
006350******************************************************************
006360*
006370********************
006380* メッセージ表示キー *
006390********************
006400 01 連メ－キー IS EXTERNAL.
006410    03  連メ－メッセージ               PIC N(20).
006420*
006430 01 連メ３－キー IS EXTERNAL.
006440    03  連メ３－メッセージ             PIC N(20).
006450    03  連メ３－メッセージ１           PIC X(20).
006460*
006470****************
006480* 画面入力情報 *
006490****************
002278 01 連入－画面情報ＹＪＢ５８０ IS EXTERNAL.
002279    03 連入－請求和暦年月.
002280       05 連入－請求和暦               PIC 9.
002281       05 連入－請求年月.
002282         07 連入－請求年               PIC 9(2).
002283         07 連入－請求月               PIC 9(2).
006560*
009851************************
009852* 長期理由文セット     *
009853************************
009854 01 連長文－キー IS EXTERNAL.
009855    03 連長文－施術年月.
009856       05 連長文－施術和暦               PIC 9.
009857       05 連長文－施術年                 PIC 9(2).
009858       05 連長文－施術月                 PIC 9(2).
009859    03  連長文－患者コード.
009860       05 連長文－患者番号               PIC 9(6).
009861       05 連長文－枝番                   PIC X.
009862    03 連長文－文桁数                    PIC 9(2).
009863    03 連長文－理由文                    PIC N(63) OCCURS 15.
009864*
009865************************
009866* 助成レセまとめ
009867************************
009868 01 連レセまとめ－キー IS EXTERNAL.
009869    03 連レセまとめ－施術和暦年月.
009870       05 連レセまとめ－施術和暦               PIC 9.
009871       05 連レセまとめ－施術年月.
009872          07 連レセまとめ－施術年              PIC 9(2).
009873          07 連レセまとめ－施術月              PIC 9(2).
009874    03 連レセまとめ－患者コード.
009875       05 連レセまとめ－患者番号               PIC 9(6).
009876       05 連レセまとめ－枝番                   PIC X(1).
009877**-------------------------------------------------------**
009878*   1:助成レセプトなしの本体まとめの判定
009879*   2:横浜・川崎用の社保助成レセかの判定
009880    03 連レセまとめ－判定区分                  PIC 9.
009881**-------------------------------------------------------**
009882*  / OUT /　 0:対象外、1:対象
009883    03 連レセまとめ－判定結果                  PIC 9.
009884**
009885*
      * 暗号複合用
       01 連暗号複合－暗号情報 IS EXTERNAL.
          03 連暗号複合－入力情報.
             05 連暗号複合－記号               PIC X(24).
             05 連暗号複合－番号               PIC X(30).
             05 連暗号複合－暗号化項目.
               07 連暗号複合－暗号患者番号     PIC X(6).
               07 連暗号複合－暗号判定記号     PIC X.
               07 連暗号複合－暗号判定番号     PIC X.
               07 連暗号複合－暗号記号         PIC X(24).
               07 連暗号複合－暗号番号         PIC X(30).
          03 連暗号複合－出力情報.
             05 連暗号複合－複合した記号       PIC X(24).
             05 連暗号複合－複合した番号       PIC X(30).
      * 
009886******************************************************************
009887*                      PROCEDURE  DIVISION                       *
009888******************************************************************
009890 PROCEDURE               DIVISION.
009900************
009910*           *
009920* 初期処理   *
009930*           *
009940************
009950     PERFORM 初期化.
009960     PERFORM 制御情報取得.
009961     PERFORM 施術所情報取得.
009970************
009980*           *
009990* 主処理     *
010000*           *
010010************
010020     PERFORM 作業ファイル作成.
010030************
010040*           *
010050* 終了処理   *
010060*           *
010070************
010080     PERFORM 終了処理.
010090     MOVE ZERO TO PROGRAM-STATUS.
010100     EXIT PROGRAM.
010110*
010120*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
010130*================================================================*
010140 初期化 SECTION.
010150*
010160     PERFORM ファイルオープン.
010170* 連結項目の待避
010180     MOVE 連入－請求和暦  TO 請求和暦ＷＲ.
010190     MOVE 連入－請求年    TO 請求年ＷＲ.
010200     MOVE 連入－請求月    TO 請求月ＷＲ.
010210*
010220     MOVE ZERO            TO 連番Ｗ.
010230*
010240* 西暦請求年月の取得
010250     MOVE ZERO          TO 西暦年月Ｗ  西暦請求年月Ｗ.
010260     MOVE 請求和暦ＷＲ  TO 元－元号区分.
010270     READ 元号マスタ
010280     NOT INVALID KEY
010290         MOVE 元－開始西暦年 TO 西暦年Ｗ
010300     END-READ.
010310*
010320     IF 西暦年Ｗ = ZERO
010330          MOVE  NC"元号マスタに開始西暦年を登録して下さい" TO 連メ－メッセージ
010340          CALL   "MSG001"
010350          CANCEL "MSG001"
010360          PERFORM ファイル閉鎖
010370          MOVE 99 TO PROGRAM-STATUS
010380          EXIT PROGRAM
010390     ELSE
010400          COMPUTE 西暦年Ｗ = 西暦年Ｗ + 請求年ＷＲ - 1
010410          MOVE 請求月ＷＲ TO 西暦月Ｗ
010420     END-IF.
010430*
010440     MOVE 西暦年月Ｗ   TO  西暦請求年月Ｗ.
010450*
010460*================================================================*
010470 ファイルオープン SECTION.
010480*
010481     OPEN INPUT 制御情報マスタ.
010482         MOVE NC"制御情報" TO ファイル名.
010483         PERFORM オープンチェック.
010490     OPEN INPUT 元号マスタ.
010500         MOVE NC"元号マスタ" TO ファイル名.
010510         PERFORM オープンチェック.
010520     OPEN INPUT 名称マスタ.
010530         MOVE NC"名称マスタ" TO ファイル名.
010540         PERFORM オープンチェック.
010550     OPEN INPUT 施術所情報マスタ
010560         MOVE NC"施情" TO ファイル名.
010570         PERFORM オープンチェック.
010580     OPEN INPUT 施術記録Ｆ.
010590         MOVE NC"施術記録Ｆ" TO ファイル名.
010600         PERFORM オープンチェック.
010610     OPEN INPUT 受診者情報Ｆ.
010620         MOVE NC"受診者情報Ｆ" TO ファイル名.
010630         PERFORM オープンチェック.
010640     OPEN INPUT 負傷データＦ.
010650         MOVE NC"負傷データＦ" TO ファイル名.
010660         PERFORM オープンチェック.
010661     OPEN INPUT 負傷原因Ｆ.
010662         MOVE NC"負傷原因" TO ファイル名.
010663         PERFORM オープンチェック.
010670     OPEN INPUT 市町村マスタ
010680         MOVE NC"市町村" TO ファイル名.
010690         PERFORM オープンチェック.
006630     OPEN INPUT レセプトＦ.
006640         MOVE NC"レセ" TO ファイル名.
006650         PERFORM オープンチェック.
003001     OPEN INPUT 会計データＦ.
003002         MOVE NC"会計" TO ファイル名.
003003         PERFORM オープンチェック.
011344     OPEN OUTPUT 作業ファイル１.
011345         MOVE NC"作１" TO ファイル名.
011346         PERFORM オープンチェック.
010730*
010740*================================================================*
010750 オープンチェック SECTION.
010760*
010770     IF 状態キー  NOT =  "00"
010780         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
010790         DISPLAY NC"状態キー：" 状態キー         UPON CONS
010800         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
010810                                                 UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
010820         ACCEPT  キー入力 FROM CONS
010830         PERFORM ファイル閉鎖
010840         MOVE 99 TO PROGRAM-STATUS
010850         EXIT PROGRAM.
010860*================================================================*
010870 ファイル閉鎖 SECTION.
010880*
010890     CLOSE 制御情報マスタ 元号マスタ 名称マスタ 受診者情報Ｆ
010891           負傷データＦ   負傷原因Ｆ 施術記録Ｆ 施術所情報マスタ
010901           市町村マスタ   会計データＦ レセプトＦ 作業ファイル１.
010910*================================================================*
010920 終了処理 SECTION.
010930*
010940     PERFORM ファイル閉鎖.
010941*================================================================*
010942 エラー表示Ｒ SECTION.
010943*
010944     DISPLAY NC"ファイル読込エラー" ファイル名     UPON CONS.
010945     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
010946     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
010947     ACCEPT  キー入力 FROM CONS.
010948     PERFORM ファイル閉鎖.
010949     MOVE 99 TO PROGRAM-STATUS.
010950     EXIT PROGRAM.
010951*================================================================*
010960 エラー表示 SECTION.
010970*
010980     DISPLAY NC"状態キー" 状態キー  UPON CONS.
010990     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
011000     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
011010     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
011020     ACCEPT  キー入力 FROM CONS.
011030     PERFORM ファイル閉鎖.
011040     MOVE 99 TO PROGRAM-STATUS.
011050     EXIT PROGRAM.
011051*================================================================*
011052 制御情報取得 SECTION.
011053*
011054     MOVE ZEROS TO 制－制御区分.
011055     READ 制御情報マスタ
011056     NOT INVALID KEY
011058         MOVE 制－レセ負傷原因印刷区分 TO 負傷原因印刷区分Ｗ
011059         MOVE 制－レセ長期理由印刷区分 TO 長期理由印刷区分Ｗ
011062     END-READ.
011063*
011064*================================================================*
011070 施術所情報取得 SECTION.
011080*
011090     MOVE ZERO  TO 施情－施術所番号.
011100     READ 施術所情報マスタ
011110     INVALID KEY
011120          MOVE  NC"施術所情報マスタに登録後、実行して下さい" TO 連メ－メッセージ
011130          CALL   "MSG001"
011140          CANCEL "MSG001"
011150          PERFORM ファイル閉鎖
011160          MOVE 99 TO PROGRAM-STATUS
011170          EXIT PROGRAM
011180     NOT INVALID KEY
011190          IF  施情－接骨師会会員番号 = SPACE
011200              MOVE  NC"施術所マスタに会員番号を登録して下さい" TO 連メ－メッセージ
011210              CALL   "MSG001"
011220              CANCEL "MSG001"
011230              PERFORM ファイル閉鎖
011240              MOVE 99 TO PROGRAM-STATUS
011250              EXIT PROGRAM
011260          ELSE
011270              MOVE 施情－接骨師会会員番号  TO 会員番号Ｗ
011280              PERFORM 会員番号右詰め
011290          END-IF
011300     END-READ.
011310*
011320*================================================================*
011330 作業ファイル作成 SECTION.
011340*
011342     PERFORM 保険者番号順ファイル作成.
011343*
011347     OPEN INPUT  作業ファイル３.
011348         MOVE NC"作３" TO ファイル名.
011349         PERFORM オープンチェック.
011350*
011351     PERFORM 作業ファイル１作成.
011352*
011353     CLOSE 作業ファイル３.
011420*
011421*================================================================*
011422 保険者番号順ファイル作成 SECTION.
011423**********************************************************************
011424**   レセプトＦから、該当請求年月のデータを抽出し、
011425**   作業ファイル３(保険者番号順)に書き出す.
011426**********************************************************************
011427*
011428     OPEN OUTPUT 作業ファイル３.
011429         MOVE NC"作３" TO ファイル名.
011430         PERFORM オープンチェック.
011431*
011432     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
011433     MOVE 請求年ＷＲ    TO レセ－請求年.
011434     MOVE 請求月ＷＲ    TO レセ－請求月.
013730     MOVE ZERO          TO レセ－レセ種別.
013720     MOVE ZERO          TO レセ－施術和暦.
013730     MOVE ZERO          TO レセ－施術年.
013740     MOVE ZERO          TO レセ－施術月.
013750     MOVE ZERO          TO レセ－患者番号.
013760     MOVE SPACE         TO レセ－枝番.
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
           END-START.
011444     IF 状態キー = "00"
011445         MOVE SPACE  TO 終了フラグ
013820         PERFORM レセプトＦ読込
011447         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
013840                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
013850                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
013860                       ( レセ－請求月   NOT = 請求月ＷＲ   )
005430            PERFORM データチェック
012327**
012328            IF  実行キーＷ = "YES"
      */長野県内の52母子、53障害、55乳幼児、60その他は償還払いの為データに載せない/110922
      */長野県内の60子ども医療を最後に載せる/211102
      */親保険もセットで最後にする/230302                                                       
      *                 IF ((受－助成種別 = 52 OR 53 OR 55) OR
      *                     ((レセ－レセ種別 NOT = 3) AND ( 受－助成種別 = 60))) AND
                       IF (受－助成種別 = 52 OR 53 OR 55) AND
                          (受－費用負担者番号助成(3:2) = "20" )
                           MOVE ZERO  TO 受－助成種別
                           MOVE SPACE TO 受－費用負担者番号助成
                       END-IF
      *
011452                 MOVE SPACE TO 作３－レコード
011453                 INITIALIZE    作３－レコード
011454                 MOVE レセ－請求和暦   TO  作３－請求和暦
011455                 MOVE レセ－請求年     TO  作３－請求年
011456                 MOVE レセ－請求月     TO  作３－請求月
011457                 MOVE 受－施術和暦     TO  作３－施術和暦
011458                 MOVE 受－施術年       TO  作３－施術年
011459                 MOVE 受－施術月       TO  作３－施術月
011460                 IF  受－助成種別   = ZERO  OR 50
011461                     IF ( 受－保険種別   NOT = ZERO ) AND
011462                        ( 受－保険者番号 NOT = SPACE )
011463** 助成なし(生保親ありは助成なし扱い)
011464                        MOVE ZERO  TO   作３－助成区分
011468                     END-IF
011469                 ELSE
011470** 助成あり
011471                     MOVE 1        TO   作３－助成区分
011472*                   /特別： 母子または障害でかつ静岡県 は、助成なしにする/
011473                     IF (( 受－助成種別 = "52" ) OR ( 受－助成種別 = "53" )) AND
011474                        ( 受－費用負担者番号助成(3:2) = "22" ) 
011475                         MOVE ZERO  TO  作３－助成区分
011476                     END-IF
011481                 END-IF
      */長野県内の60社保の子ども医療を最後に載せる/211102
      */親保険もセットで最後にする/230302
      *                 IF (レセ－レセ種別 = 3) AND
                       IF ( 受－助成種別 = 60) AND
                          (受－費用負担者番号助成(3:2) = "20" )
011475                         MOVE 2  TO  作３－助成区分
                       END-IF
011482*
011483                 IF ( 受－公費種別       = ZERO  ) AND
011484                    ( 受－費用負担者番号 = SPACE )
011485                     MOVE 受－保険者番号     TO 保険者番号Ｗ
011486                 ELSE
011487* 老人は、市町村番号
011488                     MOVE 受－費用負担者番号 TO 保険者番号Ｗ
011489                 END-IF
011490                 PERFORM 保険者番号右詰め
011491                 MOVE 保険者番号数字Ｗ   TO 作３－保険者番号
011492*
011493                 MOVE 受－本人家族区分   TO 作３－本人家族区分
011494                 MOVE 受－被保険者カナ   TO 作３－被保険者カナ
011495                 MOVE 受－患者コード     TO 作３－患者コード
011496*
                       EVALUATE レセ－レセ種別
                       WHEN 1
                       WHEN 2
                           MOVE ZERO           TO 作３－親子区分
                       WHEN 3
                           MOVE 1              TO 作３－親子区分
                       END-EVALUATE
      *
                       IF (レセ－レセ種別 = 3) AND (作３－助成区分 = ZERO)
                          CONTINUE
                       ELSE
011497                    WRITE 作３－レコード
011498                    INVALID KEY
011499                        MOVE NC"作３"  TO ファイル名
011500                    PERFORM エラー表示
011501                    END-WRITE
                       END-IF
                   END-IF
011503             PERFORM レセプトＦ読込
012418         END-PERFORM
           END-IF.
011506*
011507     CLOSE 作業ファイル３.
011502*
011509*================================================================*
011510 作業ファイル１作成 SECTION.
011511*
012302     MOVE SPACE  TO 終了フラグ.
012303     PERFORM 作業ファイル３読込.
012304     PERFORM UNTIL  終了フラグ = "YES" 
012301*
012305         MOVE SPACE TO 助成フラグ
012306         MOVE SPACE TO 助成レセまとめフラグ
               MOVE "YES" TO 実行キーＷ
012308*
012309** 労災・自賠責・自由・ 生保単独は対象外
012310            IF  受－保険種別 = 70 OR 80 OR 85 OR 90
012311                MOVE SPACE  TO 実行キーＷ
012312            END-IF
012318** 資格証明は対象外
012319         IF  ( 受－保険種別 = 01 OR 08 ) AND
012320             ( 受－公費種別 = ZERO     ) AND
012321             ( 受－資格証明区分 = 1 )
012322            MOVE SPACE  TO 実行キーＷ
012323         END-IF
012327**
012328         IF  実行キーＷ = "YES"
012332*
012333*↓* 特別処理（助成レセまとめ）
012334             IF 受－助成種別 NOT = ZERO
012335                 PERFORM 助成レセまとめ判定
012336             ELSE
012337                 MOVE SPACE TO 助成レセまとめフラグ
012338             END-IF
   339*↑*
012341*            ********
012342*            * 健保 *
012343*            ********
012372             IF 作３－親子区分 = ZERO
012344                IF ( 受－保険種別   NOT = ZERO ) AND
012345                   ( 受－保険者番号 NOT = SPACE )
012346*                **********************
012347*                * 作業ファイル作成 *
012348*                **********************
012349                    IF ( 受－公費種別       = ZERO  ) AND
012350                       ( 受－費用負担者番号 = SPACE )
012351                       IF 作３－助成区分  = ZERO
012352*   / 助成なし /
012353                          MOVE SPACE TO 助成フラグ
012356                       ELSE
012357*   / 助成あり /
012358                          MOVE "YES" TO 助成フラグ
012366                       END-IF
012354                       PERFORM 作１レコードセット健保
012355                       PERFORM 作１ファイル書込
012367                    END-IF
012367                END-IF
                   END-IF
012369*            ********
012370*            * 老人 *
012371*            ********
012372             IF 作３－親子区分 = ZERO
012372                IF ( 受－公費種別       NOT = ZERO ) AND
012373                   ( 受－費用負担者番号 NOT = SPACE )
012374*                **********************
012375*                * 作業ファイル作成 *
012376*                **********************
012377                   IF 作３－助成区分  = ZERO
012378*   / 助成なし /
012379                      MOVE SPACE TO 助成フラグ
012389                   ELSE
012390*   / 助成あり /
012391                      MOVE "YES" TO 助成フラグ
                         END-IF
012380                   PERFORM 作１レコードセット老人
012381                   PERFORM 作１ファイル書込
                      END-IF
                   END-IF
012369*            ********
012370*            * 助成 *
012371*            ********
012372             IF (作３－親子区分 = 1)
      */ 千葉県の助成で助成請求金額が０円の場合は除く
005930*/ 横浜・川崎の小児医療の請求額０は対象外にする /170411
                      IF ((受－費用負担者番号助成(3:2) = "12") OR
                          ((受－助成種別 = "55") AND (受－費用負担者番号助成(3:3) = "144" OR "145"))) AND
                         (レセ－助成請求金額 = 0) AND
                         (助成レセまとめフラグ = SPACE)
                         CONTINUE
                      ELSE
012353                   MOVE "YES" TO 助成フラグ
                         IF 受－公費種別 = ZERO
012394                      PERFORM 作１レコードセット健保助成
                         ELSE
012394                      PERFORM 作１レコードセット老人助成
                         END-IF
012395                   PERFORM 作１ファイル書込
012415                END-IF
                   END-IF
               END-IF
012417         PERFORM 作業ファイル３読込
012418     END-PERFORM.
012419*
012439*================================================================*
012440 作業ファイル３読込 SECTION.
012441*
012442     READ 作業ファイル３ NEXT
012443     AT END
012444         MOVE "YES" TO 終了フラグ
012445     NOT AT END
006665         MOVE 作３－施術和暦    TO 受－施術和暦 レセ－施術和暦
006666         MOVE 作３－施術年      TO 受－施術年   レセ－施術年  
006667         MOVE 作３－施術月      TO 受－施術月   レセ－施術月  
006668         MOVE 作３－患者番号    TO 受－患者番号 レセ－患者番号
006669         MOVE 作３－枝番        TO 受－枝番     レセ－枝番    
006670         READ 受診者情報Ｆ
006671         INVALID KEY
006672              MOVE NC"受診者"   TO ファイル名
006673              PERFORM エラー表示Ｒ
006674         END-READ
               IF 作３－親子区分 = 1
                   MOVE 3          TO レセ－レセ種別
               ELSE
                  IF 受－公費種別 = 5
                      MOVE 2          TO レセ－レセ種別
                  ELSE
                      MOVE 1          TO レセ－レセ種別
                  END-IF
               END-IF
006670         READ レセプトＦ
006671         INVALID KEY
006672              MOVE NC"レセプト"   TO ファイル名
006673              PERFORM エラー表示Ｒ
006674         END-READ
012456     END-READ.
012457*
012420*================================================================*
008560 データチェック SECTION.
008570*
008580     MOVE SPACE          TO 実行キーＷ.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
019640     IF ( レセ－請求対象区分 NOT = ZERO ) AND
005778        ( レセ－償還払い区分 NOT = 1 )
              IF(レセ－レセ種別 = 3) AND ( レセ－会総括表印刷対象区分 = 1 )
                 CONTINUE
              ELSE
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
005786**      健保のみ
005787              IF 受－保険分類 = 1
019880                 MOVE "YES"  TO 実行キーＷ
005789              END-IF
019950           END-READ
              END-IF
019960     END-IF.
009040*
012900*================================================================*
012910 レセプトＦ読込 SECTION.
012920*
012930     READ レセプトＦ NEXT
012940     AT END
012950         MOVE "YES" TO 終了フラグ
012960     END-READ.
012970*
012980*================================================================*
012990 施術記録Ｆ読込 SECTION.
013000*
013010     READ 施術記録Ｆ NEXT
013020     AT END
013030         MOVE "YES"  TO 終了フラグ２
013040     END-READ.
013050*================================================================*
013060*================================================================*
013070 作１レコードセット健保 SECTION.
013080*
013090**********/  健保助成なしの時  /**********
013100*
013110     MOVE SPACE TO 作１－レコード.
013120     INITIALIZE 作１－レコード.
013130*
013163*↓* 特別処理（助成レセまとめ）
013164*     IF 助成レセまとめフラグ = "YES"
013165*        MOVE レセ－合計         TO 作１－合計金額
013166*        MOVE レセ－受給者負担額 TO 作１－一部負担金
013167*        COMPUTE 作１－請求金額 = レセ－合計 - レセ－受給者負担額
013169*     ELSE
013173        MOVE レセ－合計       TO 作１－合計金額.
013174        MOVE レセ－一部負担金 TO 作１－一部負担金.
013175        MOVE レセ－請求金額   TO 作１－請求金額.
013176*     END-IF.
013177*↑*
013182*
013183     MOVE 1          TO 作１－該当保険種別  作１－保険区分キー.
013190*
013200* 助成がある時は、負担者番号・受給者番号をセット
      */長野県内の60子ども医療を最後に載せる/211102
013210     IF (助成フラグ = "YES") OR
              (((レセ－レセ種別 NOT = 3) AND ( 受－助成種別 = 60)) AND
               (受－費用負担者番号助成(3:2) = "20" ))
013220         PERFORM 助成負担者番号取得
013230*
013240         IF ( 受－受益者番号助成(1:1) = "*"  ) OR
013250            ( 受－受益者番号助成(1:2) = "＊" )
013260            MOVE SPACE                TO 作１－助成受給者番号
013270         ELSE
013280            MOVE 受－受益者番号助成   TO 作１－助成受給者番号
013290         END-IF
013300     END-IF.
013310*
013320     MOVE 受－本人家族区分   TO 作１－本人家族区分.
013330*
013340* 住所(被保険者)
013350     STRING 受－住所１    DELIMITED BY SPACE
013360            受－住所２    DELIMITED BY SPACE
013370            INTO 作１－被保険者住所
013380     END-STRING.
013390*
013410     PERFORM 共通レコードセット.
013420*
013430*================================================================*
013440 作１レコードセット老人 SECTION.
013450*
013460**********/ 27老人の時  /**********
013470*
013480     MOVE SPACE TO 作１－レコード.
013490     INITIALIZE 作１－レコード.
013500*
           IF 受－施術和暦年月 < 42004
013510         MOVE 受－費用負担者番号 TO 保険者番号Ｗ
013520         PERFORM 保険者番号右詰め
013530         MOVE 保険者番号数字Ｗ   TO 作１－老人市町村番号
013540*
013550         MOVE 受－受益者番号老人 TO 保険者番号Ｗ
013560         PERFORM 保険者番号右詰め
013570         MOVE 保険者番号数字Ｗ   TO 作１－老人受給者番号
           END-IF.
013611*
013612*↓* 特別処理（助成レセまとめ）
013613*     IF 助成レセまとめフラグ = "YES"
013614*        MOVE レセ－合計         TO 作１－合計金額
013615*        MOVE レセ－受給者負担額 TO 作１－一部負担金
013616*        COMPUTE 作１－請求金額 = レセ－合計 - レセ－受給者負担額
013617*     ELSE
013618        MOVE レセ－合計       TO 作１－合計金額.
013619        MOVE レセ－一部負担金 TO 作１－一部負担金.
013620        MOVE レセ－請求金額   TO 作１－請求金額.
013621*     END-IF.
013622*↑*
013623*
           IF 受－施術和暦年月 < 42004
013630         MOVE 2              TO 作１－該当保険種別  作１－保険区分キー
           ELSE
013630         MOVE 1              TO 作１－該当保険種別  作１－保険区分キー
           END-IF.
013640*
013650* 助成がある時は、負担者番号・受給者番号をセット
      */長野県内の60子ども医療を最後に載せる/211102
013210     IF (助成フラグ = "YES") OR
              (((レセ－レセ種別 NOT = 3) AND ( 受－助成種別 = 60)) AND
               (受－費用負担者番号助成(3:2) = "20" ))
013670         PERFORM 助成負担者番号取得
013680*
013690         IF ( 受－受益者番号助成(1:1) = "*"  ) OR
013700            ( 受－受益者番号助成(1:2) = "＊" )
013710            MOVE SPACE                TO 作１－助成受給者番号
013720         ELSE
013730            MOVE 受－受益者番号助成   TO 作１－助成受給者番号
013740         END-IF
013750     END-IF.
013760*
013770* 本人のみ
013780     MOVE 1   TO 作１－本人家族区分.
013790*
013800* 住所(患者)
013810     STRING 受－患者住所１    DELIMITED BY SPACE
013820            受－患者住所２    DELIMITED BY SPACE
013830            INTO 作１－被保険者住所
013840     END-STRING.
013850*
013870     PERFORM 共通レコードセット.
013880*
013890*================================================================*
013900 作１レコードセット健保助成 SECTION.
013910*
013920**********/  健保助成ありの時  /**********
013930*
013940     MOVE SPACE TO 作１－レコード.
013950     INITIALIZE 作１－レコード.
013960*
013970     PERFORM 助成負担者番号取得.
013980*
013990     IF ( 受－受益者番号助成(1:1) = "*"  ) OR
014000        ( 受－受益者番号助成(1:2) = "＊" )
014010        MOVE SPACE                TO 作１－助成受給者番号
014020     ELSE
014030        MOVE 受－受益者番号助成   TO 作１－助成受給者番号
014040     END-IF.
014050*
014113*↓* 特別処理（助成レセまとめ）
014114     IF 助成レセまとめフラグ = "YES"
014115        MOVE レセ－合計    TO 作１－合計金額
014116        MOVE ZERO          TO 作１－一部負担金
014117        MOVE ZERO          TO 作１－請求金額
014125        MOVE レセ－給付割合     TO 作１－助成用保険給付割合
014118*        MOVE 10            TO 作１－助成用保険給付割合
014119     ELSE
014122        MOVE レセ－合計         TO 作１－合計金額
014123        MOVE レセ－受給者負担額 TO 作１－一部負担金
      */静岡県の助成は窓口金(会計データＦ)の合計を転記する/130619
              IF (受－助成種別 = "52" OR "53" OR "55" OR "60") AND
                 (受－費用負担者番号助成(3:2) = "22" )
                  PERFORM 会計データＦ集計
              END-IF
014124*    助成金額
014125        MOVE レセ－助成請求金額 TO 作１－請求金額
014125        MOVE レセ－給付割合     TO 作１－助成用保険給付割合
014127*        COMPUTE 作１－助成用保険給付割合  = 10 - ( 負担率Ｗ / 10 )
014128     END-IF.
014129*↑*
      */レセまとめ時も本体の給付割合を転記する/130619
      **/レセまとめ時の給付割合は10割/230828
      *     IF 受－助成レセ印刷対象区分 = 1 OR 2 OR 3
014118*         MOVE 10            TO 作１－助成用保険給付割合
      *     END-IF.
014133*
014134     MOVE 3              TO 作１－該当保険種別  作１－保険区分キー.
014140*
014150* 本人のみ
014160     MOVE 1   TO 作１－本人家族区分.
014170*
014180* 住所(患者)
014190     STRING 受－患者住所１    DELIMITED BY SPACE
014200            受－患者住所２    DELIMITED BY SPACE
014210            INTO 作１－被保険者住所
014220     END-STRING.
014230*
014250     PERFORM 共通レコードセット.
014260*
014270*================================================================*
014280 作１レコードセット老人助成 SECTION.
014290*
014300**********/  老人助成ありの時  /**********
014310*
014320     MOVE SPACE TO 作１－レコード.
014330     INITIALIZE 作１－レコード.
014340*
           IF 受－施術和暦年月 < 42004
014350         MOVE 受－費用負担者番号 TO 保険者番号Ｗ
014360         PERFORM 保険者番号右詰め
014370         MOVE 保険者番号数字Ｗ   TO 作１－老人市町村番号
014380*
014390         MOVE 受－受益者番号老人 TO 保険者番号Ｗ
014400         PERFORM 保険者番号右詰め
014410         MOVE 保険者番号数字Ｗ   TO 作１－老人受給者番号
           END-IF.
014420*
014430     PERFORM 助成負担者番号取得.
014440*
014450     IF ( 受－受益者番号助成(1:1) = "*"  ) OR
014460        ( 受－受益者番号助成(1:2) = "＊" )
014470        MOVE SPACE                TO 作１－助成受給者番号
014480     ELSE
014490        MOVE 受－受益者番号助成   TO 作１－助成受給者番号
014500     END-IF.
014510*
014560*
014561
014562*↓* 特別処理（助成レセまとめ）
014563*     IF 助成レセまとめフラグ = "YES"
014564*        MOVE レセ－合計    TO 作１－合計金額
014565*        MOVE ZERO          TO 作１－一部負担金
014566*        MOVE ZERO          TO 作１－請求金額
014567*
014568*        IF ( 受－費用負担者番号助成(3:3) = "144" ) OR ( 受－費用負担者番号助成(3:3) = "145" )
014576*           EVALUATE 受－老人負担金免除
014577*           WHEN 2
014579*              MOVE 8   TO 作１－助成用保険給付割合
014580*           WHEN 3
014582*              MOVE 7   TO 作１－助成用保険給付割合
014583*           WHEN OTHER
014584*              MOVE 9   TO 作１－助成用保険給付割合
014585*           END-EVALUATE
014588*        ELSE
014589*           MOVE 11     TO 作１－助成用保険給付割合
014590*        END-IF
014591*
014592*    ELSE
      */会依頼レセまとめの場合は費用１０割・負担０円・請求０円。とする。↓↓↓*/20170603
014113*↓* 特別処理（助成レセまとめ）
014114     IF 助成レセまとめフラグ = "YES"
014115         MOVE レセ－合計     TO 作１－合計金額
014116         MOVE ZERO           TO 作１－一部負担金
014117         MOVE ZERO           TO 作１－請求金額
014125         MOVE レセ－給付割合 TO 作１－助成用保険給付割合
014119     ELSE
      */会依頼レセまとめの場合は費用１０割・負担０円・請求０円。とする。↑↑↑*/20170603
014593        MOVE レセ－合計         TO 作１－合計金額
014594        MOVE レセ－受給者負担額 TO 作１－一部負担金
014595*    助成金額
014596        MOVE レセ－助成請求金額 TO 作１－請求金額
014597        MOVE 11                 TO 作１－助成用保険給付割合
      */会依頼レセまとめの場合は費用１０割・負担０円・請求０円。とする。*/20170603
014598     END-IF. 
014599*↑*
      */助成用保険給付割合の設定漏れ？修正↓↓↓/121026
           IF レセ－本体まとめ区分 = 1
      */平成25年4月より神奈川県内の全ての市町村でまとめる/130406
014568*         IF ( 受－費用負担者番号助成(3:3) = "144" ) OR ( 受－費用負担者番号助成(3:3) = "145" )
004050         IF (受－費用負担者番号助成(3:3) = "144" OR "145") AND (受－施術和暦年月 <  42504) OR
                  (受－費用負担者番号助成(3:2) = "14")           AND (受－施術和暦年月 >= 42504)
014576            EVALUATE 受－老人負担金免除
014577            WHEN 2
014579               MOVE 8   TO 作１－助成用保険給付割合
014580            WHEN 3
014582               MOVE 7   TO 作１－助成用保険給付割合
014583            WHEN OTHER
014584               MOVE 9   TO 作１－助成用保険給付割合
014585            END-EVALUATE
014588         ELSE
014589            MOVE 11     TO 作１－助成用保険給付割合
014590         END-IF
014590     END-IF
      */助成用保険給付割合の設定漏れ？修正↑↑↑/121026
014602*
014603     MOVE 3              TO 作１－該当保険種別  作１－保険区分キー.
014604*
014610* 本人のみ
014620     MOVE 1   TO 作１－本人家族区分.
014630*
014640* 住所(患者)
014650     STRING 受－患者住所１    DELIMITED BY SPACE
014660            受－患者住所２    DELIMITED BY SPACE
014670            INTO 作１－被保険者住所
014680     END-STRING.
014690*
014710     PERFORM 共通レコードセット.
014720*
014730*================================================================*
014740*================================================================*
014750 共通レコードセット SECTION.
014760*
014770     MOVE レセ－請求和暦     TO 作１－請求和暦.
014780     MOVE レセ－請求年       TO 作１－請求年.
014790     MOVE レセ－請求月       TO 作１－請求月.
014800     MOVE 受－施術和暦       TO 作１－施術和暦 施術和暦ＷＲ.
014810     MOVE 受－施術年         TO 作１－施術年 施術年ＷＲ.
014820     MOVE 受－施術月         TO 作１－施術月 施術月ＷＲ.
014830     MOVE 受－患者コード     TO 作１－患者コードキー  患者コードＷＲ.
014840     MOVE 会員番号数字Ｗ     TO 作１－会員番号.
014850* 定額制なし
014860     MOVE ZERO               TO 作１－定額制受理番号区分.
014870* 年月
014880     MOVE 西暦請求年月Ｗ     TO 作１－請求年月.
014890*
014900     PERFORM 西暦施術年月取得.
014910     MOVE 西暦施術年月Ｗ     TO 作１－施術年月.
014920*
014930* レセプト番号(連番) → YJB102でやる
014940*     COMPUTE 連番Ｗ =  連番Ｗ  + 1.
014950*     MOVE 連番Ｗ             TO 作１－レセプト番号.
014960*
014970* 保険者番号キー(数字)
014980     IF ( 受－公費種別       = ZERO  ) AND
014990        ( 受－費用負担者番号 = SPACE )
015000          MOVE 受－保険者番号     TO 保険者番号Ｗ
015010     ELSE
015020* / 老人は、市町村番号をキーに /
               IF 受－施術和暦年月 < 42004
015030             MOVE 受－費用負担者番号 TO 保険者番号Ｗ
               ELSE
015000             MOVE 受－保険者番号     TO 保険者番号Ｗ
               END-IF
015040     END-IF.
015050     PERFORM 保険者番号右詰め.
015060     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号キー.
015070*
015080* 保険者番号(数字)
015090     MOVE 受－保険者番号     TO 保険者番号Ｗ
015100     PERFORM 保険者番号右詰め.
015110     MOVE 保険者番号数字Ｗ   TO 作１－保険者番号.
015120*
015130** 全国土木 (133033) の枝番削除して、保険者番号にセット
015140     IF ( 受－保険種別 = 01 ) AND ( 受－保険者番号(1:6) = "133033" )
015150         MOVE 133033         TO 作１－保険者番号  作１－保険者番号キー
015160     END-IF.
015170*
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
      *-----------------------------------------------------------------*
015180* 記号
015190*     IF 受－記号(1:2)  = "＊" 
015190     IF 連暗号複合－複合した記号(1:2)  = "＊" 
015200        MOVE SPACE               TO 記号ＰＮＷ
015210*        INSPECT 記号ＰＮＷ  REPLACING ALL 半角空白 BY 全角空白
015220        MOVE 記号ＰＷ            TO 作１－記号
015230     ELSE
015240        PERFORM 記号左詰め
015250        MOVE 記号ＰＷ            TO 作１－記号
015260     END-IF.
015270* 番号
015280*     IF ( 受－番号(1:1) = "*"  ) OR
015290*        ( 受－番号(1:2) = "＊" )
015280     IF ( 連暗号複合－複合した番号(1:1) = "*"  ) OR
015290        ( 連暗号複合－複合した番号(1:2) = "＊" )
015300        MOVE SPACE           TO 作１－番号
015310     ELSE
015320*        MOVE 受－番号        TO 作１－番号
015320        MOVE 連暗号複合－複合した番号 TO 作１－番号
015330     END-IF.
015340* 氏名
015350     MOVE 受－被保険者氏名   TO 氏名Ｗ.
           MOVE 全角氏名Ｗ         TO 作１－被保険者氏名.
015360     MOVE 受－被保険者カナ   TO 作１－被保険者カナ 作１－被保険者カナキー.
015370     MOVE 受－患者氏名       TO 氏名Ｗ.
           MOVE 全角氏名Ｗ         TO 作１－患者氏名.
015380     MOVE 受－患者カナ       TO 作１－患者カナ.
015390*
015400     MOVE 受－患者性別       TO 作１－患者性別.
015410* 生年月日
015420     MOVE ZERO               TO 計算和暦年月日Ｗ.
015430     MOVE 受－患者生年月日   TO 計算和暦年月日Ｗ.
015440     PERFORM 西暦年月日取得.
015450     MOVE 計算西暦年月日Ｗ   TO 作１－患者生年月日.
015460*
015470****　/ レセプトデータの取得 /
015480*
015500     PERFORM 負傷データ取得.
015510     PERFORM 料金情報取得.
015520     PERFORM 施術記録取得.
015530*****
015540*
015550* １部位目
015560     MOVE 負傷種別Ｗ(1)          TO 負傷種別変換前Ｗ.
015570     PERFORM 負傷種別変換.
015580     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(1).
015590     MOVE 負傷名Ｗ(1)            TO 作１－負傷名(1).
015600     MOVE 初回処置回数Ｗ(1)      TO 作１－初回処置回数(1).
015610*
015620     MOVE ZERO                   TO 計算和暦年月日Ｗ.
015630     MOVE 負傷年月日Ｗ(1)        TO 計算和暦年月日Ｗ.
015640     PERFORM 西暦年月日取得.
015650     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(1).
015660*
015670     MOVE ZERO                   TO 計算和暦年月日Ｗ.
015680     MOVE 初検年月日Ｗ(1)        TO 計算和暦年月日Ｗ.
015690     PERFORM 西暦年月日取得.
015700     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(1).
015710*
015720     MOVE ZERO                   TO 計算和暦年月日Ｗ.
015730     MOVE 開始年月日Ｗ(1)        TO 計算和暦年月日Ｗ.
015740     PERFORM 西暦年月日取得.
015750     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(1).
015760*
015770     MOVE ZERO                   TO 計算和暦年月日Ｗ.
015780     MOVE 終了年月日Ｗ(1)        TO 計算和暦年月日Ｗ.
015790     PERFORM 西暦年月日取得.
015800     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(1).
015810*
015820     MOVE 実日数Ｗ(1)            TO 作１－実日数(1).
015830*
015840     MOVE 転帰区分Ｗ(1)          TO 転帰変換前Ｗ.
015850     PERFORM 転帰区分変換.
015860     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(1).
015870*
015880     MOVE 後療回数１ＷＲ         TO 作１－後療回数(1).
015890*
015900     MOVE 冷罨法回数１ＷＲ       TO 作１－冷罨法回数(1).
015910*
015920     MOVE 温罨法回数１ＷＲ       TO 作１－温罨法回数(1).
015930*
015940     MOVE 電療回数１ＷＲ         TO 作１－電療回数(1).
015950*
015960     MOVE 多部位区分Ｗ(1)        TO 作１－多部位逓減区分(1).
015970*
015980     MOVE 長期区分Ｗ(1)          TO 作１－長期逓減区分(1).
015990*
016000* ２部位目
016010     MOVE 負傷種別Ｗ(2)          TO 負傷種別変換前Ｗ.
016020     PERFORM 負傷種別変換.
016030     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(2).
016040     MOVE 負傷名Ｗ(2)            TO 作１－負傷名(2).
016050     MOVE 初回処置回数Ｗ(2)      TO 作１－初回処置回数(2).
016060*
016070     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016080     MOVE 負傷年月日Ｗ(2)        TO 計算和暦年月日Ｗ.
016090     PERFORM 西暦年月日取得.
016100     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(2).
016110*
016120     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016130     MOVE 初検年月日Ｗ(2)        TO 計算和暦年月日Ｗ.
016140     PERFORM 西暦年月日取得.
016150     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(2).
016160*
016170     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016180     MOVE 開始年月日Ｗ(2)        TO 計算和暦年月日Ｗ.
016190     PERFORM 西暦年月日取得.
016200     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(2).
016210*
016220     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016230     MOVE 終了年月日Ｗ(2)        TO 計算和暦年月日Ｗ.
016240     PERFORM 西暦年月日取得.
016250     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(2).
016260*
016270     MOVE 実日数Ｗ(2)            TO 作１－実日数(2).
016280*
016290     MOVE 転帰区分Ｗ(2)          TO 転帰変換前Ｗ.
016300     PERFORM 転帰区分変換.
016310     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(2).
016320*
016330     MOVE 後療回数２ＷＲ         TO 作１－後療回数(2).
016340*
016350     MOVE 冷罨法回数２ＷＲ       TO 作１－冷罨法回数(2).
016360*
016370     MOVE 温罨法回数２ＷＲ       TO 作１－温罨法回数(2).
016380*
016390     MOVE 電療回数２ＷＲ         TO 作１－電療回数(2).
016400*
016410     MOVE 多部位区分Ｗ(2)        TO 作１－多部位逓減区分(2).
016420*
016430     MOVE 長期区分Ｗ(2)          TO 作１－長期逓減区分(2).
016440*
016450* ３部位目
016460     MOVE 負傷種別Ｗ(3)          TO 負傷種別変換前Ｗ.
016470     PERFORM 負傷種別変換.
016480     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(3).
016490     MOVE 負傷名Ｗ(3)            TO 作１－負傷名(3).
016500     MOVE 初回処置回数Ｗ(3)      TO 作１－初回処置回数(3).
016510*
016520     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016530     MOVE 負傷年月日Ｗ(3)        TO 計算和暦年月日Ｗ.
016540     PERFORM 西暦年月日取得.
016550     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(3).
016560*
016570     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016580     MOVE 初検年月日Ｗ(3)        TO 計算和暦年月日Ｗ.
016590     PERFORM 西暦年月日取得.
016600     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(3).
016610*
016620     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016630     MOVE 開始年月日Ｗ(3)        TO 計算和暦年月日Ｗ.
016640     PERFORM 西暦年月日取得.
016650     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(3).
016660*
016670     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016680     MOVE 終了年月日Ｗ(3)        TO 計算和暦年月日Ｗ.
016690     PERFORM 西暦年月日取得.
016700     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(3).
016710*
016720     MOVE 実日数Ｗ(3)            TO 作１－実日数(3).
016730*
016740     MOVE 転帰区分Ｗ(3)          TO 転帰変換前Ｗ.
016750     PERFORM 転帰区分変換.
016760     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(3).
016770*
016780     MOVE 後療回数３ＷＲ         TO 作１－後療回数(3).
016790*
016800     MOVE 冷罨法回数３ＷＲ       TO 作１－冷罨法回数(3).
016810*
016820     MOVE 温罨法回数３ＷＲ       TO 作１－温罨法回数(3).
016830*
016840     MOVE 電療回数３ＷＲ         TO 作１－電療回数(3).
016850*
016860     MOVE 多部位区分Ｗ(3)        TO 作１－多部位逓減区分(3).
016870*
016880     MOVE 長期区分Ｗ(3)          TO 作１－長期逓減区分(3).
016890*
016900* ４部位目
016910     MOVE 負傷種別Ｗ(4)          TO 負傷種別変換前Ｗ.
016920     PERFORM 負傷種別変換.
016930     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(4).
016940     MOVE 負傷名Ｗ(4)            TO 作１－負傷名(4).
016950     MOVE 初回処置回数Ｗ(4)      TO 作１－初回処置回数(4).
016960*
016970     MOVE ZERO                   TO 計算和暦年月日Ｗ.
016980     MOVE 負傷年月日Ｗ(4)        TO 計算和暦年月日Ｗ.
016990     PERFORM 西暦年月日取得.
017000     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(4).
017010*
017020     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017030     MOVE 初検年月日Ｗ(4)        TO 計算和暦年月日Ｗ.
017040     PERFORM 西暦年月日取得.
017050     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(4).
017060*
017070     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017080     MOVE 開始年月日Ｗ(4)        TO 計算和暦年月日Ｗ.
017090     PERFORM 西暦年月日取得.
017100     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(4).
017110*
017120     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017130     MOVE 終了年月日Ｗ(4)        TO 計算和暦年月日Ｗ.
017140     PERFORM 西暦年月日取得.
017150     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(4).
017160*
017170     MOVE 実日数Ｗ(4)            TO 作１－実日数(4).
017180*
017190     MOVE 転帰区分Ｗ(4)          TO 転帰変換前Ｗ.
017200     PERFORM 転帰区分変換.
017210     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(4).
017220*
017230     MOVE 後療回数４ＷＲ         TO 作１－後療回数(4).
017240*
017250     MOVE 冷罨法回数４ＷＲ       TO 作１－冷罨法回数(4).
017260*
017270     MOVE 温罨法回数４ＷＲ       TO 作１－温罨法回数(4).
017280*
017290     MOVE 電療回数４ＷＲ         TO 作１－電療回数(4).
017300*
017310     MOVE 多部位区分Ｗ(4)        TO 作１－多部位逓減区分(4).
017320*
017330     MOVE 長期区分Ｗ(4)          TO 作１－長期逓減区分(4).
017340*
017350* ５部位目
017360     MOVE 負傷種別Ｗ(5)          TO 負傷種別変換前Ｗ.
017370     PERFORM 負傷種別変換.
017380     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(5).
017390     MOVE 負傷名Ｗ(5)            TO 作１－負傷名(5).
017400     MOVE 初回処置回数Ｗ(5)      TO 作１－初回処置回数(5).
017410*
017420     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017430     MOVE 負傷年月日Ｗ(5)        TO 計算和暦年月日Ｗ.
017440     PERFORM 西暦年月日取得.
017450     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(5).
017460*
017470     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017480     MOVE 初検年月日Ｗ(5)        TO 計算和暦年月日Ｗ.
017490     PERFORM 西暦年月日取得.
017500     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(5).
017510*
017520     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017530     MOVE 開始年月日Ｗ(5)        TO 計算和暦年月日Ｗ.
017540     PERFORM 西暦年月日取得.
017550     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(5).
017560*
017570     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017580     MOVE 終了年月日Ｗ(5)        TO 計算和暦年月日Ｗ.
017590     PERFORM 西暦年月日取得.
017600     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(5).
017610*
017620     MOVE 実日数Ｗ(5)            TO 作１－実日数(5).
017630*
017640     MOVE 転帰区分Ｗ(5)          TO 転帰変換前Ｗ.
017650     PERFORM 転帰区分変換.
017660     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(5).
017670*
017680     MOVE 後療回数５ＷＲ         TO 作１－後療回数(5).
017690*
017700     MOVE 冷罨法回数５ＷＲ       TO 作１－冷罨法回数(5).
017710*
017720     MOVE 温罨法回数５ＷＲ       TO 作１－温罨法回数(5).
017730*
017740     MOVE 電療回数５ＷＲ         TO 作１－電療回数(5).
017750*
017760     MOVE 多部位区分Ｗ(5)        TO 作１－多部位逓減区分(5).
017770*
017780     MOVE 長期区分Ｗ(5)          TO 作１－長期逓減区分(5).
017790*
017800* ６部位目
017810     MOVE 負傷種別Ｗ(6)          TO 負傷種別変換前Ｗ.
017820     PERFORM 負傷種別変換.
017830     MOVE 負傷種別変換後Ｗ       TO 作１－負傷区分(6).
017840     MOVE 負傷名Ｗ(6)            TO 作１－負傷名(6).
017850     MOVE 初回処置回数Ｗ(6)      TO 作１－初回処置回数(6).
017860*
017870     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017880     MOVE 負傷年月日Ｗ(6)        TO 計算和暦年月日Ｗ.
017890     PERFORM 西暦年月日取得.
017900     MOVE 計算西暦年月日Ｗ       TO 作１－負傷年月日(6).
017910*
017920     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017930     MOVE 初検年月日Ｗ(6)        TO 計算和暦年月日Ｗ.
017940     PERFORM 西暦年月日取得.
017950     MOVE 計算西暦年月日Ｗ       TO 作１－初検年月日(6).
017960*
017970     MOVE ZERO                   TO 計算和暦年月日Ｗ.
017980     MOVE 開始年月日Ｗ(6)        TO 計算和暦年月日Ｗ.
017990     PERFORM 西暦年月日取得.
018000     MOVE 計算西暦年月日Ｗ       TO 作１－施術開始年月日(6).
018010*
018020     MOVE ZERO                   TO 計算和暦年月日Ｗ.
018030     MOVE 終了年月日Ｗ(6)        TO 計算和暦年月日Ｗ.
018040     PERFORM 西暦年月日取得.
018050     MOVE 計算西暦年月日Ｗ       TO 作１－施術終了年月日(6).
018060*
018070     MOVE 実日数Ｗ(6)            TO 作１－実日数(6).
018080*
018090     MOVE 転帰区分Ｗ(6)          TO 転帰変換前Ｗ.
018100     PERFORM 転帰区分変換.
018110     MOVE 転帰変換後Ｗ           TO 作１－転帰区分(6).
018120*
018130     MOVE ZERO                   TO 作１－後療回数(6).
018140*
018150     MOVE ZERO                   TO 作１－冷罨法回数(6).
018160*
018170     MOVE ZERO                   TO 作１－温罨法回数(6).
018180*
018190     MOVE ZERO                   TO 作１－電療回数(6).
018200*
018210     MOVE 多部位区分Ｗ(6)        TO 作１－多部位逓減区分(6).
018220*
018230     MOVE 長期区分Ｗ(6)          TO 作１－長期逓減区分(6).
018240*
018250**************************************************************
018260*
018270     MOVE 部位数Ｗ               TO 作１－部位数.
018280*
018320*
018330     MOVE 新規区分Ｗ             TO 作１－新規区分.
018340     MOVE 継続区分Ｗ             TO 作１－継続区分.
018350*
018360     MOVE 初検回数Ｗ             TO 作１－初検回数.
018370     MOVE 初検時間外回数Ｗ       TO 作１－初検時間外加算回数.
018380     MOVE 初検休日回数Ｗ         TO 作１－初検休日加算回数.
018390     MOVE 初検深夜回数Ｗ         TO 作１－初検深夜加算回数.
018400     MOVE 再検回数Ｗ             TO 作１－再検回数.
018410     MOVE 往療距離２Ｗ           TO 作１－往療距離.
018420     MOVE 往療回数Ｗ             TO 作１－往療回数.
018430*
018440     MOVE 往療夜間Ｗ             TO 作１－夜間加算往療回数.
018450     MOVE 往療暴風Ｗ             TO 作１－暴風雨雪加算往療回数.
018460     MOVE 往療難路Ｗ             TO 作１－難路加算往療回数.
018470*
018480     MOVE 金属副子回数Ｗ         TO 作１－金属副子回数.
018490     MOVE 運動後療回数Ｗ         TO 作１－運動後療回数.
018510*
018520     MOVE 情報提供料回数Ｗ       TO 作１－情報提供料回数.
018531**
018540** / 負傷原因・長期理由 / **
018541*
018542     IF 負傷原因印刷区分Ｗ  NOT = 1 
018543*      / 負傷原因用WORKクリアー /
018544         INITIALIZE 負傷原因ＷＴ
018545         INITIALIZE 負傷患者番号ＣＷ
018546         INITIALIZE 負傷連番ＣＷ
018547         INITIALIZE 負傷原因ＴＢＬ
018548         INITIALIZE 負傷原因内容Ｗ
018549         PERFORM 負傷原因取得
018550     END-IF.
018551*
018552     IF 長期理由印刷区分Ｗ  NOT = 1 
018553        PERFORM 長期理由文取得
018554     ELSE
018555        MOVE  SPACE TO  連長文－キー
018556        INITIALIZE      連長文－キー
018557     END-IF.
018558*
018559     MOVE 負傷原因Ｗ(1)       TO 作１－負傷原因.
018560     MOVE 連長文－理由文(1)   TO 作１－長期理由.
018561*
           MOVE 07                  TO 作１－業者区分.
           MOVE 相談支援回数Ｗ      TO 作１－相談支援回数.
           MOVE 施術日ＴＷ          TO 作１－施術日.
018530*
018500     MOVE 明細発行加算回数Ｗ  TO 作１－明細発行加算回数.
018500     MOVE 明細発行体制料Ｗ    TO 作１－明細発行体制料.
018500     MOVE 明細書発行月日Ｗ    TO 作１－明細書発行月日.
018562*================================================================*
019320 作１ファイル書込 SECTION.
019330*
019340     WRITE 作１－レコード
019350     INVALID KEY
019360         MOVE NC"作１"  TO ファイル名
019370         PERFORM エラー表示
019380     END-WRITE.
019390*================================================================*
019400*================================================================*
019410 会員番号右詰め SECTION.
019420*
019430     MOVE 会員番号Ｗ      TO  会員番号左詰めＷ.
019440     MOVE ZERO            TO  会員番号右詰めＷ.
019450     MOVE ZERO            TO  会員番号数字Ｗ.
019460*
019470     MOVE  8  TO  カウンタ.
019480*
019490     IF  会員番号左詰めＷ１(7) NOT = SPACE
019500         COMPUTE カウンタ = カウンタ  -  1
019510         MOVE 会員番号左詰めＷ１(7)  TO  会員番号右詰めＷ１(カウンタ)
019520     END-IF.
019530     IF  会員番号左詰めＷ１(6) NOT = SPACE
019540         COMPUTE カウンタ = カウンタ  -  1
019550         MOVE 会員番号左詰めＷ１(6)  TO  会員番号右詰めＷ１(カウンタ)
019560     END-IF.
019570     IF  会員番号左詰めＷ１(5) NOT = SPACE
019580         COMPUTE カウンタ = カウンタ  -  1
019590         MOVE 会員番号左詰めＷ１(5)  TO  会員番号右詰めＷ１(カウンタ)
019600     END-IF.
019610     IF  会員番号左詰めＷ１(4) NOT = SPACE
019620         COMPUTE カウンタ = カウンタ  -  1
019630         MOVE 会員番号左詰めＷ１(4)  TO  会員番号右詰めＷ１(カウンタ)
019640     END-IF.
019650     IF  会員番号左詰めＷ１(3) NOT = SPACE
019660         COMPUTE カウンタ = カウンタ  -  1
019670         MOVE 会員番号左詰めＷ１(3)  TO  会員番号右詰めＷ１(カウンタ)
019680     END-IF.
019690     IF  会員番号左詰めＷ１(2) NOT = SPACE
019700         COMPUTE カウンタ = カウンタ  -  1
019710         MOVE 会員番号左詰めＷ１(2)  TO  会員番号右詰めＷ１(カウンタ)
019720     END-IF.
019730     IF  会員番号左詰めＷ１(1) NOT = SPACE
019740         COMPUTE カウンタ = カウンタ  -  1
019750         MOVE 会員番号左詰めＷ１(1)  TO  会員番号右詰めＷ１(カウンタ)
019760     END-IF.
019770*
019780     MOVE 会員番号右詰めＷ TO 会員番号数字Ｗ.
019790*
019800*================================================================*
019810 保険者番号右詰め SECTION.
019820*
019830     MOVE 保険者番号Ｗ    TO  保険者番号左詰めＷ.
019840     MOVE ZERO            TO  保険者番号右詰めＷ.
019850     MOVE ZERO            TO  保険者番号数字Ｗ.
019860*
019870     MOVE  9  TO  カウンタ.
019880*
019890     IF  保険者番号左詰めＷ１(8) NOT = SPACE
019900         COMPUTE カウンタ = カウンタ  -  1
019910         MOVE 保険者番号左詰めＷ１(8)  TO  保険者番号右詰めＷ１(カウンタ)
019920     END-IF.
019930     IF  保険者番号左詰めＷ１(7) NOT = SPACE
019940         COMPUTE カウンタ = カウンタ  -  1
019950         MOVE 保険者番号左詰めＷ１(7)  TO  保険者番号右詰めＷ１(カウンタ)
019960     END-IF.
019970     IF  保険者番号左詰めＷ１(6) NOT = SPACE
019980         COMPUTE カウンタ = カウンタ  -  1
019990         MOVE 保険者番号左詰めＷ１(6)  TO  保険者番号右詰めＷ１(カウンタ)
020000     END-IF.
020010     IF  保険者番号左詰めＷ１(5) NOT = SPACE
020020         COMPUTE カウンタ = カウンタ  -  1
020030         MOVE 保険者番号左詰めＷ１(5)  TO  保険者番号右詰めＷ１(カウンタ)
020040     END-IF.
020050     IF  保険者番号左詰めＷ１(4) NOT = SPACE
020060         COMPUTE カウンタ = カウンタ  -  1
020070         MOVE 保険者番号左詰めＷ１(4)  TO  保険者番号右詰めＷ１(カウンタ)
020080     END-IF.
020090     IF  保険者番号左詰めＷ１(3) NOT = SPACE
020100         COMPUTE カウンタ = カウンタ  -  1
020110         MOVE 保険者番号左詰めＷ１(3)  TO  保険者番号右詰めＷ１(カウンタ)
020120     END-IF.
020130     IF  保険者番号左詰めＷ１(2) NOT = SPACE
020140         COMPUTE カウンタ = カウンタ  -  1
020150         MOVE 保険者番号左詰めＷ１(2)  TO  保険者番号右詰めＷ１(カウンタ)
020160     END-IF.
020170     IF  保険者番号左詰めＷ１(1) NOT = SPACE
020180         COMPUTE カウンタ = カウンタ  -  1
020190         MOVE 保険者番号左詰めＷ１(1)  TO  保険者番号右詰めＷ１(カウンタ)
020200     END-IF.
020210*
020220     MOVE 保険者番号右詰めＷ TO 保険者番号数字Ｗ.
020230*
020240*================================================================*
020250*================================================================*
020260 記号左詰め SECTION.
020270*
020280***** 記号の無駄なSPACEを取り除いて、左詰めにする。
020290     MOVE SPACE           TO  記号ＮＷ.
020300     MOVE SPACE           TO  記号元Ｗ.
020310     MOVE SPACE           TO  記号左詰めＷ.
020320*     MOVE 受－記号        TO  記号元Ｗ.
      *-----------------------------------------------------------------*
           MOVE SPACE TO 連暗号複合－暗号情報.
      *
      *    / 連暗号複合－入力情報セット /
           MOVE 受－記号       TO 連暗号複合－記号.
           MOVE 受－番号       TO 連暗号複合－番号.
           MOVE 受－暗号化項目 TO 連暗号複合－暗号化項目.
      *
           CALL   複合プログラム名Ｗ.
           CANCEL 複合プログラム名Ｗ.
      *
           MOVE 連暗号複合－複合した記号 TO 記号元Ｗ.
      *
      *-----------------------------------------------------------------*
020330*
020340     MOVE  ZERO  TO  カウンタ２.
020350     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 12
020360          IF  記号元Ｗ１(カウンタ) NOT = SPACE
020370              COMPUTE カウンタ２ = カウンタ２  +  1
020380              MOVE 記号元Ｗ１(カウンタ)  TO  記号左詰めＷ１(カウンタ２)
020390          END-IF
020400     END-PERFORM.
020410*
020290     MOVE SPACE           TO  記号ＰＮＷ.
020300     MOVE SPACE           TO  記号元ＸＷ.
020310     MOVE SPACE           TO  記号左詰めＸＷ.
020320     MOVE 記号左詰めＷ    TO  記号元ＸＷ.
020330*
020340     MOVE  ZERO  TO  カウンタ２.
020350     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 24
020360          IF  記号元ＸＷ１(カウンタ) NOT = SPACE
020370              COMPUTE カウンタ２ = カウンタ２  +  1
020380              MOVE 記号元ＸＷ１(カウンタ)  TO  記号左詰めＸＷ１(カウンタ２)
020390          END-IF
020400     END-PERFORM.
020410*
020420     MOVE 記号左詰めＸＷ    TO 記号ＰＮＷ.
020430*
020440*半角スペースを全角にかえる
020450*    INSPECT 記号Ｗ REPLACING ALL 半角空白 BY 全角空白.
020460*
020470*================================================================*
020480*================================================================*
020490 料金情報取得 SECTION.
020500*
020510***********************************************
020520* 料金データセット                            *
020530***********************************************
020540*    ****************************************************************
020550*    * 料金（月毎）（負傷毎）（逓減毎）については連結項目よりセット *
020560*    ****************************************************************
020570     INITIALIZE 料金１ＷＲ.
020580     INITIALIZE 料金２ＷＲ.
020590     INITIALIZE 料金３ＷＲ.
020600*
020620     MOVE レセ－往療回数               TO  往療回数Ｗ.
020621     MOVE レセ－往療距離               TO  往療距離Ｗ.
020622* 単位100m
020623     COMPUTE  往療距離２Ｗ  =  往療距離Ｗ * 10.
020630*
           MOVE レセ－金属副子回数            TO 金属副子回数Ｗ.
           MOVE レセ－運動後療回数            TO 運動後療回数Ｗ.
      *
           MOVE レセ－明細書発行加算料         TO 明細発行体制料Ｗ.
           IF レセ－明細書発行加算料 NOT = ZERO
               MOVE レセ－請求月               TO 明細月Ｗ
           END-IF.
           MOVE レセ－明細書発行加算日         TO 明細日Ｗ.
           MOVE 明細月日Ｗ                     TO 明細書発行月日Ｗ.
      *
020640********************
020650* 逓減毎料金セット *
020660********************
020670*    **********
020680*    * １部位 *
020690*    **********
020700     MOVE レセ－後療回数１             TO 後療回数１ＷＲ.
020710     MOVE レセ－冷罨法回数１           TO 冷罨法回数１ＷＲ.
020720     MOVE レセ－温罨法回数１           TO 温罨法回数１ＷＲ.
020730     MOVE レセ－電療回数１             TO 電療回数１ＷＲ.
020740     MOVE 0          TO 多部位区分Ｗ(1)
020750     IF レセ－長期逓減率１ NOT = ZERO
020760         MOVE 1      TO 長期区分Ｗ(1)
020770     ELSE
020780         MOVE 0      TO 長期区分Ｗ(1)
020790     END-IF
020800*    **********
020810*    * ２部位 *
020820*    **********
020830     MOVE レセ－後療回数２             TO 後療回数２ＷＲ.
020840     MOVE レセ－冷罨法回数２           TO 冷罨法回数２ＷＲ.
020850     MOVE レセ－温罨法回数２           TO 温罨法回数２ＷＲ.
020860     MOVE レセ－電療回数２             TO 電療回数２ＷＲ.
020870     MOVE 0          TO 多部位区分Ｗ(2)
020880     IF レセ－長期逓減率２ NOT = ZERO
020890         MOVE 1      TO 長期区分Ｗ(2)
020900     ELSE
020910         MOVE 0      TO 長期区分Ｗ(2)
020920     END-IF
020930*    ****************
020940*    * ３部位／８割 *
020950*    ****************
020960     MOVE 0                              TO 長期区分Ｗ(3)
020970     MOVE 0                              TO 長期区分Ｗ(3)
020980     MOVE レセ－後療回数３８             TO 後療回数３８ＷＲ.
020990     MOVE レセ－冷罨法回数３８           TO 冷罨法回数３８ＷＲ.
021000     MOVE レセ－温罨法回数３８           TO 温罨法回数３８ＷＲ.
021010     MOVE レセ－電療回数３８             TO 電療回数３８ＷＲ.
021020     IF レセ－小計３８ NOT = レセ－多部位込小計３８
021030         MOVE 1        TO 多部位区分Ｗ(3)
021040     END-IF
021050     IF レセ－長期逓減率３８ NOT = ZERO
021060         MOVE 1        TO 長期区分Ｗ(3)
021070     END-IF
021080*    ****************
021090*    * ３部位／10割 *
021100*    ****************
021110     MOVE レセ－後療回数３０             TO 後療回数３０ＷＲ.
021120     MOVE レセ－冷罨法回数３０           TO 冷罨法回数３０ＷＲ.
021130     MOVE レセ－温罨法回数３０           TO 温罨法回数３０ＷＲ.
021140     MOVE レセ－電療回数３０             TO 電療回数３０ＷＲ.
021150     IF レセ－長期逓減率３０ NOT = ZERO
021160         MOVE 1        TO 長期区分Ｗ(3)
021170     END-IF
021180*    ****************
021190*    * ３部位／合計 *
021200*    ****************
021210     COMPUTE 後療回数３ＷＲ      = 後療回数３８ＷＲ   + 後療回数３０ＷＲ.
021220     COMPUTE 冷罨法回数３ＷＲ    = 冷罨法回数３８ＷＲ + 冷罨法回数３０ＷＲ.
021230     COMPUTE 温罨法回数３ＷＲ    = 温罨法回数３８ＷＲ + 温罨法回数３０ＷＲ.
021240     COMPUTE 電療回数３ＷＲ      = 電療回数３８ＷＲ   + 電療回数３０ＷＲ.
021250*    ****************
021260*    * ４部位／５割 *
021270*    ****************
021280     MOVE 0                              TO 長期区分Ｗ(4)
021290     MOVE 0                              TO 長期区分Ｗ(4)
021300     MOVE レセ－後療回数４５             TO 後療回数４５ＷＲ.
021310     MOVE レセ－冷罨法回数４５           TO 冷罨法回数４５ＷＲ.
021320     MOVE レセ－温罨法回数４５           TO 温罨法回数４５ＷＲ.
021330     MOVE レセ－電療回数４５             TO 電療回数４５ＷＲ.
021340     IF レセ－小計４５ NOT = レセ－多部位込小計４５
021350         MOVE 1        TO 多部位区分Ｗ(4)
021360     END-IF
021370     IF レセ－長期逓減率４５ NOT = ZERO
021380         MOVE 1        TO 長期区分Ｗ(4)
021390     END-IF
021400*    ****************
021410*    * ４部位／８割 *
021420*    ****************
021430     MOVE レセ－後療回数４８             TO 後療回数４８ＷＲ.
021440     MOVE レセ－冷罨法回数４８           TO 冷罨法回数４８ＷＲ.
021450     MOVE レセ－温罨法回数４８           TO 温罨法回数４８ＷＲ.
021460     MOVE レセ－電療回数４８             TO 電療回数４８ＷＲ.
021470     IF レセ－小計４８ NOT = レセ－多部位込小計４８
021480         MOVE 1        TO 多部位区分Ｗ(4)
021490     END-IF
021500     IF レセ－長期逓減率４８ NOT = ZERO
021510         MOVE 1        TO 長期区分Ｗ(4)
021520     END-IF
021530*    ****************
021540*    * ４部位／10割 *
021550*    ****************
021560     MOVE レセ－後療回数４０             TO 後療回数４０ＷＲ.
021570     MOVE レセ－冷罨法回数４０           TO 冷罨法回数４０ＷＲ.
021580     MOVE レセ－温罨法回数４０           TO 温罨法回数４０ＷＲ.
021590     MOVE レセ－電療回数４０             TO 電療回数４０ＷＲ.
021600     IF レセ－長期逓減率４０ NOT = ZERO
021610         MOVE 1        TO 長期区分Ｗ(4)
021620     END-IF
021630*    ****************
021640*    * ４部位／合計 *
021650*    ****************
021660     COMPUTE 後療回数４ＷＲ      = 後療回数４５ＷＲ   + 後療回数４８ＷＲ   + 後療回数４０ＷＲ.
021670     COMPUTE 冷罨法回数４ＷＲ    = 冷罨法回数４５ＷＲ + 冷罨法回数４８ＷＲ + 冷罨法回数４０ＷＲ.
021680     COMPUTE 温罨法回数４ＷＲ    = 温罨法回数４５ＷＲ + 温罨法回数４８ＷＲ + 温罨法回数４０ＷＲ.
021690     COMPUTE 電療回数４ＷＲ      = 電療回数４５ＷＲ   + 電療回数４８ＷＲ   + 電療回数４０ＷＲ.
021700*    *****************
021710*    * ５部位／2.5割 *
021720*    *****************
021730     MOVE 0                              TO 長期区分Ｗ(5)
021740     MOVE 0                              TO 長期区分Ｗ(5)
021750     MOVE レセ－後療回数５２             TO 後療回数５２ＷＲ.
021760     MOVE レセ－冷罨法回数５２           TO 冷罨法回数５２ＷＲ.
021770     MOVE レセ－温罨法回数５２           TO 温罨法回数５２ＷＲ.
021780     MOVE レセ－電療回数５２             TO 電療回数５２ＷＲ.
021790     IF レセ－小計５２ NOT = レセ－多部位込小計５２
021800         MOVE 1        TO 多部位区分Ｗ(5)
021810     END-IF
021820     IF レセ－長期逓減率５２ NOT = ZERO
021830         MOVE 1        TO 長期区分Ｗ(5)
021840     END-IF
021850*    ****************
021860*    * ５部位／５割 *
021870*    ****************
021880     MOVE レセ－後療回数５５             TO 後療回数５５ＷＲ.
021890     MOVE レセ－冷罨法回数５５           TO 冷罨法回数５５ＷＲ.
021900     MOVE レセ－温罨法回数５５           TO 温罨法回数５５ＷＲ.
021910     MOVE レセ－電療回数５５             TO 電療回数５５ＷＲ.
021920     IF レセ－小計５５ NOT = レセ－多部位込小計５５
021930         MOVE 1        TO 多部位区分Ｗ(5)
021940     END-IF
021950     IF レセ－長期逓減率５５ NOT = ZERO
021960         MOVE 1        TO 長期区分Ｗ(5)
021970     END-IF
021980*    ****************
021990*    * ５部位／８割 *
022000*    ****************
022010     MOVE レセ－後療回数５８             TO 後療回数５８ＷＲ.
022020     MOVE レセ－冷罨法回数５８           TO 冷罨法回数５８ＷＲ.
022030     MOVE レセ－温罨法回数５８           TO 温罨法回数５８ＷＲ.
022040     MOVE レセ－電療回数５８             TO 電療回数５８ＷＲ.
022050     IF レセ－小計５８ NOT = レセ－多部位込小計５８
022060         MOVE 1        TO 多部位区分Ｗ(5)
022070     END-IF
022080     IF レセ－長期逓減率５８ NOT = ZERO
022090         MOVE 1        TO 長期区分Ｗ(5)
022100     END-IF
022110*    ****************
022120*    * ５部位／10割 *
022130*    ****************
022140     MOVE レセ－後療回数５０             TO 後療回数５０ＷＲ.
022150     MOVE レセ－冷罨法回数５０           TO 冷罨法回数５０ＷＲ.
022160     MOVE レセ－温罨法回数５０           TO 温罨法回数５０ＷＲ.
022170     MOVE レセ－電療回数５０             TO 電療回数５０ＷＲ.
022180     IF レセ－長期逓減率５０ NOT = ZERO
022190         MOVE 1        TO 長期区分Ｗ(5)
022200     END-IF
022210*    ****************
022220*    * ５部位／合計 *
022230*    ****************
022240     COMPUTE 後療回数５ＷＲ   = 後療回数５２ＷＲ   + 後療回数５５ＷＲ   +
022250                                後療回数５８ＷＲ   + 後療回数５０ＷＲ.
022260     COMPUTE 冷罨法回数５ＷＲ = 冷罨法回数５２ＷＲ + 冷罨法回数５５ＷＲ +
022270                                冷罨法回数５８ＷＲ + 冷罨法回数５０ＷＲ.
022280     COMPUTE 温罨法回数５ＷＲ = 温罨法回数５２ＷＲ + 温罨法回数５５ＷＲ +
022290                                温罨法回数５８ＷＲ + 温罨法回数５０ＷＲ.
022300     COMPUTE 電療回数５ＷＲ   = 電療回数５２ＷＲ   + 電療回数５５ＷＲ   +
022310                                電療回数５８ＷＲ   + 電療回数５０ＷＲ.
022320*
022330*================================================================*
022340 負傷データ取得 SECTION.
022350*
022360     INITIALIZE 負傷情報Ｗ.
022361*
022370     MOVE 施術和暦ＷＲ       TO 負－施術和暦.
022380     MOVE 施術年ＷＲ         TO 負－施術年.
022390     MOVE 施術月ＷＲ         TO 負－施術月.
022400     MOVE 患者コードＷＲ     TO 負－患者コード.
022410     READ 負傷データＦ
022420     INVALID KEY
022430         CONTINUE
022440     NOT INVALID KEY
022450         MOVE 負－部位数                   TO 部位数Ｗ
022460         PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
022470                 UNTIL ( 部位ＣＮＴ > 部位数Ｗ )
022480             MOVE 負－負傷種別(部位ＣＮＴ) TO 負傷種別Ｗ(部位ＣＮＴ)
022490             MOVE 負－部位(部位ＣＮＴ)     TO 部位Ｗ(部位ＣＮＴ)
022500             MOVE 負－左右区分(部位ＣＮＴ) TO 左右区分Ｗ(部位ＣＮＴ)
022510             MOVE 負－負傷位置番号(部位ＣＮＴ)
022520                                           TO 負傷位置番号Ｗ(部位ＣＮＴ)
022530* 負傷種別
022540             MOVE SPACE                     TO 負傷名称Ｗ
022550             MOVE 03                        TO 名－区分コード
022560             MOVE 負－負傷種別(部位ＣＮＴ)  TO 名－名称コード
022570             READ 名称マスタ
022580             INVALID KEY
022590                 MOVE SPACE        TO 負傷名称Ｗ
022600             NOT INVALID KEY
022610                 MOVE 名－正式名称 TO 負傷名称Ｗ
022620             END-READ
022630* 部位
022720             STRING レセ－部位名称１(部位ＣＮＴ)  DELIMITED BY SPACE
022730                    負傷名称Ｗ                    DELIMITED BY SPACE
022740                    レセ－部位名称２(部位ＣＮＴ)  DELIMITED BY SPACE
022750                    INTO 負傷名Ｗ(部位ＣＮＴ)
022760             END-STRING
022780*
022790             MOVE 負－負傷和暦(部位ＣＮＴ)   TO 負傷和暦Ｗ(部位ＣＮＴ)
022800             MOVE 負－負傷年(部位ＣＮＴ)   TO 負傷年Ｗ(部位ＣＮＴ)
022810             MOVE 負－負傷月(部位ＣＮＴ)   TO 負傷月Ｗ(部位ＣＮＴ)
022820             MOVE 負－負傷日(部位ＣＮＴ)   TO 負傷日Ｗ(部位ＣＮＴ)
022830             MOVE 負－開始和暦(部位ＣＮＴ)   TO 初検和暦Ｗ(部位ＣＮＴ)
022840             MOVE 負－開始年(部位ＣＮＴ)   TO 初検年Ｗ(部位ＣＮＴ)
022850             MOVE 負－開始月(部位ＣＮＴ)   TO 初検月Ｗ(部位ＣＮＴ)
022860             MOVE 負－開始日(部位ＣＮＴ)   TO 初検日Ｗ(部位ＣＮＴ)
022870             IF 負－転帰区分(部位ＣＮＴ) = 9
022880                 MOVE 99                   TO 終了年Ｗ(部位ＣＮＴ)
022890                 MOVE 99                   TO 終了月Ｗ(部位ＣＮＴ)
022900                 MOVE 99                   TO 終了日Ｗ(部位ＣＮＴ)
022910             ELSE
022920                 MOVE 負－終了和暦(部位ＣＮＴ)   TO 終了和暦Ｗ(部位ＣＮＴ)
022930                 MOVE 負－終了年(部位ＣＮＴ)   TO 終了年Ｗ(部位ＣＮＴ)
022940                 MOVE 負－終了月(部位ＣＮＴ)   TO 終了月Ｗ(部位ＣＮＴ)
022950                 MOVE 負－終了日(部位ＣＮＴ)   TO 終了日Ｗ(部位ＣＮＴ)
022960             END-IF
022970*
022980             MOVE 負－転帰区分(部位ＣＮＴ) TO 転帰区分Ｗ(部位ＣＮＴ)
022990*
023000         END-PERFORM
023010* 新規/継続 チェック
023020         IF レセ－初検料  NOT = ZERO
023030             MOVE 1                   TO 新規区分Ｗ
023040         ELSE
023050             MOVE 1                   TO 継続区分Ｗ
023060         END-IF
023070         PERFORM 初検日以前のデータ判定
023080* 枝番判定用
023090         MOVE 負－開始診療日手動区分 TO  開始診療日手動区分Ｗ
023100*
023110     END-READ.
023120*
023130*================================================================*
023140 初検日以前のデータ判定 SECTION.
023150*
023160*********************************************************************************
023170*  最初の初検日以前の当月中に施術記録レコードがあった時(治癒、中止)は、請求区分の
023180*  継続にもチェックする。(新規と継続の両方)
023190*********************************************************************************
023200** 最初の初検日を取得
023210     MOVE SPACE                 TO 初検フラグ.
023220     MOVE 患者番号ＷＲ          TO 施記－患者番号.
023230     MOVE 枝番ＷＲ              TO 施記－枝番.
023240     MOVE 施術和暦ＷＲ          TO 施記－施術和暦.
023250     MOVE 施術年ＷＲ            TO 施記－施術年.
023260     MOVE 施術月ＷＲ            TO 施記－施術月.
023270     MOVE ZERO                  TO 施記－施術日.
023280     START 施術記録Ｆ   KEY IS >= 施記－患者コード
023290                                  施記－施術和暦年月日
023300     END-START.
023310     IF 状態キー = "00"
023320         MOVE ZERO  TO 初検和暦ＷＴ
023330         MOVE ZERO  TO 初検年ＷＴ
023340         MOVE ZERO  TO 初検月ＷＴ
023350         MOVE ZERO  TO 初検日ＷＴ
023360         MOVE SPACE TO 終了フラグ２
023370         PERFORM 施術記録Ｆ読込
023380         PERFORM UNTIL ( 終了フラグ２         = "YES"           ) OR
023390                       ( 施記－患者コード NOT = 患者コードＷＲ  ) OR
023400                       ( 施記－施術和暦   NOT = 施術和暦ＷＲ    ) OR
023410                       ( 施記－施術年     NOT = 施術年ＷＲ      ) OR
023420                       ( 施記－施術月     NOT = 施術月ＷＲ      ) OR
023430                       ( 初検フラグ           = "YES"           ) 
023440               IF  施記－診療区分 = 2
023450                   MOVE 施記－施術和暦           TO 初検和暦ＷＴ
023460                   MOVE 施記－施術年             TO 初検年ＷＴ
023470                   MOVE 施記－施術月             TO 初検月ＷＴ
023480                   MOVE 施記－施術日             TO 初検日ＷＴ
023490                   MOVE "YES"                    TO 初検フラグ
023500               END-IF
023510               PERFORM 施術記録Ｆ読込
023520         END-PERFORM
023530     END-IF.
023540*
023550* 初検日以前のデータ判定
023560     IF 初検フラグ = "YES"
023570        MOVE 患者番号ＷＲ          TO 施記－患者番号
023580        MOVE 枝番ＷＲ              TO 施記－枝番
023590        MOVE 初検和暦ＷＴ          TO 施記－施術和暦
023600        MOVE 初検年ＷＴ            TO 施記－施術年
023610        MOVE 初検月ＷＴ            TO 施記－施術月
023620        MOVE 初検日ＷＴ            TO 施記－施術日
023630        START 施術記録Ｆ   KEY IS <  施記－患者コード
023640                                     施記－施術和暦年月日
023650                                     REVERSED
023660        END-START
023670        IF 状態キー = "00"
023680           MOVE SPACE  TO 終了フラグ２
023690           PERFORM 施術記録Ｆ読込
023700           IF ( 終了フラグ２    = SPACE        ) AND
023710              ( 施記－患者番号  = 患者番号ＷＲ ) AND
023720              ( 施記－枝番      = 枝番ＷＲ     ) AND
023730              ( 施記－施術和暦  = 初検和暦ＷＴ ) AND
023740              ( 施記－施術年    = 初検年ＷＴ   ) AND
023750              ( 施記－施術月    = 初検月ＷＴ   )
023760*  初検日以前の当月中に施術記録レコードがあった時
023770                IF 継続区分Ｗ = ZERO
023780                   MOVE 1    TO 継続区分Ｗ
023790                END-IF
023800           END-IF
023810         END-IF
023820     END-IF.
023830*
023840*================================================================*
023850 施術記録取得 SECTION.
023860*
023870     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1 UNTIL 部位ＣＮＴ > 部位数Ｗ
023880         IF ( 施術年ＷＲ = 初検年Ｗ(部位ＣＮＴ) ) AND
023890            ( 施術月ＷＲ = 初検月Ｗ(部位ＣＮＴ) )
023900             MOVE 患者番号ＷＲ          TO 施記－患者番号
023910             MOVE 枝番ＷＲ              TO 施記－枝番
023920             MOVE 施術和暦ＷＲ          TO 施記－施術和暦
023930             MOVE 初検和暦Ｗ(部位ＣＮＴ)  TO 開始和暦Ｗ(部位ＣＮＴ)
023940             MOVE 初検年Ｗ(部位ＣＮＴ)  TO 開始年Ｗ(部位ＣＮＴ) 施記－施術年
023950             MOVE 初検月Ｗ(部位ＣＮＴ)  TO 開始月Ｗ(部位ＣＮＴ) 施記－施術月
023960             MOVE 初検日Ｗ(部位ＣＮＴ)  TO 開始日Ｗ(部位ＣＮＴ) 施記－施術日
023970         ELSE
023980             MOVE 患者番号ＷＲ          TO 施記－患者番号
023990             MOVE 枝番ＷＲ              TO 施記－枝番
024000             MOVE 施術和暦ＷＲ          TO 施記－施術和暦
024010             MOVE 施術年ＷＲ            TO 施記－施術年
024020             MOVE 施術月ＷＲ            TO 施記－施術月
024030             MOVE ZERO                  TO 施記－施術日
024040         END-IF
024050         START 施術記録Ｆ   KEY IS >= 施記－患者コード
024060                                      施記－施術和暦年月日
024070         END-START
024080         IF 状態キー = "00"
024090             MOVE ZERO  TO 実日数Ｗ(部位ＣＮＴ)
024100             MOVE ZERO  TO 初回処置回数Ｗ(部位ＣＮＴ)
024110             MOVE ZERO  TO 終了和暦ＷＴ
024120             MOVE ZERO  TO 終了年ＷＴ
024130             MOVE ZERO  TO 終了月ＷＴ
024140             MOVE ZERO  TO 終了日ＷＴ
024150             MOVE SPACE TO 終了フラグ２
024160             PERFORM 施術記録Ｆ読込
024170             IF  ( 終了フラグ２      = SPACE   ) AND
024180                 ( 施記－患者コード  = 患者コードＷＲ ) AND
024190                 ( 施記－施術和暦    = 施術和暦ＷＲ   ) AND
024200                 ( 施記－施術年      = 施術年ＷＲ     ) AND
024210                 ( 施記－施術月      = 施術月ＷＲ     ) 
024220*
024340*        ****************
024350*        * 情報提供回数 *
024360*        ****************
024370             IF 施記－情報提供区分(部位ＣＮＴ) = 1
024380                 COMPUTE 情報提供料回数Ｗ = 情報提供料回数Ｗ + 1
024390             END-IF
024400*        *****************************************************************
024410*        * 開始年月日 ( その部位が当月初検でないか、
024420*                       当月初検でも枝番がある時は、最初の施術日を開始日)*
024430*        *****************************************************************
024440                 IF ( 施術年ＷＲ NOT = 初検年Ｗ(部位ＣＮＴ) ) OR
024450                    ( 施術月ＷＲ NOT = 初検月Ｗ(部位ＣＮＴ) ) OR
024460                    ( 開始診療日手動区分Ｗ = 1 )
024470                     MOVE 施記－施術和暦 TO 開始和暦Ｗ(部位ＣＮＴ)
024480                     MOVE 施記－施術年   TO 開始年Ｗ(部位ＣＮＴ)
024490                     MOVE 施記－施術月   TO 開始月Ｗ(部位ＣＮＴ)
024500                     MOVE 施記－施術日   TO 開始日Ｗ(部位ＣＮＴ)
024510                 END-IF
024520             END-IF
024530             PERFORM UNTIL ( 終了フラグ２         = "YES"            ) OR
024540                           ( 施記－患者コード NOT = 患者コードＷＲ   ) OR
024550                           ( 施記－施術和暦   NOT = 施術和暦ＷＲ     ) OR
024560                           ( 施記－施術年     NOT = 施術年ＷＲ       ) OR
024570                           ( 施記－施術月     NOT = 施術月ＷＲ       ) OR
024580                           ( 施記－施術日         > 終了日Ｗ(部位ＣＮＴ))
024590*               **********
024600*               * 実日数 *
024610*               **********
024620                COMPUTE 実日数Ｗ(部位ＣＮＴ) = 実日数Ｗ(部位ＣＮＴ) + 1
024630                MOVE 施記－施術和暦             TO 終了和暦ＷＴ
024640                MOVE 施記－施術年               TO 終了年ＷＴ
024650                MOVE 施記－施術月               TO 終了月ＷＴ
024660                MOVE 施記－施術日               TO 終了日ＷＴ
024670*            /　初回処置のカウント　/
024680                IF 施記－整復施療区分(部位ＣＮＴ) = 1
024690                    COMPUTE 初回処置回数Ｗ(部位ＣＮＴ) = 初回処置回数Ｗ(部位ＣＮＴ) + 1
024700                END-IF
024710*
024720                PERFORM 施術記録Ｆ読込
024730            END-PERFORM
024740        END-IF
024750*       **************************
024760*       * 継続：終了年月日セット *
024770*       **************************
024780        IF 転帰区分Ｗ(部位ＣＮＴ) = 9
024790            MOVE 終了和暦ＷＴ  TO 終了和暦Ｗ(部位ＣＮＴ)
024800            MOVE 終了年ＷＴ    TO 終了年Ｗ(部位ＣＮＴ)
024810            MOVE 終了月ＷＴ    TO 終了月Ｗ(部位ＣＮＴ)
024820            MOVE 終了日ＷＴ    TO 終了日Ｗ(部位ＣＮＴ)
024830        END-IF
024840     END-PERFORM.
024841***
024850     MOVE 患者番号ＷＲ          TO 施記－患者番号.
024860     MOVE 枝番ＷＲ              TO 施記－枝番.
024870     MOVE 施術和暦ＷＲ          TO 施記－施術和暦.
024880     MOVE 施術年ＷＲ            TO 施記－施術年.
024890     MOVE 施術月ＷＲ            TO 施記－施術月.
024900     MOVE ZERO                  TO 施記－施術日.
024910     START 施術記録Ｆ   KEY IS >= 施記－患者コード
024920                                  施記－施術和暦年月日
024930     END-START.
024940     IF 状態キー = "00"
024150         MOVE SPACE TO 終了フラグ２
024950         PERFORM 施術記録Ｆ読込
024960         PERFORM UNTIL ( 終了フラグ２         = "YES"            ) OR
024970                       ( 施記－患者コード NOT = 患者コードＷＲ   ) OR
024980                       ( 施記－施術和暦   NOT = 施術和暦ＷＲ     ) OR
024990                       ( 施記－施術年     NOT = 施術年ＷＲ       ) OR
025000                       ( 施記－施術月     NOT = 施術月ＷＲ       )
025010*        ************
025020*        * 初検回数 *
025030*        ************
025040             IF 施記－初検料請求区分 = 1
025050                 COMPUTE 初検回数Ｗ = 初検回数Ｗ + 1
025060             END-IF
025070*        ************
025080*        * 初検加算 *
025090*        ************
025100             EVALUATE 施記－初検加算
025110             WHEN 1
025120                 COMPUTE 初検時間外回数Ｗ = 初検時間外回数Ｗ + 1
025130             WHEN 2
025140                 COMPUTE 初検休日回数Ｗ   = 初検休日回数Ｗ + 1
025150             WHEN 3
025160                 COMPUTE 初検深夜回数Ｗ   = 初検深夜回数Ｗ + 1
025170             END-EVALUATE
025180*        ************
025190*        * 再検回数 *
025200*        ************
025210             IF 施記－再検料請求 = 1
025220                 COMPUTE 再検回数Ｗ = 再検回数Ｗ + 1
025230             END-IF
025240*        ************
025250*        * 往療加算 *
025260*        ************
025270             EVALUATE 施記－往療加算
025280             WHEN 1
025290                 COMPUTE 往療夜間Ｗ = 往療夜間Ｗ + 1
025300             WHEN 2
025310                 COMPUTE 往療難路Ｗ = 往療難路Ｗ + 1
025320             WHEN 3
025330                 COMPUTE 往療暴風Ｗ = 往療暴風Ｗ + 1
025340             END-EVALUATE
025240*        ****************
025250*        * 初検時相談料 *
025260*        ****************
                   IF (施記－診療区分 = 2 ) AND (施記－初検時相談料区分 NOT = 1)
                       COMPUTE 相談支援回数Ｗ = 相談支援回数Ｗ + 1
                   END-IF
025180*        **********************
025190*        * 明細書発行加算回数 *
025200*        **********************
025210             IF 施記－明細書発行加算区分 = 1
025220                 COMPUTE 明細発行加算回数Ｗ = 明細発行加算回数Ｗ + 1
025230             END-IF
025240*        **********
025250*        * 施術日 *
025260*        **********
                   MOVE 1 TO 施術日Ｗ(施記－施術日)
      *
025350             PERFORM 施術記録Ｆ読込
025360         END-PERFORM
025370     END-IF.
025380*
025390*================================================================*
025820 西暦施術年月取得 SECTION.
025830* 
025840     MOVE ZERO          TO 西暦年月Ｗ  西暦施術年月Ｗ.
025850     MOVE 受－施術和暦  TO 元－元号区分.
025860     READ 元号マスタ
025870     NOT INVALID KEY
025880         MOVE 元－開始西暦年 TO 西暦年Ｗ
025890     END-READ.
025900**
025910     IF 西暦年Ｗ = ZERO
025920          MOVE  NC"元号マスタに開始西暦年を登録して下さい" TO 連メ－メッセージ
025930          CALL   "MSG001"
025940          CANCEL "MSG001"
025950          PERFORM ファイル閉鎖
025960          MOVE 99 TO PROGRAM-STATUS
025970          EXIT PROGRAM
025980     ELSE
025990          COMPUTE 西暦年Ｗ = 西暦年Ｗ + 受－施術年 - 1
026000          MOVE 受－施術月 TO 西暦月Ｗ
026010     END-IF.
026020*
026030     MOVE 西暦年月Ｗ   TO  西暦施術年月Ｗ.
026040*
026050*================================================================*
026060 西暦年月日取得 SECTION.
026070*
026080     MOVE ZERO  TO 計算西暦年月日Ｗ.
026090*
026100     IF 計算和暦Ｗ  NOT = ZERO
026110         MOVE 計算和暦Ｗ    TO 元－元号区分
026120         READ 元号マスタ
026130         NOT INVALID KEY
026140             MOVE 元－開始西暦年 TO 計算西暦年Ｗ
026150         END-READ
026160**
026170         IF 計算西暦年Ｗ = ZERO
026180              MOVE  NC"元号マスタに開始西暦年を登録して下さい" TO 連メ－メッセージ
026190              CALL   "MSG001"
026200              CANCEL "MSG001"
026210              PERFORM ファイル閉鎖
026220              MOVE 99 TO PROGRAM-STATUS
026230              EXIT PROGRAM
026240         ELSE
026250              COMPUTE 計算西暦年Ｗ = 計算西暦年Ｗ + 計算年Ｗ - 1
026260              MOVE 計算月Ｗ TO 計算西暦月Ｗ
026270              MOVE 計算日Ｗ TO 計算西暦日Ｗ
026280         END-IF
026290     END-IF.
026300*
026310*================================================================*
026320 助成負担者番号取得 SECTION.
026330*
026340*--------------------------------------------------------------------------
026350* 負担者番号が ﾀﾞﾐｰ 99XXXXXXは 26XXXXXX にする。
026360* 負担者番号が数字以外で始まる(茨-)時は、26XXXXXX にする。XXXXXXは、国保番号
026370*   XXXXXXは、市町村マスタの中の 保険者番号 を使用する。(ﾏｽﾀに入力しておく)
026380*--------------------------------------------------------------------------
026390*
026400     PERFORM 助成番号左詰め.
026410*
026420     IF 助成番号Ｗ(1:2)  = "99"
026430*  / ﾀﾞﾐｰ 番号 /
026440         MOVE 助成番号Ｗ              TO 保険者番号Ｗ
026450         MOVE "26"                    TO 保険者番号Ｗ(1:2)
026460         PERFORM 保険者番号右詰め
026470         MOVE 保険者番号数字Ｗ        TO 作１－助成負担者番号
026480     ELSE
026490*  / 数字 /
026500         IF 助成番号Ｗ(1:1)  = "0" OR "1" OR "2" OR "3" OR "4" OR
026510                               "5" OR "6" OR "7" OR "8" OR "9" OR SPACE
026520             MOVE 助成番号Ｗ         TO 保険者番号Ｗ
026530             PERFORM 保険者番号右詰め
026540             MOVE 保険者番号数字Ｗ   TO 作１－助成負担者番号
026550         ELSE
026560*  / 数字以外 /
026570             MOVE 受－助成種別       TO 市－公費種別
026580             MOVE 助成番号Ｗ         TO 市－市町村番号
026590             READ 市町村マスタ
026600             INVALID KEY
026610                 MOVE ZERO           TO 作１－助成負担者番号
026620             NOT INVALID KEY
026630                 MOVE SPACE          TO 保険者番号Ｗ
026640                 MOVE "26"           TO 保険者番号Ｗ(1:2)
026650                 MOVE 市－保険者番号 TO 保険者番号Ｗ(3:6)
026660                 PERFORM 保険者番号右詰め
026670                 MOVE 保険者番号数字Ｗ   TO 作１－助成負担者番号
026680             END-READ
026690         END-IF
026700     END-IF.
026710*
026720*================================================================*
026730*================================================================*
026740 助成番号左詰め SECTION.
026750*
026760***** 助成の負担者番号の無駄なSPACEを取り除いて、左詰めにする。
026770     MOVE SPACE           TO  助成番号Ｗ.
026780     MOVE SPACE           TO  助成番号元Ｗ.
026790     MOVE SPACE           TO  助成番号左詰めＷ.
026800     MOVE 受－費用負担者番号助成   TO  助成番号元Ｗ.
026810*
026820     MOVE  ZERO  TO  カウンタ２.
026830     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL カウンタ > 10
026840          IF  助成番号元Ｗ１(カウンタ) NOT = SPACE
026850              COMPUTE カウンタ２ = カウンタ２  +  1
026860              MOVE 助成番号元Ｗ１(カウンタ)  TO  助成番号左詰めＷ１(カウンタ２)
026870          END-IF
026880     END-PERFORM.
026890*
026900     MOVE 助成番号左詰めＷ    TO 助成番号Ｗ.
026910*
026920*================================================================*
026930 負傷種別変換 SECTION.
026940*
026950     MOVE ZERO  TO 負傷種別変換後Ｗ.
026960*
026970     EVALUATE 負傷種別変換前Ｗ
026980     WHEN  ZERO
026990        MOVE ZERO TO 負傷種別変換後Ｗ
027000* 捻挫
027010     WHEN  01
027020        MOVE  4   TO 負傷種別変換後Ｗ
027030* 打撲
027040     WHEN  02
027050        MOVE  5   TO 負傷種別変換後Ｗ
027060* 挫傷
027070     WHEN  03
027080        MOVE  6   TO 負傷種別変換後Ｗ
027090* 脱臼
027100     WHEN  04
027110        MOVE  3   TO 負傷種別変換後Ｗ
027120* 骨折
027130     WHEN  05
027140        MOVE  1   TO 負傷種別変換後Ｗ
027150* 不全骨折
027160     WHEN  06
027170        MOVE  2   TO 負傷種別変換後Ｗ
027180* 骨折・不全骨折拘縮
027190     WHEN  07
027200     WHEN  08
027210        MOVE  7   TO 負傷種別変換後Ｗ
027220* 負傷名なし（無病）
027230     WHEN  09
027240        MOVE  9   TO 負傷種別変換後Ｗ
027250     WHEN OTHER
027260        CONTINUE
027270     END-EVALUATE.
027280*
027290*================================================================*
027300 転帰区分変換 SECTION.
027310*
027320     MOVE ZERO  TO 転帰変換後Ｗ.
027330*
027340     EVALUATE 転帰変換前Ｗ
027350     WHEN  ZERO
027360        MOVE ZERO TO 転帰変換後Ｗ
027370* 治癒
027380     WHEN  1
027390     WHEN  2
027400        MOVE  1   TO 転帰変換後Ｗ
027410* 中止
027420     WHEN  3
027430        MOVE  2   TO 転帰変換後Ｗ
027440* 転医
027450     WHEN  4
027460        MOVE  4   TO 転帰変換後Ｗ
027470* 継続・自然治癒
027480     WHEN  5
027490     WHEN  9
027500        MOVE  3   TO 転帰変換後Ｗ
027510     WHEN OTHER
027520        CONTINUE
027530     END-EVALUATE.
027540*
027550*================================================================*
027551*================================================================*
027552 負傷原因取得 SECTION.
027553*
027554********************************************************************
027555*  負傷原因コードが同じものは、1行にまとめて印字する。
027556*  例: ①② 家で転んだ.
027557*     負傷原因コードが同じものをまとめ、テーブルにセット
027558*     (ただし、部位を飛んで同じものは、2行になる)
027559********************************************************************
027560     MOVE  ZERO   TO  カウンタ カウンタ２.
027561     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
027562             UNTIL ( 部位ＣＮＴ > 部位数Ｗ )
027563*
027564****        IF ( 負－負傷患者番号(部位ＣＮＴ)  NOT = ZERO )  AND
027565        IF ( 負－負傷連番(部位ＣＮＴ)      NOT = ZERO )
027566*
027567           IF カウンタ = ZERO
027568               MOVE 1   TO  カウンタ カウンタ２
027569               MOVE 負－負傷患者番号(部位ＣＮＴ) TO 負傷患者番号Ｗ(カウンタ)  負傷患者番号ＣＷ
027570               MOVE 負－負傷連番(部位ＣＮＴ)     TO 負傷連番Ｗ(カウンタ)   負傷連番ＣＷ
027571               MOVE 部位ＣＮＴ                   TO 負傷原因部位Ｗ(カウンタ カウンタ２)
027572           ELSE
027573              IF ( 負－負傷患者番号(部位ＣＮＴ)  = 負傷患者番号ＣＷ )  AND
027574                 ( 負－負傷連番(部位ＣＮＴ)      = 負傷連番ＣＷ     )
027575                 COMPUTE カウンタ２ = カウンタ２  +  1
027576                 MOVE 部位ＣＮＴ                  TO 負傷原因部位Ｗ(カウンタ カウンタ２)
027577              ELSE
027578                 COMPUTE カウンタ = カウンタ  +  1
027579                 MOVE 1   TO  カウンタ２
027580                 MOVE 負－負傷患者番号(部位ＣＮＴ) TO 負傷患者番号Ｗ(カウンタ)  負傷患者番号ＣＷ
027581                 MOVE 負－負傷連番(部位ＣＮＴ)     TO 負傷連番Ｗ(カウンタ)  負傷連番ＣＷ
027582                 MOVE 部位ＣＮＴ                   TO 負傷原因部位Ｗ(カウンタ カウンタ２)
027583              END-IF
027584           END-IF
027585        END-IF
027586     END-PERFORM.
027587**************************************************************************
027588*  負傷原因マスタより文章取得
027589**************************************************************************
027590     MOVE  ZERO   TO  カウンタ カウンタ２.
027591     PERFORM VARYING カウンタ FROM 1 BY 1
027592             UNTIL ( カウンタ > 9 )  OR ( 負傷連番Ｗ(カウンタ) = ZERO )
027593** 健保は 区分 01
027594         MOVE 01                        TO 負原－区分コード
027595         MOVE 負傷患者番号Ｗ(カウンタ)  TO 負原－患者番号
027596         MOVE 負傷連番Ｗ(カウンタ)      TO 負原－負傷原因連番
027597         READ 負傷原因Ｆ
027598         NOT INVALID KEY
027599             INITIALIZE 負傷原因ＷＴ
027600             MOVE 負原－負傷原因ＣＭ(1) TO  負傷原因１ＷＴ
027601             MOVE 負原－負傷原因ＣＭ(2) TO  負傷原因２ＷＴ
027602             MOVE 負原－負傷原因ＣＭ(3) TO  負傷原因３ＷＴ
027603             MOVE 負原－負傷原因ＣＭ(4) TO  負傷原因４ＷＴ
027604             MOVE 負原－負傷原因ＣＭ(5) TO  負傷原因５ＷＴ
027605             PERFORM VARYING カウンタ２ FROM 1 BY 1
027606                     UNTIL ( カウンタ２ > 9 )  OR 
027607                           ( 負傷原因部位Ｗ(カウンタ カウンタ２) = ZERO )
027608                EVALUATE 負傷原因部位Ｗ(カウンタ カウンタ２)
027609                WHEN 1
027610                   MOVE "①"  TO  負傷原因ナンバーＷ１(カウンタ２)
027611                WHEN 2
027612                   MOVE "②"  TO  負傷原因ナンバーＷ１(カウンタ２)
027613                WHEN 3
027614                   MOVE "③"  TO  負傷原因ナンバーＷ１(カウンタ２)
027615                WHEN 4
027616                   MOVE "④"  TO  負傷原因ナンバーＷ１(カウンタ２)
027617                WHEN 5
027618                   MOVE "⑤"  TO  負傷原因ナンバーＷ１(カウンタ２)
027619                WHEN OTHER
027620                   CONTINUE
027621                END-EVALUATE
027622             END-PERFORM
027623*
027633             IF 負原－負傷原因入力区分 = 1
027634                 STRING 負傷原因ナンバーＮＷ  DELIMITED BY SPACE
027635                        負傷原因１ＷＴ  DELIMITED BY SIZE
027636                        負傷原因２ＷＴ  DELIMITED BY SIZE
027637                        負傷原因３ＷＴ  DELIMITED BY SIZE
027638                        負傷原因４ＷＴ  DELIMITED BY SIZE
027639                        負傷原因５ＷＴ  DELIMITED BY SIZE
027640                        INTO 負傷原因内容合成Ｗ(カウンタ)
027641                 END-STRING
027642             ELSE
005946                 INSPECT 負傷原因ＷＴ REPLACING ALL 全角空白 BY 半角空白
                       MOVE SPACE TO 文字１Ｗ 文字２Ｗ
                       MOVE 負傷原因ナンバーＮＷ TO 文字１Ｗ
                       MOVE 負傷原因１ＷＴ       TO 文字２Ｗ
                       CALL プログラム名Ｗ WITH C LINKAGE
                            USING BY REFERENCE 文字１Ｗ
                                  BY REFERENCE 文字２Ｗ
                       MOVE 負傷原因２ＷＴ       TO 文字２Ｗ
                       CALL プログラム名Ｗ WITH C LINKAGE
                            USING BY REFERENCE 文字１Ｗ
                                  BY REFERENCE 文字２Ｗ
                       MOVE 負傷原因３ＷＴ       TO 文字２Ｗ
                       CALL プログラム名Ｗ WITH C LINKAGE
                            USING BY REFERENCE 文字１Ｗ
                                  BY REFERENCE 文字２Ｗ
                       MOVE 負傷原因４ＷＴ       TO 文字２Ｗ
                       CALL プログラム名Ｗ WITH C LINKAGE
                            USING BY REFERENCE 文字１Ｗ
                                  BY REFERENCE 文字２Ｗ
                       MOVE 負傷原因５ＷＴ       TO 文字２Ｗ
                       CALL プログラム名Ｗ WITH C LINKAGE
                            USING BY REFERENCE 文字１Ｗ
                                  BY REFERENCE 文字２Ｗ
                        MOVE 文字１Ｗ TO 負傷原因内容合成Ｗ(カウンタ)
027651             END-IF
027652*
027653         END-READ
027654     END-PERFORM.
027655*
027656     PERFORM 負傷原因セット.
027657*
027658*================================================================*
027659 負傷原因セット SECTION.
027660*
027661**************************************************************************
027662*  文章が1行を超える時は、複数行に分解する。
027663**************************************************************************
027664     MOVE  ZERO   TO  カウンタ カウンタ２.
027665     PERFORM VARYING カウンタ FROM 1 BY 1
027666             UNTIL ( カウンタ > 9 )  OR ( 負傷原因内容合成Ｗ(カウンタ) = SPACE )
027667*
027668          INITIALIZE 負傷原因内容分解ＸＷ
027669          MOVE 負傷原因内容合成Ｗ(カウンタ)   TO 負傷原因内容分解ＸＷ
027670          IF  負傷原因内容１ＸＷ  NOT = SPACE
027671              COMPUTE カウンタ２ = カウンタ２  +  1
027672              MOVE 負傷原因内容１ＸＷ  TO 負傷原因Ｗ(カウンタ２)
027673          END-IF
027674          IF  負傷原因内容２ＸＷ  NOT = SPACE
027675              COMPUTE カウンタ２ = カウンタ２  +  1
027676              MOVE 負傷原因内容２ＸＷ  TO 負傷原因Ｗ(カウンタ２)
027677          END-IF
027678          IF  負傷原因内容３ＸＷ  NOT = SPACE
027679              COMPUTE カウンタ２ = カウンタ２  +  1
027680              MOVE 負傷原因内容３ＸＷ  TO 負傷原因Ｗ(カウンタ２)
027681          END-IF
034690          IF  負傷原因内容４ＸＷ  NOT = SPACE
034700              COMPUTE カウンタ２ = カウンタ２  +  1
034710              MOVE 負傷原因内容４ＸＷ  TO 負傷原因Ｗ(カウンタ２)
034720          END-IF
027682*
027683     END-PERFORM.
027684*
027685*================================================================*
027686 長期理由文取得 SECTION.
027687*
027688* 長期理由文取得は "CHOUBUN" を呼ぶ. 
027689     MOVE  SPACE TO  連長文－キー.
027690     INITIALIZE      連長文－キー.
027691     MOVE 施術和暦ＷＲ  TO  連長文－施術和暦.
027692     MOVE 施術年ＷＲ    TO  連長文－施術年.
027693     MOVE 施術月ＷＲ    TO  連長文－施術月.
027694     MOVE 患者番号ＷＲ  TO  連長文－患者番号.
027695     MOVE 枝番ＷＲ      TO  連長文－枝番.
027696** 日接用は56桁
027697     MOVE 56            TO  連長文－文桁数.
027698*
027699     CALL   "CHOUBUN".
027700     CANCEL "CHOUBUN".
027701*
027702*================================================================*
027703 助成レセまとめ判定 SECTION.
027704*---------------------------------------------------------------------------*
027705* 市町村マスタを読み、レセまとめ区分＝１でかつ、本体保険が国保・退職
027706* の時は、フラグYES (金額を助成込みで印字）
027707*（例：横浜市の障害は、本体保険（国保系）のレセプト１枚で請求、助成レセはなし）
027708*---------------------------------------------------------------------------*
027709*
027710     MOVE SPACE TO 助成レセまとめフラグ.
027711*
027712*     MOVE 受－助成種別           TO 市－公費種別.
027713*     MOVE 受－費用負担者番号助成 TO 市－市町村番号.
027714*     READ 市町村マスタ
027715*     NOT INVALID KEY
027716*         IF 市－レセまとめ区分 = 1 
027717*            IF (( 受－保険種別 = 01 ) AND ( 受－保険者番号(3:1) NOT = "3" )) OR
027718*               ( 受－保険種別 = 08 ) 
027719*                MOVE "YES" TO 助成レセまとめフラグ
027720*            END-IF
027721*         END-IF
027722*     END-READ.
027723*
027724** / CALL JRECEOFF /
027725*     IF 助成レセまとめフラグ = SPACE
027726*        INITIALIZE 連レセまとめ－キー
027727*        MOVE 受－施術和暦 TO 連レセまとめ－施術和暦
027728*        MOVE 受－施術年   TO 連レセまとめ－施術年
027729*        MOVE 受－施術月   TO 連レセまとめ－施術月
027730*        MOVE 受－患者番号 TO 連レセまとめ－患者番号
027731*        MOVE 受－枝番     TO 連レセまとめ－枝番
027732*       1:助成レセプトなしの本体まとめの判定
027733*        MOVE 1            TO 連レセまとめ－判定区分
027734*        CALL   "JRECEOFF"
027735*        CANCEL "JRECEOFF"
027736*
027737*        IF 連レセまとめ－判定結果 = 1
027738*           MOVE "YES" TO 助成レセまとめフラグ
027739*        END-IF
027740*     END-IF.
           IF ( レセ－本体まとめ区分 = 1 )
037165           MOVE "YES" TO 助成レセまとめフラグ
037167     END-IF.
027741*
027742*================================================================*
       会計データＦ集計 SECTION.
      *
           MOVE ZERO         TO 作１－一部負担金.
007680     MOVE 受－施術和暦 TO 会－施術和暦.
007690     MOVE 受－施術年   TO 会－施術年.
007700     MOVE 受－施術月   TO 会－施術月.
007710     MOVE ZERO         TO 会－施術日.
007720     MOVE 受－患者番号 TO 会－患者番号.
007730     MOVE 受－枝番     TO 会－枝番.
004460     START 会計データＦ     KEY IS >= 会－患者コード
004470                                      会－施術和暦年月日
004480     END-START.
004490     IF 状態キー = "00"
004491         MOVE SPACE TO 終了フラグ４
004500         PERFORM 会計データＦ読込
004510         PERFORM VARYING カウンタ FROM 1 BY 1
004520                 UNTIL ( 会－患者番号     NOT = 受－患者番号    ) OR
004530                       ( 会－枝番         NOT = 受－枝番        ) OR
004540                       ( 会－施術和暦年月 NOT = 受－施術和暦年月) OR
004550                       ( 終了フラグ４         = "YES" )
                   COMPUTE 作１－一部負担金 = 会－一部負担金 + 作１－一部負担金
004500             PERFORM 会計データＦ読込
               END-PERFORM
007930*
007770     END-IF.
      *
027743*================================================================*
003830 会計データＦ読込 SECTION.
003840*
003850     READ 会計データＦ NEXT
003860     AT END
003870         MOVE "YES"  TO 終了フラグ４
003880     END-READ.
003890*================================================================*
027744******************************************************************
027745 END PROGRAM YJB101.
027746******************************************************************
