000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YJB102.
000060 AUTHOR.                 池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【FPD書込】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100* 請求年月Ver.
000110*      MED = YJB100G 
      * 画面をＵＳＢ作成と一緒にした
      */金属副子、運動後療、明細書発行を変更追加/220810
000120*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2010-04-08
000130 DATE-COMPILED.          2010-04-08
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000330     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS  制－制御区分
000370                             FILE STATUS              IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000270     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000280                             ORGANIZATION             IS  SEQUENTIAL
000290                             ACCESS                   IS  SEQUENTIAL
000300                             FILE        STATUS       IS  状態キー
000310                             LOCK        MODE         IS  AUTOMATIC.
000390*
000400*     SELECT 会提出ファイル   ASSIGN      TO       "A:\JBFDV2.dat"
001270     SELECT 会提出ファイル ASSIGN    TO    FD-NAME
000410                             ORGANIZATION             IS  LINE SEQUENTIAL
000420                             ACCESS MODE              IS  SEQUENTIAL
000430                             FILE STATUS              IS  状態キー
000440                             LOCK      MODE           IS  AUTOMATIC.
000450******************************************************************
000460*                      DATA DIVISION                             *
000470******************************************************************
000480 DATA                    DIVISION.
000490 FILE                    SECTION.
000500*
001400*                           ［ＲＬ＝  ２５６］
001410 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001420     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000511*
000501 FD  作業ファイル１ RECORD  CONTAINS 896 CHARACTERS.
000502 01  作１－レコード.
000503*   / ヘッダ部は使用しない /
000504     03  作１－レコードヘッダ.
000505         05  作１－請求和暦年月キー.
000506             07  作１－請求和暦            PIC 9.
000507             07  作１－請求年              PIC 9(2).
000508             07  作１－請求月              PIC 9(2).
000509         05  作１－施術和暦年月キー.
000510             07  作１－施術和暦            PIC 9.
000511             07  作１－施術年              PIC 9(2).
000512             07  作１－施術月              PIC 9(2).
000513         05  作１－保険区分キー            PIC 9.
000514         05  作１－保険者番号キー          PIC 9(8).
000515         05  作１－本人家族区分キー        PIC 9.
000516         05  作１－被保険者カナキー        PIC X(20).
000517         05  作１－患者コードキー.
000518             07 作１－患者番号             PIC 9(6).
000519             07 作１－枝番                 PIC X(1).
000520     03  作１－レコードデータ.
000521         05  作１－会員番号                PIC 9(4).
000522         05  作１－定額制受理番号区分      PIC 9.
000523         05  作１－請求年月                PIC 9(6).
000524         05  作１－レセプト番号            PIC 9(4).
000525         05  作１－施術年月                PIC 9(6).
000526         05  作１－該当保険種別            PIC 9.
000527         05  作１－保険者番号              PIC 9(8).
000528         05  作１－記号                    PIC X(20).
000529         05  作１－番号                    PIC X(16).
000530         05  作１－老人市町村番号          PIC 9(8).
000531         05  作１－老人受給者番号          PIC 9(8).
000532         05  作１－助成負担者番号          PIC 9(8).
000533         05  作１－助成受給者番号          PIC X(16).
000534         05  作１－被保険者氏名            PIC N(10).
000535         05  作１－被保険者カナ            PIC X(16).
000536         05  作１－患者氏名                PIC N(10).
000537         05  作１－患者カナ                PIC X(16).
000538         05  作１－本人家族区分            PIC 9.
000539         05  作１－患者性別                PIC 9.
000540         05  作１－患者生年月日            PIC 9(8).
000541         05  作１－被保険者住所            PIC X(28).
000542         05  作１－合計金額                PIC 9(6).
000543         05  作１－助成用保険給付割合      PIC 9(2).
000544         05  作１－一部負担金              PIC 9(6).
000545         05  作１－請求金額                PIC 9(6).
000546         05  作１－部位数                  PIC 9.
000547         05  作１－負傷原因                PIC N(10).
000548         05  作１－長期理由                PIC N(16).
000549         05  作１－新規区分                PIC 9.
000550         05  作１－継続区分                PIC 9.
000551         05  作１－初検回数                PIC 9.
000552         05  作１－初検時間外加算回数      PIC 9.
000553         05  作１－初検休日加算回数        PIC 9.
000554         05  作１－初検深夜加算回数        PIC 9.
000555         05  作１－再検回数                PIC 9.
000556         05  作１－往療距離                PIC 9(3).
000557         05  作１－往療回数                PIC 9(2).
000558         05  作１－夜間加算往療回数        PIC 9.
000559         05  作１－難路加算往療回数        PIC 9(2).
000560         05  作１－暴風雨雪加算往療回数    PIC 9(2).
002110         05  作１－金属副子回数            PIC 9.
002120         05  作１－ダミー                  PIC X.
002130         05  作１－運動後療回数            PIC 9.
000564         05  作１－情報提供料回数          PIC 9.
000565*
000566         05  作１－負傷部位データ  OCCURS 6.
000567             07  作１－負傷区分            PIC 9.
000568             07  作１－負傷名              PIC N(16).
000569             07  作１－初回処置回数        PIC 9.
000570             07  作１－負傷年月日          PIC 9(8).
000571             07  作１－初検年月日          PIC 9(8).
000572             07  作１－施術開始年月日      PIC 9(8).
000573             07  作１－施術終了年月日      PIC 9(8).
000574             07  作１－実日数              PIC 9(2).
000575             07  作１－転帰区分            PIC 9.
000576             07  作１－後療回数            PIC 9(2).
000577             07  作１－冷罨法回数          PIC 9.
000578             07  作１－温罨法回数          PIC 9(2).
000579             07  作１－電療回数            PIC 9(2).
000580             07  作１－多部位逓減区分      PIC 9.
000581             07  作１－長期逓減区分        PIC 9.
      */追加110125
               05  作１－業者区分                PIC 9(2).
               05  作１－相談支援回数            PIC 9.
               05  作１－施術日                  PIC X(31).
      */追加220609
               05  作１－明細発行加算回数        PIC 9(1).
               05  作１－明細発行体制料          PIC 9(3).
               05  作１－明細書発行月日          PIC 9(4).
002320         05  FILLER                        PIC X(29).
000583*
001320*
001330 FD  会提出ファイル RECORD  CONTAINS 830 CHARACTERS.
001340 01  会提－レコード.
001350     03  会提－レコードデータ.
001360         05  会提－会員番号                PIC 9(4).
001370         05  会提－定額制受理番号区分      PIC 9.
001380         05  会提－請求年月                PIC 9(6).
001390         05  会提－レセプト番号            PIC 9(4).
001400         05  会提－施術年月                PIC 9(6).
001410         05  会提－該当保険種別            PIC 9.
001420         05  会提－保険者番号              PIC 9(8).
001430         05  会提－記号                    PIC X(20).
001440         05  会提－番号                    PIC X(16).
001450         05  会提－老人市町村番号          PIC 9(8).
001460         05  会提－老人受給者番号          PIC 9(8).
001470         05  会提－助成負担者番号          PIC 9(8).
001480         05  会提－助成受給者番号          PIC X(16).
001490         05  会提－被保険者氏名            PIC N(10).
001500         05  会提－被保険者カナ            PIC X(16).
001510         05  会提－患者氏名                PIC N(10).
001520         05  会提－患者カナ                PIC X(16).
001530         05  会提－本人家族区分            PIC 9.
001540         05  会提－患者性別                PIC 9.
001550         05  会提－患者生年月日            PIC 9(8).
001560         05  会提－被保険者住所            PIC X(28).
001570         05  会提－合計金額                PIC 9(6).
001580         05  会提－助成用保険給付割合      PIC 9(2).
001590         05  会提－一部負担金              PIC 9(6).
001600         05  会提－請求金額                PIC 9(6).
001610         05  会提－部位数                  PIC 9.
001620         05  会提－負傷原因                PIC N(10).
001630         05  会提－長期理由                PIC N(16).
001640         05  会提－新規区分                PIC 9.
001650         05  会提－継続区分                PIC 9.
001660         05  会提－初検回数                PIC 9.
001670         05  会提－初検時間外加算回数      PIC 9.
001680         05  会提－初検休日加算回数        PIC 9.
001690         05  会提－初検深夜加算回数        PIC 9.
001700         05  会提－再検回数                PIC 9.
001710         05  会提－往療距離                PIC 9(3).
001720         05  会提－往療回数                PIC 9(2).
001730         05  会提－夜間加算往療回数        PIC 9.
001740         05  会提－難路加算往療回数        PIC 9(2).
001750         05  会提－暴風雨雪加算往療回数    PIC 9(2).
002110         05  会提－金属副子回数            PIC 9.
002120         05  会提－ダミー                  PIC X.
002130         05  会提－運動後療回数            PIC 9.
001790         05  会提－情報提供料回数          PIC 9.
001800*
001810         05  会提－負傷部位データ  OCCURS 6.
001820             07  会提－負傷区分            PIC 9.
001830             07  会提－負傷名              PIC N(16).
001840             07  会提－初回処置回数        PIC 9.
001850             07  会提－負傷年月日          PIC 9(8).
001860             07  会提－初検年月日          PIC 9(8).
001870             07  会提－施術開始年月日      PIC 9(8).
001880             07  会提－施術終了年月日      PIC 9(8).
001890             07  会提－実日数              PIC 9(2).
001900             07  会提－転帰区分            PIC 9.
001910             07  会提－後療回数            PIC 9(2).
001920             07  会提－冷罨法回数          PIC 9.
001930             07  会提－温罨法回数          PIC 9(2).
001940             07  会提－電療回数            PIC 9(2).
001950             07  会提－多部位逓減区分      PIC 9.
001960             07  会提－長期逓減区分        PIC 9.
      */追加110125
               05  会提－業者区分                PIC 9(2).
               05  会提－相談支援回数            PIC 9.
               05  会提－施術日                  PIC X(31).
      */追加220609
               05  会提－明細発行加算回数        PIC 9(1).
               05  会提－明細発行体制料          PIC 9(3).
               05  会提－明細書発行月日          PIC 9(4).
001970         05  FILLER                        PIC X(10).
001980*
001990*----------------------------------------------------------------*
002000******************************************************************
002010*                WORKING-STORAGE SECTION                         *
002020******************************************************************
002030 WORKING-STORAGE         SECTION.
002040 01 キー入力                           PIC X    VALUE SPACE.
002050 01 状態キー                           PIC X(2) VALUE SPACE.
002060 01 終了フラグ                         PIC X(3) VALUE SPACE.
002070 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002080 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002090 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002100 01 ファイル名                         PIC N(8) VALUE SPACE.
002110 01 カウンタ                           PIC 9(1) VALUE ZERO.
002111 01 連番Ｗ                             PIC 9(4) VALUE ZERO.
002120**
002130** エラーメッセージ用
002140 01 エラーメッセージＷ.
002150    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002160    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002170    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002180    03 FILLER                          PIC X(10) VALUE SPACE.
002181*
002250* フロッピーパス用
002251 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002252 01 FD-NAME                            PIC X(30) VALUE SPACE.
002190******************************************************************
002200*                          連結項目                              *
002210******************************************************************
      *
       01 連入－画面情報ＹＪＢ１００ IS EXTERNAL.
          03 連入－ドライブ                  PIC X(1).
      *
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
002220*
002230********************
002240* メッセージ表示キー *
002250********************
002260 01 連メ－キー IS EXTERNAL.
002270    03  連メ－メッセージ               PIC N(20).
004090*
004091 01 連メ７－キー IS EXTERNAL.
004092    03  連メ７－メッセージ１               PIC X(40).
004102    03  連メ７－メッセージ２               PIC X(40).
002320*
002330******************************************************************
002340*                      PROCEDURE  DIVISION                       *
002350******************************************************************
002360 PROCEDURE               DIVISION.
002370************
002380*           *
002390* 初期処理   *
002400*           *
002410************
002420     PERFORM 初期化.
002430************
002440*           *
002450* 主処理     *
002460*           *
002470************
002480     PERFORM 提出ファイル作成.
002490************
002500*           *
002510* 終了処理   *
002520*           *
002530************
002540     PERFORM 終了処理.
002550     MOVE ZERO TO PROGRAM-STATUS.
002560     EXIT PROGRAM.
002570*
002580*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002590*================================================================*
002600 初期化 SECTION.
002610*
002620     PERFORM ファイルオープン.
002630*
002640*================================================================*
002650 ファイルオープン SECTION.
002660*
011000*     OPEN INPUT 制御情報マスタ.
011010*         MOVE NC"制御情報マスタ" TO ファイル名.
011020*         PERFORM オープンチェック.
003321*     MOVE ZERO TO 制－制御区分.
003322*     READ 制御情報マスタ
003323*     NOT INVALID KEY
003324*         MOVE 制－定期修正ＦＤ TO 定期修正ＦＤＷ
003325*     END-READ.
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\JBFDV3.dat" TO FD-NAME
           ELSE
003324        MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003326        IF 定期修正ＦＤＷ = SPACE
003327           MOVE "A" TO 定期修正ＦＤＷ
003328        END-IF
003330        STRING 定期修正ＦＤＷ DELIMITED BY SIZE
                    ":\JBFDV3.dat"  DELIMITED BY SIZE
003334              INTO FD-NAME
003335        END-STRING
           END-IF.
      *
002670     OPEN OUTPUT 会提出ファイル.
002680     IF 状態キー  NOT =  "00"
002690         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
               MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
002700         CALL   "MSG007"
002710         CANCEL "MSG007"
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM
002770     END-IF.
002780*
002790     OPEN INPUT 作業ファイル１.
002800         MOVE NC"作１" TO ファイル名.
002810         PERFORM オープンチェック.
002820*================================================================*
002830 オープンチェック SECTION.
002840*
002850     IF 状態キー  NOT =  "00"
002860         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002870         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002880         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002890                                                 UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
002900         ACCEPT  キー入力 FROM CONS
002910         PERFORM ファイル閉鎖
002920         MOVE 99 TO PROGRAM-STATUS
002930         EXIT PROGRAM.
002940*================================================================*
002950 ファイル閉鎖 SECTION.
002960*
002970     CLOSE  会提出ファイル 作業ファイル１.
      *            制御情報マスタ.
002980*================================================================*
002990 終了処理 SECTION.
003000*
003010     PERFORM ファイル閉鎖.
003020*================================================================*
003030 エラー表示 SECTION.
003040*
003050     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003060     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003070     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003080     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
003090     ACCEPT  キー入力 FROM CONS.
003100     PERFORM ファイル閉鎖.
003110     MOVE 99 TO PROGRAM-STATUS.
003120     EXIT PROGRAM.
003130*================================================================*
003140 提出ファイル作成 SECTION.
003150*
003160     MOVE SPACE   TO 終了フラグ.
003170     PERFORM 作業ファイル１読込.
003180     IF  終了フラグ = "YES"
003190         MOVE  NC"　データが０件です。確認して下さい。" TO 連メ－メッセージ
003200         CALL   "MSG001"
003210         CANCEL "MSG001"
003220         PERFORM ファイル閉鎖
003230         MOVE 99 TO PROGRAM-STATUS
003240         EXIT PROGRAM
003250     END-IF.
003260*
003270     PERFORM UNTIL 終了フラグ = "YES"
003280              PERFORM レコードセット
003290              PERFORM ファイル書込
003300         PERFORM 作業ファイル１読込
003310     END-PERFORM.
003320*
003330*================================================================*
003340 レコードセット SECTION.
003350*
003360     MOVE SPACE TO 会提－レコード.
003370     INITIALIZE    会提－レコード.
003380*
003381* レセプト番号(連番)
003382     COMPUTE 連番Ｗ =  連番Ｗ  + 1.
003383     MOVE 連番Ｗ  TO 会提－レセプト番号.
003384*
003390     MOVE 作１－会員番号             TO 会提－会員番号            .
003400     MOVE 作１－定額制受理番号区分   TO 会提－定額制受理番号区分  .
003410     MOVE 作１－請求年月             TO 会提－請求年月            .
003430     MOVE 作１－施術年月             TO 会提－施術年月            .
003440     MOVE 作１－該当保険種別         TO 会提－該当保険種別        .
003450     MOVE 作１－保険者番号           TO 会提－保険者番号          .
003460     MOVE 作１－記号                 TO 会提－記号                .
003470     MOVE 作１－番号                 TO 会提－番号                .
003480     MOVE 作１－老人市町村番号       TO 会提－老人市町村番号      .
003490     MOVE 作１－老人受給者番号       TO 会提－老人受給者番号      .
003500     MOVE 作１－助成負担者番号       TO 会提－助成負担者番号      .
003510     MOVE 作１－助成受給者番号       TO 会提－助成受給者番号      .
003520     MOVE 作１－被保険者氏名         TO 会提－被保険者氏名        .
003530     MOVE 作１－被保険者カナ         TO 会提－被保険者カナ        .
003540     MOVE 作１－患者氏名             TO 会提－患者氏名            .
003550     MOVE 作１－患者カナ             TO 会提－患者カナ            .
003560     MOVE 作１－本人家族区分         TO 会提－本人家族区分        .
003570     MOVE 作１－患者性別             TO 会提－患者性別            .
003580     MOVE 作１－患者生年月日         TO 会提－患者生年月日        .
003590     MOVE 作１－被保険者住所         TO 会提－被保険者住所        .
003600     MOVE 作１－合計金額             TO 会提－合計金額            .
003610     MOVE 作１－助成用保険給付割合   TO 会提－助成用保険給付割合  .
003620     MOVE 作１－一部負担金           TO 会提－一部負担金          .
003630     MOVE 作１－請求金額             TO 会提－請求金額            .
003640     MOVE 作１－部位数               TO 会提－部位数              .
003650     MOVE 作１－負傷原因             TO 会提－負傷原因            .
003660     MOVE 作１－長期理由             TO 会提－長期理由            .
003670     MOVE 作１－新規区分             TO 会提－新規区分            .
003680     MOVE 作１－継続区分             TO 会提－継続区分            .
003690     MOVE 作１－初検回数             TO 会提－初検回数            .
003700     MOVE 作１－初検時間外加算回数   TO 会提－初検時間外加算回数  .
003710     MOVE 作１－初検休日加算回数     TO 会提－初検休日加算回数    .
003720     MOVE 作１－初検深夜加算回数     TO 会提－初検深夜加算回数    .
003730     MOVE 作１－再検回数             TO 会提－再検回数            .
003740     MOVE 作１－往療距離             TO 会提－往療距離            .
003750     MOVE 作１－往療回数             TO 会提－往療回数            .
003760     MOVE 作１－夜間加算往療回数     TO 会提－夜間加算往療回数    .
003770     MOVE 作１－難路加算往療回数     TO 会提－難路加算往療回数    .
003780     MOVE 作１－暴風雨雪加算往療回数 TO 会提－暴風雨雪加算往療回数.
003790     MOVE 作１－金属副子回数         TO 会提－金属副子回数      .
003800     MOVE 作１－運動後療回数         TO 会提－運動後療回数      .
003820     MOVE 作１－情報提供料回数       TO 会提－情報提供料回数      .
003830*
003840     PERFORM VARYING カウンタ FROM 1 BY 1
003850             UNTIL ( カウンタ > 6 )
003860         MOVE 作１－負傷区分(カウンタ)       TO 会提－負傷区分(カウンタ)       
003870         MOVE 作１－負傷名(カウンタ)         TO 会提－負傷名(カウンタ)         
003880         MOVE 作１－初回処置回数(カウンタ)   TO 会提－初回処置回数(カウンタ)   
003890         MOVE 作１－負傷年月日(カウンタ)     TO 会提－負傷年月日(カウンタ)     
003900         MOVE 作１－初検年月日(カウンタ)     TO 会提－初検年月日(カウンタ)     
003910         MOVE 作１－施術開始年月日(カウンタ) TO 会提－施術開始年月日(カウンタ) 
003920         MOVE 作１－施術終了年月日(カウンタ) TO 会提－施術終了年月日(カウンタ) 
003930         MOVE 作１－実日数(カウンタ)         TO 会提－実日数(カウンタ)         
003940         MOVE 作１－転帰区分(カウンタ)       TO 会提－転帰区分(カウンタ)       
003950         MOVE 作１－後療回数(カウンタ)       TO 会提－後療回数(カウンタ)       
003960         MOVE 作１－冷罨法回数(カウンタ)     TO 会提－冷罨法回数(カウンタ)     
003970         MOVE 作１－温罨法回数(カウンタ)     TO 会提－温罨法回数(カウンタ)     
003980         MOVE 作１－電療回数(カウンタ)       TO 会提－電療回数(カウンタ)       
003990         MOVE 作１－多部位逓減区分(カウンタ) TO 会提－多部位逓減区分(カウンタ) 
004000         MOVE 作１－長期逓減区分(カウンタ)   TO 会提－長期逓減区分(カウンタ)   
004010     END-PERFORM.
           MOVE 作１－業者区分             TO 会提－業者区分.
           MOVE 作１－相談支援回数         TO 会提－相談支援回数.
           MOVE 作１－施術日               TO 会提－施術日.
           MOVE 作１－明細発行加算回数     TO 会提－明細発行加算回数.
           MOVE 作１－明細発行体制料       TO 会提－明細発行体制料.
           MOVE 作１－明細書発行月日       TO 会提－明細書発行月日.
004020*
004030*================================================================*
004040 作業ファイル１読込 SECTION.
004050*
004060     READ 作業ファイル１ NEXT
004070     AT END
004080         MOVE "YES" TO 終了フラグ
004090     END-READ.
004100*
004110*================================================================*
004120 ファイル書込 SECTION.
004130*
004140     WRITE 会提－レコード.
004150     IF 状態キー  NOT =  "00"
004160         MOVE NC"会提出ファイル" TO ファイル名
004170         PERFORM エラー表示
004180     END-IF.
004190*================================================================*
004200******************************************************************
004210 END PROGRAM YJB102.
004220******************************************************************
