000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YCB102.
000060 AUTHOR.                 池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*      中部柔整師協会 会提出フロッピー作成【FPD書込】
000100* 請求年月Ver.
000110*      MED = YCB580 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2012-11-16
000140 DATE-COMPILED.          2012-11-16
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000330     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000340                             ORGANIZATION             IS  INDEXED
000350                             ACCESS MODE              IS  DYNAMIC
000360                             RECORD KEY               IS  制－制御区分
000370                             FILE STATUS              IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000270     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000280                             ORGANIZATION             IS  SEQUENTIAL
000290                             ACCESS                   IS  SEQUENTIAL
000300                             FILE        STATUS       IS  状態キー
000310                             LOCK        MODE         IS  AUTOMATIC.
000320     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1012L.DAT"
000330                             ORGANIZATION             IS  SEQUENTIAL
000340                             ACCESS                   IS  SEQUENTIAL
000350                             FILE        STATUS       IS  状態キー
000360                             LOCK        MODE         IS  AUTOMATIC.
000370     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1013L.DAT"
000380                             ORGANIZATION             IS  SEQUENTIAL
000390                             ACCESS                   IS  SEQUENTIAL
000400                             FILE        STATUS       IS  状態キー
000410                             LOCK        MODE         IS  AUTOMATIC.
000420*
000430*     SELECT レセプトファイル   ASSIGN      TO       "A:\AK2.dat"
000430     SELECT レセプトファイル   ASSIGN      TO     FD-NAME1
000440                             ORGANIZATION             IS  LINE SEQUENTIAL
000450                             ACCESS MODE              IS  SEQUENTIAL
000460                             FILE STATUS              IS  状態キー
000470                             LOCK      MODE           IS  AUTOMATIC.
000480*     SELECT 保険者ファイル   ASSIGN      TO       "A:\JAHO.dat"
000480     SELECT 保険者ファイル   ASSIGN      TO       FD-NAME2
000490                             ORGANIZATION             IS  LINE SEQUENTIAL
000500                             ACCESS MODE              IS  SEQUENTIAL
000510                             FILE STATUS              IS  状態キー
000520                             LOCK      MODE           IS  AUTOMATIC.
000530*     SELECT 市町村ファイル   ASSIGN      TO       "A:\JAJO.dat"
000530     SELECT 市町村ファイル   ASSIGN      TO       FD-NAME3
000540                             ORGANIZATION             IS  LINE SEQUENTIAL
000550                             ACCESS MODE              IS  SEQUENTIAL
000560                             FILE STATUS              IS  状態キー
000570                             LOCK      MODE           IS  AUTOMATIC.
000580******************************************************************
000590*                      DATA DIVISION                             *
000600******************************************************************
000610 DATA                    DIVISION.
000620 FILE                    SECTION.
001400*                           ［ＲＬ＝  ２５６］
001410 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001420     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000630*
000640 FD  作業ファイル１ RECORD  CONTAINS 768 CHARACTERS.
000650 01  作１－レコード.
000660*   / ヘッダ部は使用しない /
000670     03  作１－レコードヘッダ.
000680         05  作１－請求和暦年月キー.
000690             07  作１－請求和暦キー        PIC 9.
000700             07  作１－請求年キー          PIC 9(2).
000710             07  作１－請求月キー          PIC 9(2).
000720         05  作１－保険区分キー            PIC 9.
000730         05  作１－保険者番号キー          PIC 9(8).
000740         05  作１－本人家族区分キー        PIC 9.
000750         05  作１－被保険者カナキー        PIC X(20).
000760         05  作１－患者コードキー.
000770             07 作１－患者番号キー         PIC 9(6).
000780             07 作１－枝番                 PIC X(1).
000790         05  作１－施術和暦年月キー.
000800             07  作１－施術和暦キー        PIC 9.
000810             07  作１－施術年キー          PIC 9(2).
000820             07  作１－施術月キー          PIC 9(2).
000830     03  作１－レコードデータ.
000840         05  作１－会員番号                PIC 9(4).
000850         05  作１－請求年月.
000860             07  作１－請求年              PIC X(4).
000870             07  作１－請求区切１          PIC X(1).
000880             07  作１－請求月              PIC X(2).
000890             07  作１－請求区切２          PIC X(1).
000900             07  作１－請求日              PIC X(2).
000910         05  作１－レセプト番号            PIC 9(4).
000920         05  作１－施術年月.
000930             07  作１－施術年              PIC X(4).
000940             07  作１－施術区切１          PIC X(1).
000950             07  作１－施術月              PIC X(2).
000960             07  作１－施術区切２          PIC X(1).
000970             07  作１－施術日              PIC X(2).
000980         05  作１－保険種別                PIC N(4).
000990         05  作１－保険者番号              PIC X(8).
001000         05  作１－記号                    PIC N(10).
001010         05  作１－番号                    PIC X(16).
001020         05  作１－老人市町村番号          PIC X(8).
001030         05  作１－老人受給者番号          PIC X(16).
001040         05  作１－助成負担者番号          PIC X(8).
001050         05  作１－助成受給者番号          PIC X(16).
001060         05  作１－被保険者氏名            PIC N(10).
001070         05  作１－被保険者カナ            PIC X(16).
001080         05  作１－患者氏名                PIC N(10).
001090         05  作１－患者カナ                PIC X(16).
001100*/仕様変更、仕様違い？半角英数に変更0304
001110*         05  作１－続柄                    PIC N(5).
001120         05  作１－続柄                    PIC X(1).
001130         05  作１－性別                    PIC X(1).
001140         05  作１－患者生年月日.
001150             07  作１－患者生年            PIC X(4).
001160             07  作１－患者生区切１        PIC X(1).
001170             07  作１－患者生月            PIC X(2).
001180             07  作１－患者生区切２        PIC X(1).
001190             07  作１－患者生日            PIC X(2).
001200         05  作１－患者住所                PIC N(14).
001210         05  作１－合計金額                PIC 9(6).
001220         05  作１－負担割合                PIC 9(2).
001230         05  作１－一部負担金              PIC 9(6).
001240         05  作１－請求金額                PIC 9(6).
001250         05  作１－部位数                  PIC 9.
001260         05  作１－負傷原因                PIC N(10).
001270         05  作１－長期理由                PIC N(16).
001280*
001290         05  作１－負傷部位データ  OCCURS 4.
001300             07  作１－負傷名              PIC N(16).
001310             07  作１－負傷年月日.
001320                 09  作１－負傷年          PIC X(4).
001330                 09  作１－負傷区切１      PIC X(1).
001340                 09  作１－負傷月          PIC X(2).
001350                 09  作１－負傷区切２      PIC X(1).
001360                 09  作１－負傷日          PIC X(2).
001370             07  作１－初検年月日.
001380                 09  作１－初検年          PIC X(4).
001390                 09  作１－初検区切１      PIC X(1).
001400                 09  作１－初検月          PIC X(2).
001410                 09  作１－初検区切２      PIC X(1).
001420                 09  作１－初検日          PIC X(2).
001430             07  作１－施術開始年月日.
001440                 09  作１－施術開始年      PIC X(4).
001450                 09  作１－施術開始区切１  PIC X(1).
001460                 09  作１－施術開始月      PIC X(2).
001470                 09  作１－施術開始区切２  PIC X(1).
001480                 09  作１－施術開始日      PIC X(2).
001490             07  作１－施術終了年月日.
001500                 09  作１－施術終了年      PIC X(4).
001510                 09  作１－施術終了区切１  PIC X(1).
001520                 09  作１－施術終了月      PIC X(2).
001530                 09  作１－施術終了区切２  PIC X(1).
001540                 09  作１－施術終了日      PIC X(2).
001550             07  作１－実日数              PIC 9(2).
001560             07  作１－転帰区分            PIC 9.
001570         05  作１－患者番号                PIC 9(6).
001580* 2007/10/24 追加仕様対応
001590         05  作１－年齢区分                PIC X.
001600         05  作１－助成種別                PIC X(3).
001610         05  作１－市区町村名              PIC N(20).
001620         05  作１－市区町村使用区分        PIC X.
001630         05  FILLER                        PIC X(30).
001640**
001650 FD  作業ファイル２ RECORD  CONTAINS 256 CHARACTERS.
001660 01  作２－レコード.
001670*   / ヘッダ部は使用しない /
001680     03  作２－レコードヘッダ.
001690         05  作２－保険区分キー            PIC 9.
001700         05  作２－保険者番号キー          PIC 9(8).
001710     03  作２－レコードデータ.
001720         05  作２－保険者番号              PIC X(8).
001730         05  作２－保険者名称              PIC N(30).
001740         05  作２－保険者宛名              PIC N(30).
001750         05  作２－郵便番号                PIC X(8).
001760         05  作２－保険者住所              PIC N(30).
001770         05  作２－保険種別                PIC N(4).
001780         05  作２－電話番号                PIC X(12).
001790         05  FILLER                        PIC X(31).
001800**
001810 FD  作業ファイル３ RECORD  CONTAINS 256 CHARACTERS.
001820 01  作３－レコード.
001830*   / ヘッダ部は使用しない /
001840     03  作３－レコードヘッダ.
001850         05  作３－保険区分キー            PIC 9.
001860         05  作３－市町村番号キー          PIC 9(8).
001870     03  作３－レコードデータ.
001880         05  作３－市町村番号              PIC X(8).
001890         05  作３－市町村名称              PIC N(30).
001900         05  作３－郵便番号                PIC X(8).
001910         05  作３－市町村住所              PIC N(30).
001920         05  作３－市町村宛名              PIC N(30).
001930         05  作３－電話番号                PIC X(12).
001940         05  FILLER                        PIC X(39).
001950*
001960 FD  レセプトファイル RECORD  CONTAINS 800 CHARACTERS.
001970*/日付以外のすべての英数字、日本語項目を"でくくるように仕様変更。0305
001980*/文字属性データは、""でくくる
001990
002000 01  レセ－レコード.
002010     03  レセ－レコードデータ.
002020         05  レセ－会員番号                PIC 9(4).
002030         05  コンマ１                      PIC X.
002040         05  レセ－請求年月                PIC X(12).
002050         05  コンマ２                      PIC X.
002060         05  レセ－レセプト番号            PIC 9(4).
002070         05  コンマ３                      PIC X.
002080         05  レセ－施術年月                PIC X(12).
002090         05  コンマ４                      PIC X.
002100         05  レセ－保険種別                PIC N(5).
002110         05  コンマ５                      PIC X.
002120         05  レセ－保険者番号              PIC X(10).
002130         05  コンマ６                      PIC X.
002140         05  レセ－記号                    PIC N(11).
002150         05  コンマ７                      PIC X.
002160         05  レセ－番号                    PIC X(18).
002170         05  コンマ８                      PIC X.
002180         05  レセ－老人市町村番号          PIC X(10).
002190         05  コンマ９                      PIC X.
002200         05  レセ－老人受給者番号          PIC X(18).
002210         05  コンマ１０                    PIC X.
002220         05  レセ－助成負担者番号          PIC X(10).
002230         05  コンマ１１                    PIC X.
002240         05  レセ－助成受給者番号          PIC X(18).
002250         05  コンマ１２                    PIC X.
002260         05  レセ－被保険者氏名            PIC N(13).
002270         05  コンマ１３                    PIC X.
002280         05  レセ－被保険者カナ            PIC X(18).
002290         05  コンマ１４                    PIC X.
002300         05  レセ－患者氏名                PIC N(11).
002310         05  コンマ１５                    PIC X.
002320         05  レセ－患者カナ                PIC X(18).
002330         05  コンマ１６                    PIC X.
002340*/仕様変更、仕様違い？半角英数に変更0304
002350*         05  レセ－続柄                    PIC N(5).
002360         05  レセ－続柄                    PIC X.
002370         05  コンマ１７                    PIC X.
002380         05  レセ－性別                    PIC X.
002390         05  コンマ１８                    PIC X.
002400         05  レセ－患者生年月日            PIC X(12).
002410         05  コンマ１９                    PIC X.
002420         05  レセ－患者住所                PIC N(15).
002430         05  コンマ２０                    PIC X.
002440         05  レセ－合計金額                PIC 9(6).
002450         05  コンマ２１                    PIC X.
002460         05  レセ－負担割合                PIC 9(2).
002470         05  コンマ２２                    PIC X.
002480         05  レセ－一部負担金              PIC 9(6).
002490         05  コンマ２３                    PIC X.
002500         05  レセ－請求金額                PIC 9(6).
002510         05  コンマ２４                    PIC X.
002520         05  レセ－部位数                  PIC 9.
002530         05  コンマ２５                    PIC X.
002540         05  レセ－負傷原因                PIC N(10).
002550         05  コンマ２６                    PIC X.
002560         05  レセ－長期理由                PIC N(16).
002570         05  コンマ２７                    PIC X.
002580*
002590         05  レセ－負傷部位データ  OCCURS 4.
002600             07  レセ－負傷名              PIC N(16).
002610             07  コンマ２８                PIC X.
002620             07  レセ－負傷年月日          PIC X(12).
002630             07  コンマ２９                PIC X.
002640             07  レセ－初検年月日          PIC X(12).
002650             07  コンマ３０                PIC X.
002660             07  レセ－施術開始年月日      PIC X(12).
002670             07  コンマ３１                PIC X.
002680             07  レセ－施術終了年月日      PIC X(12).
002690             07  コンマ３２                PIC X.
002700             07  レセ－実日数              PIC 9(2).
002710             07  コンマ３３                PIC X.
002720             07  レセ－転帰区分            PIC 9.
002730             07  コンマ３４                PIC X.
002740         05  レセ－ＲＥＣＥ                PIC 9(6).
002750         05  コンマ３５                    PIC X.
002760         05  レセ－患者番号                PIC 9(6).
002770         05  コンマ３６                    PIC X.
002780         05  レセ－年齢区分                PIC X.
002790         05  コンマ３７                    PIC X.
002800         05  レセ－助成種別                PIC X(3).
002810         05  コンマ３８                    PIC X.
002820         05  レセ－市区町村名              PIC N(21).
002830         05  コンマ３９                    PIC X.
002840         05  レセ－市区町村使用区分        PIC X.
002850*
002860 FD  保険者ファイル RECORD  CONTAINS 249 CHARACTERS.
002870 01  保険－レコード.
002880     03  保険－レコードデータ.
002890         05  保険－保険者番号              PIC X(10).
002900         05  保険－コンマ１                PIC X.
002910         05  保険－保険者名称              PIC N(31).
002920         05  保険－コンマ２                PIC X.
002930         05  保険－保険者宛名              PIC N(31).
002940         05  保険－コンマ３                PIC X.
002950         05  保険－郵便番号                PIC X(10).
002960         05  保険－コンマ４                PIC X.
002970         05  保険－保険者住所              PIC N(31).
002980         05  保険－コンマ５                PIC X.
002990         05  保険－保険種別                PIC N(5).
003000         05  保険－コンマ６                PIC X.
003010         05  保険－ダミー１                PIC X(3).
003020         05  保険－コンマ７                PIC X.
003030         05  保険－ダミー２                PIC X(3).
003040         05  保険－コンマ８                PIC X.
003050         05  保険－ダミー３                PIC X(3).
003060         05  保険－コンマ９                PIC X.
003070         05  保険－電話番号                PIC X(15).
003080*
003090 FD  市町村ファイル RECORD  CONTAINS 231 CHARACTERS.
003100 01  市町－レコード.
003110     03  市町－レコードデータ.
003120         05  市町－市町村番号              PIC X(10).
003130         05  市町－コンマ１                PIC X.
003140         05  市町－市町村名称              PIC N(31).
003150         05  市町－コンマ２                PIC X.
003160         05  市町－郵便番号                PIC X(10).
003170         05  市町－コンマ３                PIC X.
003180         05  市町－市町村住所              PIC N(31).
003190         05  市町－コンマ４                PIC X.
003200         05  市町－市町村宛名              PIC N(31).
003210         05  市町－コンマ５                PIC X.
003220         05  市町－ダミー１                PIC X(2).
003230         05  市町－コンマ６                PIC X.
003240         05  市町－電話番号                PIC X(14).
003250         05  市町－コンマ７                PIC X.
003260         05  市町－ダミー２                PIC X(2).
003270*
003280*----------------------------------------------------------------*
003290******************************************************************
003300*                WORKING-STORAGE SECTION                         *
003310******************************************************************
003320 WORKING-STORAGE         SECTION.
003330 01 キー入力                           PIC X    VALUE SPACE.
003340 01 状態キー                           PIC X(2) VALUE SPACE.
003350 01 終了フラグ                         PIC X(3) VALUE SPACE.
003360 01 終了フラグ２                       PIC X(3) VALUE SPACE.
003370 01 終了フラグ３                       PIC X(3) VALUE SPACE.
003380 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
003390 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
003400 01 ファイル名                         PIC N(8) VALUE SPACE.
003410 01 カウンタ                           PIC 9(1) VALUE ZERO.
003420 01 連番Ｗ                             PIC 9(4) VALUE ZERO.
003430**
003440** エラーメッセージ用
003450 01 エラーメッセージＷ.
003460    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
003470    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
003480    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
003490    03 FILLER                          PIC X(10) VALUE SPACE.
003500*
003510*/保険者番号を"で括る0304
003520 01 区切文字Ｒ                         PIC X(2) VALUE X"0022".
003530 01 区切文字Ｗ REDEFINES 区切文字Ｒ.
003540   03 区切文字Ｗ１                     PIC X(1).
003550   03 区切文字Ｗ２                     PIC X(1).
003560*
003570 01 英数字項目Ｗ.
003580   03 英数字項目ＸＷ                   PIC X(70) VALUE SPACE.
003590 01 日本語項目Ｗ.
003600   03 日本語項目ＮＷ                   PIC N(35) VALUE SPACE.
003610 01 英数字項目２Ｗ                     PIC X(70) VALUE SPACE.
003620*
003630 01 文字ＣＮＴ                         PIC 9(2) VALUE ZERO.
003640 01 終了フラグ４                       PIC X(3) VALUE SPACE.
002250* フロッピーパス用
002251 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002252 01 FD-NAME1                           PIC X(30) VALUE SPACE.
002252 01 FD-NAME2                           PIC X(30) VALUE SPACE.
002252 01 FD-NAME3                           PIC X(30) VALUE SPACE.
      */遅延処理
       01 遅延フラグ                         PIC X(3) VALUE SPACE.
       01 遅延カウンタ                       PIC 9(4) VALUE ZERO.
       01 遅延回数Ｗ                         PIC 9(4) VALUE ZERO.
003650******************************************************************
003660*                          連結項目                              *
003670******************************************************************
003680*
003690********************
003700* メッセージ表示キー *
003710********************
003720 01 連メ－キー IS EXTERNAL.
003730    03  連メ－メッセージ               PIC N(20).
003740*
003750 01 連メ３－キー IS EXTERNAL.
003760    03  連メ３－メッセージ             PIC N(20).
003770    03  連メ３－メッセージ１           PIC X(20).
004090*
004091 01 連メ７－キー IS EXTERNAL.
004092    03  連メ７－メッセージ１               PIC X(40).
004102    03  連メ７－メッセージ２               PIC X(40).
003780*
       01 連入－画面情報ＹＣＢ１００ IS EXTERNAL.
          03 連入－ドライブ                  PIC X(1).
      *
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
003780*
003790******************************************************************
003800*                      PROCEDURE  DIVISION                       *
003810******************************************************************
003820 PROCEDURE               DIVISION.
003830************
003840*           *
003850* 初期処理   *
003860*           *
003870************
003880     PERFORM 初期化.
003890************
003900*           *
003910* 主処理     *
003920*           *
003930************
003940     PERFORM レセプトファイル作成.
003950     PERFORM 保険者ファイル作成.
003960     PERFORM 市町村ファイル作成.
003970************
003980*           *
003990* 終了処理   *
004000*           *
004010************
004020     PERFORM 終了処理.
004030     MOVE ZERO TO PROGRAM-STATUS.
004040     EXIT PROGRAM.
004050*
004060*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004070*================================================================*
004080 初期化 SECTION.
004090*
004100     PERFORM ファイルオープン.
004110*
004120*================================================================*
004130 ファイルオープン SECTION.
004140*
011000*     OPEN INPUT 制御情報マスタ.
011010*         MOVE NC"制御情報マスタ" TO ファイル名.
011020*         PERFORM オープンチェック.
003321*     MOVE ZERO TO 制－制御区分.
003322*     READ 制御情報マスタ
003323*     NOT INVALID KEY
003324*         MOVE 制－定期修正ＦＤ TO 定期修正ＦＤＷ
      *         MOVE 制－遅延回数     TO 遅延回数Ｗ
003325*     END-READ.
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\AK2.dat"  TO FD-NAME1
002890        MOVE "C:\makishisys\JAHO.dat" TO FD-NAME2
002890        MOVE "C:\makishisys\JAJO.dat" TO FD-NAME3
           ELSE
003324        MOVE 連入－ドライブ TO 定期修正ＦＤＷ
003326        IF 定期修正ＦＤＷ = SPACE
003327           MOVE "A" TO 定期修正ＦＤＷ
003328        END-IF
003330        STRING 定期修正ＦＤＷ DELIMITED BY SIZE
                     ":\AK2.dat"    DELIMITED BY SIZE
003334              INTO FD-NAME1
003335        END-STRING
003330        STRING 定期修正ＦＤＷ DELIMITED BY SIZE
                     ":\JAHO.dat"   DELIMITED BY SIZE
003334              INTO FD-NAME2
003335        END-STRING
003330        STRING 定期修正ＦＤＷ DELIMITED BY SIZE
                     ":\JAJO.dat"   DELIMITED BY SIZE
003334              INTO FD-NAME3
003335        END-STRING
           END-IF.
      *
004141     OPEN INPUT 作業ファイル１.
004142         MOVE NC"作１" TO ファイル名.
004143         PERFORM オープンチェック.
004144
004145     MOVE SPACE   TO 終了フラグ.
004146     PERFORM 作業ファイル１読込.
004147     IF  終了フラグ = "YES"
004148         MOVE  NC"　データが０件です。確認して下さい。" TO 連メ－メッセージ
004149         CALL   "MSG001"
004150         CANCEL "MSG001"
004151         PERFORM ファイル閉鎖
004152         MOVE 99 TO PROGRAM-STATUS
004153         EXIT PROGRAM
004154     END-IF.
004156
004157     OPEN INPUT 作業ファイル２.
004158         MOVE NC"作２" TO ファイル名.
004159         PERFORM オープンチェック.
004160
004161     MOVE SPACE   TO 終了フラグ２.
004162     PERFORM 作業ファイル２読込.
004163     IF  終了フラグ２ = "YES"
004164         MOVE  NC"　データが０件です。確認して下さい。" TO 連メ－メッセージ
004165         CALL   "MSG001"
004166         CANCEL "MSG001"
004167         PERFORM ファイル閉鎖
004168         MOVE 99 TO PROGRAM-STATUS
004169         EXIT PROGRAM
004170     END-IF.
004171
004172     OPEN OUTPUT 作業ファイル３.
004172     CLOSE 作業ファイル３.
004172     OPEN INPUT 作業ファイル３.
004173         MOVE NC"作３" TO ファイル名.
004174         PERFORM オープンチェック.
004175
004176     OPEN OUTPUT レセプトファイル.
002680     IF 状態キー  NOT =  "00"
002690         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
               MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
002700         CALL   "MSG007"
002710         CANCEL "MSG007"
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM
003348     END-IF.
004260     OPEN OUTPUT 保険者ファイル.
004270         MOVE NC"保険者ファイル" TO ファイル名.
004280         PERFORM オープンチェック.
004290     OPEN OUTPUT 市町村ファイル.
004300         MOVE NC"市町村ファイル" TO ファイル名.
004310         PERFORM オープンチェック.
004320*
004420*================================================================*
004430 オープンチェック SECTION.
004440*
004450     IF 状態キー  NOT =  "00"
004460         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004470         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004480         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004490                                                 UPON CONS
004380*-----------------------------------------*
004390         CALL "actcshm"  WITH C LINKAGE
004400*-----------------------------------------*
004500         ACCEPT  キー入力 FROM CONS
004510         PERFORM ファイル閉鎖
004520         MOVE 99 TO PROGRAM-STATUS
004530         EXIT PROGRAM.
004540*================================================================*
004550 ファイル閉鎖 SECTION.
004560*
004570     CLOSE  レセプトファイル 保険者ファイル 市町村ファイル
004580            作業ファイル１   作業ファイル２ 作業ファイル３ 制御情報マスタ.
004590*================================================================*
004600 終了処理 SECTION.
004610*
004620     PERFORM ファイル閉鎖.
004630*================================================================*
004640 エラー表示 SECTION.
004650*
004660     DISPLAY NC"状態キー" 状態キー  UPON CONS.
004670     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
004680     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
004690     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
004380*-----------------------------------------*
004390     CALL "actcshm"  WITH C LINKAGE.
004400*-----------------------------------------*
004700     ACCEPT  キー入力 FROM CONS.
004710     PERFORM ファイル閉鎖.
004720     MOVE 99 TO PROGRAM-STATUS.
004730     EXIT PROGRAM.
004740*================================================================*
004750 レセプトファイル作成 SECTION.
004760*
004870*
004880     PERFORM UNTIL 終了フラグ = "YES"
004890              PERFORM レコードセット
      */読込不良多発の為追加/090416
                    PERFORM 遅延処理
004900              PERFORM ファイル書込
004910         PERFORM 作業ファイル１読込
004920     END-PERFORM.
004930*
004940*================================================================*
004950 保険者ファイル作成 SECTION.
004960*
005070*
005080     PERFORM UNTIL 終了フラグ２ = "YES"
005090              PERFORM レコードセット保険者
005100              PERFORM ファイル書込保険者
005110         PERFORM 作業ファイル２読込
005120     END-PERFORM.
005130*
005140*================================================================*
005150 市町村ファイル作成 SECTION.
005160*
005170     MOVE SPACE   TO 終了フラグ３.
005180     PERFORM 作業ファイル３読込.
005190*
005200     PERFORM UNTIL 終了フラグ３ = "YES"
005210              PERFORM レコードセット市町村
005220              PERFORM ファイル書込市町村
005230         PERFORM 作業ファイル３読込
005240     END-PERFORM.
005250*
005260*================================================================*
005270 レコードセット SECTION.
005280*
005290*仕様変更*日付以外のすべての英数字、日本語項目を"でくくる。0305
005300* 文字属性データは、""で括るようにする 07/10
005310     MOVE SPACE TO レセ－レコード.
005320     INITIALIZE    レセ－レコード.
005330*
005340* レセプト番号(連番)
005350*     COMPUTE 連番Ｗ =  連番Ｗ  + 1.
005360*     MOVE 連番Ｗ  TO レセ－レセプト番号.
005370     MOVE ZERO TO レセ－レセプト番号.
005380*
005390     MOVE 作１－会員番号             TO レセ－会員番号.
005400
005410*     MOVE 作１－請求年月             TO レセ－請求年月.
005420     MOVE 作１－請求年月             TO 英数字項目Ｗ.
005430     PERFORM 変換処理英数字.
005440     MOVE 英数字項目２Ｗ             TO レセ－請求年月.
005450
005460*     MOVE 作１－施術年月             TO レセ－施術年月.
005470     MOVE 作１－施術年月             TO 英数字項目Ｗ.
005480     PERFORM 変換処理英数字.
005490     MOVE 英数字項目２Ｗ             TO レセ－施術年月.
005500
005510*     MOVE 作１－保険種別            TO レセ－保険種別.
005520     MOVE 作１－保険種別             TO 英数字項目Ｗ.
005530     PERFORM 変換処理日本語.
005540     MOVE 日本語項目ＮＷ             TO レセ－保険種別.
005550*
005560*     MOVE 作１－保険者番号          TO レセ－保険者番号.
005570     MOVE 作１－保険者番号           TO 英数字項目Ｗ.
005580     PERFORM 変換処理英数字.
005590     MOVE 英数字項目２Ｗ             TO レセ－保険者番号.
005600*
005610*     MOVE 作１－記号                TO レセ－記号.
005620     MOVE 作１－記号                 TO 英数字項目Ｗ.
005630     PERFORM 変換処理日本語.
005640     MOVE 日本語項目ＮＷ             TO レセ－記号.
005650*
005660*     MOVE 作１－番号                TO レセ－番号.
005670     MOVE 作１－番号                 TO 英数字項目Ｗ.
005680     PERFORM 変換処理英数字.
005690     MOVE 英数字項目２Ｗ             TO レセ－番号.
005700*
005710     MOVE 作１－老人市町村番号      TO レセ－老人市町村番号.
005720*     MOVE 作１－老人市町村番号       TO 英数字項目Ｗ.
005730*     PERFORM 変換処理英数字.
005740*     MOVE 英数字項目２Ｗ             TO レセ－老人市町村番号.
005750*
005760*    MOVE 作１－老人受給者番号       TO レセ－老人受給者番号.
005770     MOVE 作１－老人受給者番号       TO 英数字項目Ｗ.
005780     PERFORM 変換処理英数字.
005790     MOVE 英数字項目２Ｗ             TO レセ－老人受給者番号.
005800*
005810*    MOVE 作１－助成負担者番号       TO レセ－助成負担者番号.
005820     MOVE 作１－助成負担者番号       TO 英数字項目Ｗ.
005830     PERFORM 変換処理英数字.
005840     MOVE 英数字項目２Ｗ             TO レセ－助成負担者番号.
005850*
005860*    MOVE 作１－助成受給者番号       TO レセ－助成受給者番号.
005870     MOVE 作１－助成受給者番号       TO 英数字項目Ｗ.
005880     PERFORM 変換処理英数字.
005890     MOVE 英数字項目２Ｗ             TO レセ－助成受給者番号.
005900*
005910*     MOVE 作１－被保険者氏名        TO レセ－被保険者氏名.
005920     MOVE 作１－被保険者氏名         TO 英数字項目Ｗ.
005930     PERFORM 変換処理日本語.
005940     MOVE 日本語項目ＮＷ             TO レセ－被保険者氏名.
005950*
005960*     MOVE 作１－被保険者カナ        TO レセ－被保険者カナ.
005970     MOVE 作１－被保険者カナ         TO 英数字項目Ｗ.
005980     PERFORM 変換処理英数字.
005990     MOVE 英数字項目２Ｗ             TO レセ－被保険者カナ.
006000*
006010*     MOVE 作１－患者氏名            TO レセ－患者氏名.
006020     MOVE 作１－患者氏名             TO 英数字項目Ｗ.
006030     PERFORM 変換処理日本語.
006040     MOVE 日本語項目ＮＷ             TO レセ－患者氏名.
006050*
006060*     MOVE 作１－患者カナ            TO レセ－患者カナ.
006070     MOVE 作１－患者カナ             TO 英数字項目Ｗ.
006080     PERFORM 変換処理英数字.
006090     MOVE 英数字項目２Ｗ             TO レセ－患者カナ.
006100*
006110     MOVE 作１－続柄                TO レセ－続柄.
006120*     MOVE 作１－続柄                 TO 英数字項目Ｗ.
006130*     PERFORM 変換処理英数字.
006140*     MOVE 英数字項目２Ｗ             TO レセ－続柄.
006150*
006160     MOVE 作１－性別                 TO レセ－性別.
006170*     MOVE 作１－性別                 TO 英数字項目Ｗ.
006180*     PERFORM 変換処理日本語.
006190*     MOVE 日本語項目ＮＷ             TO レセ－性別.
006200*
006210*     MOVE 作１－患者生年月日         TO レセ－患者生年月日.
006220     MOVE 作１－患者生年月日         TO 英数字項目Ｗ.
006230     PERFORM 変換処理英数字.
006240     MOVE 英数字項目２Ｗ             TO レセ－患者生年月日.
006250
006260
006270*     MOVE 作１－患者住所            TO レセ－患者住所.
006280     MOVE 作１－患者住所             TO 英数字項目Ｗ.
006290     PERFORM 変換処理日本語.
006300     MOVE 日本語項目ＮＷ             TO レセ－患者住所.
006310*
006320     MOVE 作１－合計金額             TO レセ－合計金額.
      */給付割合に変更/071220
006330*     MOVE 作１－負担割合             TO レセ－負担割合.
           COMPUTE レセ－負担割合 = 10 - 作１－負担割合.
006340     MOVE 作１－一部負担金           TO レセ－一部負担金.
006350     MOVE 作１－請求金額             TO レセ－請求金額.
006360     MOVE 作１－部位数               TO レセ－部位数.
006370*/対象外に変更
006380*     MOVE 作１－負傷原因             TO レセ－負傷原因.
006390*     MOVE 作１－長期理由             TO レセ－長期理由.
006400
006410     MOVE SPACE                      TO 英数字項目Ｗ.
006420     PERFORM 変換処理日本語.
006430     MOVE 日本語項目ＮＷ             TO レセ－負傷原因 レセ－長期理由.
006440
006450
006460*     MOVE SPACE                      TO レセ－負傷原因.
006470*     MOVE SPACE                      TO レセ－長期理由.
006480     MOVE ZERO                       TO レセ－ＲＥＣＥ.
006490     MOVE 作１－患者番号             TO レセ－患者番号.
006500     MOVE 作１－年齢区分             TO レセ－年齢区分.
006510     MOVE 作１－助成種別             TO レセ－助成種別.
006520
006530
006540     MOVE 作１－市区町村名           TO 英数字項目Ｗ.
006550     PERFORM 変換処理日本語.
006560     MOVE 日本語項目ＮＷ             TO レセ－市区町村名.
006570     MOVE 作１－市区町村使用区分     TO レセ－市区町村使用区分.
006580
006590*
006600     PERFORM VARYING カウンタ FROM 1 BY 1
006610             UNTIL ( カウンタ > 4 )
006620*         MOVE 作１－負傷名(カウンタ)         TO レセ－負傷名(カウンタ)         
006630         MOVE 作１－負傷名(カウンタ) TO 英数字項目Ｗ
006640         PERFORM 変換処理日本語
006650         MOVE 日本語項目ＮＷ TO レセ－負傷名(カウンタ)
006660*
006670*         MOVE 作１－負傷年月日(カウンタ)     TO レセ－負傷年月日(カウンタ)     
006680*         MOVE 作１－初検年月日(カウンタ)     TO レセ－初検年月日(カウンタ)     
006690*         MOVE 作１－施術開始年月日(カウンタ) TO レセ－施術開始年月日(カウンタ) 
006700*         MOVE 作１－施術終了年月日(カウンタ) TO レセ－施術終了年月日(カウンタ) 
006710
006720         MOVE 作１－負傷年月日(カウンタ)         TO 英数字項目Ｗ
006730         PERFORM 変換処理英数字
006740         MOVE 英数字項目２Ｗ             TO レセ－負傷年月日(カウンタ)
006750
006760
006770         MOVE 作１－初検年月日(カウンタ)     TO 英数字項目Ｗ
006780         PERFORM 変換処理英数字
006790         MOVE 英数字項目２Ｗ             TO レセ－初検年月日(カウンタ)
006800
006810         MOVE 作１－施術開始年月日(カウンタ) TO 英数字項目Ｗ
006820         PERFORM 変換処理英数字
006830         MOVE 英数字項目２Ｗ             TO レセ－施術開始年月日(カウンタ)
006840
006850         MOVE 作１－施術終了年月日(カウンタ) TO 英数字項目Ｗ
006860         PERFORM 変換処理英数字
006870         MOVE 英数字項目２Ｗ             TO レセ－施術終了年月日(カウンタ)
006880
006890
006900         MOVE 作１－実日数(カウンタ)         TO レセ－実日数(カウンタ)         
006910         MOVE 作１－転帰区分(カウンタ)       TO レセ－転帰区分(カウンタ)       
006920         MOVE "," TO コンマ２８(カウンタ) コンマ２９(カウンタ)
006930                     コンマ３０(カウンタ) コンマ３１(カウンタ)
006940                     コンマ３２(カウンタ) コンマ３３(カウンタ)
006950                     コンマ３４(カウンタ)
006960     END-PERFORM.
006970* ｺﾝﾏ
006980     MOVE "," TO コンマ１ コンマ２ コンマ３ コンマ４ コンマ５
006990                 コンマ６ コンマ７ コンマ８ コンマ９ コンマ１０
007000                 コンマ１１ コンマ１２ コンマ１３ コンマ１４
007010                 コンマ１５ コンマ１６ コンマ１７ コンマ１８
007020                 コンマ１９ コンマ２０ コンマ２１ コンマ２２
007030                 コンマ２３ コンマ２４ コンマ２５ コンマ２６
007040                 コンマ２７ コンマ３５ コンマ３６ コンマ３７
007050                 コンマ３８ コンマ３９.
007060*
007070*================================================================*
007080 レコードセット保険者 SECTION.
007090*
007100*仕様変更*日付以外のすべての英数字、日本語項目を"でくくる。0305
007110* 文字属性データは、""で括るようにする 07/10
007120     MOVE SPACE TO 保険－レコード.
007130     INITIALIZE    保険－レコード.
007140*
007150*     MOVE 作２－保険者番号           TO 保険－保険者番号.
007160*     MOVE 作２－保険者名称           TO 保険－保険者名称.
007170*     MOVE 作２－保険者宛名           TO 保険－保険者宛名.
007180*     MOVE 作２－郵便番号             TO 保険－郵便番号  .
007190*     MOVE 作２－保険者住所           TO 保険－保険者住所.
007200*     MOVE 作２－保険種別             TO 保険－保険種別  .
007210*     MOVE 作２－電話番号             TO 保険－電話番号  .
007220*/保険者番号
007230     MOVE 作２－保険者番号           TO 英数字項目Ｗ.
007240     PERFORM 変換処理英数字.
007250     MOVE 英数字項目２Ｗ             TO 保険－保険者番号.
007260*保険者名称
007270     MOVE 作２－保険者名称           TO 英数字項目Ｗ.
007280     PERFORM 変換処理日本語.
007290     MOVE 日本語項目ＮＷ             TO 保険－保険者名称.
007300*保険者宛先(転記対象外)
007310     MOVE 作２－保険者宛名           TO 英数字項目Ｗ.
007320     PERFORM 変換処理日本語.
007330     MOVE 日本語項目ＮＷ             TO 保険－保険者宛名.
007340*保険者〒
007350     MOVE 作２－郵便番号             TO 英数字項目Ｗ.
007360     PERFORM 変換処理英数字.
007370     MOVE 英数字項目２Ｗ             TO 保険－郵便番号.
007380*保険者住所
007390     MOVE 作２－保険者住所           TO 英数字項目Ｗ.
007400     PERFORM 変換処理日本語.
007410     MOVE 日本語項目ＮＷ             TO 保険－保険者住所.
007420*保険種別
007430     MOVE 作２－保険種別             TO 英数字項目Ｗ.
007440     PERFORM 変換処理日本語.
007450     MOVE 日本語項目ＮＷ             TO 保険－保険種別.
007460*電話番号
007470     MOVE 作２－電話番号             TO 英数字項目Ｗ.
007480     PERFORM 変換処理英数字.
007490     MOVE 英数字項目２Ｗ             TO 保険－電話番号.
007500* タックシール、委、個
007510     MOVE SPACE                      TO 英数字項目Ｗ.
007520     PERFORM 変換処理英数字.
007530     MOVE 英数字項目２Ｗ             TO 保険－ダミー１ 保険－ダミー２ 保険－ダミー３.
007540*
007550* ｺﾝﾏ
007560     MOVE "," TO 保険－コンマ１ 保険－コンマ２ 保険－コンマ３
007570                 保険－コンマ４ 保険－コンマ５ 保険－コンマ６
007580                 保険－コンマ７ 保険－コンマ８ 保険－コンマ９.
007590*
007600*================================================================*
007610 レコードセット市町村 SECTION.
007620*
007630*仕様変更*日付以外のすべての英数字、日本語項目を"でくくる。0305
007640* 文字属性データは、""で括るようにする 07/10
007650     MOVE SPACE TO 市町－レコード.
007660     INITIALIZE    市町－レコード.
007670*
007680*     MOVE 作３－市町村番号           TO 市町－市町村番号.
007690*     MOVE 作３－市町村名称           TO 市町－市町村名称.
007700*     MOVE 作３－郵便番号             TO 市町－郵便番号  .
007710*     MOVE 作３－市町村住所           TO 市町－市町村住所.
007720*     MOVE 作３－市町村宛名           TO 市町－市町村宛名.
007730*     MOVE 作３－電話番号             TO 市町－電話番号  .
007740*/市町村番号
007750     MOVE 作３－市町村番号           TO 英数字項目Ｗ.
007760     PERFORM 変換処理英数字.
007770     MOVE 英数字項目２Ｗ             TO 市町－市町村番号.
007780*/市町村名称
007790     MOVE 作３－市町村名称           TO 英数字項目Ｗ.
007800     PERFORM 変換処理日本語.
007810     MOVE 日本語項目ＮＷ             TO 市町－市町村名称.
007820*/市町村〒
007830     MOVE 作３－郵便番号             TO 英数字項目Ｗ.
007840     PERFORM 変換処理英数字.
007850     MOVE 英数字項目２Ｗ             TO 市町－郵便番号.
007860*/市町村住所
007870     MOVE 作３－市町村住所           TO 英数字項目Ｗ.
007880     PERFORM 変換処理日本語.
007890     MOVE 日本語項目ＮＷ             TO 市町－市町村住所.
007900*/市町村宛先(転記対象外)
007910     MOVE 作３－市町村宛名           TO 英数字項目Ｗ.
007920     PERFORM 変換処理日本語.
007930     MOVE 日本語項目ＮＷ             TO 市町－市町村宛名.
007940*/電話番号
007950     MOVE 作３－電話番号             TO 英数字項目Ｗ.
007960     PERFORM 変換処理英数字.
007970     MOVE 英数字項目２Ｗ             TO 市町－電話番号.
007980*/
007990     MOVE SPACE                      TO 英数字項目Ｗ.
008000     PERFORM 変換処理英数字.
008010     MOVE 英数字項目２Ｗ             TO 市町－ダミー１ 市町－ダミー２.
008020
008030* ｺﾝﾏ
008040     MOVE "," TO 市町－コンマ１ 市町－コンマ２ 市町－コンマ３
008050                 市町－コンマ４ 市町－コンマ５ 市町－コンマ６ 市町－コンマ７.
008060*
008070*================================================================*
008080 作業ファイル１読込 SECTION.
008090*
008100     READ 作業ファイル１ NEXT
008110     AT END
008120         MOVE "YES" TO 終了フラグ
008130     END-READ.
008140*
008150*================================================================*
008160 作業ファイル２読込 SECTION.
008170*
008180     READ 作業ファイル２ NEXT
008190     AT END
008200         MOVE "YES" TO 終了フラグ２
008210     END-READ.
008220*
008230*================================================================*
008240 作業ファイル３読込 SECTION.
008250*
008260     READ 作業ファイル３ NEXT
008270     AT END
008280         MOVE "YES" TO 終了フラグ３
008290     END-READ.
008300*
008310*================================================================*
008320 ファイル書込 SECTION.
008330*
008340     WRITE レセ－レコード.
008350     IF 状態キー  NOT =  "00"
008360         MOVE NC"レセプトファイル" TO ファイル名
008370         PERFORM エラー表示
008380     END-IF.
008390*================================================================*
008400 ファイル書込保険者 SECTION.
008410*
008420     WRITE 保険－レコード.
008430     IF 状態キー  NOT =  "00"
008440         MOVE NC"保険者ファイル" TO ファイル名
008450         PERFORM エラー表示
008460     END-IF.
008470*================================================================*
008480 ファイル書込市町村 SECTION.
008490*
008500     WRITE 市町－レコード.
008510     IF 状態キー  NOT =  "00"
008520         MOVE NC"市町村ファイル" TO ファイル名
008530         PERFORM エラー表示
008540     END-IF.
008550*================================================================*
008560* 変換処理日本語 SECTION.
008570**
008580*     INSPECT 英数字項目Ｗ REPLACING ALL "　" BY "  ".
008590*     MOVE SPACE TO 日本語項目Ｗ.
008600*     STRING 区切文字Ｗ２ DELIMITED BY SIZE
008610*            英数字項目Ｗ DELIMITED BY SPACE
008620*            区切文字Ｗ２ DELIMITED BY SIZE
008630*            INTO 日本語項目Ｗ
008640*     END-STRING.
008650*================================================================*
008660 変換処理日本語 SECTION.
008670*
008680*/日本語項目を"でくくる処理。
008690     INSPECT 英数字項目Ｗ REPLACING ALL "　" BY "  ".
008700     MOVE 区切文字Ｗ２ TO 日本語項目Ｗ.
008710     MOVE 英数字項目Ｗ TO 日本語項目Ｗ(2:68)
008720     MOVE SPACE TO 終了フラグ４.
008730     PERFORM VARYING 文字ＣＮＴ FROM 70 BY -1
008740             UNTIL (文字ＣＮＴ  <= ZERO) OR
008750                   (終了フラグ４ = "YES")
008760         IF 日本語項目Ｗ(文字ＣＮＴ:1) NOT = SPACE
008770             COMPUTE 文字ＣＮＴ = 文字ＣＮＴ + 1
008780             MOVE 区切文字Ｗ２ TO 日本語項目Ｗ(文字ＣＮＴ:1)
008790             MOVE "YES" TO 終了フラグ４
008800         END-IF
008810     END-PERFORM.
008820*     INSPECT 日本語項目Ｗ REPLACING ALL "  " BY "　".
008830*================================================================*
008840 変換処理英数字 SECTION.
008850*
008860*/英数字項目を"でくくる処理。
008870     MOVE SPACE TO 終了フラグ４.
008880     MOVE 区切文字Ｗ２ TO 英数字項目２Ｗ.
008890     MOVE 英数字項目Ｗ TO 英数字項目２Ｗ(2:69)
008900     PERFORM VARYING 文字ＣＮＴ FROM 70 BY -1
008910             UNTIL (文字ＣＮＴ  <= ZERO) OR
008920                   (終了フラグ４ = "YES")
008930         IF 英数字項目２Ｗ(文字ＣＮＴ:1) NOT = SPACE
008940            COMPUTE 文字ＣＮＴ = 文字ＣＮＴ + 1
008950            MOVE 区切文字Ｗ２ TO 英数字項目２Ｗ(文字ＣＮＴ:1)
008960            MOVE "YES" TO 終了フラグ４
008970         END-IF
008980     END-PERFORM.
008990*================================================================*
009000 変換処理日本語２ SECTION.
009010*
009020     MOVE 英数字項目Ｗ TO 日本語項目Ｗ.
009030     MOVE SPACE TO 終了フラグ４.
009040*     PERFORM VARYING 文字ＣＮＴ FROM 70 BY -1
009050     PERFORM VARYING 文字ＣＮＴ FROM 35 BY -1
009060             UNTIL (文字ＣＮＴ  <= ZERO) OR
009070                   (終了フラグ４ = "YES")
009080*         IF 日本語項目ＮＷ(文字ＣＮＴ:1) NOT = SPACE
009090         IF 英数字項目Ｗ(文字ＣＮＴ:1) NOT = SPACE
009100     DISPLAY 日本語項目Ｗ   UPON CONS *>HILO
009110     DISPLAY 文字ＣＮＴ     UPON CONS *>HILO
009120             MOVE "YES" TO 終了フラグ４
009130         END-IF
009140     END-PERFORM.
009150*     COMPUTE 文字ＣＮＴ = 文字ＣＮＴ * 2
009160     MOVE SPACE TO 日本語項目Ｗ.
009170     STRING 区切文字Ｗ２               DELIMITED BY SIZE
009180            英数字項目Ｗ(1:文字ＣＮＴ) DELIMITED BY SPACE
009190            区切文字Ｗ２               DELIMITED BY SIZE
009200            INTO 日本語項目Ｗ
009210     END-STRING.
009220*================================================================*
009230 変換処理日本語３ SECTION.
009240*
009250*/日本語項目を"でくくる処理。
009260*     INSPECT 英数字項目Ｗ REPLACING ALL "　" BY "  ".
009270     MOVE 英数字項目Ｗ TO 日本語項目Ｗ.
009280*     MOVE SPACE TO 日本語項目Ｗ
009290*     STRING 英数字項目Ｗ DELIMITED BY SPACE
009300*       INTO 英数字項目２Ｗ
009310*     END-STRING.
009320     MOVE SPACE TO 終了フラグ４.
009330*     PERFORM VARYING 文字ＣＮＴ FROM 70 BY -1
009340     PERFORM VARYING 文字ＣＮＴ FROM 35 BY -1
009350*             UNTIL (文字ＣＮＴ  <= 1) OR
009360             UNTIL (文字ＣＮＴ  <= ZERO) OR
009370                   (終了フラグ４ = "YES")
009380*         IF 日本語項目ＮＷ(文字ＣＮＴ:1) NOT = SPACE
009390         IF 英数字項目Ｗ(文字ＣＮＴ:1) NOT = SPACE
009400     DISPLAY 日本語項目Ｗ   UPON CONS *>HILO
009410     DISPLAY 文字ＣＮＴ     UPON CONS *>HILO
009420             MOVE "YES" TO 終了フラグ４
009430         END-IF
009440     END-PERFORM.
009450*     COMPUTE 文字ＣＮＴ = 文字ＣＮＴ * 2
009460     COMPUTE 文字ＣＮＴ = 文字ＣＮＴ + 1
009470     MOVE SPACE TO 日本語項目Ｗ.
009480     MOVE 区切文字Ｗ２ TO 日本語項目Ｗ
009490     MOVE 英数字項目Ｗ(1:文字ＣＮＴ) TO 日本語項目Ｗ(2:文字ＣＮＴ)
009500     MOVE 区切文字Ｗ２ TO 日本語項目Ｗ(文字ＣＮＴ + 2:1)
009510     DISPLAY "'" 英数字項目Ｗ(1:文字ＣＮＴ) "'" UPON CONS. *>HILO
009520*     STRING 区切文字Ｗ２               DELIMITED BY SIZE
009530*            英数字項目Ｗ(1:文字ＣＮＴ) DELIMITED BY SIZE
009540*            区切文字Ｗ２               DELIMITED BY SIZE
009550*            INTO 日本語項目Ｗ
009560*     END-STRING.
009570     DISPLAY 日本語項目Ｗ UPON CONS. *>HILO
009580*================================================================*
      *================================================================*
       遅延処理 SECTION.
      *
           PERFORM 1000 TIMES
               PERFORM VARYING 遅延カウンタ FROM 1 BY 1
                       UNTIL 遅延カウンタ > 遅延回数Ｗ
                   MOVE "YES" TO 遅延フラグ
               END-PERFORM
           END-PERFORM.
      *
      *================================================================*
009590******************************************************************
009600 END PROGRAM YCB102.
009610******************************************************************
