000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             HUJ9709.
000060 AUTHOR.                 上田  育正
000070*
000080*----------------------------------------------------------------*
000090*         負担額［助成］計算プログラム
000100*                     　日計処理［助成用］（柔）
000110*         MED = 
000120* 平成９年４月分請求から使用開始
      */神戸市対応/140709
000130*----------------------------------------------------------------*
000140* ☆注意☆
000150* 費用額の計算が終了している前提のプログラム
000160* 連計－費用額
000170* 連計－負担額
000180* 連計－請求額
000190* 上記３項目に値が代入済
000200*----------------------------------------------------------------*
000210 DATE-WRITTEN.           1997-12-21
000220 DATE-COMPILED.          1997-12-21
000230*----------------------------------------------------------------*
000240******************************************************************
000250*            ENVIRONMENT         DIVISION                        *
000260******************************************************************
000270 ENVIRONMENT             DIVISION.
000280 CONFIGURATION           SECTION.
000290 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000300 OBJECT-COMPUTER.        FMV-DESKPOWER.
000310 SPECIAL-NAMES.          CONSOLE  IS  CONS
000320                         SYSERR   IS  MSGBOX.
000330 INPUT-OUTPUT            SECTION.
000340 FILE-CONTROL.
000341* EXTERNAL用
000350     SELECT  ＥＸ保険者マスタ    ASSIGN      TO        HOKENSL
000360                             ORGANIZATION             IS  INDEXED
000370                             ACCESS MODE              IS  DYNAMIC
000380                             RECORD KEY               IS  保－保険種別
000390                                                          保－保険者番号
000400                             ALTERNATE RECORD KEY     IS  保－保険種別
000410                                                          保－保険者名称
000420                                                          保－保険者番号
000430                             FILE STATUS              IS  状態キー
000440                             LOCK        MODE         IS  AUTOMATIC.
000450     SELECT  ＥＸ負担率マスタ    ASSIGN      TO        HUTANRIL
000460                             ORGANIZATION             IS  INDEXED
000470                             ACCESS MODE              IS  DYNAMIC
000480                             RECORD KEY               IS  負率－保険種別
000490                                                          負率－開始和暦年月
000500                             FILE STATUS              IS  状態キー
000510                             LOCK        MODE         IS  AUTOMATIC.
000520     SELECT  ＥＸ受診者情報Ｆ    ASSIGN      TO        JUSINJL
000530                             ORGANIZATION             IS  INDEXED
000540                             ACCESS MODE              IS  DYNAMIC
000550                             RECORD KEY               IS  受－施術和暦年月
000560                                                          受－患者コード
000570                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000580                                                          受－患者カナ
000590                                                          受－患者コード
000600                             ALTERNATE RECORD KEY     IS  受－患者コード
000610                                                          受－施術和暦年月
000620                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000630                                                          受－保険種別
000640                                                          受－保険者番号
000650                                                          受－患者コード
000660                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000670                                                          受－公費種別
000680                                                          受－費用負担者番号
000690                                                          受－患者コード
000700                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000710                                                          受－助成種別
000720                                                          受－費用負担者番号助成
000730                                                          受－患者コード
000740                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000750                                                          受－施術和暦年月
000760                                                          受－患者コード
000770                             FILE STATUS              IS  状態キー
000780                             LOCK        MODE         IS  AUTOMATIC.
000790*     SELECT  ＥＸ負傷データＦ    ASSIGN      TO        HUSYOUL
000800*                             ORGANIZATION             IS  INDEXED
000810*                             ACCESS MODE              IS  DYNAMIC
000820*                             RECORD KEY               IS  負－施術和暦年月
000830*                                                          負－患者コード
000840*                             ALTERNATE RECORD KEY     IS  負－患者コード
000850*                                                          負－施術和暦年月
000860*                             FILE STATUS              IS  状態キー
000870*                             LOCK        MODE         IS  AUTOMATIC.
000880     SELECT  ＥＸ施術記録Ｆ      ASSIGN      TO        SEKIROKL
000890                             ORGANIZATION             IS  INDEXED
000900                             ACCESS MODE              IS  DYNAMIC
000910                             RECORD KEY               IS  施記－施術和暦年月日
000920                                                          施記－患者コード
000930                             ALTERNATE RECORD KEY     IS  施記－患者コード
000940                                                          施記－施術和暦年月日
000950                             FILE STATUS              IS  状態キー
000960                             LOCK        MODE         IS  AUTOMATIC.
000970     SELECT  ＥＸ料金マスタ      ASSIGN      TO        RYOUKINL
000980                             ORGANIZATION             IS  INDEXED
000990                             ACCESS MODE              IS  DYNAMIC
001000                             RECORD KEY               IS  料－区分コード
001010                                                          料－部位コード
001020                                                          料－開始和暦年月
001030                             FILE STATUS              IS  状態キー
001040                             LOCK        MODE         IS  AUTOMATIC.
001050     SELECT  ＥＸ市町村マスタ    ASSIGN      TO        SITYOSNL
001060                             ORGANIZATION             IS  INDEXED
001070                             ACCESS MODE              IS  DYNAMIC
001080                             RECORD KEY               IS  市－公費種別
001090                                                          市－市町村番号
001100                             ALTERNATE RECORD KEY     IS  市－公費種別
001110                                                          市－市町村名称
001120                                                          市－市町村番号
001130                             FILE STATUS              IS  状態キー
001140                             LOCK        MODE         IS  AUTOMATIC.
001220     SELECT  ＥＸ制御情報マスタ  ASSIGN      TO        SEIGYOL
001230                             ORGANIZATION             IS  INDEXED
001240                             ACCESS MODE              IS  DYNAMIC
001250                             RECORD KEY               IS  制－制御区分
001260                             FILE STATUS              IS  状態キー
001270                             LOCK        MODE         IS  AUTOMATIC.
001410**
001420     SELECT  ＥＸ保険者特別負担マスタ   ASSIGN      TO        HOKENTKL
001430                                    ORGANIZATION          IS  INDEXED
001440                                    ACCESS MODE           IS  DYNAMIC
001450                                    RECORD KEY            IS  保特－保険種別
001460                                                              保特－保険者番号
001470                                                              保特－開始和暦年月
001480                                    FILE STATUS           IS  状態キー
001490                                    LOCK        MODE      IS  AUTOMATIC.
001500**
001510******************************************************************
001520*                      DATA DIVISION                             *
001530******************************************************************
001540 DATA                    DIVISION.
001550 FILE                    SECTION.
001551* EXTERNAL用
001560*                           ［ＲＬ＝  ２５６］
001570 FD  ＥＸ保険者マスタ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001580     COPY HOKENS     OF  XFDLIB  JOINING   保   AS  PREFIX.
001590*                           ［ＲＬ＝  ２５６］
001600 FD  ＥＸ負担率マスタ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001610     COPY HUTANRI    OF  XFDLIB  JOINING   負率 AS  PREFIX.
001620*                           ［ＲＬ＝  ３２０］
001630 FD  ＥＸ受診者情報Ｆ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001640     COPY JUSINJ     OF  XFDLIB  JOINING   受   AS  PREFIX.
001650*                           ［ＲＬ＝  １２８］
001660* FD  ＥＸ負傷データＦ IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001670*     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001680*                           ［ＲＬ＝  ２５６］
001690 FD  ＥＸ施術記録Ｆ   IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001700     COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001710*                           ［ＲＬ＝  ３２０］
001720 FD  ＥＸ料金マスタ   IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001730     COPY RYOUKIN    OF  XFDLIB  JOINING 料     AS  PREFIX.
001740     COPY RYOUKNA    OF  XFDLIB  JOINING 料Ａ   AS  PREFIX.
001750     COPY RYOUKNB    OF  XFDLIB  JOINING 料Ｂ   AS  PREFIX.
001760     COPY RYOUKNC    OF  XFDLIB  JOINING 料Ｃ   AS  PREFIX.
001770     COPY RYOUKND    OF  XFDLIB  JOINING 料Ｄ   AS  PREFIX.
001780     COPY RYOUKNE    OF  XFDLIB  JOINING 料Ｅ   AS  PREFIX.
001790     COPY RYOUKNF    OF  XFDLIB  JOINING 料Ｆ   AS  PREFIX.
001840*                           ［ＲＬ＝  ２５６］
001850 FD  ＥＸ市町村マスタ IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001860     COPY SITYOSN         OF  XFDLIB  JOINING   市   AS  PREFIX.
001870*                           ［ＲＬ＝  ２５６］
001880 FD  ＥＸ制御情報マスタ IS EXTERNAL         BLOCK   CONTAINS   1   RECORDS.
001890     COPY SEIGYO     OF  XFDLIB  JOINING   制   AS  PREFIX.
001960*
001970 FD  ＥＸ保険者特別負担マスタ IS EXTERNAL   BLOCK   CONTAINS   1   RECORDS.
001980     COPY HOKENTK         OF  XFDLIB  JOINING   保特 AS PREFIX.
001990*
002000*----------------------------------------------------------------*
002010******************************************************************
002020*                WORKING-STORAGE SECTION                         *
002030******************************************************************
002040 WORKING-STORAGE         SECTION.
002050 01 キー入力                           PIC X    VALUE SPACE.
002060 01 状態キー                           PIC X(2) VALUE SPACE.
002070 01 終了フラグ                         PIC X(3) VALUE SPACE.
002080 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002090 01 終了フラグ３                       PIC X(3) VALUE SPACE.
002100 01 書込フラグ                         PIC X(4) VALUE SPACE.
002110 01 書込フラグ２                       PIC X(4) VALUE SPACE.
002120 01 書込許可フラグ                     PIC X(3) VALUE SPACE.
002130 01 年月フラグ                         PIC X(3) VALUE SPACE.
002140 01 追加フラグ                         PIC X(3) VALUE SPACE.
002150 01 行桁フラグ                         PIC X(3) VALUE SPACE.
002160 01 項目フラグ                         PIC X(3) VALUE SPACE.
002170 01 初検日フラグ                       PIC X(3) VALUE SPACE.
002180 01 初診療フラグ                       PIC X(3) VALUE SPACE.
002190 01 保険者番号Ｗ                       PIC X(6) VALUE SPACE.
002200 01 ファイル名Ｗ                       PIC N(2) VALUE SPACE.
002210 01 エラー内容Ｗ                       PIC N(18) VALUE SPACE.
002220 01 会員名Ｗ                           PIC N(16) VALUE SPACE.
002230 01 画面名称Ｗ                         PIC N(2) VALUE SPACE.
002240 01 負傷ＣＮＴ                         PIC 9    VALUE 0.
002250 01 請求移動キー                       PIC X(4) VALUE SPACE.
002260 01 画面移動キー                       PIC X(4) VALUE SPACE.
002270 01 処理移動キー                       PIC X(4) VALUE SPACE.
002280 01 再入力キーＷ                       PIC X(4) VALUE SPACE.
002290 01 入力状態Ｗ                         PIC X(4) VALUE SPACE.
002300 01 部位名称Ｗ                         PIC N(12) VALUE SPACE.
002310 01 行Ｗ                               PIC 9(4) VALUE ZERO.
002320 01 桁Ｗ                               PIC 9(4) VALUE ZERO.
002330 01 商Ｗ                               PIC 9(4) VALUE ZERO.
002340 01 剰余Ｗ                             PIC 9(4) VALUE ZERO.
002350 01 前和暦Ｗ                           PIC 9 VALUE ZERO.
002360 01 カレント和暦Ｗ                     PIC 9 VALUE ZERO.
002370*
002380 01 実日数Ｗ                           PIC 9(2) VALUE ZERO.
002390*/負担額と請求額を６桁に修正0311
002400 01 負担額助成Ｗ                       PIC 9(6) VALUE ZERO.
002410 01 負担額助成Ｗ２                     PIC 9(6) VALUE ZERO.
002420 01 請求額助成Ｗ                       PIC 9(6) VALUE ZERO.
002430 01 請求額助成Ｗ２                     PIC 9(6) VALUE ZERO.
002440*
002450*/愛知県の乳幼児の対応0109
002460 01 助成負担率Ｗ                       PIC 9(3) VALUE ZERO.
002470 01 助成負担額Ｗ                       PIC 9(5) VALUE ZERO.
002480*/0506兵庫県の改定170701より
002490 01 事務手数料Ｗ                       PIC 9(4) VALUE ZERO.
002500*
002510 01 市町村番号老人Ｗ.
002520   03 法別番号老人Ｗ                   PIC X(2).
002530   03 助保険老人.
002540     05 府県老人                       PIC X(2).
002550     05 助番老人                       PIC X(3).
002560     05 助ＣＤ老人                     PIC X.
002570   03 FILLER                           PIC X(2).
002580*
002590 01 市町村番号助成Ｗ.
002600   03 法別番号助成Ｗ                   PIC X(2).
002610   03 助保険助成Ｗ.
002620     05 府県助成Ｗ                     PIC X(2).
002630     05 助番助成Ｗ                     PIC X(3).
002640     05 助ＣＤ助成Ｗ                   PIC X.
002650   03 FILLER                           PIC X(2).
002660*
002670*/助成一定金額、一定回数を負担
002680 01 助成負担回数Ｗ                     PIC 9(2) VALUE ZERO.
002690 01 助成負担金額Ｗ                     PIC 9(4) VALUE ZERO.
002700 01 枝番フラグ                         PIC X(3) VALUE SPACE.
002710 01 公費種別Ｗ                         PIC 9(2) VALUE ZERO.
002720 01 助成種別Ｗ                         PIC 9(2) VALUE ZERO.
002730 01 公費種別Ｗ２                       PIC 9(2) VALUE ZERO.
002740 01 助成種別Ｗ２                       PIC 9(2) VALUE ZERO.
002750 01 初診療年月日ＣＷ                   PIC X(7) VALUE ZERO.
002760*
002770 01 公費助成０円請求Ｗ                 PIC 9 VALUE ZERO.
002780 01 助成助成０円請求Ｗ                 PIC 9 VALUE ZERO.
002790 01 負担一定金額Ｗ                     PIC 9(6) VALUE ZERO.
002800 01 助成一部負担金Ｗ                   PIC 9(4) VALUE ZERO.
002810*/負担区分１１の対応で桁を増やす011309
002820 01 負担区分Ｗ                         PIC 9(2) VALUE ZERO.
002830 01 負担率中間結果Ｗ                   PIC 9V9(3) VALUE ZERO.
002840*
002850 01 入金額Ｗ                           PIC 9(6) VALUE ZERO.
002860 01 保険種別Ｗ                         PIC 9(2) VALUE ZERO.
002870 01 助成種別１Ｗ                       PIC 9(2) VALUE ZERO.
002880 01 助成種別２Ｗ                       PIC 9(2) VALUE ZERO.
002890*
002900*/負担額と請求額を６桁に修正0311
002910 01 負担額Ｗ                           PIC 9(6) VALUE ZERO.
002920 01 負担額Ｗ２                         PIC 9(6) VALUE ZERO.
002930 01 負担額Ｗ１０                       PIC 9(6)V9 VALUE ZERO.
002940 01 請求額Ｗ                           PIC 9(6) VALUE ZERO.
002950 01 負担率Ｗ                           PIC 9(3) VALUE ZERO.
002960 01 甲乙区分Ｗ                         PIC 9    VALUE ZERO.
002970 01 本人負担率Ｗ                       PIC 9(3) VALUE ZERO.
002980 01 家族負担率Ｗ                       PIC 9(3) VALUE ZERO.
002990*
003000 01 初検料Ｗ                           PIC 9(4) VALUE ZERO.
003010 01 再検料Ｗ                           PIC 9(4) VALUE ZERO.
003020 01 往療料Ｗ                           PIC 9(4) VALUE ZERO.
003030 01 後療料Ｗ                           PIC 9(4) VALUE ZERO.
003040 01 冷罨法料Ｗ                         PIC 9(4) VALUE ZERO.
003050 01 温罨法料Ｗ                         PIC 9(4) VALUE ZERO.
003060 01 電療料Ｗ                           PIC 9(4) VALUE ZERO.
003070 01 金属副子料Ｗ                       PIC 9(4) VALUE ZERO.
003080 01 初回処置料Ｗ                       PIC 9(4) VALUE ZERO.
003090 01 施術情報提供料Ｗ                   PIC 9(4) VALUE ZERO.
003100*
003110 01 後療料Ｗ１                         PIC 9(4) VALUE ZERO.
003120 01 冷罨法料Ｗ１                       PIC 9(4) VALUE ZERO.
003130 01 温罨法料Ｗ１                       PIC 9(4) VALUE ZERO.
003140 01 電療料Ｗ１                         PIC 9(4) VALUE ZERO.
003150*
003160 01 部位コードＣＷ.
003170    03 負傷種別ＣＷ                    PIC 9(2).
003180    03 部位ＣＷ                        PIC 9(2).
003190*
003200 01 患者コードＷ.
003210     03 患者番号Ｗ                     PIC 9(6).
003220     03 枝番Ｗ                         PIC X.
003230*
003240 01 患者コードＣＷ.
003250     03 患者番号ＣＷ                   PIC 9(6).
003260     03 枝番ＣＷ                       PIC X.
003270*
003280 01 施術和暦年月日ＣＷ.
003290   03 施術和暦年月ＣＷ.
003300     05 施術和暦ＣＷ                   PIC 9.
003310     05 施術年月ＣＷ.
003320        07 施術年ＣＷ                  PIC 9(2).
003330        07 施術月ＣＷ                  PIC 9(2).
003340   03 施術日ＣＷ                       PIC 9(2).
003350*
003360*/091202
003370 01 施術和暦年月Ｗ.
003380     03 施術和暦Ｗ                     PIC 9    VALUE ZERO.
003390     03 施術年月Ｗ.
003400        05 施術年Ｗ                    PIC 9(2) VALUE ZERO.
003410        05 施術月Ｗ                    PIC 9(2) VALUE ZERO.
003420*     03 施術日Ｗ                       PIC 9(2).
003430*/091202
003440 01 助成種別Ｗ３                       PIC 9(2) VALUE ZERO.
003450 01 費用負担者番号助成Ｗ３             PIC X(8) VALUE SPACE.
003460*
003470 01 負傷種別略称Ｗ.
003480    03 負傷種別略称Ｗ１                PIC N(4).
003490    03 FILLER                          PIC N(2).
003500 01 元号名称Ｗ.
003510    03 元号名称Ｗ１                    PIC N(2).
003520    03 FILLER                          PIC N(4).
003530 01 転帰区分略称Ｗ.
003540    03 転帰区分略称Ｗ１                PIC N(4).
003550    03 FILLER                          PIC N(2).
003560*
003570 01  保険者番号Ｗ２.
003580     03  保番１Ｗ                      PIC X(2).
003590     03  保番２Ｗ                      PIC X(8).
003600* 費用負担者番号（市町村番号）ＷＯＲＫ
003610 01 費用負担者番号Ｗ.
003620     03  法別番号Ｗ                      PIC X(2).
003630     03  助保険Ｗ.
003640          05  府県Ｗ                     PIC X(2).
003650          05  助番Ｗ                     PIC X     OCCURS 3.
003660          05  助ＣＤＷ                   PIC X.
003670     03  FILLER                        PIC X(2).
003680*
003690*/年月毎持つ保険者データのワーク
003700 01 保負担率区分Ｗ                     PIC 9    VALUE ZERO.
003710 01 保本人負担率Ｗ                     PIC 9(3) VALUE ZERO.
003720 01 保家族負担率Ｗ                     PIC 9(3) VALUE ZERO.
003730 01 保本人負担率乙Ｗ                   PIC 9(3) VALUE ZERO.
003740 01 保家族負担率乙Ｗ                   PIC 9(3) VALUE ZERO.
003750*
003760*/エラー表示の修正
003770 01 エラー表示Ｆ                       PIC 9(1) VALUE ZERO.
003780*/負担区分7(静岡の乳幼児)の為のワーク/060512
003790 01 負担額７Ｗ                         PIC 9(6) VALUE ZERO.
003800*
004000* 日付ＷＯＲＫ
004010 01 和暦終了年Ｗ                       PIC 9(4) VALUE ZERO.
004020 01 計算機和暦年Ｗ                     PIC 9(2) VALUE ZERO.
004030*
004040 01 計算機西暦.
004050    03 計算機西暦年                    PIC 9(4).
004060    03 計算機西暦月日                  PIC 9(4).
004070 01 計算機西暦Ｒ REDEFINES 計算機西暦.
004080    03 計算機世紀                      PIC 9(2).
004090    03 計算機日付                      PIC 9(6).
004100    03 計算機日付Ｒ REDEFINES 計算機日付.
004110       05 計算機年月                   PIC 9(4).
004120       05 計算機年月Ｒ REDEFINES 計算機年月.
004130         07 計算機年                   PIC 9(2).
004140         07 計算機月                   PIC 9(2).
004150       05 計算機日                     PIC 9(2).
004160*
004200*
004201**--------------------**
004202 01 負担額日計窓口Ｗ                   PIC 9(6) VALUE ZERO.
004203 01 負担額日計窓口Ｗ２                 PIC 9(6) VALUE ZERO.
004204*
004205 01 負担額日計窓口退避Ｗ               PIC 9(6) VALUE ZERO.
004206*
004207 01 限度額１Ｗ                         PIC 9(5) VALUE ZERO.
004208 01 限度額２Ｗ                         PIC 9(5) VALUE ZERO.
004209 01 限度額３Ｗ                         PIC 9(5) VALUE ZERO.
004210 01 計算限度額Ｗ                       PIC 9(5) VALUE ZERO.
004211 01 計算用累計額Ｗ                     PIC 9(5) VALUE ZERO.
004212**
004213*
004214*****************************************************************
004215*                          連結項目                             *
004220*****************************************************************
004230*
004240 01 連－共通キー IS EXTERNAL.
004250    03  連－カレント和暦               PIC 9.
004260*
004270 01 連計－キー IS EXTERNAL.
004280    03  連計－負担金計算区分           PIC 9.
004290    03  連計－本人家族区分             PIC 9.
004300    03  連計－保険種別                 PIC 9(2).
004310    03  連計－保険者番号               PIC X(10).
004320    03  連計－公費種別                 PIC 9(2).
004330    03  連計－市町村番号老人           PIC X(10).
004340    03  連計－助成種別                 PIC 9(2).
004350    03  連計－市町村番号助成           PIC X(10).
004360    03  連計－患者コード.
004370      05  連計－患者番号               PIC 9(6).
004380      05  連計－枝番                   PIC X.
004390    03  連計－施術和暦年月日.
004400      05  連計－施術和暦年月.
004410        07  連計－施術和暦             PIC 9.
004420        07  連計－施術年月.
004430          09  連計－施術年             PIC 9(2).
004440          09  連計－施術月             PIC 9(2).
004450      05  連計－施術日                 PIC 9(2).
004460    03  連計－費用額                   PIC 9(6).
004470    03  連計－負担額                   PIC 9(6).
004480    03  連計－請求額                   PIC 9(6).
004490    03  連計－費用額老人               PIC 9(6).
004500    03  連計－負担額老人               PIC 9(6).
004510    03  連計－請求額老人               PIC 9(6).
004520    03  連計－費用額助成               PIC 9(6).
004530    03  連計－負担額助成               PIC 9(5).
004540    03  連計－請求額助成               PIC 9(5).
004550    03  連計－実日数                   PIC 9(2).
004560    03  連計－負担率                   PIC 9(3).
004570    03  連計－負担率区分               PIC 9.
004571*
004572*-------------------------------------*
004573 01 連計日計窓口－キー IS EXTERNAL.
004574    03  連計日計窓口－負担額           PIC 9(6).
004575*-------------------------------------*
004576*
004580*
004590 01 連計Ｐ－キー IS EXTERNAL.
004600    03 連計Ｐ－費用額ＰＧ              PIC X(8).
004610    03 連計Ｐ－負担額ＰＧ              PIC X(8).
004620    03 連計Ｐ－負担額ＰＧ老人          PIC X(8).
004630    03 連計Ｐ－負担額ＰＧ助成          PIC X(8).
004640*
004650* 確認メッセージ用 (２行)
004660 01 連メ７－キー IS EXTERNAL.
004670    03  連メ７－メッセージ１             PIC X(40).
004680    03  連メ７－メッセージ２             PIC X(40).
004690*
004700*/負担率取得ＰＧの対応1410
004710 01 連率－負担率取得キー IS EXTERNAL.
004720    03 連率－施術和暦年月.
004730       05 連率－施術和暦               PIC 9.
004740       05 連率－施術年月.
004750          07 連率－施術年              PIC 9(2).
004760          07 連率－施術月              PIC 9(2).
004770    03 連率－患者コード.
004780       05 連率－患者番号               PIC 9(6).
004790       05 連率－枝番                   PIC X.
004800    03 連率－実際負担率                PIC 9(3).
004810    03 連率－実際本体負担率            PIC 9(3).
004820    03 連率－健保負担率                PIC 9(3).
004830    03 連率－２７老負担率              PIC 9(3).
004840    03 連率－助成負担率                PIC 9(3).
004850    03 連率－特別用負担率              PIC 9(3).
004860*
004870 01 連計－月計算フラグ                 PIC 9 IS EXTERNAL.
004871*
004873*
004879*---------------------------------------------------------*
004880* 助成月途中用
004881 01 連計算助成月途中－キー IS EXTERNAL.
004882   03 連計算助成月途中－日計区分           PIC 9.
004883   03 連計算助成月途中－助成月途中開始日   PIC 9(2).
004884   03 連計算助成月途中－助成のみ処理区分   PIC 9.
004886*---------------------------------------------------------*
004887 01 連計算助成累計額－負担額助成       PIC 9(6) IS EXTERNAL.
004888 01 連計算助成累計額－枝番負担累計額   PIC 9(6) IS EXTERNAL.
004889*---------------------------------------------------------*
      */負担区分２２(大阪府平成30年4月～)
004887 01 連計算助成累計額－負担額助成１０   PIC 9(6) IS EXTERNAL.
004890*
004891******************************************************************
004892*                      PROCEDURE  DIVISION                       *
004900******************************************************************
004910 PROCEDURE               DIVISION.
004920************
004930*           *
004940* 初期処理   *
004950*           *
004960************
004961**
004962*--------------------------------/
004963     IF 連計－施術日 = ZERO
004965        EXIT PROGRAM
004966     END-IF.
004967*--------------------------------/
004968**
004972**   / 退避
004973     MOVE 連計日計窓口－負担額  TO 負担額日計窓口退避Ｗ.
004974**
004975     PERFORM 初期化.
004980     PERFORM 助成計算情報取得.
004990*/資格証明の対応
005000     PERFORM 受診者情報取得.
005010*
005020************
005030*           *
005040* 主処理     *
005050*           *
005060************
005070*
005080     MOVE 連計－市町村番号助成 TO 市町村番号助成Ｗ.
005090*
005100     EVALUATE TRUE
005110*/資格証明の対応/*((国保＆国保組合以外)または退職)＆資格証明区分が１の時は全額患者負担
005120     WHEN (((受－保険種別 = 01)  AND (受－保険者番号(3:1) NOT = "3")) OR
005130           ( 受－保険種別 = 08)) AND
005140           ( 受－資格証明区分 = 1)
005150         MOVE 連計－負担額 TO 連計－負担額助成
005160         MOVE ZERO         TO 連計－請求額助成
005170* 助成
005180     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
005190          ( 連計－保険者番号     NOT = SPACE ) AND
005200          ( 連計－公費種別           = ZERO  ) AND
005210          ( 連計－市町村番号老人     = SPACE ) AND
005220          ( 連計－助成種別 >= 50 AND 連計－助成種別 <= 60 ) AND
005230          ( 連計－市町村番号助成 NOT = SPACE )
005240         PERFORM 助成算定処理
005250* 生保単独
005260*     WHEN ( 連計－保険種別        = ZERO  ) AND
005270*          ( 連計－保険者番号      = SPACE ) AND
005280*          ( 連計－公費種別        = ZERO  ) AND
005290*          ( 連計－市町村番号老人  = SPACE ) AND
005300*          ( 連計－助成種別        = 50    ) AND
005310*          ( 連計－市町村番号助成 NOT = SPACE )
005320*         PERFORM 助成算定処理
005330     WHEN OTHER
005340*/エラー表示の修正
005350         PERFORM コンソールエラー確認
005360         DISPLAY "助成算定条件が満たされていません"
005370                 " 受診者№=" 連計－患者コード
005380                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
005400*-----------------------------------------*
005401         CALL "actcshm"  WITH C LINKAGE
005402*-----------------------------------------*
005403     END-EVALUATE.
005410*
005411*
005412*
005413*-------------------------------------------*
005414     IF ( 連計－助成種別 NOT = ZERO ) AND ( 連計－負担額助成 = ZERO )
005415        MOVE ZERO TO 連計日計窓口－負担額
005416     END-IF.
005417*-------------------------------------------*
005418*
005419*
005420*----------------------------------------------------------*
005421* 日計で助成月途中の時、助成になる以前は、助成なしの扱い
005423     IF ( 連計算助成月途中－日計区分 = 1 ) AND ( 連計算助成月途中－助成月途中開始日 NOT = ZERO ) AND
005424        ( 連計－施術日 < 連計算助成月途中－助成月途中開始日 )
005425***         MOVE 連計－負担額 TO 連計－負担額助成
005426         MOVE ZERO  TO 連計－負担額助成
005427         MOVE ZERO  TO 連計－請求額助成
005428         MOVE 負担額日計窓口退避Ｗ TO 連計日計窓口－負担額
005429     END-IF.
005430*----------------------------------------------------------*
005431*
005432************
005433*           *
005440* 終了処理   *
005450*           *
005460************
005470*
005480     PERFORM 終了処理.
005490     MOVE 1 TO PROGRAM-STATUS.
005500     EXIT PROGRAM.
005510*
005520*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
005530*================================================================*
005540 初期化 SECTION.
005550*
005560* EXTERNALでOPEN無し
005920*
005930*================================================================*
005940 オープンチェック SECTION.
005950*
005960     IF 状態キー  NOT =  "00"
005970         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
005980         DISPLAY NC"状態キー：" 状態キー           UPON CONS
005990         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS
006000*-----------------------------------------*
006010         CALL "actcshm"  WITH C LINKAGE
006020*-----------------------------------------*
006030         ACCEPT  キー入力 FROM CONS
006040         PERFORM ファイル閉鎖
006050         MOVE ZERO TO PROGRAM-STATUS
006060         EXIT PROGRAM.
006070*================================================================*
006080 ファイル閉鎖 SECTION.
006090*
006140*================================================================*
006150 終了処理 SECTION.
006160*
006170     PERFORM ファイル閉鎖.
006180*================================================================*
006190 エラー表示 SECTION.
006200*
006210     DISPLAY ファイル名Ｗ NC"ファイル書込エラー"   UPON CONS.
006220     DISPLAY NC"状態キー：" 状態キー               UPON CONS.
006230     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
006240     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
006250*-----------------------------------------*
006260         CALL "actcshm"  WITH C LINKAGE
006270*-----------------------------------------*
006280     ACCEPT  キー入力 FROM CONS.
006290     PERFORM ファイル閉鎖.
006300     MOVE ZERO TO PROGRAM-STATUS
006310     EXIT PROGRAM.
006320*================================================================*
006330 負担率取得 SECTION.
006340*
006350     MOVE ZERO TO 本人負担率Ｗ.
006360     MOVE ZERO TO 家族負担率Ｗ.
006370*
006380     MOVE 連計－施術和暦 TO 受－施術和暦.
006390     MOVE 連計－施術年   TO 受－施術年.
006400     MOVE 連計－施術月   TO 受－施術月.
006410     MOVE 連計－患者番号 TO 受－患者番号.
006420     MOVE 連計－枝番     TO 受－枝番.
006430     READ ＥＸ受診者情報Ｆ
006440     INVALID KEY
006450*/エラー表示の修正
006460         PERFORM コンソールエラー確認
006470         DISPLAY "施術月の受診者情報がありません"
006480                 " 受診者№=" 連計－患者コード
006490                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
006500*-----------------------------------------*
006510         CALL "actcshm"  WITH C LINKAGE
006520*-----------------------------------------*
006530*         ACCEPT  キー入力 FROM CONS
006540         PERFORM ファイル閉鎖
006550         MOVE ZERO TO PROGRAM-STATUS
006560         EXIT PROGRAM
006570     NOT INVALID KEY
006580         MOVE 受－甲乙区分 TO 甲乙区分Ｗ
006590     END-READ.
006600*
006610     MOVE 連計－保険種別   TO 保－保険種別.  
006620     MOVE 連計－保険者番号 TO 保－保険者番号.
006630     READ ＥＸ保険者マスタ
006640     INVALID KEY
006650*/エラー表示の修正
006660         PERFORM コンソールエラー確認
006670         DISPLAY "保険者番号が登録されていません"
006680                 " 受診者№="   連計－患者コード
006690                 " 施術年月="   連計－施術年 連計－施術月
006700                 " 保険者番号=" 連計－保険者番号  UPON CONS
006710*-----------------------------------------*
006720         CALL "actcshm"  WITH C LINKAGE
006730*-----------------------------------------*
006740*         ACCEPT  キー入力 FROM CONS
006750         PERFORM ファイル閉鎖
006760         MOVE ZERO TO PROGRAM-STATUS
006770         EXIT PROGRAM
006780     NOT INVALID KEY
006790*/年月毎持つデータの振り分け
006800* 特別負担
006810         MOVE 連計－保険種別   TO 保特－保険種別
006820         MOVE 連計－保険者番号 TO 保特－保険者番号
006830         MOVE 連計－施術和暦   TO 保特－開始和暦
006840         MOVE 連計－施術年     TO 保特－開始年
006850         MOVE 連計－施術月     TO 保特－開始月
006860         START ＥＸ保険者特別負担マスタ KEY IS <= 保特－保険種別 
006870                                              保特－保険者番号
006880                                              保特－開始和暦年月
006890                                              REVERSED
006900         END-START
006910         IF 状態キー = "00" 
006920             READ ＥＸ保険者特別負担マスタ NEXT
006930             NOT AT END
006940                 IF ( 保特－保険種別   = 連計－保険種別 ) AND
006950                    ( 保特－保険者番号 = 連計－保険者番号 )
006960                    MOVE 保特－負担率区分   TO 保負担率区分Ｗ
006970                    MOVE 保特－本人負担率   TO 保本人負担率Ｗ
006980                    MOVE 保特－家族負担率   TO 保家族負担率Ｗ
006990                    MOVE 保特－本人負担率乙 TO 保本人負担率乙Ｗ
007000                    MOVE 保特－家族負担率乙 TO 保家族負担率乙Ｗ
007010                 END-IF
007020             END-READ
007030         END-IF
007040        IF ( 保負担率区分Ｗ NOT = ZERO ) OR
007050            ( 甲乙区分Ｗ     NOT = ZERO )
007060             IF 甲乙区分Ｗ NOT = 2
007070                 MOVE 保本人負担率Ｗ   TO 本人負担率Ｗ
007080                 MOVE 保家族負担率Ｗ   TO 家族負担率Ｗ
007090             ELSE
007100                 MOVE 保本人負担率乙Ｗ TO 本人負担率Ｗ
007110                 MOVE 保家族負担率乙Ｗ TO 家族負担率Ｗ
007120             END-IF
007130*         IF ( 保－負担率区分 NOT = ZERO ) OR
007140*            ( 甲乙区分Ｗ     NOT = ZERO )
007150*             IF 甲乙区分Ｗ NOT = 2
007160*                 MOVE 保－本人負担率   TO 本人負担率Ｗ
007170*                 MOVE 保－家族負担率   TO 家族負担率Ｗ
007180*             ELSE
007190*                 MOVE 保－本人負担率乙 TO 本人負担率Ｗ
007200*                 MOVE 保－家族負担率乙 TO 家族負担率Ｗ
007210*             END-IF
007220         ELSE
007230             MOVE 連計－保険種別 TO 負率－保険種別
007240             MOVE 連計－施術和暦 TO 負率－開始和暦 施術和暦ＣＷ
007250             MOVE 連計－施術年   TO 負率－開始年   施術年ＣＷ
007260             MOVE 連計－施術月   TO 負率－開始月   施術月ＣＷ
007270             START ＥＸ負担率マスタ KEY IS <= 負率－保険種別 負率－開始和暦年月
007280                                                                   REVERSED
007290             END-START
007300             READ ＥＸ負担率マスタ NEXT
007310             AT END
007320*/エラー表示の修正
007330         PERFORM コンソールエラー確認
007340         DISPLAY "施術日に合った負担率がみつかりません"
007350                 " 受診者№="   連計－患者コード
007360                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
007370*-----------------------------------------*
007380                 CALL "actcshm"  WITH C LINKAGE
007390*-----------------------------------------*
007400*                 ACCEPT  キー入力 FROM CONS
007410                 PERFORM ファイル閉鎖
007420                 MOVE ZERO TO PROGRAM-STATUS
007430                 EXIT PROGRAM
007440             NOT AT END
007450                 IF ( 施術和暦年月ＣＷ >= 負率－開始和暦年月 ) AND
007460                    ( 施術和暦年月ＣＷ <= 負率－終了和暦年月 )
007470                     MOVE 負率－本人負担率 TO 本人負担率Ｗ
007480                     MOVE 負率－家族負担率 TO 家族負担率Ｗ
007490                 END-IF
007500             END-READ
007510         END-IF
007520     END-READ.
007530*
007540     EVALUATE 連計－本人家族区分
007550     WHEN 1
007560         MOVE 本人負担率Ｗ TO 負担率Ｗ
007570     WHEN 2
007580         MOVE 家族負担率Ｗ TO 負担率Ｗ
007590     WHEN OTHER
007600*/エラー表示の修正
007610         PERFORM コンソールエラー確認
007620         DISPLAY "本人家族区分が設定されていません"
007630                 " 受診者№="   連計－患者コード
007640                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
007650*-----------------------------------------*
007660         CALL "actcshm"  WITH C LINKAGE
007670*-----------------------------------------*
007680*         ACCEPT  キー入力 FROM CONS
007690         PERFORM ファイル閉鎖
007700         MOVE ZERO TO PROGRAM-STATUS
007710         EXIT PROGRAM
007720     END-EVALUATE.
007730*
007740*================================================================*
007750 負担額計算初検 SECTION.
007760******************************************************************
007770* ☆注意☆
007780* 窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
007790* レセプトは、負担金の小数点第１位を切り上げる
007800******************************************************************
007810*
007820* 負担額１０円単位（１円の位を四捨五入）
007830     EVALUATE 連計－負担金計算区分
007840     WHEN 2
007850         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
007860         COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
007870* DEBUG
007880*     DISPLAY NC"負担額Ｗ１円" 負担額Ｗ UPON MSGBOX
007890         COMPUTE 請求額Ｗ = 連計－負担額 - 負担額Ｗ
007900         COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
007910         COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
007920* DEBUG
007930*     DISPLAY NC"負担率Ｗ" 負担率Ｗ UPON MSGBOX
007940*     DISPLAY NC"負担率中間結果Ｗ" 負担率中間結果Ｗ UPON MSGBOX
007950*     DISPLAY NC"初検料Ｗ" 初検料Ｗ UPON MSGBOX
007960*     DISPLAY NC"負担額Ｗ" 負担額Ｗ UPON MSGBOX
007970*
007980     WHEN ZERO
007990         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
008000         COMPUTE 負担額Ｗ１０ = 初検料Ｗ * 負担率中間結果Ｗ
008010         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
008020         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
008030                                  REMAINDER 剰余Ｗ
008040         END-DIVIDE
008050         IF 剰余Ｗ = ZERO
008060             COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
008070             COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
008080             COMPUTE 請求額Ｗ = 連計－負担額 - 負担額Ｗ
008090         ELSE
008100* 一部負担金の端数切り上げ
008110             COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
008120             COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
008130             COMPUTE 負担額Ｗ = 負担額Ｗ + 1
008140             COMPUTE 請求額Ｗ = 連計－負担額 - 負担額Ｗ
008150         END-IF
008163*
008164*---10円単位でも計算 ------------------------------------------*
008165         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
008166         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
008167         COMPUTE 負担額日計窓口Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
008168         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
008169         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
008170         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
008171*--------------------------------------------------------------*
008172*
008176     WHEN OTHER
008177*/エラー表示の修正
008180         PERFORM コンソールエラー確認
008190         DISPLAY "負担金算定区分が指定されていません"
008200                 " 受診者№="   連計－患者コード
008210                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
008220*-----------------------------------------*
008230         CALL "actcshm"  WITH C LINKAGE
008240*-----------------------------------------*
008250*         ACCEPT  キー入力 FROM CONS
008260         PERFORM ファイル閉鎖
008270         MOVE ZERO TO PROGRAM-STATUS
008280         EXIT PROGRAM
008290     END-EVALUATE.
008300*
008310     MOVE 負担額Ｗ TO 連計－負担額助成.
008320     MOVE 請求額Ｗ TO 連計－請求額助成.
008330*
008340*================================================================*
008350 負担額計算助成 SECTION.
008360******************************************************************
008370* ☆注意☆
008380* 窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
008390* レセプトは、負担金の小数点第１位を切り上げる
008400******************************************************************
008410*
008420* 負担額１０円単位（１円の位を四捨五入）
008430     EVALUATE 連計－負担金計算区分
008440     WHEN 2
008450         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
008460         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
008470         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
008480         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
008490                                  REMAINDER 剰余Ｗ
008500         END-DIVIDE
008510         IF 剰余Ｗ = ZERO
008520             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
008530             COMPUTE 負担額助成Ｗ２ ROUNDED = 負担額Ｗ / 10
008540             COMPUTE 負担額助成Ｗ = 負担額助成Ｗ２ * 10
008550             MOVE 負担額助成Ｗ TO 連計－負担額助成
008560             MOVE ZERO         TO 連計－請求額助成
008570         ELSE
008580             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
008590* 小数点以下第１位が発生した場合、整数部に１を加え切り上げる
008600*/↑は取り消し
008610*             COMPUTE 負担額助成Ｗ = 負担額Ｗ + 1
008620             COMPUTE 負担額助成Ｗ２ ROUNDED = 負担額助成Ｗ / 10
008630             COMPUTE 負担額助成Ｗ = 負担額助成Ｗ２ * 10
008640             MOVE 負担額助成Ｗ TO 連計－負担額助成
008650             MOVE ZERO         TO 連計－請求額助成
008660         END-IF
008670     WHEN ZERO
008680         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
008690         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
008700         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
008710         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
008720                                  REMAINDER 剰余Ｗ
008730         END-DIVIDE
008740         IF 剰余Ｗ = ZERO
008750             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
008760             MOVE 負担額Ｗ     TO 連計－負担額助成
008770             MOVE ZERO         TO 連計－請求額助成
008780         ELSE
008790* 一部負担金の端数切り上げ
008800             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
008810             COMPUTE 負担額助成Ｗ = 負担額Ｗ + 1
008820             MOVE 負担額助成Ｗ TO 連計－負担額助成
008830             MOVE ZERO         TO 連計－請求額助成
008840         END-IF
008868*
008869*---10円単位でも計算 ------------------------------------------*
008870         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
008871         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
008872         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
008873         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
008874         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
008875         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
008876*--------------------------------------------------------------*
008877*
008881     WHEN OTHER
008882*/エラー表示の修正
008883         PERFORM コンソールエラー確認
008884         DISPLAY "負担金算定区分が指定されていません"
008890                 " 受診者№="   連計－患者コード
008900                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
008910*-----------------------------------------*
008920         CALL "actcshm"  WITH C LINKAGE
008930*-----------------------------------------*
008940*         ACCEPT  キー入力 FROM CONS
008950         PERFORM ファイル閉鎖
008960         MOVE ZERO TO PROGRAM-STATUS
008970         EXIT PROGRAM
008980     END-EVALUATE.
008990*
009000*================================================================*
009010 助成計算情報取得 SECTION.
009020*
009030* 初検日又は、月の初回診療日かの情報を取得
009040     MOVE SPACE TO 初検日フラグ.
009050     MOVE SPACE TO 初診療フラグ.
009060     MOVE 連計－施術和暦 TO 施記－施術和暦 施術和暦ＣＷ.
009070     MOVE 連計－施術年   TO 施記－施術年   施術年ＣＷ.
009080     MOVE 連計－施術月   TO 施記－施術月   施術月ＣＷ.
009090     MOVE 連計－施術日   TO 施記－施術日.
009100     MOVE 連計－患者番号 TO 施記－患者番号 患者番号ＣＷ.
009110     MOVE 連計－枝番     TO 施記－枝番     枝番ＣＷ.
009120     READ ＥＸ施術記録Ｆ
009130     INVALID KEY
009140*/エラー表示の修正
009150         PERFORM コンソールエラー確認
009160         DISPLAY "施術記録がありません"
009170                 " 受診者№=" 連計－患者コード
009180                 " 施術年月日=" 連計－施術年 
009190                   連計－施術月 連計－施術日 UPON CONS
009200*-----------------------------------------*
009210         CALL "actcshm"  WITH C LINKAGE
009220*-----------------------------------------*
009230*         ACCEPT  キー入力 FROM CONS
009240         PERFORM ファイル閉鎖
009250         MOVE ZERO TO PROGRAM-STATUS
009260         EXIT PROGRAM
009270     NOT INVALID KEY
009280         IF 施記－診療区分 = 2
009290             MOVE  "YES" TO 初検日フラグ
009300         END-IF
009310         START ＥＸ施術記録Ｆ KEY IS < 施記－患者コード 
009320                                   施記－施術和暦年月日
009330                                   REVERSED
009340         END-START
009350         IF 状態キー = "00"
009360             READ ＥＸ施術記録Ｆ NEXT
009370*/070517
009380             AT END
009390                 MOVE "YES" TO 初診療フラグ
009400             NOT AT END
009410                 IF ( 施術和暦年月ＣＷ NOT = 施記－施術和暦年月 ) OR
009420                    ( 患者コードＣＷ   NOT = 施記－患者コード   )
009430                     MOVE "YES" TO 初診療フラグ
009440                 END-IF
009450             END-READ
009460*/070517
009470         ELSE
009480             IF 状態キー = "23"
009490                 MOVE "YES" TO 初診療フラグ
009500             END-IF
009510         END-IF
009520     END-READ.
009530*
009540*HILO     IF ( 初検日フラグ = SPACE ) AND
009550*HILO        ( 初診療フラグ = SPACE )
009560*HILO         MOVE ZERO         TO 連計－負担額助成
009570*HILO         MOVE 連計－負担額 TO 連計－請求額助成
009580*HILO         PERFORM ファイル閉鎖
009590*HILO         MOVE ZERO TO PROGRAM-STATUS
009600*HILO         EXIT PROGRAM
009610*HILO     END-IF.
009620*
009630     MOVE 01             TO 料－区分コード.
009640     MOVE ZERO           TO 料－負傷種別.
009650     MOVE ZERO           TO 料－部位.
009660     MOVE ZERO           TO 料－左右区分.
009670     MOVE ZERO           TO 料－負傷位置番号.
009680     MOVE 連計－施術和暦 TO 料－開始和暦 施術和暦ＣＷ.
009690     MOVE 連計－施術年   TO 料－開始年   施術年ＣＷ.
009700     MOVE 連計－施術月   TO 料－開始月   施術月ＣＷ.
009710     START ＥＸ料金マスタ KEY IS <= 料－区分コード 料－部位コード
009720                                料－開始和暦年月
009730                                REVERSED
009740     END-START.
009750     IF 状態キー = "00"
009760         READ ＥＸ料金マスタ NEXT
009770         AT END
009780*/エラー表示の修正
009790             PERFORM コンソールエラー確認
009800             DISPLAY "指定日に対応した計算情報がありません"
009810                     " 受診者№="   連計－患者コード
009820                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
009830*-----------------------------------------*
009840             CALL "actcshm"  WITH C LINKAGE
009850*-----------------------------------------*
009860*             ACCEPT  キー入力 FROM CONS
009870             PERFORM ファイル閉鎖
009880             MOVE ZERO TO PROGRAM-STATUS
009890             EXIT PROGRAM
009900         NOT AT END
009910             IF ( 施術和暦年月ＣＷ >= 料－開始和暦年月 ) AND
009920                ( 施術和暦年月ＣＷ <= 料－終了和暦年月 )
009930                 MOVE 料Ａ－初検料         TO 初検料Ｗ
009940             END-IF
009950         END-READ
009960     END-IF.
009970*
009980*
009990     MOVE 連計－助成種別       TO 市－公費種別.
010000     MOVE 連計－市町村番号助成 TO 市－市町村番号.
010010     READ ＥＸ市町村マスタ
010020     INVALID KEY
010030*/エラー表示の修正
010040         PERFORM コンソールエラー確認
010050         DISPLAY "市町村番号が登録されていません"
010060                 " 受診者№="   連計－患者コード
010070                 " 施術年月="   連計－施術年 連計－施術月
010080                 " 助成種別="   連計－助成種別
010090                 " 市町村番号=" 連計－市町村番号助成 UPON CONS
010100*-----------------------------------------*
010110         CALL "actcshm"  WITH C LINKAGE
010120*-----------------------------------------*
010130*         ACCEPT  キー入力 FROM CONS
010140         PERFORM ファイル閉鎖
010150         MOVE ZERO TO PROGRAM-STATUS
010160         EXIT PROGRAM
010170     NOT INVALID KEY
010180*/以下のデータは年月で変わる
010190********↓↓↓***********
010200     CONTINUE
010210* 特別負担
010220         MOVE 連計－助成種別       TO 保特－保険種別
010230         MOVE 連計－市町村番号助成 TO 保特－保険者番号
010240         MOVE 連計－施術和暦       TO 保特－開始和暦
010250         MOVE 連計－施術年         TO 保特－開始年
010260         MOVE 連計－施術月         TO 保特－開始月
010270         START ＥＸ保険者特別負担マスタ KEY IS <= 保特－保険種別 
010280                                              保特－保険者番号
010290                                              保特－開始和暦年月
010300                                              REVERSED
010310         END-START
010320         IF 状態キー = "00" 
010330             READ ＥＸ保険者特別負担マスタ NEXT
010340             NOT AT END
010350                 IF ( 保特－保険種別   = 連計－助成種別 ) AND
010360                    ( 保特－保険者番号 = 連計－市町村番号助成 )
010370                    MOVE 保特－負担区分       TO 負担区分Ｗ
010380                    MOVE 保特－負担率１       TO 助成負担率Ｗ
010390                    MOVE 保特－負担一定金額   TO 負担一定金額Ｗ
010400                    MOVE 保特－事務手数料     TO 事務手数料Ｗ
010410                    MOVE 保特－助成負担回数   TO 助成負担回数Ｗ
010411                    MOVE 保特－限度額１       TO 限度額１Ｗ
010412                    MOVE 保特－限度額２       TO 限度額２Ｗ
010413                    MOVE 保特－限度額３       TO 限度額３Ｗ
010421*                    MOVE 保特－負担率２       TO 助成特別負担率２Ｗ
010430*                    MOVE 保特－助成負担回数２ TO 助成特別助成負担回数２Ｗ
010440                 END-IF
010450             END-READ
010460         END-IF
010470     END-READ.
010480*
010490*================================================================*
010500 助成算定処理 SECTION.
010510* ［助成］
010520******************************************************************
010530* 日毎の費用額の親保険負担率分から各市町村毎の助成算定を行う。
010540******************************************************************
010550*
010560     PERFORM 助成負担算定.
010570*
010580*================================================================*
010590 助成負担算定 SECTION.
010600*
010610* 助成分
010620     EVALUATE 負担区分Ｗ
010630*　０：通常請求（全額負担）
010640     WHEN ZERO
010650         MOVE ZERO         TO 連計－負担額助成
010660         MOVE 連計－負担額 TO 連計－請求額助成
010670*　１：初検料(初検料が発生する日)に対する負担率分
010680     WHEN 1
010690* DEBUG
010700*     DISPLAY NC"初検日フラグ" 初検日フラグ UPON MSGBOX
010710*
010720         IF 初検日フラグ NOT = SPACE
010730*           */14年10月以降は乳幼児、高齢者で本体保険の負担率が変わる。1411
010740             IF 連計－施術和暦年月 < 41410
010750                 PERFORM 負担率取得
010760             ELSE
010770                 MOVE 連計－施術和暦 TO 連率－施術和暦
010780                 MOVE 連計－施術年   TO 連率－施術年
010790                 MOVE 連計－施術月   TO 連率－施術月
010800                 MOVE 連計－患者番号 TO 連率－患者番号
010810                 MOVE 連計－枝番     TO 連率－枝番
010820                 CALL   "HUTANRIT"
010830                 CANCEL "HUTANRIT"
010840                 MOVE 連率－実際本体負担率 TO 負担率Ｗ
010850             END-IF
010860             PERFORM 負担額計算初検
010870         ELSE
010880             MOVE ZERO         TO 連計－負担額助成
010890             MOVE 連計－負担額 TO 連計－請求額助成
010900         END-IF
010910*　２：初検料(初検料が発生する日)に対する一定金額
010920     WHEN 2
010930         IF 初検日フラグ NOT = SPACE
010940             MOVE 負担一定金額Ｗ   TO 連計－負担額助成
010950             COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
010960             MOVE 請求額Ｗ         TO 連計－請求額助成
010961             MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
010970         ELSE
010980             MOVE ZERO         TO 連計－負担額助成
010990             MOVE 連計－負担額 TO 連計－請求額助成
011000         END-IF
011010*　３：初検日(初検料の発生する日)の費用額の本体負担率分に対する負担率
011020     WHEN 3
011030         IF 初検日フラグ NOT = SPACE
011040*             PERFORM 負担率取得
011050*           */14年10月以降は乳幼児、高齢者で本体保険の負担率が変わる。1411
011060             IF 連計－施術和暦年月 < 41410
011070                 PERFORM 負担率取得
011080             ELSE
011090                 MOVE 連計－施術和暦 TO 連率－施術和暦
011100                 MOVE 連計－施術年   TO 連率－施術年
011110                 MOVE 連計－施術月   TO 連率－施術月
011120                 MOVE 連計－患者番号 TO 連率－患者番号
011130                 MOVE 連計－枝番     TO 連率－枝番
011140                 CALL   "HUTANRIT"
011150                 CANCEL "HUTANRIT"
011160                 MOVE 連率－実際本体負担率 TO 負担率Ｗ
011170             END-IF
011180* 途中の負担金は、１円単位のまま、助成の計算を行う。
011190* 初検日の費用額の本体負担率分を計算する。
011200             PERFORM 負担額計算助成
011210         ELSE
011220             MOVE ZERO         TO 連計－負担額助成
011230             MOVE 連計－負担額 TO 連計－請求額助成
011240         END-IF
011250*　４：初検日(初検料の発生する日)の費用額の本体負担率分に対する一定金額
011260     WHEN 4
011270         IF 初検日フラグ NOT = SPACE
011280* 途中の負担金は、１円単位のまま、助成の計算を行う。
011290             IF 負担一定金額Ｗ >= 連計－負担額
011300                 MOVE 連計－負担額 TO 連計－負担額助成
011310                 MOVE ZERO         TO 連計－請求額助成
011311*               / 連計日計窓口－負担額は何にもしない /
011321             ELSE
011330                 MOVE 負担一定金額Ｗ  TO 連計－負担額助成
011340                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
011350                 MOVE 請求額Ｗ        TO 連計－請求額助成
011360                 MOVE 負担一定金額Ｗ  TO 連計日計窓口－負担額
011361             END-IF
011370         ELSE
011380             MOVE ZERO         TO 連計－負担額助成
011390             MOVE 連計－負担額 TO 連計－請求額助成
011400         END-IF
011410*　５：毎月一定金額を負担（限度額あり）
011420* 
011430     WHEN 5
011431         PERFORM 助成一部負担算定０５
011433*
011560*　６：毎月一定金額、一定回数を負担
011570* 
011580     WHEN 6
011590     WHEN 8
011600         PERFORM 助成一部負担算定
011610*　７：指定した日の費用額の本体負担率分に対する一定金額
011620* 
011630     WHEN 7
011640         PERFORM 施術記録Ｆ取得
011650         IF 施記－その他計算区分１ = 1
011660             IF 負担一定金額Ｗ >= 連計－負担額
011670*/月計系も１０円単位で負担額を計算する為、負担金計算区分に係わらず１の位を四捨五入する/060512      */ここに来る前に日計と月計で連計負担額に入る金額に差が出来ている。*/130722
      */連計負担額を変更しないため、ここで負担額７Ｗを計算する。        */130722
011680*                 MOVE 連計－負担額 TO 負担額７Ｗ
                       COMPUTE 負担額７Ｗ = 連計－費用額 * 連計－負担率 / 100
011690                 COMPUTE 負担額７Ｗ ROUNDED = 負担額７Ｗ / 10
011700                 COMPUTE 負担額７Ｗ ROUNDED = 負担額７Ｗ * 10
011710                 MOVE 負担額７Ｗ   TO 連計－負担額助成
011720*/↑↑↑まで追加。↓１行コメント/060512
011730*                 MOVE 連計－負担額 TO 連計－負担額助成
011740                 MOVE ZERO         TO 連計－請求額助成
011742*               / 連計日計窓口－負担額は何にもしない /
011750             ELSE
011760                 MOVE 負担一定金額Ｗ  TO 連計－負担額助成
011770                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
011780                 MOVE 請求額Ｗ        TO 連計－請求額助成
011781                MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
011790             END-IF
011800         ELSE
011810             MOVE ZERO         TO 連計－負担額助成
011820             MOVE 連計－負担額 TO 連計－請求額助成
011830         END-IF
011840*/愛知県の乳幼児の対応0109
011850* １１：毎日の費用額に対する負担率
011860     WHEN 11
011870         PERFORM 助成負担額計算１１
011880*
011902         IF 助成負担額Ｗ > 連計－負担額
011903             MOVE 連計－負担額 TO 連計－負担額助成
011904         ELSE
011905             MOVE 助成負担額Ｗ TO 連計－負担額助成
011906         END-IF
011907         COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
011908*
011911* １２：本体負担額を全額負担030717
011920     WHEN 12
011930         MOVE 連計－負担額 TO 連計－負担額助成
011940         MOVE ZERO         TO 連計－請求額助成
011941*       / 連計日計窓口－負担額は何にもしない /
011942*
011950* １３：毎月一定金額、一定回数を負担（１０円単位）
011960     WHEN 13
011970         PERFORM 助成一部負担算定１０
011980*/0506兵庫県の改定170701より
011990* １４：毎月一定金額を一定回数まで負担（手数料を低所得者用負担額とする）
012000     WHEN 14
012010         PERFORM 助成一部負担算定１４
012020*/0708東京都マル子の対応191001より
012030* １５：指定負担率
012040     WHEN 15
012050         PERFORM 助成負担額計算１５
012060         IF 助成負担額Ｗ > 連計－負担額
012070             MOVE 連計－負担額 TO 連計－負担額助成
012080         ELSE
012090             MOVE 助成負担額Ｗ TO 連計－負担額助成
012100         END-IF
012110         COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
012120*/指定負担率で毎月一定金額まで負担（上限あり）（１円単位）
012130     WHEN 16
012140         PERFORM 助成一部負担算定１６
      */神戸市対応/140709
      * １７：指定割合かつ一定金額まで一定回数負担
           WHEN 17
012010         PERFORM 助成一部負担算定１７
012141*
      */秋田県対応/150822
      * 18：本体負担額の指定負担率で１ヶ月の限度額まで負担
           WHEN 18
012010         PERFORM 助成一部負担算定１８
012120*/指定負担率で毎月一定金額まで負担（上限あり）（１０円単位）
012130     WHEN 19
012140         PERFORM 助成一部負担算定１９
      *//20180201
      * 21：本体負担率で限度額まで負担
012130     WHEN 21
012140         PERFORM 助成一部負担算定２１
      */大阪府対応/20180307
      * 22：毎月一定金額で一定回数を限度額まで負担(１円単位)
012130     WHEN 22
012140         PERFORM 助成一部負担算定２２
      */今後作る？↓↓↓
      ** 23：毎月一定金額で一定回数を限度額まで負担(１０円単位)
012130*     WHEN 23
012140*         PERFORM 助成一部負担算定２３
      */今後作る？↑↑↑
      *
      */北海道対応/20180810
012130     WHEN 24
012140         PERFORM 助成一部負担算定２４
      */滋賀県/20191126(14を10に変更)
012130     WHEN 10
012140         PERFORM 助成一部負担算定１０２
012380     WHEN OTHER
012390         MOVE ZERO         TO 連計－負担額助成
012400         MOVE 連計－負担額 TO 連計－請求額助成
012410     END-EVALUATE.
012420*
012430*================================================================*
012440 施術記録Ｆ取得 SECTION.
012450*
012460     MOVE 連計－施術和暦 TO 施記－施術和暦 .
012470     MOVE 連計－施術年   TO 施記－施術年   .
012480     MOVE 連計－施術月   TO 施記－施術月   .
012490     MOVE 連計－施術日   TO 施記－施術日.
012500     MOVE 連計－患者番号 TO 施記－患者番号 .
012510     MOVE 連計－枝番     TO 施記－枝番     .
012520     READ ＥＸ施術記録Ｆ
012530     INVALID KEY
012540*/エラー表示の修正
012550         PERFORM コンソールエラー確認
012560         DISPLAY "施術記録がありません"
012570                 " 受診者№="   連計－患者コード
012580                 " 施術年月日=" 連計－施術年 
012590                   連計－施術月 連計－施術日 UPON CONS
012600*-----------------------------------------*
012610         CALL "actcshm"  WITH C LINKAGE
012620*-----------------------------------------*
012630*         ACCEPT  キー入力 FROM CONS
012640         PERFORM ファイル閉鎖
012650         MOVE ZERO TO PROGRAM-STATUS
012660         EXIT PROGRAM
012670     NOT INVALID KEY
012680         CONTINUE
012690     END-READ.
012700*================================================================*
012710 助成一部負担算定 SECTION.
012720* ［助成］
012730******************************************************************
012740* 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
012750*（月に最大、計Ａ－老人負担回数分）
012760* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
012770* 引続きカウントされる。
012780******************************************************************
012790*
012800* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
012810* 診療した日数を受け継ぐ
012820*
012830     PERFORM 診療回数取得.
012840*
012850* DEBUG
012860*     DISPLAY NC"実日数Ｗ" 実日数Ｗ UPON MSGBOX
012870*     DISPLAY NC"老人負担回数Ｗ" 老人負担回数Ｗ UPON MSGBOX
012880*     DISPLAY NC"連計－負担額" 連計－負担額 UPON MSGBOX
012890*     DISPLAY NC"老人一部負担金Ｗ" 老人一部負担金Ｗ UPON MSGBOX
012900*
012910     IF 実日数Ｗ > 助成負担回数Ｗ
012920         MOVE ZERO         TO 連計－負担額助成
012930         MOVE 連計－負担額 TO 連計－請求額助成
012940     ELSE
012950*
012960         IF 連計－負担額 <= 負担一定金額Ｗ
012970             EVALUATE 連計－負担金計算区分
012980             WHEN ZERO
012990                 MOVE 連計－負担額 TO 連計－負担額助成
013000                 MOVE ZERO         TO 連計－請求額助成
013001*               / 連計日計窓口－負担額は何にもしない /
013010*
013020             WHEN 2
013030                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
013040                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
013050                 MOVE 負担額Ｗ TO 連計－負担額助成
013060                 MOVE ZERO     TO 連計－請求額助成
013061*               / 連計日計窓口－負担額は何にもしない /
013070             WHEN OTHER
013080*/エラー表示の修正
013090                 PERFORM コンソールエラー確認
013100                 DISPLAY "負担金算定区分が指定されていません"
013110                         " 受診者№="   連計－患者コード
013120                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013130*-----------------------------------------*
013140                 CALL "actcshm"  WITH C LINKAGE
013150*-----------------------------------------*
013160*                 ACCEPT  キー入力 FROM CONS
013170                 PERFORM ファイル閉鎖
013180                 MOVE ZERO TO PROGRAM-STATUS
013190                 EXIT PROGRAM
013200             END-EVALUATE
013210*
013220         ELSE
013230             EVALUATE 連計－負担金計算区分
013240             WHEN ZERO
013250* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
013260             WHEN 2
013270                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
013280                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
013290                 MOVE 請求額Ｗ         TO 連計－請求額助成
013291                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
013300*
013310             WHEN OTHER
013320*/エラー表示の修正
013330                 PERFORM コンソールエラー確認
013340                 DISPLAY "負担金算定区分が指定されていません"
013350                         " 受診者№="   連計－患者コード
013360                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013370*-----------------------------------------*
013380                 CALL "actcshm"  WITH C LINKAGE
013390*-----------------------------------------*
013400*                 ACCEPT  キー入力 FROM CONS
013410                 PERFORM ファイル閉鎖
013420                 MOVE ZERO TO PROGRAM-STATUS
013430                 EXIT PROGRAM
013440             END-EVALUATE
013450         END-IF
013460     END-IF.
013470*
013480*
013490*================================================================*
013500*================================================================*
013510 診療回数取得 SECTION.
013520*
013574     IF ( 連計算助成月途中－日計区分 = 1 ) AND ( 連計算助成月途中－助成月途中開始日 NOT = ZERO ) 
013575*      / 日計で助成月途中の時
013581        PERFORM 実日数取得月途中助成
013582     ELSE
013583        PERFORM 診療回数取得通常
013585     END-IF.
013587*
013591*================================================================*
013592 診療回数取得通常 SECTION.
013593*
013594* 保険が変更になった等の場合、当月の中で同患者番号の実日数もカウントする
013595*
013600* 指定月で枝番が存在するかの判定
013601     MOVE 連計－患者番号 TO 受－患者番号.
013602     MOVE 連計－枝番     TO 受－枝番.
013610     MOVE 連計－施術和暦 TO 受－施術和暦.
013620     MOVE 連計－施術年   TO 受－施術年.
013630     MOVE 連計－施術月   TO 受－施術月.
013640*/091202
013650*     START ＥＸ受診者情報Ｆ KEY IS >= 受－患者コード
013660*                                  受－施術和暦年月
013670     START ＥＸ受診者情報Ｆ KEY IS >= 受－施術和暦年月 受－患者コード
013680     END-START.
013690     IF 状態キー = "00"
013700         MOVE SPACE TO 終了フラグ３
013710         MOVE SPACE TO 枝番フラグ
013720         MOVE 連計－患者番号 TO 患者番号Ｗ
013730*/091202↓↓↓
013740         MOVE 連計－施術和暦年月     TO 施術和暦年月Ｗ
013750         MOVE 受－助成種別           TO 助成種別Ｗ３
013760         MOVE 受－費用負担者番号助成 TO 費用負担者番号助成Ｗ３
013770*/091202↑↑↑
013780         PERFORM 受診者情報Ｆ読込
013790         PERFORM UNTIL ( 終了フラグ３   NOT = SPACE ) OR 
013800                       ( 患者番号Ｗ     NOT = 受－患者番号 )
013810*/091202
013820                    OR ( 施術和暦年月Ｗ NOT = 受－施術和暦年月)
013830             IF ( 受－枝番 NOT = SPACE ) AND
013840                ( 受－継続区分 = ZERO  )
013850*/助成種別、負担者番号が違う場合は対象外/091202↓↓↓
013860             AND (受－助成種別           = 助成種別Ｗ３) 
013870             AND (受－費用負担者番号助成 = 費用負担者番号助成Ｗ３)
013880*/091202↑↑↑
013890                 MOVE "YES" TO 枝番フラグ
013900                 MOVE "YES" TO 終了フラグ３
013910             END-IF
013920             PERFORM 受診者情報Ｆ読込
013930         END-PERFORM
013940     END-IF.
013950*
013960     MOVE ZERO  TO 実日数Ｗ.
013970     IF 枝番フラグ NOT = SPACE
013980         PERFORM 前実日数取得
013990         IF 実日数Ｗ <= 助成負担回数Ｗ
014000             PERFORM 実日数取得
014010         END-IF
014020     ELSE
014030         PERFORM 実日数取得
014040     END-IF.
014050*
014060*================================================================*
014070 実日数取得 SECTION.
014080*
014090     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
014100     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
014110     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
014120     MOVE 1               TO  施記－施術日.
014130     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
014140     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
014150*
014160     MOVE 連計－施術日    TO  施術日ＣＷ.
014170*
014180     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
014190     END-START.
014200*
014210     IF 状態キー = "00"
014220         MOVE SPACE TO 終了フラグ３
014230         PERFORM 施術記録Ｆ読込
014240         PERFORM UNTIL ( 施記－施術和暦年月日 > 施術和暦年月日ＣＷ ) OR
014250                       ( 施記－患者コード NOT = 患者コードＣＷ     ) OR
014260                       ( 終了フラグ３     NOT = SPACE              )
014270             COMPUTE 実日数Ｗ = 実日数Ｗ + 1
014280             PERFORM 施術記録Ｆ読込
014290         END-PERFORM
014300     END-IF.
014310*
014320*================================================================*
014321*================================================================*
014322 実日数取得月途中助成 SECTION.
014323*
014324     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
014325     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
014326     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
014337**
014338     MOVE 連計算助成月途中－助成月途中開始日  TO 施記－施術日.
014339**
014341     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
014342     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
014343*
014344     MOVE 連計－施術日    TO  施術日ＣＷ.
014345*
014346     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
014347     END-START.
014348*
014349     IF 状態キー = "00"
014350         MOVE SPACE TO 終了フラグ３
014351         PERFORM 施術記録Ｆ読込
014352         PERFORM UNTIL ( 施記－施術和暦年月日 > 施術和暦年月日ＣＷ ) OR
014353                       ( 施記－患者コード NOT = 患者コードＣＷ     ) OR
014354                       ( 終了フラグ３     NOT = SPACE              )
014355             COMPUTE 実日数Ｗ = 実日数Ｗ + 1
014356             PERFORM 施術記録Ｆ読込
014357         END-PERFORM
014358     END-IF.
014359*
014360*================================================================*
014361*================================================================*
014362 受診者情報Ｆ読込 SECTION.
014363*
014364     READ ＥＸ受診者情報Ｆ NEXT
014370     AT END
014380         MOVE "YES" TO 終了フラグ３
014390     END-READ.
014400*================================================================*
014410*================================================================*
014420 前実日数取得 SECTION.
014430*
014440     PERFORM 初診療日取得.
014450*
014460     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
014470     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.
014480     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
014490     MOVE 1               TO  施記－施術日.
014500     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
014510     MOVE SPACE           TO  施記－枝番.
014520*
014530     MOVE 連計－枝番      TO  枝番ＣＷ.
014540*
014550     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
014560     END-START.
014570*
014580     IF 状態キー = "00"
014590         MOVE SPACE TO 終了フラグ３
014600         PERFORM 施術記録Ｆ読込
014610         PERFORM UNTIL ( 施記－患者番号     NOT = 患者番号ＣＷ     ) OR
014620*/患者コード順にソートされる為年月は順番に並んでいない
014630*                       ( 施記－施術和暦年月 NOT = 施術和暦年月ＣＷ ) OR
014640                       ( 終了フラグ３       NOT = SPACE            )
014650             PERFORM 老人種別取得２
014660             IF ( 施記－患者コード NOT = 患者コードＣＷ ) AND
014670                ( 施記－患者番号       = 患者番号ＣＷ   ) AND
014680                ( 施記－施術和暦年月日 < 初診療年月日ＣＷ ) AND
014690*/患者コード順にソートされる為年月は順番に並んでいない
014700                ( 施記－施術和暦年月  = 施術和暦年月ＣＷ ) AND
014710                ( ( 公費種別Ｗ = 公費種別Ｗ２ ) OR 
014720                  ( 助成種別Ｗ = 助成種別Ｗ２ )         )
      */枝番ありの判定から、自費x・生保h・自賠責a・労災rを除く/160709
                   AND (施記－枝番 NOT = "x" AND "h" AND "a" AND "r")
014730                 COMPUTE 実日数Ｗ = 実日数Ｗ + 1
014740             END-IF
014750             PERFORM 施術記録Ｆ読込
014760         END-PERFORM
014770     END-IF.
014780*
014790* 実日数は、都度カウントする。
014800*     MOVE 実日数Ｗ TO 負－実日数.
014810*
014820*================================================================*
014830 施術記録Ｆ読込 SECTION.
014840*
014850     READ ＥＸ施術記録Ｆ NEXT
014860     AT END
014870         MOVE "YES" TO 終了フラグ３
014880     END-READ.
014890*================================================================*
014900*================================================================*
014910 初診療日取得 SECTION.
014920*
014930* ２．同月・同患者番号・老人保険の場合（親保険の変更等）
014940* 　　で患者コードを変更した場合、その分の実日数もカウントする。
014950*
014960     PERFORM 老人種別取得.
014970     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
014980     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
014990     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
015000     MOVE 1               TO  施記－施術日.
015010     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
015020     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
015030*
015040     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
015050     END-START.
015060*
015070     IF 状態キー = "00"
015080         PERFORM 施術記録Ｆ読込
015090         MOVE 施記－施術和暦年月日 TO 初診療年月日ＣＷ
015100     END-IF.
015110*
015120*================================================================*
015130 老人種別取得 SECTION.
015140*
015150     MOVE 連計－施術和暦   TO 受－施術和暦.
015160     MOVE 連計－施術年     TO 受－施術年.
015170     MOVE 連計－施術月     TO 受－施術月.
015180     MOVE 連計－患者番号   TO 受－患者番号.
015190     MOVE 連計－枝番       TO 受－枝番.
015200     READ ＥＸ受診者情報Ｆ
015210     INVALID KEY
015220         MOVE NC"受診" TO ファイル名Ｗ
015230     NOT INVALID KEY
015240         MOVE 受－公費種別 TO 公費種別Ｗ
015250         MOVE 受－助成種別 TO 助成種別Ｗ
015260     END-READ.
015270*
015280*================================================================*
015290 老人種別取得２ SECTION.
015300*
015310     MOVE 施記－施術和暦   TO 受－施術和暦.
015320     MOVE 施記－施術年     TO 受－施術年.
015330     MOVE 施記－施術月     TO 受－施術月.
015340     MOVE 施記－患者番号   TO 受－患者番号.
015350     MOVE 施記－枝番       TO 受－枝番.
015360     READ ＥＸ受診者情報Ｆ
015370     INVALID KEY
015380         MOVE NC"受診" TO ファイル名Ｗ
015390     NOT INVALID KEY
015400         MOVE 受－公費種別 TO 公費種別Ｗ２
015410         MOVE 受－助成種別 TO 助成種別Ｗ２
015420     END-READ.
015430*
015440*================================================================*
015450 コンソールエラー確認 SECTION.
015460*
015470     IF エラー表示Ｆ = ZERO
015480         MOVE  "エラーが発生したのでコンソール画面の内容" TO 連メ７－メッセージ１
015490         MOVE  "を確認し、修正してください。"             TO 連メ７－メッセージ２
015500         CALL   "MSG007"
015510         CANCEL "MSG007"
015520     END-IF.
015530     MOVE 1 TO エラー表示Ｆ.
015540*================================================================*
015550 受診者情報取得 SECTION.
015560*
015570     MOVE 連計－施術和暦 TO 受－施術和暦.
015580     MOVE 連計－施術年   TO 受－施術年.
015590     MOVE 連計－施術月   TO 受－施術月.
015600     MOVE 連計－患者番号 TO 受－患者番号.
015610     MOVE 連計－枝番     TO 受－枝番.
015620     READ ＥＸ受診者情報Ｆ
015630     INVALID KEY
015640*/エラー表示の修正
015650         PERFORM コンソールエラー確認
015660         DISPLAY "施術月の受診者情報がありません"
015670                 " 受診者№=" 連計－患者コード
015680                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
015690*-----------------------------------------*
015700         CALL "actcshm"  WITH C LINKAGE
015710*-----------------------------------------*
015720*         ACCEPT  キー入力 FROM CONS
015730         PERFORM ファイル閉鎖
015740         MOVE ZERO TO PROGRAM-STATUS
015750         EXIT PROGRAM
015760     END-READ.
015770*================================================================*
015780 助成負担額計算１１ SECTION.
015790*
015800* １１：毎日の費用額に対する負担率
015810****************************************************************
015820* 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
015830* 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
015840*              　　　　 　　　１　　　　１０円単位             *
015850*              　　　　　　　 ２　　　　　１円単位  １０円単位 *
015860****************************************************************
015870*
015880     EVALUATE 連計－負担金計算区分
015890     WHEN ZERO
015900*/小数第一位を四捨五入して１の位まで計算
015910         COMPUTE 負担率中間結果Ｗ     =  助成負担率Ｗ / 100
015920         COMPUTE 助成負担額Ｗ ROUNDED = 連計－費用額 * 負担率中間結果Ｗ
015921*
015922*---10円単位でも計算 ------------------------------------------*
015923         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
015924         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
015925         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
015926         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
015927         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
015928         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
015929*--------------------------------------------------------------*
015930*
015933     WHEN 2
015940*/１の位を四捨五入して１０の位まで計算
015950         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
015960         COMPUTE 助成負担額Ｗ     = 連計－費用額 * 負担率中間結果Ｗ
015970*       /*１の位を四捨五入して１０円単位にする
015980         COMPUTE 助成負担額Ｗ ROUNDED = 助成負担額Ｗ / 10
015990         COMPUTE 助成負担額Ｗ         = 助成負担額Ｗ * 10
016000     END-EVALUATE.
016010*
016020*================================================================*
016030*================================================================*
016040 助成一部負担算定１０ SECTION.
016050* ［助成］
016060******************************************************************
016070* 日毎の費用額の親保険負担率分から助成一部負担金のみを患者負担。
016080*（月に最大、計Ａ－老人負担回数分）
016090* 同一月内で初検日があっても、保険が切り替わっても助成負担回数分は
016100* 引続きカウントされる。
016110******************************************************************
016120*
016130* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
016140* 診療した日数を受け継ぐ
016150*
016160     PERFORM 診療回数取得.
016170*
016180     IF 実日数Ｗ > 助成負担回数Ｗ
016190         MOVE ZERO         TO 連計－負担額助成
016200         MOVE 連計－負担額 TO 連計－請求額助成
016210     ELSE
016220*
016230         IF 連計－負担額 <= 負担一定金額Ｗ
016240             EVALUATE 連計－負担金計算区分
016250*/日々の負担額の合計を月の負担額とする。(毎日四捨五入した金額の合計)
016260             WHEN ZERO
016270             WHEN 2
016280* sano2011/02
016281*                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
016290*                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
016300*                 MOVE 負担額Ｗ TO 連計－負担額助成
016301                 MOVE 連計日計窓口－負担額 TO 連計－負担額助成
016302*
016310                 MOVE ZERO     TO 連計－請求額助成
016320             WHEN OTHER
016330*/エラー表示の修正
016340                 PERFORM コンソールエラー確認
016350                 DISPLAY "負担金算定区分が指定されていません"
016360                         " 受診者№="   連計－患者コード
016370                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
016380*-----------------------------------------*
016390                 CALL "actcshm"  WITH C LINKAGE
016400*-----------------------------------------*
016410*                 ACCEPT  キー入力 FROM CONS
016420                 PERFORM ファイル閉鎖
016430                 MOVE ZERO TO PROGRAM-STATUS
016440                 EXIT PROGRAM
016450             END-EVALUATE
016460*
016470         ELSE
016480             EVALUATE 連計－負担金計算区分
016490             WHEN ZERO
016500*/ 設定された金額をそのまま転記する。
016510             WHEN 2
016520                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
016530                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
016540                 MOVE 請求額Ｗ         TO 連計－請求額助成
016541                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
016550*
016560             WHEN OTHER
016570*/エラー表示の修正
016580                 PERFORM コンソールエラー確認
016590                 DISPLAY "負担金算定区分が指定されていません"
016600                         " 受診者№="   連計－患者コード
016610                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
016620*-----------------------------------------*
016630                 CALL "actcshm"  WITH C LINKAGE
016640*-----------------------------------------*
016650*                 ACCEPT  キー入力 FROM CONS
016660                 PERFORM ファイル閉鎖
016670                 MOVE ZERO TO PROGRAM-STATUS
016680                 EXIT PROGRAM
016690             END-EVALUATE
016700         END-IF
016710     END-IF.
016720*
016730*================================================================*
016740 助成一部負担算定１４ SECTION.
016750* ［助成］
016760******************************************************************
016770* 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
016780*（月に最大、計Ａ－老人負担回数分）
016790* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
016800* 引続きカウントされる。
016810* １７年７月からの兵庫の改定に対応。(低所得者は低い単価(手数料の項目)で計算する)
016820******************************************************************
016830*
016840* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
016850* 診療した日数を受け継ぐ
016860*
016870     PERFORM 診療回数取得.
016880*
016890*/助成負担金免除：９ なら、低所得者用の負担額を使う
016900     MOVE 連計－施術和暦 TO 受－施術和暦.
016910     MOVE 連計－施術年   TO 受－施術年.
016920     MOVE 連計－施術月   TO 受－施術月.
016930     MOVE 連計－患者番号 TO 受－患者番号.
016940     MOVE 連計－枝番     TO 受－枝番.
016950     READ ＥＸ受診者情報Ｆ
016960     INVALID KEY
016970*/エラー表示の修正
016980         PERFORM コンソールエラー確認
016990         DISPLAY "施術月の受診者情報がありません"
017000                 " 受診者№=" 連計－患者コード
017010                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
017020*-----------------------------------------*
017030         CALL "actcshm"  WITH C LINKAGE
017040*-----------------------------------------*
017050*         ACCEPT  キー入力 FROM CONS
017060         PERFORM ファイル閉鎖
017070         MOVE ZERO TO PROGRAM-STATUS
017080         EXIT PROGRAM
017090     NOT INVALID KEY
017100         IF 受－助成負担金免除 = 9
017110             MOVE 事務手数料Ｗ TO 負担一定金額Ｗ
017120         END-IF
017130*/21年7月より経過措置(２年間)090625
017140*         IF 受－助成負担金免除 = 8
017150*             EVALUATE 受－助成種別
017160*             WHEN 52
017170*             WHEN 53
017180*                 MOVE  900 TO 負担一定金額Ｗ
017190*             WHEN 55
017200*                 MOVE 1200 TO 負担一定金額Ｗ
017210*             END-EVALUATE
017220*         END-IF
017230     END-READ.
017240*
017250     IF 実日数Ｗ > 助成負担回数Ｗ
017260         MOVE ZERO         TO 連計－負担額助成
017270         MOVE 連計－負担額 TO 連計－請求額助成
017280     ELSE
017290*
017300         IF 連計－負担額 <= 負担一定金額Ｗ
017310             EVALUATE 連計－負担金計算区分
017320             WHEN ZERO
017330                 MOVE 連計－負担額 TO 連計－負担額助成
017340                 MOVE ZERO         TO 連計－請求額助成
017341*               / 連計日計窓口－負担額は何にもしない /
017350*
017360             WHEN 2
017370                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
017380                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
017390                 MOVE 負担額Ｗ TO 連計－負担額助成
017400                 MOVE ZERO     TO 連計－請求額助成
017401*               / 連計日計窓口－負担額は何にもしない /
017410             WHEN OTHER
017420*/エラー表示の修正
017430                 PERFORM コンソールエラー確認
017440                 DISPLAY "負担金算定区分が指定されていません"
017450                         " 受診者№="   連計－患者コード
017460                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
017470*-----------------------------------------*
017480                 CALL "actcshm"  WITH C LINKAGE
017490*-----------------------------------------*
017500*                 ACCEPT  キー入力 FROM CONS
017510                 PERFORM ファイル閉鎖
017520                 MOVE ZERO TO PROGRAM-STATUS
017530                 EXIT PROGRAM
017540             END-EVALUATE
017550*
017560         ELSE
017570             EVALUATE 連計－負担金計算区分
017580             WHEN ZERO
017590* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
017600             WHEN 2
017610                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
017620                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
017630                 MOVE 請求額Ｗ       TO 連計－請求額助成
017631                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
017640*
017650             WHEN OTHER
017660*/エラー表示の修正
017670                 PERFORM コンソールエラー確認
017680                 DISPLAY "負担金算定区分が指定されていません"
017690                         " 受診者№="   連計－患者コード
017700                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
017710*-----------------------------------------*
017720                 CALL "actcshm"  WITH C LINKAGE
017730*-----------------------------------------*
017740*                 ACCEPT  キー入力 FROM CONS
017750                 PERFORM ファイル閉鎖
017760                 MOVE ZERO TO PROGRAM-STATUS
017770                 EXIT PROGRAM
017780             END-EVALUATE
017790         END-IF
017800     END-IF.
017810*
017820*================================================================*
017830*================================================================*
017840 助成負担額計算１５ SECTION.
017850*
017860* １５：指定負担率
017870****************************************************************
017880* 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
017890* 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
017900*              　　　　 　　　１　　　　１０円単位             *
017910*              　　　　　　　 ２　　　　　１円単位  １０円単位 *
017920****************************************************************
017930*
017940     EVALUATE 連計－負担金計算区分
017950     WHEN ZERO
017960*/負担額は、小数点以下第１位を切り上げる
017970         COMPUTE 負担率中間結果Ｗ = 助成負担率Ｗ / 100
017980         COMPUTE 助成負担額Ｗ     = 連計－費用額 * 負担率中間結果Ｗ + 0.9
017981*
017982*---10円単位でも計算 ------------------------------------------*
017983         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
017984         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
017985         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
017986         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
017987         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
017989*
017990         IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
017993             MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
017995         END-IF
017998*--------------------------------------------------------------*
017999*
018000     WHEN 2
018001*/１の位を四捨五入して１０の位まで計算
018010         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
018020         COMPUTE 助成負担額Ｗ     = 連計－費用額 * 負担率中間結果Ｗ
018030*       /*１の位を四捨五入して１０円単位にする
018040         COMPUTE 助成負担額Ｗ ROUNDED = 助成負担額Ｗ / 10
018050         COMPUTE 助成負担額Ｗ         = 助成負担額Ｗ * 10
018060     END-EVALUATE.
018070*
018071*================================================================*
018072 助成一部負担算定０５ SECTION.
018073* ［助成］
018080*
018081* 負担一定金額Ｗに上限１（低い金額）、事務手数料Ｗに上限２（高い金額）が入っている。
018089*
018090*/助成負担金免除：９ なら、事務手数料の負担額を使う
018091     MOVE 連計－施術和暦 TO 受－施術和暦.
018092     MOVE 連計－施術年   TO 受－施術年.
018093     MOVE 連計－施術月   TO 受－施術月.
018094     MOVE 連計－患者番号 TO 受－患者番号.
018095     MOVE 連計－枝番     TO 受－枝番.
018096     READ ＥＸ受診者情報Ｆ
018097     INVALID KEY
018098*/エラー表示の修正
018099         PERFORM コンソールエラー確認
018100         DISPLAY "施術月の受診者情報がありません"
018101                 " 受診者№=" 連計－患者コード
018102                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018103*-----------------------------------------*
018104         CALL "actcshm"  WITH C LINKAGE
018105*-----------------------------------------*
018106*         ACCEPT  キー入力 FROM CONS
018107         PERFORM ファイル閉鎖
018108         MOVE ZERO TO PROGRAM-STATUS
018109         EXIT PROGRAM
018110     NOT INVALID KEY
018111         EVALUATE 受－助成負担金免除
018113         WHEN ZERO
018114             MOVE 負担一定金額Ｗ TO 計算限度額Ｗ
018115         WHEN 1
018116             MOVE ZERO           TO 計算限度額Ｗ
018117         WHEN 9
018118             MOVE 事務手数料Ｗ   TO 計算限度額Ｗ
018119         WHEN OTHER
018120             MOVE 負担一定金額Ｗ TO 計算限度額Ｗ
018121         END-EVALUATE
018122     END-READ.
018123*
018131*****
018132*    月計の時、累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
018133*              限度額を超えている時は､限度額を連計－負担額助成に。
018134*            ※連計算助成累計額－枝番負担累計額も考慮
018142     IF 連計算助成月途中－日計区分 = ZERO
018144        IF 連計算助成累計額－枝番負担累計額 = ZERO
018150           IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018151               MOVE 連計－負担額 TO 連計－負担額助成
018152               MOVE ZERO         TO 連計－請求額助成
018153           ELSE
018154               MOVE 計算限度額Ｗ TO 連計－負担額助成
018155               COMPUTE 連計－請求額助成 = 連計－負担額 - 計算限度額Ｗ
018156           END-IF
018157        ELSE
018159           IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018160               MOVE 連計－負担額 TO 連計－負担額助成
018161               MOVE ZERO         TO 連計－請求額助成
018162           ELSE
018164               COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018165               COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018166           END-IF
018177        END-IF
018178     ELSE
018179*
018180*       / 日計 /
018181        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
018182            MOVE ZERO         TO 連計－負担額助成
018183            MOVE 連計－負担額 TO 連計－請求額助成
018184        ELSE
018185*
018186             EVALUATE 連計－負担金計算区分
018187             WHEN ZERO
018188             WHEN 2
018189                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
018190                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
018191                 MOVE 負担額Ｗ TO 連計－負担額助成
018192                 MOVE ZERO     TO 連計－請求額助成
018193*                / 連計日計窓口－負担額は何にもしない /
018194**
018195                 COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 負担額Ｗ
018196                 IF  計算用累計額Ｗ > 計算限度額Ｗ
018197                     COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
018198                     COMPUTE 連計－請求額助成 = 負担額Ｗ - 連計－負担額助成
018199*                    / 上限を超える時、連計日計窓口－負担額セット /
018200                     MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018201                 END-IF
018202             END-EVALUATE
018203        END-IF
018204*
018205     END-IF.
018206*
018216*================================================================*
018217*================================================================*
      */負担区分１６から１９に変更
018218* 助成一部負担算定１６ SECTION.
018218 助成一部負担算定１９ SECTION.
018219* ［助成］
018220*
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
018266*****
018278*
018279*****
018280*    月計の時、本体の負担率と助成の負担率が同じ時、
018282*    　　　　　累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
018283*              限度額を超えている時は､限度額を連計－負担額助成に。
018284*              負担率が違うときは、累計額を連計－負担額助成に。
018285*            ※連計算助成累計額－枝番負担累計額も考慮
018286     IF 連計算助成月途中－日計区分 = ZERO
018287        IF 連計算助成累計額－枝番負担累計額 = ZERO
018288           IF 連計－負担率 = 助成負担率Ｗ
018289              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018290                  MOVE 連計－負担額 TO 連計－負担額助成
018291                  MOVE ZERO         TO 連計－請求額助成
018292              ELSE
018293                  MOVE 計算限度額Ｗ TO 連計－負担額助成
018294                  COMPUTE 連計－請求額助成 = 連計－負担額 - 計算限度額Ｗ
018295              END-IF
018296           ELSE
018298              MOVE 連計算助成累計額－負担額助成 TO 連計－負担額助成
018299              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計算助成累計額－負担額助成
018307           END-IF
018309        ELSE
018311           IF 連計－負担率 = 助成負担率Ｗ
018312              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018313                  MOVE 連計－負担額 TO 連計－負担額助成
018314                  MOVE ZERO         TO 連計－請求額助成
018315              ELSE
018318                  COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018319                  COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018320              END-IF
018321           ELSE
018322              COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018323              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018328           END-IF
018331        END-IF
018332     ELSE
018356*
018357*    / 日計 /
018358        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
018359            MOVE ZERO         TO 連計－負担額助成
018360            MOVE 連計－負担額 TO 連計－請求額助成
018361        ELSE
018362*
018363*---10円単位計算 ------------------------------------------*
018364            MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
018365            COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
018366            COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
018367            COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
018368            COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
018369*
018370            IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
018371                MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
018372            END-IF
018373*
018374            MOVE 負担額日計窓口Ｗ TO 助成負担額Ｗ
018375*--------------------------------------------------------------*
018376            IF 助成負担額Ｗ > 連計日計窓口－負担額
018377                MOVE 連計日計窓口－負担額 TO 連計－負担額助成
018378            ELSE
018379                MOVE 助成負担額Ｗ         TO 連計－負担額助成
018380            END-IF
018381            COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018382**
018383            COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 助成負担額Ｗ
018384            IF  計算用累計額Ｗ > 計算限度額Ｗ
018385                COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
018386                COMPUTE 連計－請求額助成 = 助成負担額Ｗ - 連計－負担額助成
018387*            / 上限を超える時、連計日計窓口－負担額セット /
018388                MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018389            END-IF
018390**
018391        END-IF
018392     END-IF.
018393*
018394*================================================================*
016740 助成一部負担算定１７ SECTION.
016750* ［助成］
016760******************************************************************
016770* 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
016780*（月に最大、計Ａ－老人負担回数分）
016790* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
016800* 引続きカウントされる。
016810* １７年７月からの兵庫の改定に対応。(低所得者は低い単価(手数料の項目)で計算する)
016820******************************************************************
016830*
016840* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
016850* 診療した日数を受け継ぐ
016860*
016870     PERFORM 診療回数取得.
016880*
016890*/助成負担金免除：９ なら、低所得者用の負担額を使う
016900     MOVE 連計－施術和暦 TO 受－施術和暦.
016910     MOVE 連計－施術年   TO 受－施術年.
016920     MOVE 連計－施術月   TO 受－施術月.
016930     MOVE 連計－患者番号 TO 受－患者番号.
016940     MOVE 連計－枝番     TO 受－枝番.
016950     READ ＥＸ受診者情報Ｆ
016960     INVALID KEY
016970*/エラー表示の修正
016980         PERFORM コンソールエラー確認
016990         DISPLAY "施術月の受診者情報がありません"
017000                 " 受診者№=" 連計－患者コード
017010                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
017020*-----------------------------------------*
017030         CALL "actcshm"  WITH C LINKAGE
017040*-----------------------------------------*
017050*         ACCEPT  キー入力 FROM CONS
017060         PERFORM ファイル閉鎖
017070         MOVE ZERO TO PROGRAM-STATUS
017080         EXIT PROGRAM
017090     NOT INVALID KEY
017100         IF 受－助成負担金免除 = 9
017110             MOVE 事務手数料Ｗ TO 負担一定金額Ｗ
017120         END-IF
017230     END-READ.
017240*
      */指定負担率で負担額を求める/
012050         PERFORM 助成負担額計算１５
012060         IF 助成負担額Ｗ > 連計－負担額
012070             MOVE 連計－負担額 TO 連計－負担額助成
012080         ELSE
012090             MOVE 助成負担額Ｗ TO 連計－負担額助成
012100         END-IF
017250     IF 実日数Ｗ > 助成負担回数Ｗ
017260         MOVE ZERO         TO 連計－負担額助成
017270**         MOVE 連計－負担額 TO 連計－請求額助成
017280     ELSE
017290*
017300**         IF 連計－負担額 <= 負担一定金額Ｗ
017300         IF 連計－負担額助成 <= 負担一定金額Ｗ
017310             EVALUATE 連計－負担金計算区分
017320             WHEN ZERO
017330**                 MOVE 連計－負担額 TO 連計－負担額助成
017340                 MOVE ZERO         TO 連計－請求額助成
017341*               / 連計日計窓口－負担額は何にもしない /
017350*
017360             WHEN 2
017370**                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
017370                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額助成 / 10
017380                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
017390                 MOVE 負担額Ｗ TO 連計－負担額助成
017400                 MOVE ZERO     TO 連計－請求額助成
017401*               / 連計日計窓口－負担額は何にもしない /
017410             WHEN OTHER
017420*/エラー表示の修正
017430                 PERFORM コンソールエラー確認
017440                 DISPLAY "負担金算定区分が指定されていません"
017450                         " 受診者№="   連計－患者コード
017460                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
017470*-----------------------------------------*
017480                 CALL "actcshm"  WITH C LINKAGE
017490*-----------------------------------------*
017500*                 ACCEPT  キー入力 FROM CONS
017510                 PERFORM ファイル閉鎖
017520                 MOVE ZERO TO PROGRAM-STATUS
017530                 EXIT PROGRAM
017540             END-EVALUATE
017550*
017560         ELSE
017570             EVALUATE 連計－負担金計算区分
017580             WHEN ZERO
017590* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
017600             WHEN 2
017610                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
017620**                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
017620                 COMPUTE 請求額Ｗ = 連計－負担額助成 - 負担一定金額Ｗ
017630                 MOVE 請求額Ｗ       TO 連計－請求額助成
017631                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
017640*
017650             WHEN OTHER
017660*/エラー表示の修正
017670                 PERFORM コンソールエラー確認
017680                 DISPLAY "負担金算定区分が指定されていません"
017690                         " 受診者№="   連計－患者コード
017700                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
017710*-----------------------------------------*
017720                 CALL "actcshm"  WITH C LINKAGE
017730*-----------------------------------------*
017740*                 ACCEPT  キー入力 FROM CONS
017750                 PERFORM ファイル閉鎖
017760                 MOVE ZERO TO PROGRAM-STATUS
017770                 EXIT PROGRAM
017780             END-EVALUATE
017790         END-IF
017800     END-IF.
017810*
017820*================================================================*
018218 助成一部負担算定１８ SECTION.
018219* ［助成］
018220*
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
018266*****
018278*
018279*****
018280*    月計の時、本体の負担率と助成の負担率が同じ時、
018282*    　　　　　累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
018283*              限度額を超えている時は､限度額を連計－負担額助成に。
018284*              負担率が違うときは、累計額を連計－負担額助成に。
018285*            ※連計算助成累計額－枝番負担累計額も考慮
018286     IF 連計算助成月途中－日計区分 = ZERO
018287        IF 連計算助成累計額－枝番負担累計額 = ZERO
018288           IF 連計－負担率 = 助成負担率Ｗ
018289              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018290                  MOVE 連計－負担額 TO 連計－負担額助成
018291                  MOVE ZERO         TO 連計－請求額助成
018292              ELSE
018293                  MOVE 計算限度額Ｗ TO 連計－負担額助成
018294                  COMPUTE 連計－請求額助成 = 連計－負担額 - 計算限度額Ｗ
018295              END-IF
018296           ELSE
018298              MOVE 連計算助成累計額－負担額助成 TO 連計－負担額助成
018299              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計算助成累計額－負担額助成
018307           END-IF
018309        ELSE
018311           IF 連計－負担率 = 助成負担率Ｗ
018312              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018313                  MOVE 連計－負担額 TO 連計－負担額助成
018314                  MOVE ZERO         TO 連計－請求額助成
018315              ELSE
018318                  COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018319                  COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018320              END-IF
018321           ELSE
018322              COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018323              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018328           END-IF
018331        END-IF
018332     ELSE
018356*
018357*    / 日計 /
018358        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
018359            MOVE ZERO         TO 連計－負担額助成
018360            MOVE 連計－負担額 TO 連計－請求額助成
018361        ELSE
018362*
011090            MOVE 連計－施術和暦 TO 連率－施術和暦
011100            MOVE 連計－施術年   TO 連率－施術年
011110            MOVE 連計－施術月   TO 連率－施術月
011120            MOVE 連計－患者番号 TO 連率－患者番号
011130            MOVE 連計－枝番     TO 連率－枝番
011140            CALL   "HUTANRIT"
011150            CANCEL "HUTANRIT"
011160            MOVE 連率－実際本体負担率 TO 負担率Ｗ
      *
018363*---10円単位計算 ------------------------------------------*
018364            MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
018365*            COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
017970            COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100 * 助成負担率Ｗ / 100
018366            COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
018367            COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
018368            COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
018369*
018370            IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
018371                MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
018372            END-IF
018373*
018374            MOVE 負担額日計窓口Ｗ TO 助成負担額Ｗ
018375*--------------------------------------------------------------*
018376            IF 助成負担額Ｗ > 連計日計窓口－負担額
018377                MOVE 連計日計窓口－負担額 TO 連計－負担額助成
018378            ELSE
018379                MOVE 助成負担額Ｗ         TO 連計－負担額助成
018380            END-IF
018381            COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018382**
018383            COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 助成負担額Ｗ
018384            IF  計算用累計額Ｗ > 計算限度額Ｗ
018385                COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
018386                COMPUTE 連計－請求額助成 = 助成負担額Ｗ - 連計－負担額助成
018387*            / 上限を超える時、連計日計窓口－負担額セット /
018388                MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018389            END-IF
018390**
018391        END-IF
018392     END-IF.
018393*
018394*================================================================*
018217*================================================================*
018218 助成一部負担算定１６ SECTION.
018219* ［助成］
018220*
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
018266*****
018278*
018279*****
018280*    月計の時、本体の負担率と助成の負担率が同じ時、
018282*    　　　　　累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
018283*              限度額を超えている時は､限度額を連計－負担額助成に。
018284*              負担率が違うときは、累計額を連計－負担額助成に。
018285*            ※連計算助成累計額－枝番負担累計額も考慮
018286     IF 連計算助成月途中－日計区分 = ZERO
      */月の助成負担額を月の合計から求める/160711
      */負担額は、小数点以下第１位を切り上げる
               COMPUTE 助成負担額Ｗ  = 連計－費用額 * 助成負担率Ｗ / 100 + 0.9
               IF 助成負担額Ｗ > 連計－負担額
                   MOVE 連計－負担額 TO 連計－負担額助成
               ELSE
                   MOVE 助成負担額Ｗ TO 連計－負担額助成
               END-IF
018289         IF 連計－負担額助成 >= 計算限度額Ｗ
018293             MOVE 計算限度額Ｗ TO 連計－負担額助成
018295         END-IF
               COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
      */月の助成負担額を月の合計から求める。以下コメント↓↓↓/160711
018287*        IF 連計算助成累計額－枝番負担累計額 = ZERO
018288*           IF 連計－負担率 = 助成負担率Ｗ
018289*              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018290*                  MOVE 連計－負担額 TO 連計－負担額助成
018291*                  MOVE ZERO         TO 連計－請求額助成
018292*              ELSE
018293*                  MOVE 計算限度額Ｗ TO 連計－負担額助成
018294*                  COMPUTE 連計－請求額助成 = 連計－負担額 - 計算限度額Ｗ
018295*              END-IF
018296*           ELSE
018298*              MOVE 連計算助成累計額－負担額助成 TO 連計－負担額助成
018299*              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計算助成累計額－負担額助成
018307*           END-IF
018309*        ELSE
018311*           IF 連計－負担率 = 助成負担率Ｗ
018312*              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
018313*                  MOVE 連計－負担額 TO 連計－負担額助成
018314*                  MOVE ZERO         TO 連計－請求額助成
018315*              ELSE
018318*                  COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018319*                  COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018320*              END-IF
018321*           ELSE
018322*              COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018323*              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018328*           END-IF
018331*        END-IF
      */月の助成負担額を月の合計から求める。以上コメント↑↑↑/160711
018332     ELSE
018356*
018357*    / 日計 /
018358        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
018359            MOVE ZERO         TO 連計－負担額助成
018360            MOVE 連計－負担額 TO 連計－請求額助成
018361        ELSE
018362*
018363*---10円単位計算 ------------------------------------------*
018364            MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
018365            COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
018366            COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
018367            COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
018368            COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
018369*
018370            IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
018371                MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
018372            END-IF
018373*
018374            MOVE 負担額日計窓口Ｗ TO 助成負担額Ｗ
018375*--------------------------------------------------------------*
018376            IF 助成負担額Ｗ > 連計日計窓口－負担額
018377                MOVE 連計日計窓口－負担額 TO 連計－負担額助成
018378            ELSE
018379                MOVE 助成負担額Ｗ         TO 連計－負担額助成
018380            END-IF
018381            COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018382**
018383            COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 助成負担額Ｗ
018384            IF  計算用累計額Ｗ > 計算限度額Ｗ
018385                COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
018386                COMPUTE 連計－請求額助成 = 助成負担額Ｗ - 連計－負担額助成
018387*            / 上限を超える時、連計日計窓口－負担額セット /
018388                MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018389            END-IF
018390**
018391        END-IF
018392     END-IF.
018393*
018394*================================================================*
018218 助成一部負担算定２１ SECTION.
018219* ［助成］
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
018357*    / 日計 /
018358     IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
018359         MOVE ZERO         TO 連計－負担額助成
018360         MOVE 連計－負担額 TO 連計－請求額助成
018361     ELSE
012970         EVALUATE 連計－負担金計算区分
012980         WHEN ZERO
      *１円単位
012990*             MOVE 連計－負担額 TO 連計－負担額助成
013000*             MOVE ZERO         TO 連計－請求額助成
013001*           / 連計日計窓口－負担額は何にもしない /
013010*
013020         WHEN 2
013030             COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
013040             COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
013050             MOVE 負担額Ｗ TO 連計－負担額助成
013060             MOVE ZERO     TO 連計－請求額助成
013061*           / 連計日計窓口－負担額は何にもしない /
013070         WHEN OTHER
013080*/エラー表示の修正
013090             PERFORM コンソールエラー確認
013100             DISPLAY "負担金算定区分が指定されていません"
013110                     " 受診者№="   連計－患者コード
013120                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013130*-------------------------------------*
013140             CALL "actcshm"  WITH C LINKAGE
013150*-------------------------------------*
013160*             ACCEPT  キー入力 FROM CONS
013170             PERFORM ファイル閉鎖
013180             MOVE ZERO TO PROGRAM-STATUS
013190             EXIT PROGRAM
013200         END-EVALUATE
           END-IF.
      *
018358     IF 連計算助成累計額－負担額助成 + 連計－負担額助成 >= 計算限度額Ｗ
               COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
               COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018388         MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018361     END-IF.
018394*================================================================*
018218 助成一部負担算定２２ SECTION.
018219* ［助成］
012730******************************************************************
012760* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
012770* 引続きカウントされる。
012780******************************************************************
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
012790*
012800* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
012810* 診療した日数を受け継ぐ
012820*
012830     PERFORM 診療回数取得.
012840*
012910     IF 実日数Ｗ > 助成負担回数Ｗ
012920         MOVE ZERO         TO 連計－負担額助成
012930         MOVE 連計－負担額 TO 連計－請求額助成
012940     ELSE
012950*
018357*    / 日計 /
018358         IF 連計算助成累計額－負担額助成１０ >= 計算限度額Ｗ
018359             MOVE ZERO         TO 連計－負担額助成
018360             MOVE 連計－負担額 TO 連計－請求額助成
018361         ELSE
018362*
012960         IF 連計－負担額 <= 負担一定金額Ｗ
012970             EVALUATE 連計－負担金計算区分
012980             WHEN ZERO
      *１円単位
012990                 MOVE 連計－負担額 TO 連計－負担額助成
013000                 MOVE ZERO         TO 連計－請求額助成
013001*               / 連計日計窓口－負担額は何にもしない /
013010*
013020             WHEN 2
013030                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
013040                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
013050                 MOVE 負担額Ｗ TO 連計－負担額助成
013060                 MOVE ZERO     TO 連計－請求額助成
013061*               / 連計日計窓口－負担額は何にもしない /
013070             WHEN OTHER
013080*/エラー表示の修正
013090                 PERFORM コンソールエラー確認
013100                 DISPLAY "負担金算定区分が指定されていません"
013110                         " 受診者№="   連計－患者コード
013120                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013130*-----------------------------------------*
013140                 CALL "actcshm"  WITH C LINKAGE
013150*-----------------------------------------*
013160*                 ACCEPT  キー入力 FROM CONS
013170                 PERFORM ファイル閉鎖
013180                 MOVE ZERO TO PROGRAM-STATUS
013190                 EXIT PROGRAM
013200             END-EVALUATE
013210*
013220         ELSE
013230             EVALUATE 連計－負担金計算区分
013240             WHEN ZERO
013250* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
013260             WHEN 2
013270                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
013280                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
013290                 MOVE 請求額Ｗ         TO 連計－請求額助成
013291                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
013300*
013310             WHEN OTHER
013320*/エラー表示の修正
013330                 PERFORM コンソールエラー確認
013340                 DISPLAY "負担金算定区分が指定されていません"
013350                         " 受診者№="   連計－患者コード
013360                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013370*-----------------------------------------*
013380                 CALL "actcshm"  WITH C LINKAGE
013390*-----------------------------------------*
013400*                 ACCEPT  キー入力 FROM CONS
013410                 PERFORM ファイル閉鎖
013420                 MOVE ZERO TO PROGRAM-STATUS
013430                 EXIT PROGRAM
013440             END-EVALUATE
013450         END-IF
      */限度額を超える日の処理
018358*             IF 連計算助成累計額－負担額助成 + 連計－負担額助成 >= 計算限度額Ｗ
018358             IF 連計算助成累計額－負担額助成１０ + 連計日計窓口－負担額 >= 計算限度額Ｗ
                       COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成１０
                       COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018388                 MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018361             END-IF
013450         END-IF
013460     END-IF.
013470*
013480*
018358     IF 連計算助成累計額－負担額助成１０ < 計算限度額Ｗ
HILO           COMPUTE 連計算助成累計額－負担額助成１０ = 連計算助成累計額－負担額助成１０ + 連計日計窓口－負担額
HILO       END-IF.
HILO  *     DISPLAY "HUJ-8 連計日計窓口－負担額 " 連計日計窓口－負担額 " 累計" 連計算助成累計額－負担額助成１０
018394*================================================================*
012140 助成一部負担算定２４ SECTION.
      *
018111     EVALUATE 受－助成負担金免除
018113     WHEN ZERO
010930         IF 初検日フラグ NOT = SPACE
010940             MOVE 負担一定金額Ｗ   TO 連計－負担額助成
010950             COMPUTE 請求額Ｗ = 連計－負担額 - 負担一定金額Ｗ
010960             MOVE 請求額Ｗ         TO 連計－請求額助成
010961             MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
010970         ELSE
010980             MOVE ZERO         TO 連計－負担額助成
010990             MOVE 連計－負担額 TO 連計－請求額助成
011000         END-IF
018113     WHEN 1
               CONTINUE
018113     WHEN 2
012050         PERFORM 助成負担額計算１５
012060         IF 助成負担額Ｗ > 連計－負担額
012070             MOVE 連計－負担額 TO 連計－負担額助成
012080         ELSE
012090             MOVE 助成負担額Ｗ TO 連計－負担額助成
012100         END-IF
012110         COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
           END-EVALUATE.
018394*================================================================*
018217*================================================================*
018218 助成一部負担算定１０２ SECTION.
018219* ［助成］
018280*    月計の時、本体の負担率と助成の負担率が同じ時、
018282*    　　　　　累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
018283*              限度額を超えている時は､限度額を連計－負担額助成に。
018284*              負担率が違うときは、累計額を連計－負担額助成に。
018285*            ※連計算助成累計額－枝番負担累計額も考慮
018286     IF 連計算助成月途中－日計区分 = ZERO
018287        IF 連計算助成累計額－枝番負担累計額 = ZERO
018288           IF 連計－負担率 = 助成負担率Ｗ
018290               MOVE 連計－負担額 TO 連計－負担額助成
018291               MOVE ZERO         TO 連計－請求額助成
018296           ELSE
018298              MOVE 連計算助成累計額－負担額助成 TO 連計－負担額助成
018299              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計算助成累計額－負担額助成
018307           END-IF
018309        ELSE
018311           IF 連計－負担率 = 助成負担率Ｗ
018313               MOVE 連計－負担額 TO 連計－負担額助成
018314               MOVE ZERO         TO 連計－請求額助成
018321           ELSE
018322              COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
018323              COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018328           END-IF
018331        END-IF
018332     ELSE
018356*
018357*    / 日計 /
018363*---10円単位計算 ------------------------------------------*
018364         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
018365         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
018366         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
018367         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
018368         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
018369*
018370         IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
018371             MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
018372         END-IF
018373*
018374         MOVE 負担額日計窓口Ｗ TO 助成負担額Ｗ
018375*-----------------------------------------------------------*
018376         IF 助成負担額Ｗ > 連計日計窓口－負担額
018377             MOVE 連計日計窓口－負担額 TO 連計－負担額助成
018378         ELSE
018379             MOVE 助成負担額Ｗ         TO 連計－負担額助成
018380         END-IF
018381         COMPUTE 連計－請求額助成 = 連計－負担額 - 連計－負担額助成
018382**
018383         COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 助成負担額Ｗ
018392     END-IF.
018393*
018394*================================================================*
018396******************************************************************
018397 END PROGRAM HUJ9709.
018398******************************************************************
