000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             HUR0210.
000060 AUTHOR.                 山田 浩之
000070*
000080*----------------------------------------------------------------*
000090*         負担額［老人・４１老人］計算プログラム
000100*                     　日計処理［老人用］（柔）
000110*         MED = 
000120* 平成１４年１０月分請求から使用開始(予定)定率制のみ。負担率は１割２割。*0210
000130* 「月の費用額」に負担割合１割、２割をかけて負担額を算出するように変更*02102
000140*----------------------------------------------------------------*
000150* ☆注意☆
000160* 費用額の計算が終了している前提のプログラム
000170* 連計－費用額
000180* 連計－負担額
000190* 連計－請求額
000200* 上記３項目に値が代入済
000201*----------------------------------------------------------------*
000202*----------------------------------------------------------------*
000203*----------------------------------------------------------------*
000204* ※※※※※　重要　※※※※※※
000205*
000206* 公費種別 = 0 で、41老人・41に準ずる(負担区分 09 OR 10) は、健保負担額計算済み
000207* (連計日計窓口－負担額がセット済み）
000208*
000209* 公費種別 = 05 助成有り無しともに、健保負担額CALLなしのため、連計日計窓口－負担額が未
000210*　⇒このPGでセット
000211*
000212* 助成ありの時、助成負担算定 SECTIONは、HUJXXXXと同じようにする。.
000213*
000214*----------------------------------------------------------------*
000220 DATE-WRITTEN.           1997-12-21
000230 DATE-COMPILED.          1997-12-21
000240*----------------------------------------------------------------*
000250******************************************************************
000260*            ENVIRONMENT         DIVISION                        *
000270******************************************************************
000280 ENVIRONMENT             DIVISION.
000290 CONFIGURATION           SECTION.
000300 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000310 OBJECT-COMPUTER.        FMV-DESKPOWER.
000320 SPECIAL-NAMES.          CONSOLE  IS  CONS
000330                         SYSERR   IS  MSGBOX.
000340 INPUT-OUTPUT            SECTION.
000350 FILE-CONTROL.
000351* EXTERNAL用
000360     SELECT  ＥＸ保険者マスタ    ASSIGN      TO        HOKENSL
000370                             ORGANIZATION             IS  INDEXED
000380                             ACCESS MODE              IS  DYNAMIC
000390                             RECORD KEY               IS  保－保険種別
000400                                                          保－保険者番号
000410                             ALTERNATE RECORD KEY     IS  保－保険種別
000420                                                          保－保険者名称
000430                                                          保－保険者番号
000440                             FILE STATUS              IS  状態キー
000450                             LOCK        MODE         IS  AUTOMATIC.
000460     SELECT  ＥＸ負担率マスタ    ASSIGN      TO        HUTANRIL
000470                             ORGANIZATION             IS  INDEXED
000480                             ACCESS MODE              IS  DYNAMIC
000490                             RECORD KEY               IS  負率－保険種別
000500                                                          負率－開始和暦年月
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  ＥＸ受診者情報Ｆ    ASSIGN      TO        JUSINJL
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS MODE              IS  DYNAMIC
000560                             RECORD KEY               IS  受－施術和暦年月
000570                                                          受－患者コード
000580                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000590                                                          受－患者カナ
000600                                                          受－患者コード
000610                             ALTERNATE RECORD KEY     IS  受－患者コード
000620                                                          受－施術和暦年月
000630                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000640                                                          受－保険種別
000650                                                          受－保険者番号
000660                                                          受－患者コード
000670                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000680                                                          受－公費種別
000690                                                          受－費用負担者番号
000700                                                          受－患者コード
000710                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000720                                                          受－助成種別
000730                                                          受－費用負担者番号助成
000740                                                          受－患者コード
000750                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000760                                                          受－施術和暦年月
000770                                                          受－患者コード
000780                             FILE STATUS              IS  状態キー
000790                             LOCK        MODE         IS  AUTOMATIC.
000800*     SELECT  ＥＸ負傷データＦ    ASSIGN      TO        HUSYOUL
000810*                             ORGANIZATION             IS  INDEXED
000820*                             ACCESS MODE              IS  DYNAMIC
000830*                             RECORD KEY               IS  負－施術和暦年月
000840*                                                          負－患者コード
000850*                             ALTERNATE RECORD KEY     IS  負－患者コード
000860*                                                          負－施術和暦年月
000870*                             FILE STATUS              IS  状態キー
000880*                             LOCK        MODE         IS  AUTOMATIC.
000890     SELECT  ＥＸ施術記録Ｆ      ASSIGN      TO        SEKIROKL
000900                             ORGANIZATION             IS  INDEXED
000910                             ACCESS MODE              IS  DYNAMIC
000920                             RECORD KEY               IS  施記－施術和暦年月日
000930                                                          施記－患者コード
000940                             ALTERNATE RECORD KEY     IS  施記－患者コード
000950                                                          施記－施術和暦年月日
000960                             FILE STATUS              IS  状態キー
000970                             LOCK        MODE         IS  AUTOMATIC.
000980     SELECT  ＥＸ料金マスタ      ASSIGN      TO        RYOUKINL
000990                             ORGANIZATION             IS  INDEXED
001000                             ACCESS MODE              IS  DYNAMIC
001010                             RECORD KEY               IS  料－区分コード
001020                                                          料－部位コード
001030                                                          料－開始和暦年月
001040                             FILE STATUS              IS  状態キー
001050                             LOCK        MODE         IS  AUTOMATIC.
001060     SELECT  ＥＸ市町村マスタ    ASSIGN      TO        SITYOSNL
001070                             ORGANIZATION             IS  INDEXED
001080                             ACCESS MODE              IS  DYNAMIC
001090                             RECORD KEY               IS  市－公費種別
001100                                                          市－市町村番号
001110                             ALTERNATE RECORD KEY     IS  市－公費種別
001120                                                          市－市町村名称
001130                                                          市－市町村番号
001140                             FILE STATUS              IS  状態キー
001150                             LOCK        MODE         IS  AUTOMATIC.
001160     SELECT  ＥＸ計算マスタ      ASSIGN      TO        KEISANL
001170                             ORGANIZATION             IS  INDEXED
001180                             ACCESS MODE              IS  DYNAMIC
001190                             RECORD KEY               IS  計－制御区分
001200                                                          計－開始和暦年月
001210                             FILE STATUS              IS  状態キー
001220                             LOCK        MODE         IS  AUTOMATIC.
001230     SELECT  ＥＸ制御情報マスタ  ASSIGN      TO        SEIGYOL
001240                             ORGANIZATION             IS  INDEXED
001250                             ACCESS MODE              IS  DYNAMIC
001260                             RECORD KEY               IS  制－制御区分
001270                             FILE STATUS              IS  状態キー
001280                             LOCK        MODE         IS  AUTOMATIC.
001420     SELECT  ＥＸ老人負担区分マスタ    ASSIGN      TO      ROUJINHL
001430                             ORGANIZATION             IS  INDEXED
001440                             ACCESS MODE              IS  DYNAMIC
001450                             RECORD KEY               IS  老負－保険種別
001460                                                          老負－開始和暦年月
001470                             FILE STATUS              IS  状態キー
001480                             LOCK        MODE         IS  AUTOMATIC.
001490**
001500     SELECT  ＥＸ保険者特別負担マスタ   ASSIGN      TO        HOKENTKL
001510                                    ORGANIZATION          IS  INDEXED
001520                                    ACCESS MODE           IS  DYNAMIC
001530                                    RECORD KEY            IS  保特－保険種別
001540                                                              保特－保険者番号
001550                                                              保特－開始和暦年月
001560                                    FILE STATUS           IS  状態キー
001570                                    LOCK        MODE      IS  AUTOMATIC.
001580**
001590******************************************************************
001600*                      DATA DIVISION                             *
001610******************************************************************
001620 DATA                    DIVISION.
001630 FILE                    SECTION.
001631* EXTERNAL用
001640*                           ［ＲＬ＝  ２５６］
001650 FD  ＥＸ保険者マスタ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001660     COPY HOKENS     OF  XFDLIB  JOINING   保   AS  PREFIX.
001670*                           ［ＲＬ＝  ２５６］
001680 FD  ＥＸ負担率マスタ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001690     COPY HUTANRI    OF  XFDLIB  JOINING   負率 AS  PREFIX.
001700*                           ［ＲＬ＝  ３２０］
001710 FD  ＥＸ受診者情報Ｆ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001720     COPY JUSINJ     OF  XFDLIB  JOINING   受   AS  PREFIX.
001730*                           ［ＲＬ＝  １２８］
001740* FD  ＥＸ負傷データＦ  IS EXTERNAL      BLOCK   CONTAINS   1   RECORDS.
001750*     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001760*                           ［ＲＬ＝  ２５６］
001770 FD  ＥＸ施術記録Ｆ   IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001780     COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001790*                           ［ＲＬ＝  ３２０］
001800 FD  ＥＸ料金マスタ   IS EXTERNAL        BLOCK   CONTAINS   1   RECORDS.
001810     COPY RYOUKIN    OF  XFDLIB  JOINING 料     AS  PREFIX.
001820     COPY RYOUKNA    OF  XFDLIB  JOINING 料Ａ   AS  PREFIX.
001830     COPY RYOUKNB    OF  XFDLIB  JOINING 料Ｂ   AS  PREFIX.
001840     COPY RYOUKNC    OF  XFDLIB  JOINING 料Ｃ   AS  PREFIX.
001850     COPY RYOUKND    OF  XFDLIB  JOINING 料Ｄ   AS  PREFIX.
001860     COPY RYOUKNE    OF  XFDLIB  JOINING 料Ｅ   AS  PREFIX.
001870     COPY RYOUKNF    OF  XFDLIB  JOINING 料Ｆ   AS  PREFIX.
001880*                           ［ＲＬ＝  ２５６］
001890 FD  ＥＸ計算マスタ   IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001900     COPY KEISAN     OF  XFDLIB  JOINING   計   AS  PREFIX.
001910     COPY KEISANA    OF  XFDLIB  JOINING   計Ａ AS  PREFIX.
001920*                           ［ＲＬ＝  ２５６］
001930 FD  ＥＸ市町村マスタ IS EXTERNAL       BLOCK   CONTAINS   1   RECORDS.
001940     COPY SITYOSN         OF  XFDLIB  JOINING   市   AS  PREFIX.
001950*                           ［ＲＬ＝  ２５６］
001960 FD  ＥＸ制御情報マスタ IS EXTERNAL         BLOCK   CONTAINS   1   RECORDS.
001970     COPY SEIGYO     OF  XFDLIB  JOINING   制   AS  PREFIX.
002040*                           ［ＲＬ＝  １２８］
002050 FD  ＥＸ老人負担区分マスタ IS EXTERNAL     BLOCK   CONTAINS   1   RECORDS.
002060     COPY ROUJINH    OF  XFDLIB  JOINING   老負   AS  PREFIX.
002070*
002080 FD  ＥＸ保険者特別負担マスタ IS EXTERNAL   BLOCK   CONTAINS   1   RECORDS.
002090     COPY HOKENTK         OF  XFDLIB  JOINING   保特 AS PREFIX.
002100*
002110*----------------------------------------------------------------*
002120******************************************************************
002130*                WORKING-STORAGE SECTION                         *
002140******************************************************************
002150 WORKING-STORAGE         SECTION.
002160 01 キー入力                           PIC X    VALUE SPACE.
002170 01 状態キー                           PIC X(2) VALUE SPACE.
002180 01 終了フラグ                         PIC X(3) VALUE SPACE.
002190 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002200 01 終了フラグ３                       PIC X(3) VALUE SPACE.
002210 01 書込フラグ                         PIC X(4) VALUE SPACE.
002220 01 書込フラグ２                       PIC X(4) VALUE SPACE.
002230 01 書込許可フラグ                     PIC X(3) VALUE SPACE.
002240 01 年月フラグ                         PIC X(3) VALUE SPACE.
002250 01 追加フラグ                         PIC X(3) VALUE SPACE.
002260 01 行桁フラグ                         PIC X(3) VALUE SPACE.
002270 01 項目フラグ                         PIC X(3) VALUE SPACE.
002280 01 初検日フラグ                       PIC X(3) VALUE SPACE.
002290 01 初診療フラグ                       PIC X(3) VALUE SPACE.
002300 01 枝番フラグ                         PIC X(3) VALUE SPACE.
002310 01 保険者番号Ｗ                       PIC X(6) VALUE SPACE.
002320 01 ファイル名Ｗ                       PIC N(2) VALUE SPACE.
002330 01 エラー内容Ｗ                       PIC N(18) VALUE SPACE.
002340 01 会員名Ｗ                           PIC N(16) VALUE SPACE.
002350 01 画面名称Ｗ                         PIC N(2) VALUE SPACE.
002360 01 負傷ＣＮＴ                         PIC 9    VALUE 0.
002370 01 請求移動キー                       PIC X(4) VALUE SPACE.
002380 01 画面移動キー                       PIC X(4) VALUE SPACE.
002390 01 処理移動キー                       PIC X(4) VALUE SPACE.
002400 01 再入力キーＷ                       PIC X(4) VALUE SPACE.
002410 01 入力状態Ｗ                         PIC X(4) VALUE SPACE.
002420 01 部位名称Ｗ                         PIC N(12) VALUE SPACE.
002430 01 行Ｗ                               PIC 9(4) VALUE ZERO.
002440 01 桁Ｗ                               PIC 9(4) VALUE ZERO.
002450 01 商Ｗ                               PIC 9(4) VALUE ZERO.
002460 01 剰余Ｗ                             PIC 9(4) VALUE ZERO.
002470 01 前和暦Ｗ                           PIC 9 VALUE ZERO.
002480 01 カレント和暦Ｗ                     PIC 9 VALUE ZERO.
002490*
002500 01 公費種別Ｗ                         PIC 9(2) VALUE ZERO.
002510 01 助成種別Ｗ                         PIC 9(2) VALUE ZERO.
002520 01 公費種別Ｗ２                       PIC 9(2) VALUE ZERO.
002530 01 助成種別Ｗ２                       PIC 9(2) VALUE ZERO.
002540*
002550 01 実日数Ｗ                           PIC 9(2) VALUE ZERO.
002560 01 負担額助成Ｗ                       PIC 9(5) VALUE ZERO.
002570 01 負担額助成Ｗ２                     PIC 9(5) VALUE ZERO.
002580 01 請求額助成Ｗ                       PIC 9(5) VALUE ZERO.
002590 01 請求額助成Ｗ２                     PIC 9(5) VALUE ZERO.
002600*
002610*/愛知県の乳幼児の対応0109
002620 01 助成負担率Ｗ                       PIC 9(3) VALUE ZERO.
002630 01 助成負担額Ｗ                       PIC 9(5) VALUE ZERO.
002640*/0506兵庫県の改定170701より
002650 01 事務手数料Ｗ                       PIC 9(4) VALUE ZERO.
002660*
002670 01 市町村番号老人Ｗ.
002680   03 法別番号老人Ｗ                   PIC X(2).
002690   03 助保険老人.
002700     05 府県老人                       PIC X(2).
002710     05 助番老人                       PIC X(3).
002720     05 助ＣＤ老人                     PIC X.
002730   03 FILLER                           PIC X(2).
002740*
002750 01 市町村番号助成Ｗ.
002760   03 法別番号助成Ｗ                   PIC X(2).
002770   03 助保険助成Ｗ.
002780     05 府県助成Ｗ                     PIC X(2).
002790     05 助番助成Ｗ                     PIC X(3).
002800     05 助ＣＤ助成Ｗ                   PIC X.
002810   03 FILLER                           PIC X(2).
002820*
002830*/老人保険改正の対応0101
002840 01 老人負担額上限ＡＷ                 PIC 9(5) VALUE ZERO.
002850*/老人保険改正の対応0101
002860 01 老人負担区分Ｗ.
002870   03 老人負担計算区分Ｗ               PIC 9    VALUE ZERO.
002880*/４１端数区分
002890*/０：１０円、１の位を四捨五入
002900*/１：１円、小数点以下を含めて足し込んだ合計の小数点以下を切り上げ。
002910   03 ４１端数区分Ｗ                   PIC 9    VALUE ZERO.
002920*
002930 01 老人負担回数Ｗ                     PIC 9(2) VALUE ZERO.
002940 01 公費老人０円請求Ｗ                 PIC 9 VALUE ZERO.
002950 01 助成老人０円請求Ｗ                 PIC 9 VALUE ZERO.
002960 01 負担一定金額Ｗ                     PIC 9(5) VALUE ZERO.
002970 01 老人一部負担金Ｗ                   PIC 9(4) VALUE ZERO.
002980 01 負担区分Ｗ                         PIC 9(2) VALUE ZERO.
002990 01 負担率中間結果Ｗ                   PIC 9V9(3) VALUE ZERO.
003000*
003010*/助成一定金額、一定回数を負担
003020 01 助成負担回数Ｗ                     PIC 9(2) VALUE ZERO.
003030 01 助成負担金額Ｗ                     PIC 9(4) VALUE ZERO.
003040*
003050 01 入金額Ｗ                           PIC 9(6) VALUE ZERO.
003060 01 保険種別Ｗ                         PIC 9(2) VALUE ZERO.
003070 01 助成種別１Ｗ                       PIC 9(2) VALUE ZERO.
003080 01 助成種別２Ｗ                       PIC 9(2) VALUE ZERO.
003090*
003100*/負担額と請求額を６桁に修正0311
003110 01 負担額Ｗ                           PIC 9(6) VALUE ZERO.
003120 01 負担額Ｗ２                         PIC 9(6) VALUE ZERO.
003130 01 負担額Ｗ１０                       PIC 9(6)V9 VALUE ZERO.
003140 01 請求額Ｗ                           PIC 9(6) VALUE ZERO.
003150 01 負担率Ｗ                           PIC 9(3) VALUE ZERO.
003160 01 甲乙区分Ｗ                         PIC 9    VALUE ZERO.
003170 01 本人負担率Ｗ                       PIC 9(3) VALUE ZERO.
003180 01 家族負担率Ｗ                       PIC 9(3) VALUE ZERO.
003190*/４１老人用のワーク0101
003200 01 負担額４１Ｗ                       PIC 9(5)V9(3) VALUE ZERO.
003210 01 負担額３Ｗ                         PIC 9(5) VALUE ZERO.
003220*
003230 01 初検料Ｗ                           PIC 9(4) VALUE ZERO.
003240 01 再検料Ｗ                           PIC 9(4) VALUE ZERO.
003250 01 往療料Ｗ                           PIC 9(4) VALUE ZERO.
003260 01 後療料Ｗ                           PIC 9(4) VALUE ZERO.
003270 01 冷罨法料Ｗ                         PIC 9(4) VALUE ZERO.
003280 01 温罨法料Ｗ                         PIC 9(4) VALUE ZERO.
003290 01 電療料Ｗ                           PIC 9(4) VALUE ZERO.
003300 01 金属副子料Ｗ                       PIC 9(4) VALUE ZERO.
003310 01 初回処置料Ｗ                       PIC 9(4) VALUE ZERO.
003320 01 施術情報提供料Ｗ                   PIC 9(4) VALUE ZERO.
003330*
003340 01 後療料Ｗ１                         PIC 9(4) VALUE ZERO.
003350 01 冷罨法料Ｗ１                       PIC 9(4) VALUE ZERO.
003360 01 温罨法料Ｗ１                       PIC 9(4) VALUE ZERO.
003370 01 電療料Ｗ１                         PIC 9(4) VALUE ZERO.
003380*
003390 01 部位コードＣＷ.
003400    03 負傷種別ＣＷ                    PIC 9(2).
003410    03 部位ＣＷ                        PIC 9(2).
003420*
003430 01 患者コードＷ.
003440     03 患者番号Ｗ                     PIC 9(6).
003450     03 枝番Ｗ                         PIC X.
003460*
003470 01 患者コードＣＷ.
003480     03 患者番号ＣＷ                   PIC 9(6).
003490     03 枝番ＣＷ                       PIC X.
003500*
003510 01 初診療年月日ＣＷ                   PIC X(7).
003520*
003530 01 施術和暦年月日ＣＷ.
003540   03 施術和暦年月ＣＷ.
003550     05 施術和暦ＣＷ                   PIC 9.
003560     05 施術年月ＣＷ.
003570        07 施術年ＣＷ                  PIC 9(2).
003580        07 施術月ＣＷ                  PIC 9(2).
003590   03 施術日ＣＷ                       PIC 9(2).
003600*
003610 01 施術和暦年月Ｗ.
003620     03 施術和暦Ｗ                     PIC 9.
003630     03 施術年月Ｗ.
003640        05 施術年Ｗ                    PIC 9(2).
003650        05 施術月Ｗ                    PIC 9(2).
003660     03 施術日Ｗ                       PIC 9(2).
003670*
003680 01 負傷種別略称Ｗ.
003690    03 負傷種別略称Ｗ１                PIC N(4).
003700    03 FILLER                          PIC N(2).
003710 01 元号名称Ｗ.
003720    03 元号名称Ｗ１                    PIC N(2).
003730    03 FILLER                          PIC N(4).
003740 01 転帰区分略称Ｗ.
003750    03 転帰区分略称Ｗ１                PIC N(4).
003760    03 FILLER                          PIC N(2).
003770*
003780 01  保険者番号Ｗ２.
003790     03  保番１Ｗ                      PIC X(2).
003800     03  保番２Ｗ                      PIC X(8).
003810* 費用負担者番号（市町村番号）ＷＯＲＫ
003820 01 費用負担者番号Ｗ.
003830     03  法別番号Ｗ                      PIC X(2).
003840     03  助保険Ｗ.
003850          05  府県Ｗ                     PIC X(2).
003860          05  助番Ｗ                     PIC X     OCCURS 3.
003870          05  助ＣＤＷ                   PIC X.
003880     03  FILLER                        PIC X(2).
003890*
003900*/年月毎持つ保険者データのワーク
003910 01 保負担率区分Ｗ                     PIC 9    VALUE ZERO.
003920 01 保本人負担率Ｗ                     PIC 9(3) VALUE ZERO.
003930 01 保家族負担率Ｗ                     PIC 9(3) VALUE ZERO.
003940 01 保本人負担率乙Ｗ                   PIC 9(3) VALUE ZERO.
003950 01 保家族負担率乙Ｗ                   PIC 9(3) VALUE ZERO.
003960*
003970*/エラー表示の修正
003980 01 エラー表示Ｆ                       PIC 9(1)  VALUE ZERO.
003990*/0101
004000 01 計算用負担額Ｗ                     PIC 9(5) VALUE ZERO.
004010 01 計算用負担額ＷＲ REDEFINES 計算用負担額Ｗ.
004020    03 負担額５位Ｗ                    PIC 9(4).
004030    03 負担額１位Ｗ                    PIC 9(1).
004040 01 老人最終負担日Ｗ                   PIC 9(2)  VALUE ZERO.
004050 01 老人負担額端数Ｗ                   PIC 9(5)  VALUE ZERO.
004060*
004070 01 助成負担計算区分Ｗ                 PIC 9 VALUE ZERO.
004080 01 助成負担金免除Ｗ                   PIC 9    VALUE ZERO.
004090*
004290* 日付ＷＯＲＫ
004300 01 和暦終了年Ｗ                       PIC 9(4) VALUE ZERO.
004310 01 計算機和暦年Ｗ                     PIC 9(2) VALUE ZERO.
004320*
004330 01 計算機西暦.
004340    03 計算機西暦年                    PIC 9(4).
004350    03 計算機西暦月日                  PIC 9(4).
004360 01 計算機西暦Ｒ REDEFINES 計算機西暦.
004370    03 計算機世紀                      PIC 9(2).
004380    03 計算機日付                      PIC 9(6).
004390    03 計算機日付Ｒ REDEFINES 計算機日付.
004400       05 計算機年月                   PIC 9(4).
004410       05 計算機年月Ｒ REDEFINES 計算機年月.
004420         07 計算機年                   PIC 9(2).
004430         07 計算機月                   PIC 9(2).
004440       05 計算機日                     PIC 9(2).
004450*
004490*
004491**--------------------**
004492 01 負担額日計窓口Ｗ                   PIC 9(6) VALUE ZERO.
004493 01 負担額日計窓口Ｗ２                 PIC 9(6) VALUE ZERO.
004494*
004495 01 負担額日計窓口退避Ｗ               PIC 9(6) VALUE ZERO.
004496*
004497*
004498 01 限度額１Ｗ                         PIC 9(5) VALUE ZERO.
004499 01 限度額２Ｗ                         PIC 9(5) VALUE ZERO.
004500 01 限度額３Ｗ                         PIC 9(5) VALUE ZERO.
004501 01 計算限度額Ｗ                       PIC 9(5) VALUE ZERO.
004502 01 計算用累計額Ｗ                     PIC 9(5) VALUE ZERO.
004503**
004504 01 老人負担率Ｗ                       PIC 9(3) VALUE ZERO.
004505*
004506*****************************************************************
004507*                          連結項目                             *
004510*****************************************************************
004520*
004530 01 連－共通キー IS EXTERNAL.
004540    03  連－カレント和暦               PIC 9.
004550*
004560 01 連計－キー IS EXTERNAL.
004570    03  連計－負担金計算区分           PIC 9.
004580    03  連計－本人家族区分             PIC 9.
004590    03  連計－保険種別                 PIC 9(2).
004600    03  連計－保険者番号               PIC X(10).
004610    03  連計－公費種別                 PIC 9(2).
004620    03  連計－市町村番号老人           PIC X(10).
004630    03  連計－助成種別                 PIC 9(2).
004640    03  連計－市町村番号助成           PIC X(10).
004650    03  連計－患者コード.
004660      05  連計－患者番号               PIC 9(6).
004670      05  連計－枝番                   PIC X.
004680    03  連計－施術和暦年月日.
004690      05  連計－施術和暦年月.
004700        07  連計－施術和暦             PIC 9.
004710        07  連計－施術年月.
004720          09  連計－施術年             PIC 9(2).
004730          09  連計－施術月             PIC 9(2).
004740      05  連計－施術日                 PIC 9(2).
004750    03  連計－費用額                   PIC 9(6).
004760    03  連計－負担額                   PIC 9(6).
004770    03  連計－請求額                   PIC 9(6).
004780    03  連計－費用額老人               PIC 9(6).
004790    03  連計－負担額老人               PIC 9(6).
004800    03  連計－請求額老人               PIC 9(6).
004810    03  連計－費用額助成               PIC 9(6).
004820    03  連計－負担額助成               PIC 9(5).
004830    03  連計－請求額助成               PIC 9(5).
004840    03  連計－実日数                   PIC 9(2).
004850    03  連計－負担率                   PIC 9(3).
004860    03  連計－負担率区分               PIC 9.
004861*
004862*-------------------------------------*
004863 01 連計日計窓口－キー IS EXTERNAL.
004864    03  連計日計窓口－負担額           PIC 9(6).
004865*-------------------------------------*
004866*
004870*
004880 01 連計Ｐ－キー IS EXTERNAL.
004890    03 連計Ｐ－費用額ＰＧ                 PIC X(8).
004900    03 連計Ｐ－負担額ＰＧ                 PIC X(8).
004910    03 連計Ｐ－負担額ＰＧ老人             PIC X(8).
004920    03 連計Ｐ－負担額ＰＧ助成             PIC X(8).
004930*
004940* 確認メッセージ用 (２行)
004950 01 連メ７－キー IS EXTERNAL.
004960    03  連メ７－メッセージ１             PIC X(40).
004970    03  連メ７－メッセージ２             PIC X(40).
004980*
004990*老人保険改正の対応0101
005000*当月の累計金額と回数
005010 01 連老負－キー IS EXTERNAL.
005020    03 連老負－老人負担回数              PIC 9(2).
005030    03 連老負－老人負担額累計            PIC 9(5)V9(3).
005040    03 連老負－老人最終負担日            PIC 9(2).
005050    03 連老負－老人負担額端数            PIC 9(4).
005060    03 連老負－老人負担回数１            PIC 9(2).
005070    03 連老負－老人負担額累計１          PIC 9(5)V9(3).
005080    03 連老負－老人最終負担日１          PIC 9(2).
005090    03 連老負－老人負担額端数１          PIC 9(4).
005100*/老人負担額計算用、月計と日計を区別するフラグ。０：月計。１：日計。
005110 01 連老計算－キー IS EXTERNAL.
005120    03 連老計算－月日Ｆ                  PIC 9.
005130    03 連老計算－枝番フラグ              PIC 9.
005140*/負担金の累計を０：する、１：しない。
005150    03 連老計算－累計フラグ              PIC 9.
005160***/４１老人の月計の合計
005170**    03 連老計算－４１老人月計            PIC 9(5)V9(3).
005180*/大阪老人負担金免除 500円×2回 の対応(日計時のみ計算)/061117
005190 01 大阪負担金免除計算Ｆ                   PIC 9 IS EXTERNAL.
005200*/負担率取得ＰＧの対応
005210 01 連率－負担率取得キー IS EXTERNAL.
005220    03 連率－施術和暦年月.
005230       05 連率－施術和暦               PIC 9.
005240       05 連率－施術年月.
005250          07 連率－施術年              PIC 9(2).
005260          07 連率－施術月              PIC 9(2).
005270    03 連率－患者コード.
005280       05 連率－患者番号               PIC 9(6).
005290       05 連率－枝番                   PIC X.
005300    03 連率－実際負担率                PIC 9(3).
005310    03 連率－実際本体負担率            PIC 9(3).
005320    03 連率－健保負担率                PIC 9(3).
005330    03 連率－２７老負担率              PIC 9(3).
005340    03 連率－助成負担率                PIC 9(3).
005350    03 連率－特別用負担率              PIC 9(3).
005360*
005370 01 連計－月計算フラグ                 PIC 9 IS EXTERNAL.
005371*
005372*
005378*---------------------------------------------------------*
005379* 助成月途中用
005380 01 連計算助成月途中－キー IS EXTERNAL.
005381   03 連計算助成月途中－日計区分           PIC 9.
005382   03 連計算助成月途中－助成月途中開始日   PIC 9(2).
005383   03 連計算助成月途中－助成のみ処理区分   PIC 9.
005385*---------------------------------------------------------*
005386 01 連計算助成累計額－負担額助成       PIC 9(6) IS EXTERNAL.
005387 01 連計算助成累計額－枝番負担累計額   PIC 9(6) IS EXTERNAL.
005388*---------------------------------------------------------*
005389*
      */負担区分２２(大阪府平成30年4月～)
004887 01 連計算助成累計額－負担額助成１０   PIC 9(6) IS EXTERNAL.
      *
005390******************************************************************
005391*                      PROCEDURE  DIVISION                       *
005400******************************************************************
005410 PROCEDURE               DIVISION.
005420************
005430*           *
005440* 初期処理   *
005450*           *
005460************
005461**
005462*--------------------------------/
005463     IF 連計－施術日 = ZERO
005464        EXIT PROGRAM
005465     END-IF.
005466*--------------------------------/
005467**
005468**   / 退避 （公費種別0の時は、セット済みなので退避）
005469     MOVE 連計日計窓口－負担額  TO 負担額日計窓口退避Ｗ.
005470**
005471**
005472     PERFORM 初期化.
005480     PERFORM 受診者情報取得.
005490     PERFORM 制御情報取得.
005500     PERFORM 老人計算情報取得.
005510*/0101
005520     PERFORM 老人負担区分取得.
005530*
005540************
005550*           *
005560* 主処理     *
005570*           *
005580************
005590*
005600     MOVE 連計－市町村番号老人 TO 市町村番号老人Ｗ.
005610     MOVE 連計－市町村番号助成 TO 市町村番号助成Ｗ.
005620*
005630     EVALUATE TRUE
005640* ２７老人
005650     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
005660          ( 連計－保険者番号     NOT = SPACE ) AND
005670          ( 連計－公費種別           = 05    ) AND
005680          ( 連計－市町村番号老人 NOT = SPACE ) AND
005690          ( 法別番号老人Ｗ           = "27"  ) AND
005700          ( 連計－助成種別           = ZERO  ) AND
005710          ( 連計－市町村番号助成     = SPACE )
005720*/後期高齢者/0801
005730     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
005740          ( 連計－保険者番号     NOT = SPACE ) AND
005750          ( 連計－公費種別           = 05    ) AND
005760          ( 連計－市町村番号老人 NOT = SPACE ) AND
005770          ( 連計－助成種別           = ZERO  ) AND
005780          ( 連計－市町村番号助成     = SPACE ) AND
005790          ( 連計－施術和暦年月      >= 42004 )
005800         PERFORM 定率公費老人負担算定
005804*
005810*/資格証明の対応/*４１老人と４１に準ずる助成で)
005820*/２７老人でなく((国保＆国保組合以外)または退職)＆資格証明区分が１の時は全額患者負担
005830     WHEN (((受－保険種別 = 01)  AND (受－保険者番号(3:1) NOT = "3")) OR
005840           ( 受－保険種別 = 08)) AND
005850           ( 受－資格証明区分 = 1) AND
005860           ( 受－公費種別 NOT = 05)
005870         MOVE 連計－負担額 TO 連計－負担額助成
005880         MOVE ZERO         TO 連計－請求額助成
005881*        / 連計日計窓口－負担額は何にもしない /
005882*
005890* ４１老人
005900     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
005910          ( 連計－保険者番号     NOT = SPACE ) AND
005920          ( 連計－公費種別           = ZERO  ) AND
005930          ( 連計－市町村番号老人     = SPACE ) AND
005940          ( 連計－助成種別           = 51    ) AND
005950          ( 連計－市町村番号助成 NOT = SPACE )
005960*          ( 法別番号助成Ｗ           = 41    )
005970* ４１老に準ずる助成の対応
005980     WHEN ( 連計－助成種別 NOT = ZERO ) AND (負担区分Ｗ = 09 OR 10) AND
005990* 27+41準を考慮していなかった。27助成は27のロジックへ。(助成負担はゼロ)
006000          (連計－公費種別       = ZERO ) AND
006010          (連計－市町村番号老人 = SPACE)
006020*/定率制のみに変更0210
006030*/老人負担計算区分１：定額制、０：定率制
006040*         IF 老人負担計算区分Ｗ = 1
006050*             PERFORM 定額助成老人負担算定
006060*         ELSE
006070             PERFORM 定率助成老人負担算定
006080*         END-IF
006090* ２７老人＋身障・被爆
006100     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
006110          ( 連計－保険者番号     NOT = SPACE ) AND
006120          ( 連計－公費種別           = 05    ) AND
006130          ( 連計－市町村番号老人 NOT = SPACE ) AND
006140          ( 法別番号老人Ｗ           = "27"  ) AND
006150          ( 連計－助成種別 >= 50 AND 連計－助成種別 <= 60 ) AND
006160          ( 連計－市町村番号助成 NOT = SPACE )
006170*/後期高齢者/0801
006180     WHEN (( 連計－保険種別 >= 01 ) AND ( 連計－保険種別 <= 09 )) AND
006190          ( 連計－保険者番号     NOT = SPACE ) AND
006200          ( 連計－公費種別           = 05    ) AND
006210          ( 連計－市町村番号老人 NOT = SPACE ) AND
006220          ( 連計－助成種別 >= 50 AND 連計－助成種別 <= 60 ) AND
006230          ( 連計－市町村番号助成 NOT = SPACE ) AND
006240          ( 連計－施術和暦年月      >= 42004 )
006250         PERFORM 公費老人助成負担算定
006260     WHEN OTHER
006270*/エラー表示の修正
006280         PERFORM コンソールエラー確認
006290         DISPLAY "老人算定条件が満たされていません"
006300                 " 受診者№=" 連計－患者コード
006310                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
006320*-----------------------------------------*
006330         CALL "actcshm"  WITH C LINKAGE
006340*-----------------------------------------*
006350*         ACCEPT  キー入力 FROM CONS
006360         PERFORM ファイル閉鎖
006370         MOVE ZERO TO PROGRAM-STATUS
006380         EXIT PROGRAM
006390     END-EVALUATE.
006400*
006401*
006402*
006403*-------------------------------------------*
006404     IF ( 連計－助成種別 NOT = ZERO ) AND ( 連計－負担額助成 = ZERO )
006405        MOVE ZERO TO 連計日計窓口－負担額
006406     END-IF.
006407*-------------------------------------------*
006408*
006409*
006419*----------------------------------------------------------*
006420* 日計で助成月途中の時、助成になる以前は、助成なしの扱い
006421     IF ( 連計算助成月途中－日計区分 = 1 ) AND ( 連計算助成月途中－助成月途中開始日 NOT = ZERO ) AND
006422        ( 連計－施術日 < 連計算助成月途中－助成月途中開始日 )
006423***         MOVE 連計－負担額 TO 連計－負担額助成
006424         MOVE ZERO  TO 連計－負担額助成
006425         MOVE ZERO  TO 連計－請求額助成
006432         MOVE 負担額日計窓口退避Ｗ TO 連計日計窓口－負担額
006434     END-IF.
006435*----------------------------------------------------------*
006436*
006437************
006438*           *
006439* 終了処理   *
006440*           *
006450************
006460     PERFORM 終了処理.
006470     MOVE 1 TO PROGRAM-STATUS.
006480     EXIT PROGRAM.
006490*
006500*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
006510*================================================================*
006520 初期化 SECTION.
006530*
006930* EXTERNALでOPEN無し
006931*
006940*================================================================*
006950 オープンチェック SECTION.
006960*
006970     IF 状態キー  NOT =  "00"
006980         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
006990         DISPLAY NC"状態キー：" 状態キー           UPON CONS
007000         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS
007010*-----------------------------------------*
007020         CALL "actcshm"  WITH C LINKAGE
007030*-----------------------------------------*
007040         ACCEPT  キー入力 FROM CONS
007050         PERFORM ファイル閉鎖
007060         MOVE ZERO TO PROGRAM-STATUS
007070         EXIT PROGRAM.
007080*================================================================*
007090 ファイル閉鎖 SECTION.
007100*
007160*================================================================*
007170 終了処理 SECTION.
007180*
007190     PERFORM ファイル閉鎖.
007200*================================================================*
007210 エラー表示 SECTION.
007220*
007230     DISPLAY ファイル名Ｗ NC"ファイル書込エラー"   UPON CONS.
007240     DISPLAY NC"状態キー：" 状態キー               UPON CONS.
007250     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
007260     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
007270*-----------------------------------------*
007280         CALL "actcshm"  WITH C LINKAGE.
007290*-----------------------------------------*
007300     ACCEPT  キー入力 FROM CONS.
007310     PERFORM ファイル閉鎖.
007320     MOVE ZERO TO PROGRAM-STATUS
007330     EXIT PROGRAM.
007340*================================================================*
007350 負担率取得 SECTION.
007360*
007370     MOVE ZERO TO 本人負担率Ｗ.
007380     MOVE ZERO TO 家族負担率Ｗ.
007390*
007400     MOVE 連計－施術和暦 TO 受－施術和暦.
007410     MOVE 連計－施術年   TO 受－施術年.
007420     MOVE 連計－施術月   TO 受－施術月.
007430     MOVE 連計－患者番号 TO 受－患者番号.
007440     MOVE 連計－枝番     TO 受－枝番.
007450     READ ＥＸ受診者情報Ｆ
007460     INVALID KEY
007470*/エラー表示の修正
007480         PERFORM コンソールエラー確認
007490         DISPLAY "施術月の受診者情報がありません"
007500                 " 受診者№=" 連計－患者コード
007510                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
007520*-----------------------------------------*
007530         CALL "actcshm"  WITH C LINKAGE
007540*-----------------------------------------*
007550*         ACCEPT  キー入力 FROM CONS
007560         PERFORM ファイル閉鎖
007570         MOVE ZERO TO PROGRAM-STATUS
007580         EXIT PROGRAM
007590     NOT INVALID KEY
007600         MOVE 受－甲乙区分 TO 甲乙区分Ｗ
007610     END-READ.
007620*
007630*/後期高齢者は負担率取得PGをコールする/080802
007640     IF (受－保険種別 NOT = 05) OR (受－施術和暦年月 < 42004)
007650         MOVE 連計－保険種別   TO 保－保険種別
007660         MOVE 連計－保険者番号 TO 保－保険者番号
007670         READ ＥＸ保険者マスタ
007680         INVALID KEY
007690*/エラー表示の修正
007700             PERFORM コンソールエラー確認
007710             DISPLAY "保険者番号が登録されていません"
007720                     " 受診者№="   連計－患者コード
007730                     " 施術年月="   連計－施術年 連計－施術月
007740                     " 保険者番号=" 連計－保険者番号  UPON CONS
007750*-----------------------------------------*
007760             CALL "actcshm"  WITH C LINKAGE
007770*-----------------------------------------*
007780*             ACCEPT  キー入力 FROM CONS
007790             PERFORM ファイル閉鎖
007800             MOVE ZERO TO PROGRAM-STATUS
007810             EXIT PROGRAM
007820         NOT INVALID KEY
007830*/年月毎持つデータの振り分け
007840* 特別負担
007850         MOVE 連計－保険種別   TO 保特－保険種別
007860         MOVE 連計－保険者番号 TO 保特－保険者番号
007870         MOVE 連計－施術和暦   TO 保特－開始和暦
007880         MOVE 連計－施術年     TO 保特－開始年
007890         MOVE 連計－施術月     TO 保特－開始月
007900         START ＥＸ保険者特別負担マスタ KEY IS <= 保特－保険種別 
007910                                              保特－保険者番号
007920                                              保特－開始和暦年月
007930                                              REVERSED
007940         END-START
007950         IF 状態キー = "00" 
007960             READ ＥＸ保険者特別負担マスタ NEXT
007970             NOT AT END
007980                 IF ( 保特－保険種別   = 連計－保険種別 ) AND
007990                    ( 保特－保険者番号 = 連計－保険者番号 )
008000                    MOVE 保特－負担率区分   TO 保負担率区分Ｗ
008010                    MOVE 保特－本人負担率   TO 保本人負担率Ｗ
008020                    MOVE 保特－家族負担率   TO 保家族負担率Ｗ
008030                    MOVE 保特－本人負担率乙 TO 保本人負担率乙Ｗ
008040                    MOVE 保特－家族負担率乙 TO 保家族負担率乙Ｗ
008050                 END-IF
008060             END-READ
008070         END-IF
008080             IF ( 保負担率区分Ｗ NOT = ZERO ) OR
008090                ( 甲乙区分Ｗ     NOT = ZERO )
008100                 IF 甲乙区分Ｗ NOT = 2
008110                     MOVE 保本人負担率Ｗ   TO 本人負担率Ｗ
008120                     MOVE 保家族負担率Ｗ   TO 家族負担率Ｗ
008130                 ELSE
008140                     MOVE 保本人負担率乙Ｗ TO 本人負担率Ｗ
008150                     MOVE 保家族負担率乙Ｗ TO 家族負担率Ｗ
008160                 END-IF
008170*             IF ( 保－負担率区分 NOT = ZERO ) OR
008180*                ( 甲乙区分Ｗ     NOT = ZERO )
008190*                 IF 甲乙区分Ｗ NOT = 2
008200*                     MOVE 保－本人負担率   TO 本人負担率Ｗ
008210*                     MOVE 保－家族負担率   TO 家族負担率Ｗ
008220*                 ELSE
008230*                     MOVE 保－本人負担率乙 TO 本人負担率Ｗ
008240*                     MOVE 保－家族負担率乙 TO 家族負担率Ｗ
008250*                 END-IF
008260             ELSE
008270                 MOVE 連計－保険種別 TO 負率－保険種別
008280                 MOVE 連計－施術和暦 TO 負率－開始和暦 施術和暦ＣＷ
008290                 MOVE 連計－施術年   TO 負率－開始年   施術年ＣＷ
008300                 MOVE 連計－施術月   TO 負率－開始月   施術月ＣＷ
008310                 START ＥＸ負担率マスタ KEY IS <= 負率－保険種別 
008320                                              負率－開始和暦年月
008330                                              REVERSED
008340                 END-START
008350                 READ ＥＸ負担率マスタ NEXT
008360                 AT END
008370*/エラー表示の修正
008380                     PERFORM コンソールエラー確認
008390                     DISPLAY "施術日に合った負担率がみつかりません"
008400                             " 受診者№="   連計－患者コード
008410                             " 施術年月="   連計－施術年 連計－施術月 UPON CONS
008420*-----------------------------------------*
008430                     CALL "actcshm"  WITH C LINKAGE
008440*-----------------------------------------*
008450*                     ACCEPT  キー入力 FROM CONS
008460                     PERFORM ファイル閉鎖
008470                     MOVE ZERO TO PROGRAM-STATUS
008480                     EXIT PROGRAM
008490                 NOT AT END
008500                     IF ( 施術和暦年月ＣＷ >= 負率－開始和暦年月 ) AND
008510                        ( 施術和暦年月ＣＷ <= 負率－終了和暦年月 )
008520                         MOVE 負率－本人負担率 TO 本人負担率Ｗ
008530                         MOVE 負率－家族負担率 TO 家族負担率Ｗ
008540                     END-IF
008550                 END-READ
008560             END-IF
008570         END-READ
008580*
008590         EVALUATE 連計－本人家族区分
008600         WHEN 1
008610             MOVE 本人負担率Ｗ TO 負担率Ｗ
008620         WHEN 2
008630             MOVE 家族負担率Ｗ TO 負担率Ｗ
008640         WHEN OTHER
008650*/エラー表示の修正
008660             PERFORM コンソールエラー確認
008670             DISPLAY "本人家族区分が設定されていません"
008680                     " 受診者№="   連計－患者コード
008690                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
008700*-----------------------------------------*
008710             CALL "actcshm"  WITH C LINKAGE
008720*-----------------------------------------*
008730*             ACCEPT  キー入力 FROM CONS
008740             PERFORM ファイル閉鎖
008750             MOVE ZERO TO PROGRAM-STATUS
008760             EXIT PROGRAM
008770         END-EVALUATE
008780     ELSE
008790         MOVE 受－施術和暦 TO 連率－施術和暦
008800         MOVE 受－施術年   TO 連率－施術年
008810         MOVE 受－施術月   TO 連率－施術月
008820         MOVE 受－患者番号 TO 連率－患者番号
008830         MOVE 受－枝番     TO 連率－枝番
008840         CALL   "HUTANRIT"
008850         CANCEL "HUTANRIT"
008860         MOVE 連率－実際本体負担率 TO 負担率Ｗ
008870     END-IF.
008880*
008890*================================================================*
008900 負担額計算初検 SECTION.
008910******************************************************************
008920* ☆注意☆
008930* 窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
008940* レセプトは、負担金の小数点第１位を切り上げる
008950******************************************************************
008960*
008970* 負担額１０円単位（１円の位を四捨五入）
008980     EVALUATE 連計－負担金計算区分
008990     WHEN 2
009000         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009010         COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
009020         COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担額Ｗ
009030         COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
009040         COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
009050     WHEN ZERO
009060         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009070         COMPUTE 負担額Ｗ１０ = 初検料Ｗ * 負担率中間結果Ｗ
009080         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
009090         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
009100                                  REMAINDER 剰余Ｗ
009110         END-DIVIDE
009120         IF 剰余Ｗ = ZERO
009130             COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009140             COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
009150             COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担額Ｗ
009160         ELSE
009170* 一部負担金の端数切り上げ
009180             COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009190             COMPUTE 負担額Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
009200             COMPUTE 負担額Ｗ = 負担額Ｗ + 1
009210             COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担額Ｗ
009220         END-IF
009222*
009223*---10円単位でも計算 ------------------------------------------*
009224         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
009235         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009236         COMPUTE 負担額日計窓口Ｗ = 初検料Ｗ * 負担率中間結果Ｗ
009237         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
009238         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
009239         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
009244*--------------------------------------------------------------*
009245*
009252     WHEN OTHER
009253*/エラー表示の修正
009254         PERFORM コンソールエラー確認
009260         DISPLAY "負担金計算区分が指定されていません"
009270                 " 受診者№="   連計－患者コード
009280                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
009290*-----------------------------------------*
009300         CALL "actcshm"  WITH C LINKAGE
009310*-----------------------------------------*
009320*         ACCEPT  キー入力 FROM CONS
009330         PERFORM ファイル閉鎖
009340         MOVE ZERO TO PROGRAM-STATUS
009350         EXIT PROGRAM
009360     END-EVALUATE.
009370*
009380     MOVE 負担額Ｗ TO 連計－負担額助成.
009390     MOVE 請求額Ｗ TO 連計－請求額助成.
009400*
009410*================================================================*
009420 負担額計算助成 SECTION.
009430******************************************************************
009440* ☆注意☆
009450* 窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
009460* レセプトは、負担金の小数点第１位を切り上げる
009470******************************************************************
009480*
009490* 負担額１０円単位（１円の位を四捨五入）
009500     EVALUATE 連計－負担金計算区分
009510     WHEN 2
009520         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009530         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
009540         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
009550         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
009560                                  REMAINDER 剰余Ｗ
009570         END-DIVIDE
009580         IF 剰余Ｗ = ZERO
009590             COMPUTE 負担額助成Ｗ = 連計－費用額 * 負担率中間結果Ｗ
009600             IF 負担額助成Ｗ > 老人一部負担金Ｗ
009610                 MOVE 老人一部負担金Ｗ TO 連計－負担額老人 連計－負担額助成
009620                 MOVE ZERO             TO 連計－請求額助成
009630             ELSE
009640                 COMPUTE 負担額助成Ｗ２ ROUNDED = 負担額助成Ｗ / 10
009650                 COMPUTE 負担額助成Ｗ = 負担額助成Ｗ２ * 10
009660                 MOVE 負担額助成Ｗ TO 連計－負担額老人 連計－負担額助成
009670                 MOVE ZERO             TO 連計－請求額助成
009680             END-IF
009690         ELSE
009700             COMPUTE 負担額助成Ｗ = 連計－費用額 * 負担率中間結果Ｗ
009710* 小数点以下第１位が発生した場合、整数部に１を加え切り上げる
009720*/↑は取り消し
009730*             COMPUTE 負担額助成Ｗ = 負担額助成Ｗ + 1
009740             IF 負担額助成Ｗ > 老人一部負担金Ｗ
009750                 MOVE 老人一部負担金Ｗ TO 連計－負担額老人 連計－負担額助成
009760                 MOVE ZERO             TO 連計－請求額助成
009770             ELSE
009780                 MOVE 負担額助成Ｗ TO 連計－負担額老人
009790                 COMPUTE 負担額助成Ｗ２ ROUNDED = 負担額助成Ｗ / 10
009800                 COMPUTE 負担額助成Ｗ = 負担額助成Ｗ２ * 10
009810                 MOVE 負担額助成Ｗ TO 連計－負担額助成
009820                 MOVE ZERO         TO 連計－請求額助成
009830             END-IF
009840         END-IF
009850     WHEN ZERO
009860         COMPUTE 負担率中間結果Ｗ = 負担率Ｗ / 100
009870         COMPUTE 負担額Ｗ１０ = 連計－費用額老人 * 負担率中間結果Ｗ
009880         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
009890         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
009900                                  REMAINDER 剰余Ｗ
009910         END-DIVIDE
009920         IF 剰余Ｗ = ZERO
009930             COMPUTE 負担額助成Ｗ = 連計－費用額 * 負担率中間結果Ｗ
009940             IF 負担額助成Ｗ > 老人一部負担金Ｗ
009950                 MOVE 老人一部負担金Ｗ TO 連計－負担額老人 連計－負担額助成
009960                 MOVE ZERO             TO 連計－請求額助成
009970             ELSE
009980                 MOVE 負担額助成Ｗ     TO 連計－負担額老人 連計－負担額助成
009990                 MOVE ZERO             TO 連計－請求額助成
010000             END-IF
010010         ELSE
010020* 一部負担金の端数切り上げ
010030             COMPUTE 負担額助成Ｗ = 連計－費用額 * 負担率中間結果Ｗ
010040             COMPUTE 負担額助成Ｗ = 負担額助成Ｗ + 1
010050             IF 負担額助成Ｗ > 老人一部負担金Ｗ
010060                 MOVE 老人一部負担金Ｗ TO 連計－負担額老人 連計－負担額助成
010070                 MOVE ZERO             TO 連計－請求額助成
010080             ELSE
010090                 MOVE 負担額助成Ｗ TO 連計－負担額老人 連計－負担額助成
010100                 MOVE ZERO         TO 連計－請求額助成
010110             END-IF
010120         END-IF
010160*
010161*---10円単位でも計算 ------------------------------------------*
010162         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
010163         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
010164         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
010166         IF 負担額日計窓口Ｗ > 老人一部負担金Ｗ
010167             MOVE 老人一部負担金Ｗ TO 連計日計窓口－負担額
010169         ELSE
010174             COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
010175             COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
010176             MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
010177         END-IF
010185*--------------------------------------------------------------*
010186*
010192     WHEN OTHER
010193*/エラー表示の修正
010194         PERFORM コンソールエラー確認
010195         DISPLAY "負担金計算区分が指定されていません"
010196                 " 受診者№="   連計－患者コード
010197                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
010198*-----------------------------------------*
010200         CALL "actcshm"  WITH C LINKAGE
010210*-----------------------------------------*
010220*         ACCEPT  キー入力 FROM CONS
010230         PERFORM ファイル閉鎖
010240         MOVE ZERO TO PROGRAM-STATUS
010250         EXIT PROGRAM
010260     END-EVALUATE.
010270*
010280*================================================================*
010290 負担額計算２ SECTION.
010291*
010292* ※ 使用なし
010300******************************************************************
010310* ☆注意☆
010320* ２７老人助成の費用額は、２７老人の負担額となるが、窓口会計・カルテ
010330* においても、負担金の小数点第１位を切り上げた金額（１円単位）で計算
010340* 最終的に１０円単位にする。（助成の負担金）
010350******************************************************************
010360*
010370     DIVIDE  連計－費用額 BY 10 GIVING    商Ｗ
010380                              REMAINDER 剰余Ｗ
010390     END-DIVIDE.
010400     IF 剰余Ｗ = ZERO
010410         COMPUTE 負担額Ｗ = 連計－費用額 * ( 負担率Ｗ / 100 )
010420         COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
010430     ELSE
010440* 一部負担金の端数切り上げ
010450         COMPUTE 負担額Ｗ = 連計－費用額 * ( 負担率Ｗ / 100 )
010460         COMPUTE 負担額Ｗ = 負担額Ｗ + 1
010470         COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
010480     END-IF.
010490*
010500     MOVE 負担額Ｗ TO 連計－負担額.
010510     MOVE 請求額Ｗ TO 連計－請求額.
010520*
010530*================================================================*
010540 老人計算情報取得 SECTION.
010550*
010560     MOVE 01             TO 計－制御区分.
010570     MOVE 連計－施術和暦 TO 計－開始和暦 施術和暦ＣＷ.
010580     MOVE 連計－施術年   TO 計－開始年   施術年ＣＷ.
010590     MOVE 連計－施術月   TO 計－開始月   施術月ＣＷ.
010600     START ＥＸ計算マスタ KEY IS <= 計－制御区分 計－開始和暦年月
010610                                                     REVERSED
010620     END-START.
010630     IF 状態キー = "00"
010640         READ ＥＸ計算マスタ NEXT
010650         AT END
010660*/エラー表示の修正
010670         PERFORM コンソールエラー確認
010680         DISPLAY "施術日に対応した計算情報がありません"
010690                 " 受診者№="   連計－患者コード
010700                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
010710*-----------------------------------------*
010720             CALL "actcshm"  WITH C LINKAGE
010730*-----------------------------------------*
010740*             ACCEPT  キー入力 FROM CONS
010750             PERFORM ファイル閉鎖
010760             MOVE ZERO TO PROGRAM-STATUS
010770             EXIT PROGRAM
010780         NOT AT END
010790             IF ( 施術和暦年月ＣＷ >= 計－開始和暦年月 ) AND
010800                ( 施術和暦年月ＣＷ <= 計－終了和暦年月 )
010810                 MOVE 計Ａ－老人負担回数     TO 老人負担回数Ｗ
010820                 MOVE 計Ａ－公費老人０円請求 TO 公費老人０円請求Ｗ
010830                 MOVE 計Ａ－助成老人０円請求 TO 助成老人０円請求Ｗ
010840             END-IF
010850         END-READ
010860     END-IF.
010870*
010880     MOVE 01             TO 料－区分コード.
010890     MOVE ZERO           TO 料－負傷種別.
010900     MOVE ZERO           TO 料－部位.
010910     MOVE ZERO           TO 料－左右区分.
010920     MOVE ZERO           TO 料－負傷位置番号.
010930     MOVE 連計－施術和暦 TO 料－開始和暦 施術和暦ＣＷ.
010940     MOVE 連計－施術年   TO 料－開始年   施術年ＣＷ.
010950     MOVE 連計－施術月   TO 料－開始月   施術月ＣＷ.
010960*
010970     START ＥＸ料金マスタ KEY IS <= 料－区分コード 料－部位コード
010980                                    料－開始和暦年月
010990                                    REVERSED
011000     END-START.
011010     IF 状態キー = "00"
011020         READ ＥＸ料金マスタ NEXT
011030         AT END
011040*/エラー表示の修正
011050             PERFORM コンソールエラー確認
011060             DISPLAY "施術日に対応した計算情報がありません"
011070                     " 受診者№="   連計－患者コード
011080                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
011090*-----------------------------------------*
011100             CALL "actcshm"  WITH C LINKAGE
011110*-----------------------------------------*
011120*             ACCEPT  キー入力 FROM CONS
011130             PERFORM ファイル閉鎖
011140             MOVE ZERO TO PROGRAM-STATUS
011150             EXIT PROGRAM
011160         NOT AT END
011170*
011180             IF ( 施術和暦年月ＣＷ >= 料－開始和暦年月 ) AND
011190                ( 施術和暦年月ＣＷ <= 料－終了和暦年月 )
011200                 MOVE 料Ａ－老人一部負担金 TO 老人一部負担金Ｗ
011210                 MOVE 料Ａ－初検料         TO 初検料Ｗ
011220*老人保険改正の対応0101
011230                 MOVE 料Ａ－老人負担額上限 TO 老人負担額上限ＡＷ
011240             END-IF
011250         END-READ
011260     END-IF.
011270*
011280     EVALUATE TRUE
011290     WHEN ( 連計－公費種別 = 05 ) AND ( 連計－助成種別 = ZERO )
011300         MOVE 連計－公費種別       TO 市－公費種別
011310         MOVE 連計－市町村番号老人 TO 市－市町村番号
011320     WHEN ( 連計－公費種別 = ZERO ) AND ( 連計－助成種別 = 51 )
011330         MOVE 連計－助成種別       TO 市－公費種別
011340         MOVE 連計－市町村番号助成 TO 市－市町村番号
011350     WHEN ( 連計－公費種別 = 05 ) AND ( 連計－助成種別 >= 50 AND 連計－助成種別 <= 60 )
011360*         MOVE 連計－公費種別       TO 市－公費種別
011370*         MOVE 連計－市町村番号老人 TO 市－市町村番号
011380         MOVE 連計－助成種別       TO 市－公費種別
011390         MOVE 連計－市町村番号助成 TO 市－市町村番号
011400*/４１に準ずる助成の対応
011410     WHEN ( 連計－助成種別 NOT = ZERO)
011420         MOVE 連計－助成種別       TO 市－公費種別
011430         MOVE 連計－市町村番号助成 TO 市－市町村番号
011440     WHEN OTHER
011450*/エラー表示の修正
011460         PERFORM コンソールエラー確認
011470         DISPLAY "老人の種別が正しく設定されてません"
011480                 " 受診者№="   連計－患者コード
011490                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
011500*-----------------------------------------*
011510         CALL "actcshm"  WITH C LINKAGE
011520*-----------------------------------------*
011530*         ACCEPT  キー入力 FROM CONS
011540         PERFORM ファイル閉鎖
011550         MOVE ZERO TO PROGRAM-STATUS
011560         EXIT PROGRAM
011570     END-EVALUATE.
011580     READ ＥＸ市町村マスタ
011590     INVALID KEY
011600*/エラー表示の修正
011610         PERFORM コンソールエラー確認
011620         DISPLAY "市町村番号が登録されていません"
011630                 " 受診者№="   連計－患者コード
011640                 " 施術年月="   連計－施術年 連計－施術月
011650                 " 種別="       市－公費種別
011660                 " 市町村番号=" 市－市町村番号  UPON CONS
011670*-----------------------------------------*
011680         CALL "actcshm"  WITH C LINKAGE
011690*-----------------------------------------*
011700*         ACCEPT  キー入力 FROM CONS
011710         PERFORM ファイル閉鎖
011720         MOVE ZERO TO PROGRAM-STATUS
011730         EXIT PROGRAM
011740     NOT INVALID KEY
011750*/以下のデータは年月で変わる
011760* 特別負担
011770         MOVE 市－公費種別   TO 保特－保険種別
011780         MOVE 市－市町村番号 TO 保特－保険者番号
011790         MOVE 連計－施術和暦 TO 保特－開始和暦
011800         MOVE 連計－施術年   TO 保特－開始年
011810         MOVE 連計－施術月   TO 保特－開始月
011820         START ＥＸ保険者特別負担マスタ KEY IS <= 保特－保険種別 
011830                                              保特－保険者番号
011840                                              保特－開始和暦年月
011850                                              REVERSED
011860         END-START
011870         IF 状態キー = "00" 
011880             READ ＥＸ保険者特別負担マスタ NEXT
011890             NOT AT END
011900                 IF ( 保特－保険種別   = 市－公費種別 ) AND
011910                    ( 保特－保険者番号 = 市－市町村番号 )
011920                    MOVE 保特－負担区分       TO 負担区分Ｗ
011930                    MOVE 保特－負担率１       TO 助成負担率Ｗ
011940                    MOVE 保特－負担一定金額   TO 負担一定金額Ｗ
011950                    MOVE 保特－事務手数料     TO 事務手数料Ｗ
011960                    MOVE 保特－助成負担回数   TO 助成負担回数Ｗ
011961                    MOVE 保特－限度額１       TO 限度額１Ｗ
011962                    MOVE 保特－限度額２       TO 限度額２Ｗ
011963                    MOVE 保特－限度額３       TO 限度額３Ｗ
011970*                    MOVE 保特－負担率２       TO 助成特別負担率２Ｗ
011980*                    MOVE 保特－助成負担回数２ TO 助成特別助成負担回数２Ｗ
011990                 END-IF
012000             END-READ
012010         END-IF
012020     END-READ.
012030*
012040* 初検日又は、月の初回診療日かの情報を取得
012050     MOVE SPACE TO 初検日フラグ.
012060     MOVE SPACE TO 初診療フラグ.
012070     MOVE 連計－施術和暦 TO 施記－施術和暦 施術和暦ＣＷ.
012080     MOVE 連計－施術年   TO 施記－施術年   施術年ＣＷ.
012090     MOVE 連計－施術月   TO 施記－施術月   施術月ＣＷ.
012100     MOVE 連計－施術日   TO 施記－施術日.
012110     MOVE 連計－患者番号 TO 施記－患者番号 患者番号ＣＷ.
012120     MOVE 連計－枝番     TO 施記－枝番     枝番ＣＷ.
012130     READ ＥＸ施術記録Ｆ
012140     INVALID KEY
012150*/エラー表示の修正
012160         PERFORM コンソールエラー確認
012170         DISPLAY "施術記録がありません"
012180                 " 受診者№="   連計－患者コード
012190                 " 施術年月日=" 連計－施術年
012200                   連計－施術月 連計－施術日 UPON CONS
012210*-----------------------------------------*
012220         CALL "actcshm"  WITH C LINKAGE
012230*-----------------------------------------*
012240*         ACCEPT  キー入力 FROM CONS
012250         PERFORM ファイル閉鎖
012260         MOVE ZERO TO PROGRAM-STATUS
012270         EXIT PROGRAM
012280     NOT INVALID KEY
012290         IF 施記－診療区分 = 2
012300             MOVE  "YES" TO 初検日フラグ
012310         END-IF
012320         START ＥＸ施術記録Ｆ KEY IS < 施記－患者コード 施記－施術和暦年月日
012330                                                                REVERSED
012340         END-START
012350         IF 状態キー = "00"
012360             READ ＥＸ施術記録Ｆ NEXT
012370*/070517
012380             AT END
012390                 MOVE "YES" TO 初診療フラグ
012400             NOT AT END
012410                 IF ( 施術和暦年月ＣＷ NOT = 施記－施術和暦年月 ) OR
012420                    ( 患者コードＣＷ   NOT = 施記－患者コード   )
012430                     MOVE "YES" TO 初診療フラグ
012440                 END-IF
012450             END-READ
012460*/070517
012470         ELSE
012480             IF 状態キー = "23"
012490                 MOVE "YES" TO 初診療フラグ
012500             END-IF
012510         END-IF
012520     END-READ.
012530*
012540*================================================================*
012550* 定額公費老人負担算定 SECTION.
012560** ［２７老人］
012570*******************************************************************
012580** 日毎の費用額から老人一部負担金のみを患者負担。
012590**（月に最大、計Ａ－老人負担回数分）
012600** 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
012610** 引続きカウントされる。
012620*******************************************************************
012630** 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、
012640** 当月旧保険で診療した日数を取得（カレント番号の患者番号に加算する
012650** ため）
012660*******************************************************************
012670**
012680*     PERFORM 診療回数取得.
012690**
012700** 老人負担回数Ｗ（負担の規定診療回数：1998.04現在は４回）
012710**
012720** DEBUG
012730**     DISPLAY NC"実日数Ｗ" 実日数Ｗ UPON MSGBOX.
012740**     DISPLAY NC"老人負担回数Ｗ" 老人負担回数Ｗ UPON MSGBOX.
012750**
012760*     IF 実日数Ｗ > 老人負担回数Ｗ
012770*         MOVE 連計－費用額 TO 連計－費用額老人
012780*         MOVE ZERO         TO 連計－負担額老人
012790*         MOVE 連計－費用額 TO 連計－請求額老人
012800*     ELSE
012810*         IF 連計－費用額 <= 老人一部負担金Ｗ
012820**
012830*             EVALUATE 連計－負担金計算区分
012840*             WHEN ZERO
012850*                 MOVE 連計－費用額 TO 連計－費用額老人
012860*                 MOVE 連計－費用額 TO 連計－負担額老人
012870*                 MOVE ZERO         TO 連計－請求額老人
012880*             WHEN 2
012890*                 MOVE 連計－費用額 TO 連計－費用額老人
012900*                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－費用額 / 10
012910*                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
012920*                 MOVE 負担額Ｗ TO 連計－負担額老人
012930*                 MOVE ZERO     TO 連計－請求額老人
012940*             WHEN OTHER
012950**/エラー表示の修正
012960*                 PERFORM コンソールエラー確認
012970*                 DISPLAY "負担金計算区分が指定されていません"
012980*                         " 受診者№="   連計－患者コード
012990*                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013000**                 DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
013010*                 PERFORM ファイル閉鎖
013020*                 MOVE ZERO TO PROGRAM-STATUS
013030*                 EXIT PROGRAM
013040*             END-EVALUATE
013050**
013060*         ELSE
013070**
013080*             EVALUATE 連計－負担金計算区分
013090*             WHEN ZERO
013100** 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
013110*             WHEN 2
013120*                 MOVE 連計－費用額     TO 連計－費用額老人
013130*                 MOVE 老人一部負担金Ｗ TO 連計－負担額老人
013140**
013150*                 COMPUTE 請求額Ｗ = 連計－費用額 - 老人一部負担金Ｗ
013160*                 MOVE 請求額Ｗ         TO 連計－請求額老人
013170*             WHEN OTHER
013180**/エラー表示の修正
013190*                 PERFORM コンソールエラー確認
013200*                 DISPLAY "負担金計算区分が指定されていません"
013210*                         " 受診者№="   連計－患者コード
013220*                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013230**                 DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
013240*                 PERFORM ファイル閉鎖
013250*                 MOVE ZERO TO PROGRAM-STATUS
013260*                 EXIT PROGRAM
013270*             END-EVALUATE
013280*         END-IF
013290*     END-IF.
013300**
013310*================================================================*
013320 助成負担算定 SECTION.
013330*
013340* 助成分
013350     EVALUATE 負担区分Ｗ
013360*　０：通常請求（全額負担）
013370     WHEN ZERO
013380         MOVE ZERO             TO 連計－負担額助成
013390         MOVE 連計－負担額老人 TO 連計－請求額助成
013400*　１：初検料(初検料が発生する日)に対する負担率分
013410     WHEN 1
013420* DEBUG
013430*     DISPLAY NC"初検日フラグ" 初検日フラグ UPON MSGBOX
013440*
013450         IF 初検日フラグ NOT = SPACE
013460             PERFORM 負担率取得
013470             PERFORM 負担額計算初検
013480         ELSE
013490             MOVE ZERO             TO 連計－負担額助成
013500             MOVE 連計－負担額老人 TO 連計－請求額助成
013510         END-IF
013520*　２：初検料(初検料が発生する日)に対する一定金額
013530     WHEN 2
013540         IF 初検日フラグ NOT = SPACE
013550             MOVE 負担一定金額Ｗ   TO 連計－負担額助成
013560             COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
013570             MOVE 請求額Ｗ         TO 連計－請求額助成
013571             MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
013580         ELSE
013590             MOVE ZERO             TO 連計－負担額助成
013600             MOVE 連計－負担額老人 TO 連計－請求額助成
013610         END-IF
013620*　３：初検日(初検料の発生する日)の費用額の本体負担率分に対する負担率
013630     WHEN 3
013640         IF 初検日フラグ NOT = SPACE
013650             PERFORM 負担率取得
013660* 途中の負担金は、１円単位のまま、助成の計算を行う。
013670* 初検日の費用額の本体負担率分を計算する。
013680*             PERFORM 負担額計算２
013690             PERFORM 負担額計算助成
013700         ELSE
013710             MOVE ZERO             TO 連計－負担額助成
013720             MOVE 連計－負担額老人 TO 連計－請求額助成
013730         END-IF
013740*　４：初検日(初検料の発生する日)の費用額の本体負担率分（親保険負担額）
013750*      に対する一定金額
013760     WHEN 4
013770         IF 初検日フラグ NOT = SPACE
013780* 途中の負担金は、１円単位のまま、助成の計算を行う。
013790*             PERFORM 負担額計算２
013800             IF 負担一定金額Ｗ >= 連計－負担額老人
013810                 MOVE 連計－負担額老人 TO 連計－負担額助成
013820                 MOVE ZERO             TO 連計－請求額助成
013821*               / 連計日計窓口－負担額は何にもしない /
013830*
013831             ELSE
013840                 MOVE 負担一定金額Ｗ  TO 連計－負担額助成
013850                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
013860                 MOVE 請求額Ｗ        TO 連計－請求額助成
013861                MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
013870             END-IF
013880         ELSE
013890             MOVE ZERO             TO 連計－負担額助成
013900             MOVE 連計－負担額老人 TO 連計－請求額助成
013910         END-IF
013920*　５：毎月一定金額を負担
013930* 
013940     WHEN 5
013941         PERFORM 助成一部負担算定０５
013942*
014070*　６：毎月一定金額、一定回数を負担
014080* 
014090     WHEN 6
014100         PERFORM 助成一部負担算定
014110*　７：指定した日の費用額の本体負担率分に対する一定金額
014120* 
014130     WHEN 7
014140         PERFORM 施術記録Ｆ取得
014150         IF 施記－その他計算区分１ = 1
014160             IF 負担一定金額Ｗ >= 連計－負担額老人
014170                 MOVE 連計－負担額老人 TO 連計－負担額助成
014180                 MOVE ZERO             TO 連計－請求額助成
014188*               / 連計日計窓口－負担額は何にもしない /
014189*
014190             ELSE
014200                 MOVE 負担一定金額Ｗ  TO 連計－負担額助成
014210                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
014220                 MOVE 請求額Ｗ        TO 連計－請求額助成
014221                MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
014230             END-IF
014240         ELSE
014250             MOVE ZERO             TO 連計－負担額助成
014260             MOVE 連計－負担額老人 TO 連計－請求額助成
014270         END-IF
014280*/０９、１０：２７老人＋４１に準ずる助成の対応/071005
014290     WHEN 09
014300     WHEN 10
014310         PERFORM 定率助成老人負担算定
014320* １２：本体負担額を全額負担030717
014330     WHEN 12
014340         MOVE 連計－負担額老人 TO 連計－負担額助成
014350         MOVE ZERO             TO 連計－請求額助成
014351*       / 連計日計窓口－負担額は何にもしない /
014352*
014360* １３：毎月一定金額、一定回数を負担（１０円単位）
014370     WHEN 13
014380         PERFORM 助成一部負担算定１０
014390*/0506兵庫県の改定170701より
014400* １４：毎月一定金額を一定回数まで負担（手数料を低所得者用負担額とする）
014410     WHEN 14
014420         PERFORM 助成一部負担算定１４
014430*/0708東京都マル子の対応191001より/老人で対応は080523
014440* １５：指定負担率
014450     WHEN 15
014460         PERFORM 助成負担額計算１５
014470         IF 助成負担額Ｗ > 連計－負担額老人
014480             MOVE 連計－負担額老人 TO 連計－負担額助成
014490         ELSE
014500             MOVE 助成負担額Ｗ     TO 連計－負担額助成
014510         END-IF
014520         COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
014541*/指定負担率で毎月一定金額まで負担（上限あり）
014542     WHEN 16
014543         PERFORM 助成一部負担算定１６
      */大阪府対応/20180307
      * 22：毎月一定金額で一定回数を限度額まで負担(１円単位)
012130     WHEN 22
012140         PERFORM 助成一部負担算定２２
      */今後作る？↓↓↓
      ** 23：毎月一定金額で一定回数を限度額まで負担(１０円単位)
012130*     WHEN 23
012140*         PERFORM 助成一部負担算定２３
      */今後作る？↑↑↑
      *
      *
      */北海道対応/20180817
012130     WHEN 24
012140         PERFORM 助成一部負担算定２４
014544*
014790     WHEN OTHER
014800         MOVE ZERO             TO 連計－負担額助成
014810         MOVE 連計－負担額老人 TO 連計－請求額助成
014820     END-EVALUATE.
014830*
014840*================================================================*
014850 受診者情報Ｆ読込 SECTION.
014860*
014870     READ ＥＸ受診者情報Ｆ NEXT
014880     AT END
014890         MOVE "YES" TO 終了フラグ３
014900     END-READ.
014901*================================================================*
014902 診療回数取得 SECTION.
014903*
014904     IF ( 連計算助成月途中－日計区分 = 1 ) AND ( 連計算助成月途中－助成月途中開始日 NOT = ZERO ) 
014905*      / 日計で助成月途中の時
014906        PERFORM 実日数取得月途中助成
014907     ELSE
014908        PERFORM 診療回数取得通常
014909     END-IF.
014910*
014911*================================================================*
014930 診療回数取得通常 SECTION.
014931*
014940* 保険が変更になった等の場合、当月の中で同患者番号の実日数もカウントする
014950*
014960* DEBUG
014970*     DISPLAY NC"診療回数取得" UPON MSGBOX.
014980*
014990* 指定月で枝番が存在するかの判定
015000     MOVE 連計－患者番号 TO 受－患者番号.
015010     MOVE 連計－枝番     TO 受－枝番.
015020     MOVE 連計－施術和暦 TO 受－施術和暦.
015030     MOVE 連計－施術年   TO 受－施術年.
015040     MOVE 連計－施術月   TO 受－施術月.
015050     START ＥＸ受診者情報Ｆ KEY IS >= 受－患者コード
015060                                  受－施術和暦年月
015070     END-START.
015080     IF 状態キー = "00"
015090         MOVE SPACE TO 終了フラグ３
015100         MOVE SPACE TO 枝番フラグ
015110         MOVE 連計－患者番号 TO 患者番号Ｗ
015120         PERFORM 受診者情報Ｆ読込
015130         PERFORM UNTIL ( 終了フラグ３ NOT = SPACE ) OR 
015140                       ( 患者番号Ｗ   NOT = 受－患者番号 )
015150             IF ( 受－枝番 NOT = SPACE ) AND
015160                ( 受－継続区分 = ZERO  )
015170                 MOVE "YES" TO 枝番フラグ
015180                 MOVE "YES" TO 終了フラグ３
015190             END-IF
015200             PERFORM 受診者情報Ｆ読込
015210         END-PERFORM
015220     END-IF.
015230*
015240     MOVE ZERO  TO 実日数Ｗ.
015250     IF 枝番フラグ NOT = SPACE
015260         PERFORM 前実日数取得
015270         IF 実日数Ｗ <= 老人負担回数Ｗ
015280             PERFORM 実日数取得
015290         END-IF
015300     ELSE
015310         PERFORM 実日数取得
015320     END-IF.
015330*
015340*================================================================*
015350 実日数取得 SECTION.
015360*
015370     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
015380     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
015390     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
015400     MOVE 1               TO  施記－施術日.
015410     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
015420     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
015430*
015440     MOVE 連計－施術日    TO  施術日ＣＷ.
015450*
015460     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
015470     END-START.
015480*
015490     IF 状態キー = "00"
015500         MOVE SPACE TO 終了フラグ３
015510         PERFORM 施術記録Ｆ読込
015520         PERFORM UNTIL ( 施記－施術和暦年月日 > 施術和暦年月日ＣＷ ) OR
015530                       ( 施記－患者コード NOT = 患者コードＣＷ     ) OR
015540                       ( 終了フラグ３     NOT = SPACE              )
015550             COMPUTE 実日数Ｗ = 実日数Ｗ + 1
015560             PERFORM 施術記録Ｆ読込
015570         END-PERFORM
015580     END-IF.
015590*
015591*================================================================*
015592 実日数取得月途中助成 SECTION.
015593*
015594     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
015595     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
015596     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
015597**
015598     MOVE 連計算助成月途中－助成月途中開始日  TO 施記－施術日.
015599**
015600     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
015601     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
015602*
015603     MOVE 連計－施術日    TO  施術日ＣＷ.
015604*
015605     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
015606     END-START.
015607*
015608     IF 状態キー = "00"
015609         MOVE SPACE TO 終了フラグ３
015610         PERFORM 施術記録Ｆ読込
015611         PERFORM UNTIL ( 施記－施術和暦年月日 > 施術和暦年月日ＣＷ ) OR
015612                       ( 施記－患者コード NOT = 患者コードＣＷ     ) OR
015613                       ( 終了フラグ３     NOT = SPACE              )
015614             COMPUTE 実日数Ｗ = 実日数Ｗ + 1
015615             PERFORM 施術記録Ｆ読込
015616         END-PERFORM
015617     END-IF.
015618*
015619*================================================================*
015620 初診療日取得 SECTION.
015621*
015630* ２．同月・同患者番号・老人保険の場合（親保険の変更等）
015640* 　　で患者コードを変更した場合、その分の実日数もカウントする。
015650*
015660     PERFORM 老人種別取得.
015670     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
015680     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.  
015690     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
015700     MOVE 1               TO  施記－施術日.
015710     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
015720     MOVE 連計－枝番      TO  施記－枝番     枝番ＣＷ.
015730*
015740     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
015750     END-START.
015760*
015770     IF 状態キー = "00"
015780         PERFORM 施術記録Ｆ読込
015790         MOVE 施記－施術和暦年月日 TO 初診療年月日ＣＷ
015800     END-IF.
015810*
015820*================================================================*
015830 前実日数取得 SECTION.
015840*
015850*/当月に枝番が有る場合に枝番の分の実日数もカウントする。
015860     PERFORM 初診療日取得.
015870*
015880     MOVE 連計－施術和暦  TO  施記－施術和暦 施術和暦ＣＷ.
015890     MOVE 連計－施術年    TO  施記－施術年   施術年ＣＷ.
015900     MOVE 連計－施術月    TO  施記－施術月   施術月ＣＷ.  
015910     MOVE 1               TO  施記－施術日.
015920     MOVE 連計－患者番号  TO  施記－患者番号 患者番号ＣＷ.
015930     MOVE SPACE           TO  施記－枝番.
015940*
015950     MOVE 連計－枝番      TO  枝番ＣＷ.
015960*
015970     START ＥＸ施術記録Ｆ KEY IS >= 施記－患者コード 施記－施術和暦年月日
015980     END-START.
015990*
016000     IF 状態キー = "00"
016010         MOVE SPACE TO 終了フラグ３
016020         PERFORM 施術記録Ｆ読込
016030         PERFORM UNTIL ( 施記－患者番号     NOT = 患者番号ＣＷ     ) OR
016040*/患者コード順にソートされる為年月は順番に並んでいない
016050*                       ( 施記－施術和暦年月 NOT = 施術和暦年月ＣＷ ) OR
016060                       ( 終了フラグ３       NOT = SPACE            )
016070             PERFORM 老人種別取得２
016080             IF ( 施記－患者コード NOT = 患者コードＣＷ ) AND
016090                ( 施記－患者番号       = 患者番号ＣＷ   ) AND
016100                ( 施記－施術和暦年月日 < 初診療年月日ＣＷ ) AND
016110*/患者コード順にソートされる為年月は順番に並んでいない
016120                ( 施記－施術和暦年月  = 施術和暦年月ＣＷ ) AND
016130                ( ( 公費種別Ｗ = 公費種別Ｗ２ ) OR 
016140                  ( 助成種別Ｗ = 助成種別Ｗ２ )         )
016150                 COMPUTE 実日数Ｗ = 実日数Ｗ + 1
016160             END-IF
016170             PERFORM 施術記録Ｆ読込
016180         END-PERFORM
016190     END-IF.
016200*
016210* 実日数は、都度カウントする。
016220*     MOVE 実日数Ｗ TO 負－実日数.
016230*
016240*================================================================*
016250 施術記録Ｆ読込 SECTION.
016260*
016270     READ ＥＸ施術記録Ｆ NEXT
016280     AT END
016290         MOVE "YES" TO 終了フラグ３
016300     END-READ.
016310*================================================================*
016320 老人種別取得 SECTION.
016330*
016340     MOVE 連計－施術和暦   TO 受－施術和暦.
016350     MOVE 連計－施術年     TO 受－施術年.
016360     MOVE 連計－施術月     TO 受－施術月.
016370     MOVE 連計－患者番号   TO 受－患者番号.
016380     MOVE 連計－枝番       TO 受－枝番.
016390     READ ＥＸ受診者情報Ｆ
016400     INVALID KEY
016410         MOVE NC"受診" TO ファイル名Ｗ
016420     NOT INVALID KEY
016430         MOVE 受－公費種別 TO 公費種別Ｗ
016440         MOVE 受－助成種別 TO 助成種別Ｗ
016450     END-READ.
016460*
016470*================================================================*
016480 老人種別取得２ SECTION.
016490*
016500     MOVE 施記－施術和暦   TO 受－施術和暦.
016510     MOVE 施記－施術年     TO 受－施術年.
016520     MOVE 施記－施術月     TO 受－施術月.
016530     MOVE 施記－患者番号   TO 受－患者番号.
016540     MOVE 施記－枝番       TO 受－枝番.
016550     READ ＥＸ受診者情報Ｆ
016560     INVALID KEY
016570         MOVE NC"受診" TO ファイル名Ｗ
016580     NOT INVALID KEY
016590         MOVE 受－公費種別 TO 公費種別Ｗ２
016600         MOVE 受－助成種別 TO 助成種別Ｗ２
016610     END-READ.
016620*
016630*================================================================*
016640 コンソールエラー確認 SECTION.
016650*
016660     IF エラー表示Ｆ = ZERO
016670         MOVE  "エラーが発生したのでコンソール画面の内容" TO 連メ７－メッセージ１
016680         MOVE  "を確認し、修正してください。"             TO 連メ７－メッセージ２
016690         CALL   "MSG007"
016700         CANCEL "MSG007"
016710     END-IF.
016720     MOVE 1 TO エラー表示Ｆ.
016730*================================================================*
016740*** 旧定率公費老人負担算定 SECTION.
016750**** ［２７老人］
016760*********************************************************************
016770**** 日毎の費用額から老人の負担率分を患者負担
016780**** 月に最大 ３０００円まで
016790**** 同一月内で初検日があっても、保険が切り替わっても老人負担金額分は
016800**** 引続きカウントされる。
016810*********************************************************************
016820***     MOVE 連計－費用額 TO 連計－費用額老人.
016830***     MOVE ZERO         TO 負担額Ｗ.
016840***     MOVE ZERO         TO 請求額Ｗ.
016850****/日計の計算は受診者ファイルの老人最終負担日と老人負担額端数を判定する
016860****/月計は上限を超えるまで計算する。
016870****/バグ修正。負担額の上限の処理は必要ない。↓↓0211
016880***     MOVE ZERO                   TO 老人最終負担日Ｗ.
016890***     MOVE ZERO                   TO 老人負担額端数Ｗ.
016900****     IF 連老計算－月日Ｆ = 1
016910****         MOVE 連計－施術和暦         TO 受－施術和暦
016920****         MOVE 連計－施術年           TO 受－施術年
016930****         MOVE 連計－施術月           TO 受－施術月
016940****         MOVE 連計－患者番号         TO 受－患者番号
016950****         MOVE 連計－枝番             TO 受－枝番
016960****         READ ＥＸ受診者情報Ｆ
016970****         INVALID KEY
016980****             MOVE ZERO               TO 老人最終負担日Ｗ
016990****             MOVE ZERO               TO 老人負担額端数Ｗ
017000****         NOT INVALID KEY
017010****             MOVE 受－老人最終負担日 TO 老人最終負担日Ｗ
017020****             MOVE 受－老人負担額端数 TO 老人負担額端数Ｗ
017030****         END-READ
017040****     ELSE
017050****         MOVE ZERO                   TO 老人最終負担日Ｗ
017060****         MOVE ZERO                   TO 老人負担額端数Ｗ
017070****     END-IF.
017080****/バグ修正。負担額の上限の処理は必要ない。↑↑0211
017090****
017100***     EVALUATE TRUE
017110****/通常計算*/枝番、最終負担日より前の日計、月計、の場合の計算
017120****         */上限を超えない場合は最終負担日に最終日が入っている。
017130****         */上限を超えない場合は毎日計算する。
017140***     WHEN 連老計算－枝番フラグ = 1
017150****/ 枝番で元の番号が３０００円を超える場合のバグ修正「 > 」→「 >= 」
017160****/ 別のバグの発生の為元に戻す010828
017170***     WHEN 老人最終負担日Ｗ  > 連計－施術日
017180***     WHEN 連老計算－月日Ｆ  = ZERO
017190***     WHEN 老人負担額端数Ｗ  = ZERO
017200***         PERFORM 老人負担率取得
017210*********************************************************************
017220****☆注意☆
017230****窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
017240****レセプトは、負担金の小数点第１位を切り上げる
017250*********************************************************************
017260****
017270*******************************************************************
017280**** 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
017290**** 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
017300****              　　　　 　　　１　　　　１０円単位             *
017310****              　　　　　　　 ２　　　　　１円単位  １０円単位 *
017320*******************************************************************
017330********************************************
017340**** 負担額１０円単位（１円の位を四捨五入）*
017350********************************************
017360****/0101老人の負担金額は日々の１０円単位の金額の合計
017370***         EVALUATE 連計－負担金計算区分
017380*****/0101老人保険は負担金計算区分が０でも２でも１０円単位で計算する？0101没*>使用確定後消す事
017390****02102 １円単位で計算する。
017400****         WHEN ZERO
017410************************************************************************没*>使用確定後消す事
017420***         WHEN 2
017430****     負担額は、小数点以下第１位を切り上げる
017440***             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
017450***             COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
017460***             COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
017470***             DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
017480***                                      REMAINDER 剰余Ｗ
017490***             END-DIVIDE
017500***             IF 剰余Ｗ = ZERO
017510***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
017520***                 COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
017530****
017540***                 COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
017550***                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
017560****
017570****     負担額Ｗが１０円単位の状態で請求額を計算
017580***                 COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
017590***             ELSE
017600***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
017610***                 COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
017620****     小数点以下第１位が発生した場合、整数部に１を加え切り上げる
017630****    /日計の場合負担額を切り上げず請求額から１を引く↑は取り消し
017640****                 COMPUTE 負担額Ｗ = 負担額Ｗ + 1
017650****
017660***                 COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
017670***                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
017680****
017690****     負担額Ｗが１０円単位の状態で請求額を計算
017700***                 COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
017710***             END-IF
017720****
017730****    *****************
017740****     負担額１円単位 *
017750****    *****************
017760***         WHEN ZERO
017770***             COMPUTE 負担率中間結果Ｗ = ( 負担率Ｗ / 100 )
017780***             COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
017790***             COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
017800***             DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
017810***                                    REMAINDER 剰余Ｗ
017820***             END-DIVIDE
017830***             IF 剰余Ｗ = ZERO
017840***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
017850***                 COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
017860***                 COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
017870***             ELSE
017880****     一部負担金の端数切り上げ
017890***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
017900***                 COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
017910****
017920***                 COMPUTE 負担額Ｗ = 負担額Ｗ + 1
017930****
017940***                 COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
017950***             END-IF
017960***         WHEN OTHER
017970****    /エラー表示の修正
017980***             PERFORM コンソールエラー確認
017990***             DISPLAY "負担金計算区分が指定されていません"
018000***                     " 受診者№="   連計－患者コード
018010***                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
018020****             DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
018030***             PERFORM ファイル閉鎖
018040***             MOVE ZERO TO PROGRAM-STATUS
018050***             EXIT PROGRAM
018060***         END-EVALUATE
018070****
018080****/老人の負担額を日毎の費用額を四捨五入して足し込んで行く方法。0101
018090****    /月計系の計算で負担額の累計が上限を超える場合の処理0101
018100***         IF (連老計算－月日Ｆ = ZERO) AND
018110***            (連老負－老人負担額累計 + 負担額Ｗ >= 老人負担額上限ＡＷ)
018120***             COMPUTE 請求額Ｗ = 請求額Ｗ
018130***                              + 連老負－老人負担額累計 
018140***                              + 負担額Ｗ
018150***                              - 老人負担額上限ＡＷ
018160***             COMPUTE 負担額Ｗ = 老人負担額上限ＡＷ - 連老負－老人負担額累計
018170***         END-IF
018180****
018190****
018200****/端数の処理は必要ない。↓↓0211
018210******/端数の処理
018220*****     WHEN 老人最終負担日Ｗ = 連計－施術日
018230*****         EVALUATE 連計－負担金計算区分
018240*****         WHEN 2
018250******/   １０円単位(１の位を四捨五入)
018260******/   請求額は１円単位まで計算、端数は小数点以下にならない為整数のみ対応
018270******/   請求額は四捨五入する前の負担額で計算する。
018280*****             COMPUTE 請求額Ｗ         = 連計－費用額 - 老人負担額端数Ｗ
018290*****             COMPUTE 負担額Ｗ ROUNDED = 老人負担額端数Ｗ / 10
018300*****             COMPUTE 負担額Ｗ         = 負担額Ｗ * 10
018310******             MOVE 老人負担額端数Ｗ TO 計算用負担額Ｗ
018320******             COMPUTE 請求額Ｗ = 連計－費用額 - 計算用負担額Ｗ
018330******             COMPUTE 計算用負担額Ｗ = 計算用負担額Ｗ + 5
018340******             MOVE ZERO TO 負担額１位Ｗ
018350******             MOVE 計算用負担額Ｗ TO 負担額Ｗ
018360******/   １円単位
018370*****         WHEN ZERO
018380*****             MOVE 老人負担額端数Ｗ TO 負担額Ｗ
018390*****             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
018400*****         END-EVALUATE
018410******/枝番で累計が３０００を超える場合の不具合の修正、
018420******/累計の計算の為に負担額Ｗ１０に転記しておく。010828
018430*****         MOVE 負担額Ｗ TO 負担額Ｗ１０
018440******
018450******/計算しない(負担額０円)
018460*****     WHEN 老人最終負担日Ｗ < 連計－施術日
018470*****         MOVE ZERO TO 負担額Ｗ
018480*****         COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
018490****/端数の処理は必要ない。↑↑0211
018500***     END-EVALUATE.
018510****
018520***     MOVE 負担額Ｗ TO 連計－負担額老人.
018530***     MOVE 請求額Ｗ TO 連計－請求額老人.
018540****
018550****/１円単位
018560***     IF (連老負－老人負担額端数１ = ZERO) AND
018570***        (連老計算－累計フラグ     = ZERO)
018580****/    負担回数0101
018590***         COMPUTE 連老負－老人負担回数１ = 連老負－老人負担回数１ + 1
018600****/    最終負担日0101
018610***         MOVE 連計－施術日 TO 連老負－老人最終負担日１
018620****/    １円単位の負担金額の合計、小数第１位を切り上げてある負担額Ｗを使う。
018630***         COMPUTE 連老負－老人負担額累計１ = 連老負－老人負担額累計１
018640***                                          + 負担額Ｗ
018650***         IF 連老負－老人負担額累計１ >= 老人負担額上限ＡＷ
018660***             COMPUTE 連老負－老人負担額端数１ = 老人負担額上限ＡＷ
018670***                                              - 連老負－老人負担額累計１
018680***                                              + 負担額Ｗ
018690***         END-IF
018700***     END-IF.
018710****/１０円単位
018720***     IF (連老負－老人負担額端数 = ZERO) AND
018730***        (連老計算－累計フラグ   = ZERO)
018740****/    負担回数0101
018750***         COMPUTE 連老負－老人負担回数 = 連老負－老人負担回数 + 1
018760****/    最終負担日0101
018770***         MOVE 連計－施術日 TO 連老負－老人最終負担日
018780****/    １０円単位の負担金額の合計、累計は四捨五入して１０円単位で足し込む0101
018790****/    ここでの負担額Ｗは既に小数点以下１位を切り上げてあるので
018800****/    計算前の負担額Ｗ１０を使って再計算する。
018810***         COMPUTE 負担額Ｗ ROUNDED       = 負担額Ｗ１０ / 10
018820***         COMPUTE 負担額Ｗ               = 負担額Ｗ     * 10
018830***         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 + 負担額Ｗ
018840***         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
018850***             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
018860***                                            - 連老負－老人負担額累計
018870***                                            + 負担額Ｗ
018880***         END-IF
018890***     END-IF.
018900****     END-IF.
018910*================================================================*
018920 老人負担率取得 SECTION.
018930*
018940     MOVE 連計－公費種別 TO 負率－保険種別.
018950*/後高＋資格証明/080410
018960     IF (受－資格証明区分 = 1) AND (受－施術和暦年月 >= 42004)
018970         MOVE 91         TO 負率－保険種別
018980     END-IF.
018990*
019000     MOVE 連計－施術和暦 TO 負率－開始和暦 施術和暦ＣＷ.
019010     MOVE 連計－施術年   TO 負率－開始年   施術年ＣＷ.
019020     MOVE 連計－施術月   TO 負率－開始月   施術月ＣＷ.
019030     START ＥＸ負担率マスタ KEY IS <= 負率－保険種別
019040                                  負率－開始和暦年月
019050                                  REVERSED
019060     END-START
019070     READ ＥＸ負担率マスタ NEXT
019080     AT END
019090*/エラー表示の修正
019100         PERFORM コンソールエラー確認
019110         DISPLAY "施術日に合った負担率がみつかりません"
019120                 " 受診者№="   連計－患者コード
019130                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
019140*-----------------------------------------*
019150         CALL "actcshm"  WITH C LINKAGE
019160*-----------------------------------------*
019170*         ACCEPT  キー入力 FROM CONS
019180         PERFORM ファイル閉鎖
019190         MOVE ZERO TO PROGRAM-STATUS
019200         EXIT PROGRAM
019210     NOT AT END
019220         IF ( 施術和暦年月ＣＷ >= 負率－開始和暦年月 ) AND
019230            ( 施術和暦年月ＣＷ <= 負率－終了和暦年月 )
019240             MOVE 負率－本人負担率 TO 本人負担率Ｗ
019250             MOVE 負率－家族負担率 TO 家族負担率Ｗ
019260         END-IF
019270     END-READ
019280*
019290     EVALUATE 連計－本人家族区分
019300     WHEN 1
019310         MOVE 本人負担率Ｗ TO 負担率Ｗ
019320     WHEN 2
019330         MOVE 家族負担率Ｗ TO 負担率Ｗ
019340     WHEN OTHER
019350*/エラー表示の修正
      */保険証画面からコンソールエラー表示を削除する↓↓↓/120926
019360*         PERFORM コンソールエラー確認
019370*         DISPLAY "本人家族区分が設定されていません"
019380*                 " 受診者№="   連計－患者コード
019390*                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
019400**-----------------------------------------*
019410*         CALL "actcshm"  WITH C LINKAGE
019420**-----------------------------------------*
019430*         ACCEPT  キー入力 FROM CONS
               MOVE  "本人家族区分が設定されていません" TO 連メ７－メッセージ１
               MOVE  SPACE                              TO 連メ７－メッセージ２
      */コンソール画面に年月患者コードを表示する/130601
               STRING "受診者№="       DELIMITED BY SIZE
                       連計－患者コード DELIMITED BY SIZE
                     " 施術年月="       DELIMITED BY SIZE
                       連計－施術年     DELIMITED BY SIZE
                       連計－施術月     DELIMITED BY SIZE
                  INTO 連メ７－メッセージ２
               END-STRING
               CALL   "MSG007"
               CANCEL "MSG007"
      */保険証画面からコンソールエラー表示を削除する↑↑↑/120926
019440         PERFORM ファイル閉鎖
019450         MOVE ZERO TO PROGRAM-STATUS
019460         EXIT PROGRAM
019470     END-EVALUATE.
019480*
019490*/老人の計算の改正0210
019500     MOVE 連計－施術和暦 TO 受－施術和暦.
019510     MOVE 連計－施術年   TO 受－施術年.
019520     MOVE 連計－施術月   TO 受－施術月.
019530     MOVE 連計－患者番号 TO 受－患者番号.
019540     MOVE 連計－枝番     TO 受－枝番.
019550     READ ＥＸ受診者情報Ｆ
019560     INVALID KEY
019570         CONTINUE
019580     NOT INVALID KEY
019590*/後高＋資格証明/080410
019600         IF (受－資格証明区分 = 1) AND (受－施術和暦年月 >= 42004)
019610             CONTINUE
019620         ELSE
019630             IF 受－老人負担金免除 >= 2
019640                 COMPUTE 負担率Ｗ = 受－老人負担金免除 * 10
019650             END-IF
019660         END-IF
019670     END-READ.
019680*
019690*/国保組合で負担なしの対応↓↓↓/0501
019700     MOVE 連計－施術和暦 TO 受－施術和暦.
019710     MOVE 連計－施術年   TO 受－施術年.
019720     MOVE 連計－施術月   TO 受－施術月.
019730     MOVE 連計－患者番号 TO 受－患者番号.
019740     MOVE 連計－枝番     TO 受－枝番.
019750     READ ＥＸ受診者情報Ｆ
019760     INVALID KEY
019770*/エラー表示の修正
019780         PERFORM コンソールエラー確認
019790         DISPLAY "施術月の受診者情報がありません"
019800                 " 受診者№=" 連計－患者コード
019810                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
019820*-----------------------------------------*
019830         CALL "actcshm"  WITH C LINKAGE
019840*-----------------------------------------*
019850*         ACCEPT  キー入力 FROM CONS
019860         PERFORM ファイル閉鎖
019870         MOVE ZERO TO PROGRAM-STATUS
019880         EXIT PROGRAM
019890     NOT INVALID KEY
019900         MOVE 受－甲乙区分 TO 甲乙区分Ｗ
019910     END-READ.
019920     IF 甲乙区分Ｗ = 9
019930         MOVE ZERO TO 負担率Ｗ
019940     END-IF.
019950*/国保組合で負担なしの対応↑↑↑/0501
019960*/9:０割の対応/0609
019970     IF 受－特別区分 = 9
019980         MOVE ZERO TO 負担率Ｗ
019990     END-IF.
020000*
020001*  退避
020002     MOVE 負担率Ｗ TO 老人負担率Ｗ.
020003*
020010*================================================================*
020020 公費老人助成負担算定 SECTION.
020030* ［２７老人＋助成］
020040*
020050*     PERFORM 公費老人負担算定.
020060*/定率制のみに変更0210
020070*/老人負担計算区分１：定額制、０：定率制
020080*     IF 老人負担計算区分Ｗ = 1
020090*         PERFORM 定額公費老人負担算定
020100*     ELSE
020110         PERFORM 定率公費老人負担算定
020120*     END-IF
020130*/２７＋助成の場合は患者負担は０円とする。
020140*/山形県の身障は負担金がある。
020150     IF (助成負担計算区分Ｗ NOT = ZERO) AND
020160        (助成負担金免除Ｗ   NOT = 1   )
020170         PERFORM 助成負担算定
020180     ELSE
020190         MOVE ZERO             TO 連計－負担額助成
020200         MOVE 連計－負担額老人 TO 連計－請求額助成
020210     END-IF.
020220*
020230*================================================================*
020240*** 旧定率助成老人負担算定 SECTION.
020250****
020260**** ［４１老人］
020270****/月の負担額
020280****/	日々の費用額に４１老人負担割合１割をかけて１ヶ月分足し込む。
020290****/	ワークは小数点以下３位まで持つ事とする。
020300****/日の負担額
020310****/	日の費用額に４１老人負担割合１割をかけて１のくらいを四捨五入する。
020320****
020330***     MOVE 連計－費用額 TO 連計－費用額助成.
020340***     MOVE ZERO         TO 負担額４１Ｗ.
020350***     MOVE ZERO         TO 負担額Ｗ.
020360***     MOVE ZERO         TO 請求額Ｗ.
020370***     MOVE ZERO         TO 負担額３Ｗ.
020380****/日計の計算は受診者ファイルの老人最終負担日と老人負担額端数を判定する
020390****/月計は上限を超えるまで計算する。
020400***     IF 連老計算－月日Ｆ = 1
020410***         MOVE 連計－施術和暦         TO 受－施術和暦
020420***         MOVE 連計－施術年           TO 受－施術年
020430***         MOVE 連計－施術月           TO 受－施術月
020440***         MOVE 連計－患者番号         TO 受－患者番号
020450***         MOVE 連計－枝番             TO 受－枝番
020460***         READ ＥＸ受診者情報Ｆ
020470***         INVALID KEY
020480***             MOVE ZERO               TO 老人最終負担日Ｗ
020490***             MOVE ZERO               TO 老人負担額端数Ｗ
020500***         NOT INVALID KEY
020510***             MOVE 受－老人最終負担日 TO 老人最終負担日Ｗ
020520***             MOVE 受－老人負担額端数 TO 老人負担額端数Ｗ
020530***         END-READ
020540***     ELSE
020550***         MOVE ZERO                   TO 老人最終負担日Ｗ
020560***         MOVE ZERO                   TO 老人負担額端数Ｗ
020570***     END-IF.
020580****
020590***     EVALUATE TRUE
020600****/通常計算*/枝番、最終負担日より前の日計、月計、の場合の計算
020610****         */上限を超えない場合は最終負担日に最終日が入っている。
020620****         */上限を超えない場合は毎日計算する。
020630***     WHEN 連老計算－枝番フラグ = 1
020640***     WHEN 老人最終負担日Ｗ > 連計－施術日
020650***     WHEN 連老計算－月日Ｆ = ZERO
020660***     WHEN 老人負担額端数Ｗ = ZERO
020670***         PERFORM 助成負担率取得
020680*********************************************************************
020690****☆注意☆
020700****窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
020710****レセプトは、負担金の小数点第１位を切り上げる
020720*********************************************************************
020730****
020740*******************************************************************
020750**** 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
020760**** 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
020770****              　　　　 　　　１　　　　１０円単位             *
020780****              　　　　　　　 ２　　　　　１円単位  １０円単位 *
020790*******************************************************************
020800********************************************
020810**** 負担額１０円単位（１円の位を四捨五入）*
020820********************************************
020830****/0101老人の負担金額は日々の１０円単位の金額の合計
020840***         EVALUATE 連計－負担金計算区分
020850***         WHEN 2
020860****     負担額は、小数点以下第１位を切り上げる
020870***             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
020880***             COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
020890***             COMPUTE 負担額４１Ｗ = 負担額Ｗ１０ * 10
020900***             DIVIDE  負担額４１Ｗ BY 10 GIVING    商Ｗ
020910***                                      REMAINDER 剰余Ｗ
020920***             END-DIVIDE
020930***             IF 剰余Ｗ = ZERO
020940***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
020950***                 COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
020960****
020970***                 COMPUTE 負担額Ｗ２ ROUNDED = 負担額４１Ｗ / 10
020980***                 COMPUTE 負担額４１Ｗ = 負担額Ｗ２ * 10
020990****
021000****     負担額Ｗが１０円単位の状態で請求額を計算
021010***                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
021020***             ELSE
021030***                 COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
021040***                 COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
021050****     小数点以下第１位が発生した場合、整数部に１を加え切り上げる
021060****    /日計の場合負担額を切り上げず請求額から１を引く↑は取り消し
021070****                 COMPUTE 負担額Ｗ = 負担額Ｗ + 1
021080****
021090****/４１負担区分が２の場合少数点以下を切り上げる処理を追加。0103
021100****/小数点以下を切上げて１の位を四捨五入(１０円単位)0103
021110***                 IF ４１端数区分Ｗ = 2
021120***                     IF 負担額４１Ｗ(6:3) NOT = ZERO
021130***                         MOVE ZERO TO 負担額４１Ｗ(6:3)
021140***                         COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
021150***                     END-IF
021160***                 END-IF
021170****
021180***                 COMPUTE 負担額Ｗ２ ROUNDED = 負担額４１Ｗ / 10
021190***                 COMPUTE 負担額４１Ｗ = 負担額Ｗ２ * 10
021200****
021210****     負担額Ｗが１０円単位の状態で請求額を計算
021220***                 COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
021230***             END-IF
021240****
021250****    *****************４１老人の月計の負担額は日毎の費用額×負担率を
021260****     負担額１円単位 *そのまま足し込む。※日毎には切り上げない事
021270****    *****************月の合計の小数点以下は切り上げる。
021280***         WHEN ZERO
021290***             COMPUTE 負担率中間結果Ｗ = ( 負担率Ｗ / 100 )
021300***             COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
021310****
021320****
021330***             EVALUATE ４１端数区分Ｗ
021340***             WHEN ZERO
021350***                 COMPUTE 負担額３Ｗ ROUNDED = 負担額４１Ｗ / 10
021360***                 COMPUTE 負担額３Ｗ = 負担額３Ｗ * 10
021370***                 COMPUTE 請求額Ｗ   = 連計－負担額 - 負担額３Ｗ
021380****
021390***                 MOVE 負担額３Ｗ TO 負担額４１Ｗ
021400***             WHEN 1
021410****/端数区分１の場合月の合計に負担率をかけ、小数点以下を切り上げ。02102↓↓
021420****           */切り上げ処理
021430***                 IF 負担額４１Ｗ(6:3) NOT = ZERO
021440***                     COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
021450***                     MOVE ZERO TO 負担額４１Ｗ(6:3)
021460***                 END-IF
021470***                 COMPUTE 請求額Ｗ   = 連計－負担額 - 負担額４１Ｗ
021480****                 MOVE 負担額４１Ｗ TO 負担額３Ｗ
021490****                 IF 負担額４１Ｗ(6:3) NOT = ZERO
021500****                     COMPUTE 請求額Ｗ = 連計－負担額 - 負担額３Ｗ - 1
021510****                 ELSE
021520****                     COMPUTE 請求額Ｗ = 連計－負担額 - 負担額３Ｗ
021530****                 END-IF
021540***             END-EVALUATE
021550****/端数区分１の場合月の合計に負担率をかけ、小数点以下を切り上げ。02102↑↑
021560****
021570***         WHEN OTHER
021580****    /エラー表示の修正
021590***             PERFORM コンソールエラー確認
021600***             DISPLAY "負担金計算区分が指定されていません"
021610***                     " 受診者№="   連計－患者コード
021620***                     " 施術年月="   連計－施術年 連計－施術月 UPON CONS
021630****             DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
021640***             PERFORM ファイル閉鎖
021650***             MOVE ZERO TO PROGRAM-STATUS
021660***             EXIT PROGRAM
021670***         END-EVALUATE
021680****
021690****/老人の負担額を日毎の費用額を四捨五入して足し込んで行く方法。0101
021700****    /月計系の計算で負担額の累計が上限を超える場合の処理0101
021710***         IF (連老計算－月日Ｆ = ZERO) AND
021720***            (連老負－老人負担額累計 + 負担額Ｗ >= 老人負担額上限ＡＷ)
021730***             COMPUTE 請求額Ｗ = 請求額Ｗ
021740***                              + 連老負－老人負担額累計 
021750***                              + 負担額Ｗ
021760***                              - 老人負担額上限ＡＷ
021770***             COMPUTE 負担額Ｗ = 老人負担額上限ＡＷ - 連老負－老人負担額累計
021780***         END-IF
021790****
021800****
021810****/端数の処理
021820***     WHEN 老人最終負担日Ｗ = 連計－施術日
021830***         EVALUATE 連計－負担金計算区分
021840***         WHEN 2
021850****/   １０円単位(１の位を四捨五入)
021860****/   請求額は１円単位まで計算、端数は小数点以下にならない為整数のみ対応
021870****/   請求額は四捨五入する前の負担額で計算する。
021880****             COMPUTE 請求額Ｗ         = 連計－費用額 - 老人負担額端数Ｗ
021890****/請求額の計算式がおかしい。20226
021900***             COMPUTE 請求額Ｗ         = 連計－負担額 - 老人負担額端数Ｗ
021910***             COMPUTE 負担額Ｗ ROUNDED = 老人負担額端数Ｗ / 10
021920***             COMPUTE 負担額Ｗ         = 負担額Ｗ * 10
021930****
021940***             MOVE 負担額Ｗ TO 負担額４１Ｗ
021950****             MOVE 老人負担額端数Ｗ TO 計算用負担額Ｗ
021960****             COMPUTE 請求額Ｗ = 連計－費用額 - 計算用負担額Ｗ
021970****             COMPUTE 計算用負担額Ｗ = 計算用負担額Ｗ + 5
021980****             MOVE ZERO TO 負担額１位Ｗ
021990****             MOVE 計算用負担額Ｗ TO 負担額Ｗ
022000****/   １円単位
022010***         WHEN ZERO
022020***             MOVE 老人負担額端数Ｗ TO 負担額４１Ｗ
022030****             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額４１Ｗ
022040****/請求額の計算式がおかしい。20226
022050***             COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
022060***         END-EVALUATE
022070****/計算しない(負担額０円)
022080***     WHEN 老人最終負担日Ｗ < 連計－施術日
022090***         MOVE ZERO TO 負担額４１Ｗ
022100****         COMPUTE 請求額Ｗ = 連計－費用額 - 負担額４１Ｗ
022110****/請求額の計算式がおかしい。20226
022120***         COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
022130***     END-EVALUATE.
022140****
022150***     MOVE 負担額４１Ｗ TO 連計－負担額助成.
022160***     MOVE 請求額Ｗ     TO 連計－請求額助成.
022170****
022180****/１円単位
022190***     IF (連老負－老人負担額端数１ = ZERO) AND
022200***        (連老計算－累計フラグ     = ZERO)
022210****/    負担回数0101
022220***         COMPUTE 連老負－老人負担回数１ = 連老負－老人負担回数１ + 1
022230****/    最終負担日0101
022240***         MOVE 連計－施術日 TO 連老負－老人最終負担日１
022250******/    １円単位の負担金額の合計、小数第１位を切り上げてある負担額Ｗを使う。
022260*****         COMPUTE 連老負－老人負担額累計１ = 連老負－老人負担額累計１
022270*****                                          + 負担額４１Ｗ
022280*****         IF 連老負－老人負担額累計１ >= 老人負担額上限ＡＷ
022290*****             COMPUTE 連老負－老人負担額端数１ = 老人負担額上限ＡＷ
022300*****                                              - 連老負－老人負担額累計１
022310*****                                              + 負担額４１Ｗ
022320*****       END-IF
022330***     END-IF.
022340****/１０円単位
022350***     IF (連老負－老人負担額端数 = ZERO) AND
022360***        (連老計算－累計フラグ   = ZERO)
022370****/    負担回数0101
022380***         COMPUTE 連老負－老人負担回数 = 連老負－老人負担回数 + 1
022390****/    最終負担日0101
022400***         MOVE 連計－施術日 TO 連老負－老人最終負担日
022410******/    １０円単位の負担金額の合計、累計は四捨五入して１０円単位で足し込む0101
022420*****         COMPUTE 負担額Ｗ ROUNDED       = 負担額Ｗ１０ / 10
022430*****         COMPUTE 負担額Ｗ               = 負担額４１Ｗ     * 10
022440*****         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 + 負担額４１Ｗ
022450*****         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
022460*****             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
022470*****                                            - 連老負－老人負担額累計
022480*****                                            + 負担額４１Ｗ
022490*****         END-IF
022500***     END-IF.
022510***     EVALUATE ４１端数区分Ｗ
022520***     WHEN 1
022530****/小数点以下も込みの合計を足し込む(１円単位)0101
022540***         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
022550***                                        + 負担額４１Ｗ
022560****
022570***         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
022580***             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
022590***                                            - 連老負－老人負担額累計
022600***                                            + 負担額４１Ｗ
022610***         END-IF
022620***     WHEN ZERO
022630****/１の位を四捨五入して足し込む(１０円単位)
022640***         MOVE 負担額４１Ｗ TO 負担額Ｗ
022650***         COMPUTE 負担額Ｗ ROUNDED = 負担額Ｗ / 10
022660***         COMPUTE 負担額Ｗ = 負担額Ｗ * 10
022670***         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計
022680***                                        + 負担額Ｗ
022690****
022700***         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
022710***             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
022720***                                            - 連老負－老人負担額累計
022730***                                            + 負担額Ｗ
022740***         END-IF
022750***     WHEN 2
022760****/小数点以下を切上げて１の位を四捨五入して足し込む(１０円単位)0103
022770***         IF 負担額４１Ｗ(6:3) NOT = ZERO
022780***             MOVE ZERO TO 負担額４１Ｗ(6:3)
022790***             COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
022800***         END-IF
022810****
022820***         MOVE 負担額４１Ｗ TO 負担額Ｗ
022830***         COMPUTE 負担額Ｗ ROUNDED = 負担額Ｗ / 10
022840***         COMPUTE 負担額Ｗ = 負担額Ｗ * 10
022850***         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
022860***                                        + 負担額Ｗ
022870****
022880***         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
022890***             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
022900***                                            - 連老負－老人負担額累計
022910***                                            + 負担額Ｗ
022920***         END-IF
022930***     WHEN OTHER
022940***         DISPLAY "４１端数区分が不正です ４１端数区分="
022950***                  ４１端数区分Ｗ UPON CONS
022960***     END-EVALUATE.
022970*================================================================*
022980 助成負担率取得 SECTION.
022990*
023000*     MOVE 連計－助成種別 TO 負率－保険種別.
023010     MOVE 51             TO 負率－保険種別.
023020     MOVE 連計－施術和暦 TO 負率－開始和暦 施術和暦ＣＷ.
023030     MOVE 連計－施術年   TO 負率－開始年   施術年ＣＷ.
023040     MOVE 連計－施術月   TO 負率－開始月   施術月ＣＷ.
023050     START ＥＸ負担率マスタ KEY IS <= 負率－保険種別
023060                                  負率－開始和暦年月
023070                                  REVERSED
023080     END-START
023090     READ ＥＸ負担率マスタ NEXT
023100     AT END
023110*/エラー表示の修正
023120         PERFORM コンソールエラー確認
023130         DISPLAY "施術日に合った負担率がみつかりません"
023140                 " 受診者№="   連計－患者コード
023150                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
023160*-----------------------------------------*
023170         CALL "actcshm"  WITH C LINKAGE
023180*-----------------------------------------*
023190*         ACCEPT  キー入力 FROM CONS
023200         PERFORM ファイル閉鎖
023210         MOVE ZERO TO PROGRAM-STATUS
023220         EXIT PROGRAM
023230     NOT AT END
023240         IF ( 施術和暦年月ＣＷ >= 負率－開始和暦年月 ) AND
023250            ( 施術和暦年月ＣＷ <= 負率－終了和暦年月 )
023260             MOVE 負率－本人負担率 TO 本人負担率Ｗ
023270             MOVE 負率－家族負担率 TO 家族負担率Ｗ
023280         END-IF
023290     END-READ
023300*
023310     EVALUATE 連計－本人家族区分
023320     WHEN 1
023330         MOVE 本人負担率Ｗ TO 負担率Ｗ
023340     WHEN 2
023350         MOVE 家族負担率Ｗ TO 負担率Ｗ
023360     WHEN OTHER
023370*/エラー表示の修正
023380         PERFORM コンソールエラー確認
023390         DISPLAY "本人家族区分が設定されていません"
023400                 " 受診者№="   連計－患者コード
023410                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
023420*-----------------------------------------*
023430         CALL "actcshm"  WITH C LINKAGE
023440*-----------------------------------------*
023450*         ACCEPT  キー入力 FROM CONS
023460         PERFORM ファイル閉鎖
023470         MOVE ZERO TO PROGRAM-STATUS
023480         EXIT PROGRAM
023490     END-EVALUATE.
023500*
023510*/老人料金改正の対応0210(４１で２割は無いとの説もあり流動的だが対応する)
023520     MOVE 連計－施術和暦 TO 受－施術和暦.
023530     MOVE 連計－施術年   TO 受－施術年.
023540     MOVE 連計－施術月   TO 受－施術月.
023550     MOVE 連計－患者番号 TO 受－患者番号.
023560     MOVE 連計－枝番     TO 受－枝番.
023570     READ ＥＸ受診者情報Ｆ
023580     INVALID KEY
023590         CONTINUE
023600     NOT INVALID KEY
023610         IF 受－助成負担金免除 >= 2
023620             COMPUTE 負担率Ｗ = 受－助成負担金免除 * 10
023630         END-IF
023640     END-READ.
023650*
023660*/国保組合で負担なしの対応↓↓↓/0501
023670     MOVE 連計－施術和暦 TO 受－施術和暦.
023680     MOVE 連計－施術年   TO 受－施術年.
023690     MOVE 連計－施術月   TO 受－施術月.
023700     MOVE 連計－患者番号 TO 受－患者番号.
023710     MOVE 連計－枝番     TO 受－枝番.
023720     READ ＥＸ受診者情報Ｆ
023730     INVALID KEY
023740*/エラー表示の修正
023750         PERFORM コンソールエラー確認
023760         DISPLAY "施術月の受診者情報がありません"
023770                 " 受診者№=" 連計－患者コード
023780                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
023790*-----------------------------------------*
023800         CALL "actcshm"  WITH C LINKAGE
023810*-----------------------------------------*
023820*         ACCEPT  キー入力 FROM CONS
023830         PERFORM ファイル閉鎖
023840         MOVE ZERO TO PROGRAM-STATUS
023850         EXIT PROGRAM
023860     NOT INVALID KEY
023870         MOVE 受－甲乙区分 TO 甲乙区分Ｗ
023880     END-READ.
023890     IF 甲乙区分Ｗ = 9
023900         MOVE ZERO TO 負担率Ｗ
023910     END-IF.
023920*/国保組合で負担なしの対応↑↑↑/0501
023930*
023940*================================================================*
023950 老人負担区分取得 SECTION.
023960*
023970     MOVE 05             TO 老負－保険種別.
023980     MOVE 連計－施術和暦 TO 老負－開始和暦.
023990     MOVE 連計－施術年   TO 老負－開始年.
024000     MOVE 連計－施術月   TO 老負－開始月.
024010*
024020     START ＥＸ老人負担区分マスタ KEY IS <= 老負－保険種別
024030                                        老負－開始和暦年月
024040                                        REVERSED
024050     END-START.
024060     IF 状態キー = "00"
024070         READ ＥＸ老人負担区分マスタ NEXT
024080         AT END
024090             DISPLAY "施術年月に対応した老人負担区分がありません"
024100                     " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
024110         NOT AT END
024120             IF 老負－保険種別 = 05
024130                 MOVE 老負－負担区分     TO 老人負担計算区分Ｗ
024140                 MOVE 老負－４１端数区分 TO ４１端数区分Ｗ
024150             END-IF
024160         END-READ
024170     ELSE
024180         DISPLAY "施術年月に対応した老人負担区分がありません"
024190                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
024200     END-IF.
024210*================================================================*
024220* 定額助成老人負担算定 SECTION.
024230** ［４１老人］
024240*     PERFORM 負担率取得.
024250**/月計またはレセプトの計算
024260*         IF 連老計算－月日Ｆ = ZERO
024270**/小数点以下を含めた負担額を計算する。
024280*             COMPUTE 負担率中間結果Ｗ = ( 負担率Ｗ / 100 )
024290*             COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
024300*         END-IF.
024310*******************************************************************
024320** 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
024330**（月に最大、計Ａ－老人負担回数分）
024340** 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
024350** 引続きカウントされる。
024360*******************************************************************
024370**
024380** 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
024390** 診療した日数を受け継ぐ
024400**
024410*     PERFORM 診療回数取得.
024420**
024430** DEBUG
024440**     DISPLAY NC"実日数Ｗ" 実日数Ｗ UPON MSGBOX
024450**     DISPLAY NC"老人負担回数Ｗ" 老人負担回数Ｗ UPON MSGBOX
024460**     DISPLAY NC"連計－負担額" 連計－負担額 UPON MSGBOX
024470**     DISPLAY NC"老人一部負担金Ｗ" 老人一部負担金Ｗ UPON MSGBOX
024480**
024490*     IF 実日数Ｗ > 老人負担回数Ｗ
024500*         MOVE ZERO         TO 連計－負担額助成
024510*         MOVE 連計－負担額 TO 連計－請求額助成
024520*         MOVE ZERO         TO 負担額４１Ｗ
024530*     ELSE
024540**
024550*         IF 連計－負担額 <= 老人一部負担金Ｗ
024560**/負担金計算区分０：月計
024570*             EVALUATE 連計－負担金計算区分
024580*             WHEN ZERO
024590*                 MOVE ZERO TO 連計－請求額助成
024600*                 EVALUATE ４１端数区分Ｗ
024610*                 WHEN ZERO
024620*                     COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
024630*                     COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
024640*                     MOVE 負担額Ｗ TO 連計－負担額助成
024650*                 WHEN 1
024660*                     MOVE 連計－負担額 TO 連計－負担額助成
024670*                 WHEN 2
024680*                 WHEN 3
024690**/小数点以下を切上げる(１円単位)0103
024700*                     MOVE 連計－負担額 TO 連計－負担額助成
024710*                 END-EVALUATE
024720**
024730*             WHEN 2
024740*                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額 / 10
024750*                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
024760*                 MOVE 負担額Ｗ TO 連計－負担額助成
024770*                 MOVE ZERO     TO 連計－請求額助成
024780*             WHEN OTHER
024790**/エラー表示の修正
024800*                 PERFORM コンソールエラー確認
024810*                 DISPLAY "負担金計算区分が指定されていません"
024820*                         " 受診者№="   連計－患者コード
024830*                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
024840**                 DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
024850*                 PERFORM ファイル閉鎖
024860*                 MOVE ZERO TO PROGRAM-STATUS
024870*                 EXIT PROGRAM
024880*             END-EVALUATE
024890**
024900*         ELSE
024910*             EVALUATE 連計－負担金計算区分
024920*             WHEN ZERO
024930** 現在は、老人一部負担金が、８００円のため、１０円単位にする必要なし
024940*             WHEN 2
024950*                 MOVE 老人一部負担金Ｗ TO 連計－負担額助成
024960*                 COMPUTE 請求額Ｗ = 連計－負担額 - 老人一部負担金Ｗ
024970*                 MOVE 請求額Ｗ         TO 連計－請求額助成
024980*                 MOVE 老人一部負担金Ｗ TO 負担額４１Ｗ
024990**
025000*             WHEN OTHER
025010**/エラー表示の修正
025020*                 PERFORM コンソールエラー確認
025030*                 DISPLAY "負担金計算区分が指定されていません"
025040*                         " 受診者№="   連計－患者コード
025050*                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
025060**                 DISPLAY NC"負担金計算区分が指定されていません" UPON MSGBOX
025070*                 PERFORM ファイル閉鎖
025080*                 MOVE ZERO TO PROGRAM-STATUS
025090*                 EXIT PROGRAM
025100*             END-EVALUATE
025110*         END-IF
025120*     END-IF.
025130**
025140**/日々の負担金額を累計する。
025150*     EVALUATE ４１端数区分Ｗ
025160*     WHEN 1
025170**/小数点以下も込みの合計を足し込む(１円単位)0101
025180*         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
025190*                                        + 負担額４１Ｗ
025200**
025210**         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
025220*             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
025230*                                            - 連老負－老人負担額累計
025240*                                            + 負担額４１Ｗ
025250*         END-IF
025260*     WHEN ZERO
025270**/１の位を四捨五入して足し込む(１０円単位)
025280*         MOVE 負担額４１Ｗ TO 負担額Ｗ
025290*         COMPUTE 負担額Ｗ ROUNDED = 負担額Ｗ / 10
025300*         COMPUTE 負担額Ｗ = 負担額Ｗ * 10
025310*         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計
025320*                                        + 負担額Ｗ
025330**
025340*         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
025350*             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
025360*                                            - 連老負－老人負担額累計
025370*                                            + 負担額Ｗ
025380*         END-IF
025390*     WHEN 2
025400*     WHEN 3
025410**/小数点以下を切上げて足し込む(１円単位)0103
025420*         IF 負担額４１Ｗ(6:3) NOT = ZERO
025430*             MOVE ZERO TO 負担額４１Ｗ(6:3)
025440*             COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
025450*         END-IF
025460*         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
025470*                                        + 負担額４１Ｗ
025480**
025490*         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
025500*             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
025510*                                            - 連老負－老人負担額累計
025520*                                            + 負担額４１Ｗ
025530*         END-IF
025540*     WHEN OTHER
025550*         DISPLAY "４１端数区分が不正です ４１端数区分="
025560*                  ４１端数区分Ｗ UPON CONS
025570*     END-EVALUATE.
025580**
025590*================================================================*
025600 助成一部負担算定 SECTION.
025610* ［助成］
025620******************************************************************
025630* 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
025640*（月に最大、計Ａ－老人負担回数分）
025650* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
025660* 引続きカウントされる。
025670******************************************************************
025680*
025690* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
025700* 診療した日数を受け継ぐ
025710*
025720     PERFORM 診療回数取得.
025730*
025740     IF 実日数Ｗ > 助成負担回数Ｗ
025750         MOVE ZERO             TO 連計－負担額助成
025760*         MOVE 連計－負担額    TO 連計－請求額助成
025770         MOVE 連計－負担額老人 TO 連計－請求額助成
025780     ELSE
025790*
025800         IF 連計－負担額老人 <= 負担一定金額Ｗ
025810             EVALUATE 連計－負担金計算区分
025820             WHEN ZERO
025830                 MOVE 連計－負担額老人 TO 連計－負担額助成
025840                 MOVE ZERO             TO 連計－請求額助成
025850*
025851*---10円単位でも計算 ------------------------------------------*
025852                 MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
025853                 COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 連計－負担額老人 / 10
025854                 COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
025855                 MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
025863*--------------------------------------------------------------*
025870             WHEN 2
025871                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
025880                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
025890                 MOVE 負担額Ｗ TO 連計－負担額助成
025900                 MOVE ZERO     TO 連計－請求額助成
025910             WHEN OTHER
025920*/エラー表示の修正
025930                 PERFORM コンソールエラー確認
025940                 DISPLAY "負担金算定区分が指定されていません"
025950                         " 受診者№="   連計－患者コード
025960                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
025970*-----------------------------------------*
025980                 CALL "actcshm"  WITH C LINKAGE
025990*-----------------------------------------*
026000*                 ACCEPT  キー入力 FROM CONS
026010                 PERFORM ファイル閉鎖
026020                 MOVE ZERO TO PROGRAM-STATUS
026030                 EXIT PROGRAM
026040             END-EVALUATE
026050*
026060         ELSE
026070             EVALUATE 連計－負担金計算区分
026080             WHEN ZERO
026090             WHEN 2
026100                 MOVE    負担一定金額Ｗ TO 連計－負担額助成
026110                 COMPUTE 請求額Ｗ        = 連計－負担額老人 - 負担一定金額Ｗ
026120                 MOVE    請求額Ｗ       TO 連計－請求額助成
026121                 MOVE    負担一定金額Ｗ TO 連計日計窓口－負担額
026130*
026140             WHEN OTHER
026150*/エラー表示の修正
026160                 PERFORM コンソールエラー確認
026170                 DISPLAY "負担金算定区分が指定されていません"
026180                         " 受診者№="   連計－患者コード
026190                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
026200*-----------------------------------------*
026210                 CALL "actcshm"  WITH C LINKAGE
026220*-----------------------------------------*
026230*                 ACCEPT  キー入力 FROM CONS
026240                 PERFORM ファイル閉鎖
026250                 MOVE ZERO TO PROGRAM-STATUS
026260                 EXIT PROGRAM
026270             END-EVALUATE
026280         END-IF
026290     END-IF.
026300*
026310*
026320*================================================================*
026330 施術記録Ｆ取得 SECTION.
026340*
026350     MOVE 連計－施術和暦 TO 施記－施術和暦 .
026360     MOVE 連計－施術年   TO 施記－施術年   .
026370     MOVE 連計－施術月   TO 施記－施術月   .
026380     MOVE 連計－施術日   TO 施記－施術日.
026390     MOVE 連計－患者番号 TO 施記－患者番号 .
026400     MOVE 連計－枝番     TO 施記－枝番     .
026410     READ ＥＸ施術記録Ｆ
026420     INVALID KEY
026430*/エラー表示の修正
026440         PERFORM コンソールエラー確認
026450         DISPLAY "施術記録がありません"
026460                 " 受診者№="   連計－患者コード
026470                 " 施術年月日=" 連計－施術年 
026480                   連計－施術月 連計－施術日 UPON CONS
026490*-----------------------------------------*
026500         CALL "actcshm"  WITH C LINKAGE
026510*-----------------------------------------*
026520*         ACCEPT  キー入力 FROM CONS
026530         PERFORM ファイル閉鎖
026540         MOVE ZERO TO PROGRAM-STATUS
026550         EXIT PROGRAM
026560     NOT INVALID KEY
026570         CONTINUE
026580     END-READ.
026590*================================================================*
026600 受診者情報取得 SECTION.
026610*
026620     MOVE 連計－施術和暦     TO 受－施術和暦.
026630     MOVE 連計－施術年       TO 受－施術年  .
026640     MOVE 連計－施術月       TO 受－施術月  .
026650     MOVE 連計－患者番号     TO 受－患者番号.
026660     MOVE 連計－枝番         TO 受－枝番    .
026670     READ ＥＸ受診者情報Ｆ
026680     INVALID KEY
026690         MOVE ZERO               TO 助成負担金免除Ｗ
026700     NOT INVALID KEY
026710         MOVE 受－助成負担金免除 TO 助成負担金免除Ｗ
026720     END-READ.
026730*================================================================*
026740 制御情報取得 SECTION.
026750*
026760     MOVE ZERO TO 制－制御区分.
026770     READ ＥＸ制御情報マスタ
026780     NOT INVALID KEY
026790         MOVE 制－助成負担計算区分 TO 助成負担計算区分Ｗ
026800     END-READ.
026810*
026820*================================================================*
026830 定率公費老人負担算定 SECTION.
026840* ［２７老人］
026850******************************************************************
026860* 日毎の費用額から老人の負担率分を患者負担
026870* 月に最大 ３０００円まで
026880* 同一月内で初検日があっても、保険が切り替わっても老人負担金額分は
026890* 引続きカウントされる。
026900******************************************************************
026910     MOVE 連計－費用額 TO 連計－費用額老人.
026920     MOVE ZERO         TO 負担額Ｗ.
026930     MOVE ZERO         TO 請求額Ｗ.
026940*     MOVE ZERO                   TO 老人最終負担日Ｗ.
026950*     MOVE ZERO                   TO 老人負担額端数Ｗ.
026960*
026970     PERFORM 老人負担率取得.
026980******************************************************************
026990*☆注意☆
027000*窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
027010*レセプトは、負担金の小数点第１位を切り上げる
027020******************************************************************
027030*
027040****************************************************************
027050* 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
027060* 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
027070*              　　　　 　　　１　　　　１０円単位             *
027080*              　　　　　　　 ２　　　　　１円単位  １０円単位 *
027090****************************************************************
027100*****************************************
027110* 負担額１０円単位（１円の位を四捨五入）*
027120*****************************************
027130     EVALUATE 連計－負担金計算区分
027140     WHEN 2
027150*     負担額は、小数点以下第１位を切り上げる
027160         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027170         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
027180         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
027190         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
027200                                  REMAINDER 剰余Ｗ
027210         END-DIVIDE
027220         IF 剰余Ｗ = ZERO
027230             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027240             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
027250*
027260             COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
027270             COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
027280*
027290*     負担額Ｗが１０円単位の状態で請求額を計算
027300             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
027310         ELSE
027320             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027330             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
027340*
027350             COMPUTE 負担額Ｗ２ ROUNDED = 負担額Ｗ / 10
027360             COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
027370*
027380*     負担額Ｗが１０円単位の状態で請求額を計算
027390             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
027400         END-IF
027410*/資格証明時、負担額が費用額を超える場合の対応/080410
027420         IF 連計－費用額 < 負担額Ｗ
027430             MOVE ZERO TO 請求額Ｗ
027440         END-IF
027450*
027460*
027470*    *****************
027480*     負担額１円単位 *
027490*    *****************
027500     WHEN ZERO
027510         COMPUTE 負担率中間結果Ｗ = ( 負担率Ｗ / 100 )
027520         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
027530         COMPUTE 負担額Ｗ = 負担額Ｗ１０ * 10
027540         DIVIDE  負担額Ｗ BY 10 GIVING    商Ｗ
027550                                REMAINDER 剰余Ｗ
027560         END-DIVIDE
027570         IF 剰余Ｗ = ZERO
027580             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027590             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
027600             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
027610         ELSE
027620*     一部負担金の端数切り上げ
027630             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027640             COMPUTE 負担額Ｗ = 連計－費用額 * 負担率中間結果Ｗ
027650*
027660             COMPUTE 負担額Ｗ = 負担額Ｗ + 1
027670*
027680             COMPUTE 請求額Ｗ = 連計－費用額 - 負担額Ｗ
027690         END-IF
027723*
027724*---10円単位でも計算 ------------------------------------------*
027725         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
027726         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
027727         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
027728         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
027729         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
027730         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
027731*        / 退避 /
027732         MOVE 連計日計窓口－負担額  TO 負担額日計窓口退避Ｗ
027733*--------------------------------------------------------------*
027734*
027737     WHEN OTHER
027738*    /エラー表示の修正
027739         PERFORM コンソールエラー確認
027740         DISPLAY "負担金計算区分が指定されていません"
027741                 " 受診者№="   連計－患者コード
027750                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
027760*-----------------------------------------*
027770         CALL "actcshm"  WITH C LINKAGE
027780*-----------------------------------------*
027790*         ACCEPT  キー入力 FROM CONS
027800         PERFORM ファイル閉鎖
027810         MOVE ZERO TO PROGRAM-STATUS
027820         EXIT PROGRAM
027830     END-EVALUATE.
027840*
027850     MOVE 負担額Ｗ TO 連計－負担額老人.
027860     MOVE 請求額Ｗ TO 連計－請求額老人.
027870*
027880*/１円単位
027890     IF (連老負－老人負担額端数１ = ZERO) AND
027900        (連老計算－累計フラグ     = ZERO)
027910*/    負担回数0101
027920         COMPUTE 連老負－老人負担回数１ = 連老負－老人負担回数１ + 1
027930*/    最終負担日0101
027940         MOVE 連計－施術日 TO 連老負－老人最終負担日１
027950*/    １円単位の負担金額の合計、小数第１位を切り上げてある負担額Ｗを使う。
027960         COMPUTE 連老負－老人負担額累計１ = 連老負－老人負担額累計１
027970                                          + 負担額Ｗ
027980         IF 連老負－老人負担額累計１ >= 老人負担額上限ＡＷ
027990             COMPUTE 連老負－老人負担額端数１ = 老人負担額上限ＡＷ
028000                                              - 連老負－老人負担額累計１
028010                                              + 負担額Ｗ
028020         END-IF
028030     END-IF.
028040*/１０円単位
028050     IF (連老負－老人負担額端数 = ZERO) AND
028060        (連老計算－累計フラグ   = ZERO)
028070*/    負担回数0101
028080         COMPUTE 連老負－老人負担回数 = 連老負－老人負担回数 + 1
028090*/    最終負担日0101
028100         MOVE 連計－施術日 TO 連老負－老人最終負担日
028110*/    １０円単位の負担金額の合計、累計は四捨五入して１０円単位で足し込む0101
028120*/    ここでの負担額Ｗは既に小数点以下１位を切り上げてあるので
028130*/    計算前の負担額Ｗ１０を使って再計算する。
028140         COMPUTE 負担額Ｗ ROUNDED       = 負担額Ｗ１０ / 10
028150         COMPUTE 負担額Ｗ               = 負担額Ｗ     * 10
028160         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 + 負担額Ｗ
028170         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
028180             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
028190                                            - 連老負－老人負担額累計
028200                                            + 負担額Ｗ
028210         END-IF
028220     END-IF.
028230*     END-IF.
028240*
028250*/大阪老人負担金免除 500円×2回 の対応(日計時のみ計算)↓↓↓/061117
028260     IF (大阪負担金免除計算Ｆ = 1    ) AND
028270        (連計－施術和暦年月  >= 41611)
028280         IF (( 受－公費種別 = ZERO )    AND  ( 受－助成種別 = 51 ) AND
028290             ( 受－老人負担金免除 = 1 ) AND
028300             ( 受－費用負担者番号助成(3:2) = "27" ))
028310           OR
028320            (( 受－公費種別 = 05 ) AND ( 受－老人負担金免除 = 1 ) AND
028330             ( 受－費用負担者番号(3:2) = "27" ))
028340           OR
028350            (( 受－公費種別 = 05 ) AND ( 受－助成負担金免除 = 1 ) AND
028360             ( 受－費用負担者番号(3:2) = "27" ))
028370             MOVE 500 TO 負担一定金額Ｗ
028380             MOVE 2   TO 助成負担回数Ｗ
028390             PERFORM 大阪負担金免除２７
028400         END-IF
028410     END-IF.
028420*/大阪老人負担金免除 500円×2回 の対応(日計時のみ計算)↑↑↑/061117
028430*================================================================*
028440 定率助成老人負担算定 SECTION.
028450*
028460* ［４１老人］
028470*/月の負担額
028480*/	日々の費用額に４１老人負担割合１割をかけて１ヶ月分足し込む。
028490*/	ワークは小数点以下３位まで持つ事とする。
028500*/日の負担額
028510*/	日の費用額に４１老人負担割合１割をかけて１のくらいを四捨五入する。
028520*
028530     MOVE 連計－費用額 TO 連計－費用額助成.
028540     MOVE ZERO         TO 負担額４１Ｗ.
028550     MOVE ZERO         TO 負担額Ｗ.
028560     MOVE ZERO         TO 請求額Ｗ.
028570     MOVE ZERO         TO 負担額３Ｗ.
028580*
028590     PERFORM 助成負担率取得.
028600******************************************************************
028610*☆注意☆
028620*窓口会計・カルテは、負担金の１円の位を四捨五入する（１０円単位）
028630*レセプトは、負担金の小数点第１位を切り上げる
028640******************************************************************
028650*
028660****************************************************************
028670* 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
028680* 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
028690*              　　　　 　　　１　　　　１０円単位             *
028700*              　　　　　　　 ２　　　　　１円単位  １０円単位 *
028710****************************************************************
028720*****************************************
028730* 負担額１０円単位（１円の位を四捨五入）*
028740*****************************************
028750*/0101老人の負担金額は日々の１０円単位の金額の合計
028760     EVALUATE 連計－負担金計算区分
028770     WHEN 2
028780*     負担額は、小数点以下第１位を切り上げる
028790         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
028800         COMPUTE 負担額Ｗ１０ = 連計－費用額 * 負担率中間結果Ｗ
028810         COMPUTE 負担額４１Ｗ = 負担額Ｗ１０ * 10
028820         DIVIDE  負担額４１Ｗ BY 10 GIVING    商Ｗ
028830                                  REMAINDER 剰余Ｗ
028840         END-DIVIDE
028850         IF 剰余Ｗ = ZERO
028860             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
028870             COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
028880*
028890             COMPUTE 負担額Ｗ２ ROUNDED = 負担額４１Ｗ / 10
028900             COMPUTE 負担額４１Ｗ = 負担額Ｗ２ * 10
028910*
028920*     負担額Ｗが１０円単位の状態で請求額を計算
028930             COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
028940         ELSE
028950             COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
028960             COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
028970*
028980*/４１負担区分が２の場合少数点以下を切り上げる処理を追加。0103
028990*/小数点以下を切上げて１の位を四捨五入(１０円単位)0103
029000             IF ４１端数区分Ｗ = 2
029010                 IF 負担額４１Ｗ(6:3) NOT = ZERO
029020                     MOVE ZERO TO 負担額４１Ｗ(6:3)
029030                     COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
029040                 END-IF
029050             END-IF
029060*
029070             COMPUTE 負担額Ｗ２ ROUNDED = 負担額４１Ｗ / 10
029080             COMPUTE 負担額４１Ｗ = 負担額Ｗ２ * 10
029090*
029100*     負担額Ｗが１０円単位の状態で請求額を計算
029110             COMPUTE 請求額Ｗ = 連計－負担額 - 負担額４１Ｗ
029120         END-IF
029130*
029140*    *****************４１老人の月計の負担額は日毎の費用額×負担率を
029150*     負担額１円単位 *そのまま足し込む。※日毎には切り上げない事
029160*    *****************月の合計の小数点以下は切り上げる。
029170     WHEN ZERO
029180         COMPUTE 負担率中間結果Ｗ = ( 負担率Ｗ / 100 )
029190         COMPUTE 負担額４１Ｗ = 連計－費用額 * 負担率中間結果Ｗ
029200*
029210*
029220         EVALUATE ４１端数区分Ｗ
029230         WHEN ZERO
029240             COMPUTE 負担額３Ｗ ROUNDED = 負担額４１Ｗ / 10
029250             COMPUTE 負担額３Ｗ = 負担額３Ｗ * 10
029260             COMPUTE 請求額Ｗ   = 連計－負担額 - 負担額３Ｗ
029270*
029280             MOVE 負担額３Ｗ TO 負担額４１Ｗ
029290         WHEN 1
029300*/端数区分１の場合月の合計に負担率をかけ、小数点以下を切り上げ。02102↓↓
029310*           */切り上げ処理
029320             IF 負担額４１Ｗ(6:3) NOT = ZERO
029330                 COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
029340                 MOVE ZERO TO 負担額４１Ｗ(6:3)
029350             END-IF
029360             COMPUTE 請求額Ｗ   = 連計－負担額 - 負担額４１Ｗ
029370*/２７老人＋４１に準ずる助成の対応 老人負担額から計算する/071005
029380             IF 受－公費種別 = 05
029390                  COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担額４１Ｗ
029400             END-IF
029410*                 MOVE 負担額４１Ｗ TO 負担額３Ｗ
029420*                 IF 負担額４１Ｗ(6:3) NOT = ZERO
029430*                     COMPUTE 請求額Ｗ = 連計－負担額 - 負担額３Ｗ - 1
029440*                 ELSE
029450*                     COMPUTE 請求額Ｗ = 連計－負担額 - 負担額３Ｗ
029460*                 END-IF
029470         END-EVALUATE
029480*/端数区分１の場合月の合計に負担率をかけ、小数点以下を切り上げ。02102↑↑
029490*
029496*
029497*---10円単位でも計算 ------------------------------------------*
029498         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
029508         COMPUTE 負担率中間結果Ｗ =  負担率Ｗ / 100
029509         COMPUTE 負担額日計窓口Ｗ = 連計－費用額 * 負担率中間結果Ｗ
029510         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
029511         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
029512         MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
029513*--------------------------------------------------------------*
029514*
029520     WHEN OTHER
029521*    /エラー表示の修正
029522         PERFORM コンソールエラー確認
029530         DISPLAY "負担金計算区分が指定されていません"
029540                 " 受診者№="   連計－患者コード
029550                 " 施術年月="   連計－施術年 連計－施術月 UPON CONS
029560*-----------------------------------------*
029570         CALL "actcshm"  WITH C LINKAGE
029580*-----------------------------------------*
029590*         ACCEPT  キー入力 FROM CONS
029600         PERFORM ファイル閉鎖
029610         MOVE ZERO TO PROGRAM-STATUS
029620         EXIT PROGRAM
029630     END-EVALUATE.
029640*
029650*/老人の負担額を日毎の費用額を四捨五入して足し込んで行く方法。0101
029660*    /月計系の計算で負担額の累計が上限を超える場合の処理0101
029670     IF (連老計算－月日Ｆ = ZERO) AND
029680        (連老負－老人負担額累計 + 負担額Ｗ >= 老人負担額上限ＡＷ)
029690         COMPUTE 請求額Ｗ = 請求額Ｗ
029700                          + 連老負－老人負担額累計 
029710                          + 負担額Ｗ
029720                          - 老人負担額上限ＡＷ
029730         COMPUTE 負担額Ｗ = 老人負担額上限ＡＷ - 連老負－老人負担額累計
029740     END-IF.
029750*
029760     MOVE 負担額４１Ｗ TO 連計－負担額助成.
029770     MOVE 請求額Ｗ     TO 連計－請求額助成.
029780*
029790*/１円単位
029800     IF (連老負－老人負担額端数１ = ZERO) AND
029810        (連老計算－累計フラグ     = ZERO)
029820*/    負担回数0101
029830         COMPUTE 連老負－老人負担回数１ = 連老負－老人負担回数１ + 1
029840*/    最終負担日0101
029850         MOVE 連計－施術日 TO 連老負－老人最終負担日１
029860     END-IF.
029870*/１０円単位
029880     IF (連老負－老人負担額端数 = ZERO) AND
029890        (連老計算－累計フラグ   = ZERO)
029900*/    負担回数0101
029910         COMPUTE 連老負－老人負担回数 = 連老負－老人負担回数 + 1
029920*/    最終負担日0101
029930         MOVE 連計－施術日 TO 連老負－老人最終負担日
029940     END-IF.
029950     EVALUATE ４１端数区分Ｗ
029960     WHEN 1
029970*/小数点以下も込みの合計を足し込む(１円単位)0101
029980         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
029990                                        + 負担額４１Ｗ
030000*
030010         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
030020             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
030030                                            - 連老負－老人負担額累計
030040                                            + 負担額４１Ｗ
030050         END-IF
030060     WHEN ZERO
030070*/１の位を四捨五入して足し込む(１０円単位)
030080         MOVE 負担額４１Ｗ TO 負担額Ｗ
030090         COMPUTE 負担額Ｗ ROUNDED = 負担額Ｗ / 10
030100         COMPUTE 負担額Ｗ = 負担額Ｗ * 10
030110         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計
030120                                        + 負担額Ｗ
030130*
030140         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
030150             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
030160                                            - 連老負－老人負担額累計
030170                                            + 負担額Ｗ
030180         END-IF
030190     WHEN 2
030200*/小数点以下を切上げて１の位を四捨五入して足し込む(１０円単位)0103
030210         IF 負担額４１Ｗ(6:3) NOT = ZERO
030220             MOVE ZERO TO 負担額４１Ｗ(6:3)
030230             COMPUTE 負担額４１Ｗ = 負担額４１Ｗ + 1
030240         END-IF
030250*
030260         MOVE 負担額４１Ｗ TO 負担額Ｗ
030270         COMPUTE 負担額Ｗ ROUNDED = 負担額Ｗ / 10
030280         COMPUTE 負担額Ｗ = 負担額Ｗ * 10
030290         COMPUTE 連老負－老人負担額累計 = 連老負－老人負担額累計 
030300                                        + 負担額Ｗ
030310*
030320         IF 連老負－老人負担額累計 >= 老人負担額上限ＡＷ
030330             COMPUTE 連老負－老人負担額端数 = 老人負担額上限ＡＷ
030340                                            - 連老負－老人負担額累計
030350                                            + 負担額Ｗ
030360         END-IF
030370     WHEN OTHER
030380         DISPLAY "４１端数区分が不正です ４１端数区分="
030390                  ４１端数区分Ｗ UPON CONS
030400     END-EVALUATE.
030410*/大阪老人負担金免除 500円×2回 の対応(日計時のみ計算)↓↓↓/061117
030420     IF (大阪負担金免除計算Ｆ = 1    ) AND
030430        (連計－施術和暦年月  >= 41611)
030440         IF (( 受－公費種別 = ZERO )    AND  ( 受－助成種別 = 51 ) AND
030450             ( 受－老人負担金免除 = 1 ) AND
030460             ( 受－費用負担者番号助成(3:2) = "27" ))
030470           OR
030480            (( 受－公費種別 = 05 ) AND ( 受－老人負担金免除 = 1 ) AND
030490             ( 受－費用負担者番号(3:2) = "27" ))
030500           OR
030510            (( 受－公費種別 = 05 ) AND ( 受－助成負担金免除 = 1 ) AND
030520             ( 受－費用負担者番号(3:2) = "27" ))
030530*　６：毎月一定金額、一定回数を負担(500円×２回を固定)
030540             MOVE 500 TO 負担一定金額Ｗ
030550             MOVE 2   TO 助成負担回数Ｗ
030560             PERFORM 大阪負担金免除４１
030570         END-IF
030580     END-IF.
030590*/大阪老人負担金免除 500円×2回 の対応(日計時のみ計算)↑↑↑/061117
030600*================================================================*
030610 助成一部負担算定１０ SECTION.
030620* ［助成］
030630******************************************************************
030640* 日毎の費用額の親保険負担率分から助成一部負担金のみを患者負担。
030650*（月に最大、計Ａ－老人負担回数分）
030660* 同一月内で初検日があっても、保険が切り替わっても助成負担回数分は
030670* 引続きカウントされる。
030680******************************************************************
030690*
030700* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
030710* 診療した日数を受け継ぐ
030720*
030730     PERFORM 診療回数取得.
030740*
030750     IF 実日数Ｗ > 助成負担回数Ｗ
030760         MOVE ZERO         TO 連計－負担額助成
030770         MOVE 連計－負担額 TO 連計－請求額助成
030780     ELSE
030790*
030800         IF 連計－負担額老人 <= 負担一定金額Ｗ
030810             EVALUATE 連計－負担金計算区分
030820*/日々の負担額の合計を月の負担額とする。(毎日四捨五入した金額の合計)
030830             WHEN ZERO
030840             WHEN 2
030850                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
030860                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
030870                 MOVE 負担額Ｗ TO 連計－負担額助成
030880                 MOVE ZERO     TO 連計－請求額助成
030881                 MOVE 負担額Ｗ TO 連計日計窓口－負担額
030890             WHEN OTHER
030900*/エラー表示の修正
030910                 PERFORM コンソールエラー確認
030920                 DISPLAY "負担金算定区分が指定されていません"
030930                         " 受診者№="   連計－患者コード
030940                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
030950*-----------------------------------------*
030960                 CALL "actcshm"  WITH C LINKAGE
030970*-----------------------------------------*
030980*                 ACCEPT  キー入力 FROM CONS
030990                 PERFORM ファイル閉鎖
031000                 MOVE ZERO TO PROGRAM-STATUS
031010                 EXIT PROGRAM
031020             END-EVALUATE
031030*
031040         ELSE
031050             EVALUATE 連計－負担金計算区分
031060             WHEN ZERO
031070*/ 設定された金額をそのまま転記する。
031080             WHEN 2
031090                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
031100                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
031110                 MOVE 請求額Ｗ         TO 連計－請求額助成
031111                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
031120*
031130             WHEN OTHER
031140*/エラー表示の修正
031150                 PERFORM コンソールエラー確認
031160                 DISPLAY "負担金算定区分が指定されていません"
031170                         " 受診者№="   連計－患者コード
031180                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
031190*-----------------------------------------*
031200                 CALL "actcshm"  WITH C LINKAGE
031210*-----------------------------------------*
031220*                 ACCEPT  キー入力 FROM CONS
031230                 PERFORM ファイル閉鎖
031240                 MOVE ZERO TO PROGRAM-STATUS
031250                 EXIT PROGRAM
031260             END-EVALUATE
031270         END-IF
031280     END-IF.
031290*
031300*================================================================*
031310 助成一部負担算定１４ SECTION.
031320* ［助成］
031330******************************************************************
031340* 日毎の費用額の親保険負担率分から老人一部負担金のみを患者負担。
031350*（月に最大、計Ａ－老人負担回数分）
031360* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
031370* 引続きカウントされる。
031380* １７年７月からの兵庫の改定に対応。(低所得者は低い単価(手数料の項目)で計算する)
031390******************************************************************
031400*
031410* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
031420* 診療した日数を受け継ぐ
031430*
031440     PERFORM 診療回数取得.
031450*
031460*/助成負担金免除：９ なら、低所得者用の負担額を使う
031470     MOVE 連計－施術和暦 TO 受－施術和暦.
031480     MOVE 連計－施術年   TO 受－施術年.
031490     MOVE 連計－施術月   TO 受－施術月.
031500     MOVE 連計－患者番号 TO 受－患者番号.
031510     MOVE 連計－枝番     TO 受－枝番.
031520     READ ＥＸ受診者情報Ｆ
031530     INVALID KEY
031540*/エラー表示の修正
031550         PERFORM コンソールエラー確認
031560         DISPLAY "施術月の受診者情報がありません"
031570                 " 受診者№=" 連計－患者コード
031580                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
031590*-----------------------------------------*
031600         CALL "actcshm"  WITH C LINKAGE
031610*-----------------------------------------*
031620*         ACCEPT  キー入力 FROM CONS
031630         PERFORM ファイル閉鎖
031640         MOVE ZERO TO PROGRAM-STATUS
031650         EXIT PROGRAM
031660     NOT INVALID KEY
031670         IF 受－助成負担金免除 = 9
031680             MOVE 事務手数料Ｗ TO 負担一定金額Ｗ
031690         END-IF
031700     END-READ.
031710*
031720     IF 実日数Ｗ > 助成負担回数Ｗ
031730         MOVE ZERO         TO 連計－負担額助成
031740         MOVE 連計－負担額 TO 連計－請求額助成
031750     ELSE
031760*
031770         IF 連計－負担額老人 <= 負担一定金額Ｗ
031780             EVALUATE 連計－負担金計算区分
031790             WHEN ZERO
031800                 MOVE 連計－負担額老人 TO 連計－負担額助成
031810                 MOVE ZERO             TO 連計－請求額助成
031812*
031813*---10円単位でも計算 ------------------------------------------*
031814                 MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
031815                 COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 連計－負担額老人 / 10
031816                 COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
031817                 MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
031818*--------------------------------------------------------------*
031822*
031830             WHEN 2
031840                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
031850                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
031860                 MOVE 負担額Ｗ TO 連計－負担額助成
031870                 MOVE ZERO     TO 連計－請求額助成
031880             WHEN OTHER
031890*/エラー表示の修正
031900                 PERFORM コンソールエラー確認
031910                 DISPLAY "負担金算定区分が指定されていません"
031920                         " 受診者№="   連計－患者コード
031930                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
031940*-----------------------------------------*
031950                 CALL "actcshm"  WITH C LINKAGE
031960*-----------------------------------------*
031970*                 ACCEPT  キー入力 FROM CONS
031980                 PERFORM ファイル閉鎖
031990                 MOVE ZERO TO PROGRAM-STATUS
032000                 EXIT PROGRAM
032010             END-EVALUATE
032020*
032030         ELSE
032040             EVALUATE 連計－負担金計算区分
032050             WHEN ZERO
032060* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
032070             WHEN 2
032080                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
032090                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
032100                 MOVE 請求額Ｗ       TO 連計－請求額助成
032101                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
032110*
032120             WHEN OTHER
032130*/エラー表示の修正
032140                 PERFORM コンソールエラー確認
032150                 DISPLAY "負担金算定区分が指定されていません"
032160                         " 受診者№="   連計－患者コード
032170                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
032180*-----------------------------------------*
032190                 CALL "actcshm"  WITH C LINKAGE
032200*-----------------------------------------*
032210*                 ACCEPT  キー入力 FROM CONS
032220                 PERFORM ファイル閉鎖
032230                 MOVE ZERO TO PROGRAM-STATUS
032240                 EXIT PROGRAM
032250             END-EVALUATE
032260         END-IF
032270     END-IF.
032280*
032290*================================================================*
032300 大阪負担金免除２７ SECTION.
032310*
032320* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
032330* 診療した日数を受け継ぐ
032340*
032350     PERFORM 診療回数取得.
032360*
032370     IF 実日数Ｗ > 助成負担回数Ｗ
032380         MOVE ZERO             TO 連計－負担額老人
032390         MOVE 連計－費用額     TO 連計－請求額老人
032400     ELSE
032410*
032420         IF 連計－負担額老人 <= 負担一定金額Ｗ
032430             EVALUATE 連計－負担金計算区分
032440             WHEN ZERO
032441*---10円単位でも計算 ------------------------------------------*
032442                 MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
032443                 COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 連計－負担額老人 / 10
032444                 COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
032445                 MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
032446*--------------------------------------------------------------*
032460             WHEN 2
032470                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
032480                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
032490                 MOVE 負担額Ｗ TO 連計－負担額老人
032500                 COMPUTE 連計－請求額老人 = 連計－費用額 - 連計－負担額老人
032510             WHEN OTHER
032520*/エラー表示の修正
032530                 PERFORM コンソールエラー確認
032540                 DISPLAY "負担金算定区分が指定されていません"
032550                         " 受診者№="   連計－患者コード
032560                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
032570*-----------------------------------------*
032580                 CALL "actcshm"  WITH C LINKAGE
032590*-----------------------------------------*
032600*                 ACCEPT  キー入力 FROM CONS
032610                 PERFORM ファイル閉鎖
032620                 MOVE ZERO TO PROGRAM-STATUS
032630                 EXIT PROGRAM
032640             END-EVALUATE
032650*
032660         ELSE
032670             EVALUATE 連計－負担金計算区分
032680             WHEN ZERO
032690             WHEN 2
032700                 MOVE    負担一定金額Ｗ TO 連計－負担額老人
032710                 COMPUTE 請求額Ｗ        = 連計－費用額 - 負担一定金額Ｗ
032720                 MOVE    請求額Ｗ       TO 連計－請求額老人
032721                 MOVE    負担一定金額Ｗ TO 連計日計窓口－負担額
032730*
032740             WHEN OTHER
032750*/エラー表示の修正
032760                 PERFORM コンソールエラー確認
032770                 DISPLAY "負担金算定区分が指定されていません"
032780                         " 受診者№="   連計－患者コード
032790                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
032800*-----------------------------------------*
032810                 CALL "actcshm"  WITH C LINKAGE
032820*-----------------------------------------*
032830*                 ACCEPT  キー入力 FROM CONS
032840                 PERFORM ファイル閉鎖
032850                 MOVE ZERO TO PROGRAM-STATUS
032860                 EXIT PROGRAM
032870             END-EVALUATE
032880         END-IF
032890     END-IF.
032900*
032910*================================================================*
032920 大阪負担金免除４１ SECTION.
032930*
032940* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
032950* 診療した日数を受け継ぐ
032960*
032970     PERFORM 診療回数取得.
032980*
032990     IF 実日数Ｗ > 助成負担回数Ｗ
033000         MOVE ZERO            TO 連計－負担額助成
033010         MOVE 連計－負担額    TO 連計－請求額助成
033020     ELSE
033030*
033040         IF 連計－負担額助成 <= 負担一定金額Ｗ
033050             EVALUATE 連計－負担金計算区分
033060             WHEN ZERO
033061*---10円単位でも計算 ------------------------------------------*
033062                 MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
033063                 COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 連計－負担額助成 / 10
033064                 COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
033065                 MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
033066*--------------------------------------------------------------*
033080             WHEN 2
033090                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額助成 / 10
033100                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
033110                 MOVE 負担額Ｗ TO 連計－負担額助成
033120                 MOVE ZERO     TO 連計－請求額助成
033130             WHEN OTHER
033140*/エラー表示の修正
033150                 PERFORM コンソールエラー確認
033160                 DISPLAY "負担金算定区分が指定されていません"
033170                         " 受診者№="   連計－患者コード
033180                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
033190*-----------------------------------------*
033200                 CALL "actcshm"  WITH C LINKAGE
033210*-----------------------------------------*
033220*                 ACCEPT  キー入力 FROM CONS
033230                 PERFORM ファイル閉鎖
033240                 MOVE ZERO TO PROGRAM-STATUS
033250                 EXIT PROGRAM
033260             END-EVALUATE
033270*
033280         ELSE
033290             EVALUATE 連計－負担金計算区分
033300             WHEN ZERO
033310             WHEN 2
033320                 MOVE    負担一定金額Ｗ TO 連計－負担額助成
033330                 COMPUTE 請求額Ｗ        = 連計－負担額 - 負担一定金額Ｗ
033340                 MOVE    請求額Ｗ       TO 連計－請求額助成
033341                 MOVE    負担一定金額Ｗ TO 連計日計窓口－負担額
033350*
033360             WHEN OTHER
033370*/エラー表示の修正
033380                 PERFORM コンソールエラー確認
033390                 DISPLAY "負担金算定区分が指定されていません"
033400                         " 受診者№="   連計－患者コード
033410                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
033420*-----------------------------------------*
033430                 CALL "actcshm"  WITH C LINKAGE
033440*-----------------------------------------*
033450*                 ACCEPT  キー入力 FROM CONS
033460                 PERFORM ファイル閉鎖
033470                 MOVE ZERO TO PROGRAM-STATUS
033480                 EXIT PROGRAM
033490             END-EVALUATE
033500         END-IF
033510     END-IF.
033520*
033530*
033540*================================================================*
033550*================================================================*
033560 助成負担額計算１５ SECTION.
033570*
033580* １５：指定負担率
033590****************************************************************
033600* 負担金計算方法の指定  負担金計算区分  費用・請求額   負担額  *
033610* 　　　　　　　　　　　　　　０　　　　　１円単位    １円単位 *
033620*              　　　　 　　　１　　　　１０円単位             *
033630*              　　　　　　　 ２　　　　　１円単位  １０円単位 *
033640****************************************************************
033650*
033660     EVALUATE 連計－負担金計算区分
033670     WHEN ZERO
033680*/負担額は、小数点以下第１位を切り上げる
033690         COMPUTE 負担率中間結果Ｗ = 助成負担率Ｗ / 100
033700         COMPUTE 助成負担額Ｗ     = 連計－費用額老人 * 負担率中間結果Ｗ + 0.9
033701*
033703*---10円単位でも計算 ------------------------------------------*
033704         MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
033705         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
033706         COMPUTE 負担額日計窓口Ｗ = 連計－費用額老人 * 負担率中間結果Ｗ
033707         COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
033708         COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
033710*
033711         IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
033712             MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
033713         END-IF
033717*--------------------------------------------------------------*
033718*
033719     WHEN 2
033720*/１の位を四捨五入して１０の位まで計算
033730         COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
033740         COMPUTE 助成負担額Ｗ     = 連計－費用額老人 * 負担率中間結果Ｗ
033750*       /*１の位を四捨五入して１０円単位にする
033760         COMPUTE 助成負担額Ｗ ROUNDED = 助成負担額Ｗ / 10
033770         COMPUTE 助成負担額Ｗ         = 助成負担額Ｗ * 10
033780     END-EVALUATE.
033790*
033791*================================================================*
033792*================================================================*
033793 助成一部負担算定０５ SECTION.
033794* ［助成］
033795*
033796* 負担一定金額Ｗに上限１（低い金額）、事務手数料Ｗに上限２（高い金額）が入っている。
033797*
033798*/助成負担金免除：９ なら、事務手数料の負担額を使う
033799     MOVE 連計－施術和暦 TO 受－施術和暦.
033800     MOVE 連計－施術年   TO 受－施術年.
033801     MOVE 連計－施術月   TO 受－施術月.
033802     MOVE 連計－患者番号 TO 受－患者番号.
033803     MOVE 連計－枝番     TO 受－枝番.
033804     READ ＥＸ受診者情報Ｆ
033805     INVALID KEY
033806*/エラー表示の修正
033807         PERFORM コンソールエラー確認
033808         DISPLAY "施術月の受診者情報がありません"
033809                 " 受診者№=" 連計－患者コード
033810                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
033811*-----------------------------------------*
033812         CALL "actcshm"  WITH C LINKAGE
033813*-----------------------------------------*
033814*         ACCEPT  キー入力 FROM CONS
033815         PERFORM ファイル閉鎖
033816         MOVE ZERO TO PROGRAM-STATUS
033817         EXIT PROGRAM
033818     NOT INVALID KEY
033819         EVALUATE 受－助成負担金免除
033820         WHEN ZERO
033821             MOVE 負担一定金額Ｗ TO 計算限度額Ｗ
033822         WHEN 1
033823             MOVE ZERO           TO 計算限度額Ｗ
033824         WHEN 9
033825             MOVE 事務手数料Ｗ   TO 計算限度額Ｗ
033826         WHEN OTHER
033827             MOVE 負担一定金額Ｗ TO 計算限度額Ｗ
033828         END-EVALUATE
033829     END-READ.
033830*
033831*****
033844*    月計の時、累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
033845*              限度額を超えている時は､限度額を連計－負担額助成に。
033846*            ※連計算助成累計額－枝番負担累計額も考慮
033847     IF 連計算助成月途中－日計区分 = ZERO
033848        IF 連計算助成累計額－枝番負担累計額 = ZERO
033849           IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
033850               MOVE 連計－負担額老人 TO 連計－負担額助成
033851               MOVE ZERO             TO 連計－請求額助成
033852           ELSE
033853               MOVE 計算限度額Ｗ TO 連計－負担額助成
033854               COMPUTE 連計－請求額助成 = 連計－負担額老人 - 計算限度額Ｗ
033855           END-IF
033856        ELSE
033857           IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
033858               MOVE 連計－負担額老人 TO 連計－負担額助成
033859               MOVE ZERO             TO 連計－請求額助成
033860           ELSE
033861               COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
033862               COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
033863           END-IF
033864        END-IF
033865     ELSE
033868*
033869*       / 日計 /
033870*
033871        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
033872            MOVE ZERO             TO 連計－負担額助成
033873            MOVE 連計－負担額老人 TO 連計－請求額助成
033874        ELSE
033875*
033876             EVALUATE 連計－負担金計算区分
033877             WHEN ZERO
033878             WHEN 2
033879                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
033880                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
033881                 MOVE 負担額Ｗ TO 連計－負担額助成
033882                 MOVE ZERO     TO 連計－請求額助成
033883*                / 連計日計窓口－負担額は何にもしない /
033884**
033885                 COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 負担額Ｗ
033886                 IF  計算用累計額Ｗ > 計算限度額Ｗ
033887                     COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
033888                     COMPUTE 連計－請求額助成 = 負担額Ｗ - 連計－負担額助成
033889*                    / 上限を超える時、連計日計窓口－負担額セット /
033890                     MOVE 連計－負担額助成 TO 連計日計窓口－負担額
033891                 END-IF
033892             END-EVALUATE
033893        END-IF
033894*
033895     END-IF.
033896*
033897*================================================================*
033898*================================================================*
033899 助成一部負担算定１６ SECTION.
033900* ［助成］
033901*
033902* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
033903*
033904     MOVE 連計－施術和暦 TO 受－施術和暦.
033905     MOVE 連計－施術年   TO 受－施術年.
033906     MOVE 連計－施術月   TO 受－施術月.
033907     MOVE 連計－患者番号 TO 受－患者番号.
033908     MOVE 連計－枝番     TO 受－枝番.
033909     READ ＥＸ受診者情報Ｆ
033910     INVALID KEY
033911*/エラー表示の修正
033912         PERFORM コンソールエラー確認
033913         DISPLAY "施術月の受診者情報がありません"
033914                 " 受診者№=" 連計－患者コード
033915                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
033916*-----------------------------------------*
033917         CALL "actcshm"  WITH C LINKAGE
033918*-----------------------------------------*
033919*         ACCEPT  キー入力 FROM CONS
033920         PERFORM ファイル閉鎖
033921         MOVE ZERO TO PROGRAM-STATUS
033922         EXIT PROGRAM
033923     NOT INVALID KEY
033924         EVALUATE 受－助成負担金免除
033925         WHEN ZERO
033926             MOVE 限度額１Ｗ TO 計算限度額Ｗ
033927         WHEN 1
033928             MOVE ZERO       TO 計算限度額Ｗ
033929         WHEN 8
033930             MOVE 限度額２Ｗ TO 計算限度額Ｗ
033931         WHEN 9
033932             MOVE 限度額３Ｗ TO 計算限度額Ｗ
033933         WHEN OTHER
033934             MOVE 限度額１Ｗ TO 計算限度額Ｗ
033935         END-EVALUATE
033936     END-READ.
033937*
033938*****
033941*
033942*    月計の時、本体の負担率と助成の負担率が同じ時、
033943*    　　　　　累計が限度額を超えていない時は､連計－負担額を連計－負担額助成に、請求額助成はZERO
033944*              限度額を超えている時は､限度額を連計－負担額助成に。
033945*              負担率が違うときは、累計額を連計－負担額助成に。
033947*            ※連計算助成累計額－枝番負担累計額も考慮
033948     IF 連計算助成月途中－日計区分 = ZERO
033949        IF 連計算助成累計額－枝番負担累計額 = ZERO
033950           IF 連計－負担率 = 助成負担率Ｗ
033951              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
033952                  MOVE 連計－負担額老人 TO 連計－負担額助成
033953                  MOVE ZERO             TO 連計－請求額助成
033954              ELSE
033955                  MOVE 計算限度額Ｗ TO 連計－負担額助成
033956                  COMPUTE 連計－請求額助成 = 連計－負担額老人 - 計算限度額Ｗ
033957              END-IF
033958           ELSE
033959              MOVE 連計算助成累計額－負担額助成 TO 連計－負担額助成
033960              COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計算助成累計額－負担額助成
033961           END-IF
033962        ELSE
033963           IF 連計－負担率 = 助成負担率Ｗ
033964              IF 連計算助成累計額－負担額助成 < 計算限度額Ｗ
033965                  MOVE 連計－負担額老人 TO 連計－負担額助成
033966                  MOVE ZERO             TO 連計－請求額助成
033967              ELSE
033968                  COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
033969                  COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
033970              END-IF
033971           ELSE
033972              COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－枝番負担累計額
033973              COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
033974           END-IF
033975        END-IF
033976     ELSE
033997*
033998*    / 日計 /
033999        IF 連計算助成累計額－負担額助成 >= 計算限度額Ｗ
034000            MOVE ZERO             TO 連計－負担額助成
034001            MOVE 連計－負担額老人 TO 連計－請求額助成
034002        ELSE
034003*
034004*---10円単位計算 ------------------------------------------*
034005            MOVE ZERO TO 負担額日計窓口Ｗ 負担額日計窓口Ｗ２
034006            COMPUTE 負担率中間結果Ｗ =  助成負担率Ｗ / 100
034007            COMPUTE 負担額日計窓口Ｗ = 連計－費用額老人 * 負担率中間結果Ｗ
034008            COMPUTE 負担額日計窓口Ｗ２ ROUNDED = 負担額日計窓口Ｗ / 10
034009            COMPUTE 負担額日計窓口Ｗ = 負担額日計窓口Ｗ２ * 10
034010*
034011            IF 負担額日計窓口Ｗ < 連計日計窓口－負担額
034012                MOVE 負担額日計窓口Ｗ TO 連計日計窓口－負担額
034013            END-IF
034014*
034015            MOVE 負担額日計窓口Ｗ TO 助成負担額Ｗ
034016*--------------------------------------------------------------*
034017            IF 助成負担額Ｗ > 連計日計窓口－負担額
034018                MOVE 連計日計窓口－負担額 TO 連計－負担額助成
034019            ELSE
034020                MOVE 助成負担額Ｗ         TO 連計－負担額助成
034021            END-IF
034022            COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
034023**
034024            COMPUTE 計算用累計額Ｗ = 連計算助成累計額－負担額助成 + 助成負担額Ｗ
034025            IF  計算用累計額Ｗ > 計算限度額Ｗ
034026                COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成
034027                COMPUTE 連計－請求額助成 = 助成負担額Ｗ - 連計－負担額助成
034028*            / 上限を超える時、連計日計窓口－負担額セット /
034029                MOVE 連計－負担額助成 TO 連計日計窓口－負担額
034030            END-IF
034031**
034032        END-IF
034033     END-IF.
034034*
034035*================================================================*
018218 助成一部負担算定２２ SECTION.
018219* ［助成］
012730******************************************************************
012760* 同一月内で初検日があっても、保険が切り替わっても老人負担回数分は
012770* 引続きカウントされる。
012780******************************************************************
018221* 限度額１Ｗ、限度額２Ｗ、限度額３Ｗに金額の高い順に入っている。。
018225*
018232     MOVE 連計－施術和暦 TO 受－施術和暦.
018233     MOVE 連計－施術年   TO 受－施術年.
018234     MOVE 連計－施術月   TO 受－施術月.
018235     MOVE 連計－患者番号 TO 受－患者番号.
018236     MOVE 連計－枝番     TO 受－枝番.
018237     READ ＥＸ受診者情報Ｆ
018238     INVALID KEY
018239*/エラー表示の修正
018240         PERFORM コンソールエラー確認
018241         DISPLAY "施術月の受診者情報がありません"
018242                 " 受診者№=" 連計－患者コード
018243                 " 施術年月=" 連計－施術年 連計－施術月 UPON CONS
018244*-----------------------------------------*
018245         CALL "actcshm"  WITH C LINKAGE
018246*-----------------------------------------*
018247*         ACCEPT  キー入力 FROM CONS
018248         PERFORM ファイル閉鎖
018249         MOVE ZERO TO PROGRAM-STATUS
018250         EXIT PROGRAM
018251     NOT INVALID KEY
018252         EVALUATE 受－助成負担金免除
018253         WHEN ZERO
018254             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018255         WHEN 1
018256             MOVE ZERO       TO 計算限度額Ｗ
018257         WHEN 8
018258             MOVE 限度額２Ｗ TO 計算限度額Ｗ
018259         WHEN 9
018260             MOVE 限度額３Ｗ TO 計算限度額Ｗ
018261         WHEN OTHER
018262             MOVE 限度額１Ｗ TO 計算限度額Ｗ
018263         END-EVALUATE
018264     END-READ.
018265*
012790*
012800* 親保険が月の途中で変わり、枝番処理を行った場合を考慮し、前親保険で
012810* 診療した日数を受け継ぐ
012820*
012830     PERFORM 診療回数取得.
012840*
012850* DEBUG
012860*     DISPLAY NC"実日数Ｗ" 実日数Ｗ UPON MSGBOX
012870*     DISPLAY NC"老人負担回数Ｗ" 老人負担回数Ｗ UPON MSGBOX
012880*     DISPLAY NC"連計－負担額" 連計－負担額 UPON MSGBOX
012890*     DISPLAY NC"老人一部負担金Ｗ" 老人一部負担金Ｗ UPON MSGBOX
012900*
012910     IF 実日数Ｗ > 助成負担回数Ｗ
012920         MOVE ZERO             TO 連計－負担額助成
012930         MOVE 連計－負担額老人 TO 連計－請求額助成
012940     ELSE
012950*
018357*    / 日計 /
018358         IF 連計算助成累計額－負担額助成１０ >= 計算限度額Ｗ
018359             MOVE ZERO             TO 連計－負担額助成
018360             MOVE 連計－負担額老人 TO 連計－請求額助成
018361         ELSE
018362*
012960         IF 連計－負担額老人 <= 負担一定金額Ｗ
012970             EVALUATE 連計－負担金計算区分
012980             WHEN ZERO
      *１円単位
012990                 MOVE 連計－負担額老人 TO 連計－負担額助成
013000                 MOVE ZERO             TO 連計－請求額助成
013001*               / 連計日計窓口－負担額は何にもしない /
013010*
013020             WHEN 2
013030                 COMPUTE 負担額Ｗ２ ROUNDED = 連計－負担額老人 / 10
013040                 COMPUTE 負担額Ｗ = 負担額Ｗ２ * 10
013050                 MOVE 負担額Ｗ TO 連計－負担額助成
013060                 MOVE ZERO     TO 連計－請求額助成
013061*               / 連計日計窓口－負担額は何にもしない /
013070             WHEN OTHER
013080*/エラー表示の修正
013090                 PERFORM コンソールエラー確認
013100                 DISPLAY "負担金算定区分が指定されていません"
013110                         " 受診者№="   連計－患者コード
013120                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013130*-----------------------------------------*
013140                 CALL "actcshm"  WITH C LINKAGE
013150*-----------------------------------------*
013160*                 ACCEPT  キー入力 FROM CONS
013170                 PERFORM ファイル閉鎖
013180                 MOVE ZERO TO PROGRAM-STATUS
013190                 EXIT PROGRAM
013200             END-EVALUATE
013210*
013220         ELSE
013230             EVALUATE 連計－負担金計算区分
013240             WHEN ZERO
013250* 現在は、老人一部負担金が、５００円のため、１０円単位にする必要なし
013260             WHEN 2
013270                 MOVE 負担一定金額Ｗ TO 連計－負担額助成
013280                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
013290                 MOVE 請求額Ｗ         TO 連計－請求額助成
013291                 MOVE 負担一定金額Ｗ TO 連計日計窓口－負担額
013300*
013310             WHEN OTHER
013320*/エラー表示の修正
013330                 PERFORM コンソールエラー確認
013340                 DISPLAY "負担金算定区分が指定されていません"
013350                         " 受診者№="   連計－患者コード
013360                         " 施術年月="   連計－施術年 連計－施術月 UPON CONS
013370*-----------------------------------------*
013380                 CALL "actcshm"  WITH C LINKAGE
013390*-----------------------------------------*
013400*                 ACCEPT  キー入力 FROM CONS
013410                 PERFORM ファイル閉鎖
013420                 MOVE ZERO TO PROGRAM-STATUS
013430                 EXIT PROGRAM
013440             END-EVALUATE
013450         END-IF
      */限度額を超える日の処理
018358*             IF 連計算助成累計額－負担額助成 + 連計－負担額助成 >= 計算限度額Ｗ
018358             IF 連計算助成累計額－負担額助成１０ + 連計日計窓口－負担額 >= 計算限度額Ｗ
                       COMPUTE 連計－負担額助成 = 計算限度額Ｗ - 連計算助成累計額－負担額助成１０
                       COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
018388                 MOVE 連計－負担額助成 TO 連計日計窓口－負担額
018361             END-IF
013450         END-IF
013460     END-IF.
013470*
013480*
018358     IF 連計算助成累計額－負担額助成１０ < 計算限度額Ｗ
               COMPUTE 連計算助成累計額－負担額助成１０ = 連計算助成累計額－負担額助成１０ + 連計日計窓口－負担額
           END-IF.
034036*================================================================*
012140 助成一部負担算定２４ SECTION.
      *
018111     EVALUATE 受－助成負担金免除
018113     WHEN ZERO
013770         IF 初検日フラグ NOT = SPACE
013780* 途中の負担金は、１円単位のまま、助成の計算を行う。
013790*             PERFORM 負担額計算２
013800             IF 負担一定金額Ｗ >= 連計－負担額老人
013810                 MOVE 連計－負担額老人 TO 連計－負担額助成
013820                 MOVE ZERO             TO 連計－請求額助成
013821*               / 連計日計窓口－負担額は何にもしない /
013830*
013831             ELSE
013840                 MOVE 負担一定金額Ｗ  TO 連計－負担額助成
013850                 COMPUTE 請求額Ｗ = 連計－負担額老人 - 負担一定金額Ｗ
013860                 MOVE 請求額Ｗ        TO 連計－請求額助成
013861                MOVE 負担一定金額Ｗ   TO 連計日計窓口－負担額
013870             END-IF
013880         ELSE
013890             MOVE ZERO             TO 連計－負担額助成
013900             MOVE 連計－負担額老人 TO 連計－請求額助成
013910         END-IF
018113     WHEN 1
               CONTINUE
018113     WHEN 2
014460         PERFORM 助成負担額計算１５
014470         IF 助成負担額Ｗ > 連計－負担額老人
014480             MOVE 連計－負担額老人 TO 連計－負担額助成
014490         ELSE
014500             MOVE 助成負担額Ｗ     TO 連計－負担額助成
014510         END-IF
014520         COMPUTE 連計－請求額助成 = 連計－負担額老人 - 連計－負担額助成
           END-EVALUATE.
018394*================================================================*
034037******************************************************************
034038 END PROGRAM HUR0210.
034039******************************************************************
