000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             JUCONV.
000060 AUTHOR.                 佐野　誠
000070*
000080*----------------------------------------------------------------*
000090*   受診者情報Ｆ　記号・番号暗号化
000130*----------------------------------------------------------------*
000140 DATE-WRITTEN.           2012-06-06
000150 DATE-COMPILED.          2012-06-06
000160*----------------------------------------------------------------*
000170******************************************************************
000180*            ENVIRONMENT         DIVISION                        *
000190******************************************************************
000200 ENVIRONMENT             DIVISION.
000210 CONFIGURATION           SECTION.
000220 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000230 OBJECT-COMPUTER.        FMV-DESKPOWER.
000240 SPECIAL-NAMES.          CONSOLE  IS  CONS
000250                         SYSERR   IS  MSGBOX.
000260 INPUT-OUTPUT            SECTION.
000270 FILE-CONTROL.
000280     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000290                             ORGANIZATION             IS  INDEXED
000300                             ACCESS MODE              IS  DYNAMIC
000310                             RECORD KEY               IS  受－施術和暦年月
000320                                                          受－患者コード
000330                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000340                                                          受－患者カナ
000350                                                          受－患者コード
000360                             ALTERNATE RECORD KEY     IS  受－患者コード
000370                                                          受－施術和暦年月
000380                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000390                                                          受－保険種別
000400                                                          受－保険者番号
000410                                                          受－患者コード
000420                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000430                                                          受－公費種別
000440                                                          受－費用負担者番号
000450                                                          受－患者コード
000460                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000470                                                          受－助成種別
000480                                                          受－費用負担者番号助成
000490                                                          受－患者コード
000500                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000510                                                          受－施術和暦年月
000520                                                          受－患者コード
000530                             FILE STATUS              IS  状態キー
000540                             LOCK        MODE         IS  AUTOMATIC.
000710******************************************************************
000720*                      DATA DIVISION                             *
000730******************************************************************
000740 DATA                    DIVISION.
000750 FILE                    SECTION.
000760*
000770 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000780     COPY JUSINJ         OF  XFDLIB  JOINING   受   AS  PREFIX.
000820*
000830*---------------------------------------------------------------*
000840******************************************************************
000850*                WORKING-STORAGE SECTION                         *
000860******************************************************************
000870 WORKING-STORAGE         SECTION.
000880 01 キー入力                           PIC X     VALUE SPACE.
000890 01 状態キー                           PIC X(2)  VALUE SPACE.
000900 01 終了フラグ                         PIC X(3)  VALUE SPACE.
000950 01 ファイル名Ｗ                       PIC N(6)  VALUE SPACE.
000980*
001060*
001061 01 プログラム名Ｗ     PIC X(8) VALUE "MOJI1".
001062*
001067*
001070*****************************************************************
001080*                          連結項目                             *
001090*****************************************************************
001100*
001101*-----------------------------------------------------------*
001102* 暗号登録用
001103 01 連暗号登録－暗号情報 IS EXTERNAL.
001104    03 連暗号登録－入力情報.
001105       05 連暗号登録－患者番号           PIC 9(6).
001106       05 連暗号登録－画面の記号         PIC X(24).
001107       05 連暗号登録－画面の番号         PIC X(30).
001108    03 連暗号登録－出力情報.
001109       05 連暗号登録－記号               PIC X(24).
001110       05 連暗号登録－番号               PIC X(30).
001111       05 連暗号登録－暗号化項目.
001112         07 連暗号登録－暗号患者番号     PIC X(6).
001113         07 連暗号登録－暗号判定記号     PIC X.
001114         07 連暗号登録－暗号判定番号     PIC X.
001115         07 連暗号登録－暗号記号         PIC X(24).
001116         07 連暗号登録－暗号番号         PIC X(30).
001117*-----------------------------------------------------------*
001118*
001120******************************************************************
001130*                      PROCEDURE  DIVISION                       *
001140******************************************************************
001150 PROCEDURE               DIVISION.
001160************
001170*           *
001180* 初期処理   *
001190*           *
001200************
001210**
001240************
001250*           *
001260* 主処理     *
001270*           *
001280************
001281*
001290     PERFORM 変換処理.
001300*
001310************
001320*           *
001330* 終了処理   *
001340*           *
001350************
001370     EXIT PROGRAM.
001380*
001390*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
001400*================================================================*
001490*================================================================*
001500 オープンチェック SECTION.
001510     IF 状態キー  NOT =  "00"
001520         DISPLAY ファイル名Ｗ NC"Ｆオープンエラー" UPON CONS
001530         DISPLAY NC"状態キー：" 状態キー           UPON CONS
001540         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
001550                                                   UPON CONS
001551*-----------------------------------------*
001552         CALL "actcshm"  WITH C LINKAGE
001553*-----------------------------------------*
001560         ACCEPT  キー入力 FROM CONS
001580         EXIT PROGRAM.
001590*
001600*================================================================*
001610*================================================================*
001620 変換処理 SECTION.
001630*
001631     OPEN I-O 受診者情報Ｆ.
001632          MOVE NC"受診者" TO ファイル名Ｗ.
001633          PERFORM オープンチェック.
001634*
001638*
001640     MOVE ZERO  TO 受－施術和暦年月.
001650     MOVE ZERO  TO 受－患者番号.
001660     MOVE SPACE TO 受－枝番.
001670     START 受診者情報Ｆ KEY IS >= 受－施術和暦年月
001680                                  受－患者コード
001690     END-START.
001700     IF 状態キー = "00"
001710         MOVE SPACE TO 終了フラグ
001720         PERFORM 受診者情報Ｆ読込
001730         PERFORM UNTIL ( 終了フラグ NOT = SPACE )
002110*
002112*---------------------------------------------------------------------------------*
002113*          / 記号・番号暗号化 /
002114            MOVE SPACE TO 連暗号登録－暗号情報
002115            INITIALIZE 連暗号登録－暗号情報
002116*
002120*
002121            MOVE 受－患者番号 TO 連暗号登録－患者番号
002122            MOVE 受－記号     TO 連暗号登録－画面の記号
002123            MOVE 受－番号     TO 連暗号登録－画面の番号
002154*
002155            CALL   プログラム名Ｗ
002156            CANCEL プログラム名Ｗ
002157*
002158*           / セット /
002164            IF 受－暗号判定記号 NOT = "1"
002165               MOVE 連暗号登録－記号          TO 受－記号
002166               MOVE 連暗号登録－暗号患者番号  TO 受－暗号患者番号
002167               MOVE 連暗号登録－暗号判定記号  TO 受－暗号判定記号
002168               MOVE 連暗号登録－暗号記号      TO 受－暗号記号
002169            END-IF
002170*
002171            IF 受－暗号判定番号 NOT = "1"
002172               MOVE 連暗号登録－番号          TO 受－番号
002173               MOVE 連暗号登録－暗号患者番号  TO 受－暗号患者番号
002174               MOVE 連暗号登録－暗号判定番号  TO 受－暗号判定番号
002175               MOVE 連暗号登録－暗号番号      TO 受－暗号番号
002176            END-IF
002177*
002179*---------------------------------------------------------------------------------*
002180*
002181            REWRITE 受－レコード
002182            IF 状態キー NOT = "00"
002183               DISPLAY "受診者更新エラー：" 受－レコードキー UPON CONS
002184               DISPLAY "状態：" 状態キー UPON CONS
002185               CALL "actcshm"  WITH C LINKAGE
002186               ACCEPT  キー入力 FROM CONS
002187            END-IF
002212*
002213            PERFORM 受診者情報Ｆ読込
002214         END-PERFORM
002220     END-IF.
002230*
002231     CLOSE 受診者情報Ｆ.
002232*
002240*================================================================*
002410*================================================================*
002420 受診者情報Ｆ読込 SECTION.
002430*
002440     READ 受診者情報Ｆ NEXT
002450     AT END
002460         MOVE "YES" TO 終了フラグ
002470     END-READ.
002480*
002481*================================================================*
002600*================================================================*
002610*******************************************************************
002620 END PROGRAM JUCONV.
002630*******************************************************************
