000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             KEISAN.
000060 AUTHOR.                 佐野 誠
000070*
000080*------------------------------------------------------------------*
000090*
000100* 計算プログラムの振り分け
000101*
000110*------------------------------------------------------------------*
000120 DATE-WRITTEN.           2004-08-25
000130 DATE-COMPILED.          2004-08-25
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260*
000370*
001360     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\hmobj\TEMP\W50610L.DAT"
001370                             ORGANIZATION             IS  INDEXED
001380                             ACCESS                   IS  DYNAMIC
001390                             RECORD      KEY          IS  作１－施術区分
000180                                                          作１－施術和暦年月日
000190                                                          作１－患者コード
001490                             FILE        STATUS       IS  状態キー
001500                             LOCK        MODE         IS  AUTOMATIC.
001360     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\hmobj\TEMP\W506103L.DAT"
001370                             ORGANIZATION             IS  INDEXED
001380                             ACCESS                   IS  DYNAMIC
001390                             RECORD      KEY          IS  作３－施術区分
000180                                                          作３－患者コード
001490                             FILE        STATUS       IS  状態キー
001500                             LOCK        MODE         IS  AUTOMATIC.
000841*
001990     SELECT  Ｈ制御情報マスタ  ASSIGN      TO      HSEIGYOL
002000                               ORGANIZATION             IS  INDEXED
002010                               ACCESS MODE              IS  DYNAMIC
002020                               RECORD KEY               IS  Ｈ制－制御区分
002030                               FILE STATUS              IS  状態キー
002040                               LOCK        MODE         IS  AUTOMATIC.
000850******************************************************************
000860*                      DATA DIVISION                             *
000870******************************************************************
000880 DATA                    DIVISION.
000890 FILE                    SECTION.
000891*
001350*
001870 FD  作業ファイル１ RECORD  CONTAINS 32 CHARACTERS.
001880 01  作１－レコード.
001890   03  作１－レコードキー.
000450* 1:鍼灸、2:あんま・マッサージ
000460     05 作１－施術区分                       PIC 9.
000470*-----------------------------------------------*
000390     05 作１－施術和暦年月日.
000480        07 作１－施術和暦年月.
000490           09 作１－施術和暦                 PIC 9.
000500           09 作１－施術年月.
000510              11 作１－施術年                PIC 9(2).
000520              11 作１－施術月                PIC 9(2).
000450        07 作１－施術日                      PIC 9(2).
000530     05 作１－患者コード.
000540        07 作１－患者番号                    PIC 9(6).
000550        07 作１－枝番                        PIC X.
003270*---------------------------------------------------------------*
001060*---------------------------------------------------------------*
001350*
001870 FD  作業ファイル３ RECORD  CONTAINS 32 CHARACTERS.
001880 01  作３－レコード.
001890   03  作３－レコードキー.
000450* 1:鍼灸、2:あんま・マッサージ
000460     05 作３－施術区分                       PIC 9.
000470*-----------------------------------------------*
000530     05 作３－患者コード.
000540        07 作３－患者番号                    PIC 9(6).
000550        07 作３－枝番                        PIC X.
003270*---------------------------------------------------------------*
003150*
003160 FD  Ｈ制御情報マスタ    BLOCK   CONTAINS   1   RECORDS.
003170     COPY H_SEIGYO   OF  XFDLIB  JOINING   Ｈ制   AS  PREFIX.
003180*
002090******************************************************************
002100*                WORKING-STORAGE SECTION                         *
002110******************************************************************
002120 WORKING-STORAGE         SECTION.
002130 01 キー入力                           PIC X    VALUE SPACE.
002140 01 状態キー                           PIC X(2) VALUE SPACE.
002150 01 終了フラグ                         PIC X(3) VALUE SPACE.
003370 01 ファイル名                         PIC N(10) VALUE SPACE.
       01 料金計算区分Ｗ                     PIC 9 VALUE ZERO.
002173**
002663* 計算連携キー
002664 01 Ｈ連計算－キーＷ.
002665* / inパラメタ /
002666   03 Ｈ連計算－施術区分Ｗ             PIC 9    VALUE ZERO.
002667   03 Ｈ連計算－施術和暦年月日Ｗ.
002668      05 Ｈ連計算－施術和暦年月Ｗ.
002669        07 Ｈ連計算－施術和暦Ｗ        PIC 9    VALUE ZERO.
002670        07 Ｈ連計算－施術年月Ｗ.
002671          09 Ｈ連計算－施術年Ｗ        PIC 9(2) VALUE ZERO.
002672          09 Ｈ連計算－施術月Ｗ        PIC 9(2) VALUE ZERO.
002673      05 Ｈ連計算－施術日Ｗ            PIC 9(2) VALUE ZERO.
002674   03 Ｈ連計算－患者コードＷ.
002675      05 Ｈ連計算－患者番号Ｗ          PIC 9(6) VALUE ZERO.
002676      05 Ｈ連計算－枝番Ｗ              PIC X    VALUE SPACE.
002677   03 Ｈ連計算－保険種別Ｗ             PIC 9(2) VALUE ZERO.
002678* / 内部パラメタ/
002679   03 Ｈ連計算－内部パラメタＷ.
002680      05 Ｈ連計算－負担金計算区分Ｗ    PIC 9    VALUE ZERO.
002681      05 Ｈ連計算－費用額Ｗ            PIC 9(6) VALUE ZERO.
002682*  初検日に"YES"(負担区分1,2,3,4)
002683      05 Ｈ連計算－初検日フラグＷ      PIC X(3) VALUE SPACE.
002684*  当月の初回なら"YES"(負担区分5)
002685      05 Ｈ連計算－初診療フラグＷ      PIC X(3) VALUE SPACE.
002686*  初検料の金額を転記(負担区分1)
002687      05 Ｈ連計算－初検料Ｗ            PIC 9(4) VALUE ZERO.
002688*  当月の当日までの実日数(枝番も含む)(負担区分6,8,13)
002689      05 Ｈ連計算－実日数Ｗ            PIC 9(2) VALUE ZERO.
002690*  日整静岡乳幼児用。当日の負担のありなし  ０：なし　１：あり (負担区分7)
002691      05 Ｈ連計算－その他計算区分１Ｗ  PIC 9    VALUE ZERO.
002692*  out
002693      05 Ｈ連計算－負担額Ｗ            PIC 9(6) VALUE ZERO.
002694      05 Ｈ連計算－請求額Ｗ            PIC 9(6) VALUE ZERO.
002695      05 Ｈ連計算－負担額助成Ｗ        PIC 9(5) VALUE ZERO.
002696      05 Ｈ連計算－請求額助成Ｗ        PIC 9(5) VALUE ZERO.
002697      05 Ｈ連計算－負担率Ｗ            PIC 9(3) VALUE ZERO.
002409*
002580*
002590******************************************************************
002600*                          連結項目                              *
002610******************************************************************
002620*
002630*
002660 01 連メ－キー IS EXTERNAL.
002661    03 連メ－メッセージ                 PIC N(20).
002662*
002663* 計算連携キー
002664 01 Ｈ連計算－キー IS EXTERNAL.
002665* / inパラメタ /
002666   03 Ｈ連計算－施術区分                   PIC 9.
002667   03 Ｈ連計算－施術和暦年月日.
002668      05 Ｈ連計算－施術和暦年月.
002669        07 Ｈ連計算－施術和暦              PIC 9.
002670        07 Ｈ連計算－施術年月.
002671          09 Ｈ連計算－施術年              PIC 9(2).
002672          09 Ｈ連計算－施術月              PIC 9(2).
002673      05 Ｈ連計算－施術日                  PIC 9(2).
002674   03 Ｈ連計算－患者コード.
002675      05 Ｈ連計算－患者番号                PIC 9(6).
002676      05 Ｈ連計算－枝番                    PIC X.
002677   03 Ｈ連計算－保険種別                   PIC 9(2).
002678* / 内部パラメタ/
002679   03 Ｈ連計算－内部パラメタ.
002680      05 Ｈ連計算－負担金計算区分          PIC 9.
002681      05 Ｈ連計算－費用額                  PIC 9(6).
002682*  初検日に"YES"(負担区分1,2,3,4)
002683      05 Ｈ連計算－初検日フラグ            PIC X(3).
002684*  当月の初回なら"YES"(負担区分5)
002685      05 Ｈ連計算－初診療フラグ            PIC X(3).
002686*  初検料の金額を転記(負担区分1)
002687      05 Ｈ連計算－初検料                  PIC 9(4).
002688*  当月の当日までの実日数(枝番も含む)(負担区分6,8,13)
002689      05 Ｈ連計算－実日数                  PIC 9(2).
002690*  日整静岡乳幼児用。当日の負担のありなし  ０：なし　１：あり (負担区分7)
002691      05 Ｈ連計算－その他計算区分１        PIC 9.
002692*  out
002693      05 Ｈ連計算－負担額                  PIC 9(6).
002694      05 Ｈ連計算－請求額                  PIC 9(6).
002695      05 Ｈ連計算－負担額助成              PIC 9(5).
002696      05 Ｈ連計算－請求額助成              PIC 9(5).
002697      05 Ｈ連計算－負担率                  PIC 9(3).
002698*
002664 01 Ｈ連計算４－キー IS EXTERNAL.
002666   03 Ｈ連計算４－同一建物患者数取得Ｆ     PIC 9.
002698*
002664 01 Ｈ連計算５－キー IS EXTERNAL.
002666   03 Ｈ連計算５－呼出ＰＧ区分             PIC 9.
003526******************************************************************
003527*                      PROCEDURE  DIVISION                       *
003528******************************************************************
003529 PROCEDURE               DIVISION.
HILO  *     DISPLAY "Kei:St-------"  Ｈ連計算－施術和暦年月日 " " Ｈ連計算－患者コード.
003530************
003531*           *
003532* 初期処理   *
003533*           *
003540************
007720     PERFORM ファイルオープン.
           PERFORM 制御情報取得.
003560************
003570*           *
003580* 主処理     *
003590*           *
003600************
003610     PERFORM 呼び出し処理.
003620************
003630*           *
003640* 終了処理   *
003650*           *
003660************
008610     PERFORM ファイル閉鎖.
003690     EXIT PROGRAM.
003700*
003710*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
003720*================================================================*
005610*================================================================*
006522 呼び出し処理 SECTION.
006523*
006524* / 健保と生保単独と保険証忘れ /
006527       IF (( Ｈ連計算－保険種別 > ZERO ) AND ( Ｈ連計算－保険種別 < 10 )) OR 
006528           ( Ｈ連計算－保険種別 = 85 OR 91 )
006529*
      */計算PG追加↓↓↓/20240508
                 EVALUATE TRUE
                 WHEN Ｈ連計算－施術和暦年月 >= 50610
002666              MOVE ZERO TO Ｈ連計算４－同一建物患者数取得Ｆ
006534              CALL   "K50610"
006535              CANCEL "K50610"
      */往療受付画面・料金再計算からコールされた場合は再計算しない/20240928
HILO  *              DISPLAY "Kei-1 " Ｈ連計算５－呼出ＰＧ区分
002666              IF Ｈ連計算５－呼出ＰＧ区分 NOT = 1
      */月次更新対応(計算手動)/20241114
                        IF 料金計算区分Ｗ NOT = 1
                            PERFORM 同一建物患者再計算
                        END-IF
                    END-IF
      */コール元で必ずクリアする/20241001
      *              MOVE ZERO TO Ｈ連計算５－呼出ＰＧ区分
                 WHEN Ｈ連計算－施術和暦年月 >= 41410
006534              CALL   "K41410"
006535              CANCEL "K41410"
                 WHEN OTHER
006538              MOVE  NC"　　該当の施術年月は計算できません。" TO 連メ－メッセージ
006539              CALL   "MSG001"
006540              CANCEL "MSG001"
                 END-EVALUATE
006533*           IF Ｈ連計算－施術和暦年月 >= 41410
006534*              CALL   "K41410"
006535*              CANCEL "K41410"
006536*           ELSE
006538*              MOVE  NC"　　該当の施術年月は計算できません。" TO 連メ－メッセージ
006539*              CALL   "MSG001"
006540*              CANCEL "MSG001"
006541*           END-IF
      */計算PG追加↑↑↑/20240508
006542       ELSE
006543* / 自費 /
006544          IF ( Ｈ連計算－保険種別 = 90 )
006547              CALL   "KJIHI"
006548              CANCEL "KJIHI"
006549          END-IF
006550       END-IF.
006633*
009790*================================================================*
       同一建物患者再計算 SECTION.
      *
HILO  *     DISPLAY "同一建物患者再計算"
002666     MOVE 1    TO Ｈ連計算４－同一建物患者数取得Ｆ.
      *
      */20241216↓逆だと思われる↓↓↓
002664*     MOVE Ｈ連計算－キーＷ TO Ｈ連計算－キー.
002664     MOVE Ｈ連計算－キー TO Ｈ連計算－キーＷ.
      */20241216↑逆だと思われる↑↑↑
           INITIALIZE    Ｈ連計算－キー.
           MOVE SPACE TO Ｈ連計算－キー.
008320     OPEN INPUT 作業ファイル１.
008330         MOVE NC"作１" TO ファイル名.
008340         PERFORM オープンチェック.
           MOVE SPACE TO 終了フラグ.
010280     PERFORM 作業ファイル１読込
010290     PERFORM UNTIL ( 終了フラグ NOT = SPACE )
hilo  *         DISPLAY "KEI-1 " 作１－レコードキー
000460         MOVE 作１－施術区分     TO Ｈ連計算－施術区分     
000480         MOVE 作１－施術和暦年月 TO Ｈ連計算－施術和暦年月
000530         MOVE 作１－患者コード   TO Ｈ連計算－患者コード
HILO  *         DISPLAY "Kei-1 " Ｈ連計算－施術区分 " " Ｈ連計算－施術和暦年月 " " Ｈ連計算－患者コード
      */傷病通院画面からコールされた場合は重複を除く/20240930
002666         IF Ｈ連計算５－呼出ＰＧ区分 NOT = 2
006534             CALL   "K50610"
006535             CANCEL "K50610"
      */傷病通院画面からコールされた場合は重複を除く/20240930↓↓↓
               ELSE
000460             MOVE 作１－施術区分     TO 作３－施術区分
000530             MOVE 作１－患者コード   TO 作３－患者コード
                   WRITE 作３－レコード
                   EVALUATE 状態キー
                   WHEN "00"
006534                 CALL   "K50610"
006535                 CANCEL "K50610"
                   WHEN "22"
                       CONTINUE
                   WHEN OTHER
                       MOVE NC"作３" TO ファイル名
                       PERFORM エラー表示
                   END-EVALUATE
               END-IF
      */傷病通院画面からコールされた場合は重複を除く/20240930↑↑↑
010280         PERFORM 作業ファイル１読込
           END-PERFORM
           CLOSE 作業ファイル１.
      */20241216↓逆だと思われる↓↓↓
002664*     MOVE Ｈ連計算－キー TO Ｈ連計算－キーＷ.
002664     MOVE Ｈ連計算－キーＷ TO Ｈ連計算－キー.
      */20241216↑逆だと思われる↑↑↑
002666     MOVE ZERO TO Ｈ連計算４－同一建物患者数取得Ｆ.
002666     MOVE ZERO TO Ｈ連計算５－呼出ＰＧ区分.
009878*================================================================*
010280 作業ファイル１読込 SECTION.
009160*
009170     READ 作業ファイル１ NEXT
009180     AT END
009190         MOVE "YES"  TO 終了フラグ
009200     END-READ.
009210*
010011*================================================================*
008360 オープンチェック SECTION.
008370*
008380     IF 状態キー  NOT =  "00"
008390         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
008400         DISPLAY NC"状態キー：" 状態キー         UPON CONS
008410         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
008420                                                 UPON CONS
008430*-----------------------------------------*
008440         CALL "actcshm"  WITH C LINKAGE
008450*-----------------------------------------*
008460         ACCEPT  キー入力 FROM CONS
008470*         PERFORM ファイル閉鎖
008480         MOVE 99 TO PROGRAM-STATUS
008490         EXIT PROGRAM.
008500*
007840*================================================================*
007850 ファイルオープン SECTION.
007860*
008320     OPEN I-O 作業ファイル３.
           IF 状態キー = 35
008320         OPEN OUTPUT 作業ファイル３
           END-IF.
008330     MOVE NC"作３" TO ファイル名.
008340     PERFORM オープンチェック.
008240     OPEN INPUT Ｈ制御情報マスタ.
008250         MOVE NC"Ｈ制御" TO ファイル名.
008260         PERFORM オープンチェック.
008510*================================================================*
008520 ファイル閉鎖 SECTION.
008530*
           CLOSE  作業ファイル３ Ｈ制御情報マスタ.
028360*================================================================*
028370 エラー表示 SECTION.
028380*
028390     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
028400     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
028410     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
028420     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"  UPON CONS.
028430*-----------------------------------------*
028440     CALL "actcshm"  WITH C LINKAGE.
028450*-----------------------------------------*
028460     ACCEPT  キー入力 FROM CONS.
028470*
028480*================================================================*
       制御情報取得 SECTION.
      *
007750*   / Ｈ制御情報より /
007760     MOVE ZERO TO Ｈ制－制御区分.
007770     READ Ｈ制御情報マスタ
007780     NOT INVALID KEY
               MOVE Ｈ制－料金計算区分 TO 料金計算区分Ｗ
007800     END-READ.
007840*================================================================*
010200******************************************************************
010210 END PROGRAM KEISAN.
010220******************************************************************
