000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             MAXOURYO.
000060 AUTHOR.                 岡田 憲和
000070*
000080*------------------------------------------------------------------*
000090*      料金改定ごとの最大往療加算金額を算出                        *
000110*------------------------------------------------------------------*
000120 DATE-WRITTEN.           2016-08-31
000130 DATE-COMPILED.          2016-08-31
000140*----------------------------------------------------------------*
000141* 20180425 岡田憲和 平成30年6月からの料金改定に対応
000150* 20201111 佐野　　 令和02年12月からの料金改定に対応
000151******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000266*
001020******************************************************************
001030*                      DATA DIVISION                             *
001040******************************************************************
001050 DATA                    DIVISION.
001060 FILE                    SECTION.
001190*
002080*----------------------------------------------------------------*
002090******************************************************************
002100*                WORKING-STORAGE SECTION                         *
002110******************************************************************
002120 WORKING-STORAGE         SECTION.
002130 01 キー入力                  PIC X    VALUE SPACE.
002140 01 状態キー                  PIC X(2) VALUE SPACE.
002173**
002183 01 エラーフラグ              PIC X(3) VALUE SPACE.
002581*
002590******************************************************************
002600*                          連結項目                              *
002610******************************************************************
003481*---------------------------------------------------------*
003482* 往療料上限料金算定用
003483*---------------------------------------------------------*
003484 01 Ｈ連最往－キー IS EXTERNAL.
003485* 1:鍼灸、2:あんま・マッサージ、3:両方（労災）
003486    03 Ｈ連最往－施術区分                      PIC 9(1).
003487    03 Ｈ連最往－施術和暦年月.
003488       05 Ｈ連最往－施術和暦                   PIC 9.
003489       05 Ｈ連最往－施術年月.
003490          07 Ｈ連最往－施術年                  PIC 9(2).
003491          07 Ｈ連最往－施術月                  PIC 9(2).
003492* 往療距離
003493    03 Ｈ連最往－往療距離                      PIC 9(2)V9.
003494* 往療金額の上限に該当したか？　0:該当せず 1:該当する
003495    03 Ｈ連最往－該当区分                      PIC 9(1).
003496* 今回の往療金額（往療基本料+往療加算料の合算）
003497    03 Ｈ連最往－往療加算金額                  PIC 9(6).
003498* 将来予備項目
003499    03 Ｈ連最往－その他１                      PIC 9(6).
003500    03 Ｈ連最往－その他２                      PIC 9(6).
003501    03 Ｈ連最往－その他３                      PIC 9(6).
003502*
003503*--------------------------------------------------------------*
003504*
003505 01 連メ１０－キー IS EXTERNAL.
003506    03  連メ１０－メッセージ１               PIC X(40).
003507    03  連メ１０－メッセージ２               PIC X(40).
003508    03  連メ１０－メッセージ３               PIC X(40).
003509    03  連メ１０－メッセージ４               PIC X(40).
003510    03  連メ１０－メッセージ５               PIC X(40).
003511    03  連メ１０－メッセージ６               PIC X(40).
003512*
003513******************************************************************
003514*                      PROCEDURE  DIVISION                       *
003515******************************************************************
003516 PROCEDURE               DIVISION.
003517************
003518*           *
003520* 初期処理   *
003530*           *
003540************
003541* 出力情報初期化
003550     MOVE ZERO TO Ｈ連最往－該当区分.
003551     MOVE ZERO TO Ｈ連最往－往療加算金額.
003552*
003560************
003570*           *
003580* 主処理     *
003590*           *
003600************
003610*
003619     PERFORM 主処理.
003623*
003624************
003630*           *
003640* 終了処理   *
003650*           *
003660************
003690     EXIT PROGRAM.
003700*
003710*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
003720*================================================================*
006533*================================================================*
006543 主処理 SECTION.
006553*
006581     MOVE SPACE TO エラーフラグ.
006582
006583*    往療料を算出し返却する
006584     EVALUATE TRUE
006585     WHEN Ｈ連最往－施術和暦年月 NOT < 50610
006587         MOVE ZERO                               TO Ｈ連最往－該当区分
006588         MOVE ZERO                               TO Ｈ連最往－往療加算金額
006585     WHEN Ｈ連最往－施術和暦年月 NOT < 50212
006586         IF Ｈ連最往－往療距離 > 4 
006587             MOVE 1                              TO Ｈ連最往－該当区分
006588             MOVE 250                            TO Ｈ連最往－往療加算金額
006589         END-IF
006590     WHEN Ｈ連最往－施術和暦年月 NOT < 43006
006591         IF Ｈ連最往－往療距離 > 4 
006592             MOVE 1                              TO Ｈ連最往－該当区分
006593             MOVE 400                            TO Ｈ連最往－往療加算金額
006594         END-IF
006595     WHEN Ｈ連最往－施術和暦年月 NOT < 42810
006596         IF Ｈ連最往－往療距離 > 8 
006597             MOVE 1                              TO Ｈ連最往－該当区分
006598             MOVE 2310                           TO Ｈ連最往－往療加算金額
006599         END-IF
006600     WHEN Ｈ連最往－施術和暦年月 NOT < 41806
006607         IF Ｈ連最往－往療距離 > 8 
006608             MOVE 1                              TO Ｈ連最往－該当区分
006611             MOVE 2400                           TO Ｈ連最往－往療加算金額
006612         END-IF
006618     END-EVALUATE.
006619*
006640*-----------------------------------------------------------------------------------*
006641* 異常時エラーメッセージ
006642     IF ( エラーフラグ = "YES" )
006643*
006645         MOVE SPACE TO 連メ１０－キー
006646         MOVE "往療料が計算できません。"        TO 連メ１０－メッセージ１
006649         MOVE "データを確認して下さい。"        TO 連メ１０－メッセージ２
006651*
006652         STRING "施術区分："                    DELIMITED BY SIZE
006655                 Ｈ連最往－施術区分             DELIMITED BY SIZE
006656                " 施術和暦年月日："             DELIMITED BY SIZE
006657                 Ｈ連最往－施術和暦年月         DELIMITED BY SIZE
006658                 INTO 連メ１０－メッセージ４
006659         END-STRING
006660*
006674         STRING "往療距離："                    DELIMITED BY SIZE
006675                 Ｈ連最往－往療距離             DELIMITED BY SIZE
006676                 INTO 連メ１０－メッセージ６
006677         END-STRING
006684
006685         CALL   "MSG010"
006686         CANCEL "MSG010"
006687*
006688     END-IF.
006689*
010106*================================================================*
010200******************************************************************
010210 END PROGRAM MAXOURYO.
010220******************************************************************
