000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             MSG007.
000060 AUTHOR.                 佐野 誠　池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*         メッセージ出力　（柔）
000091*   ２行バージョン
000100*         MED = MSG007G
      *         画面定義体をPowerCOBOLに変更 2009.5
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           1999-05-19
000130 DATE-COMPILED.          1999-05-19
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260*     SELECT  表示ファイル    ASSIGN      TO     GS-DSPFMSG
000270*                             SYMBOLIC    DESTINATION  IS "DSP"
000280*                             FORMAT                   IS  定義体名
000290*                             GROUP                    IS  項目群名
000300*                             PROCESSING  MODE         IS  処理種別
000310*                             SELECTED    FUNCTION     IS  アテンション
000320*                             UNIT        CONTROL      IS  拡張制御
000330*                             FILE        STATUS       IS  通知情報.
000340*     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000350*                             ORGANIZATION             IS  INDEXED
000360*                             ACCESS MODE              IS  DYNAMIC
000370*                             RECORD KEY               IS  制－制御区分
000380*                             FILE STATUS              IS  状態キー
000390*                             LOCK        MODE         IS  AUTOMATIC.
000400******************************************************************
000410*                      DATA DIVISION                             *
000420******************************************************************
000430 DATA                    DIVISION.
000440 FILE                    SECTION.
000450* FD  表示ファイル.
000460*     COPY MSG007G        OF  XMDLIB.
000470*                           ［ＲＬ＝  ２５６］
000480* FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000490*     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000500*
000510*----------------------------------------------------------------*
000520******************************************************************
000530*                WORKING-STORAGE SECTION                         *
000540******************************************************************
000550 WORKING-STORAGE         SECTION.
000560 01 キー入力                           PIC X    VALUE SPACE.
000570 01 状態キー                           PIC X(2) VALUE SPACE.
000580 01 終了フラグ                         PIC X(3) VALUE SPACE.
000870 01 ファイル名                         PIC N(2) VALUE SPACE.
001830*
001831* POWER COBOL用
001832 01 dll-name  PIC X(260)  VALUE SPACE.
001833 01 form-name PIC X(14)   VALUE SPACE.
001190*
003640***************************************************
003650 01 画面制御.
003660     03 定義体名                       PIC X(8) VALUE SPACE.
003670     03 項目群名                       PIC X(8) VALUE SPACE.
003680     03 項目群名Ｒ  REDEFINES  項目群名.
003690         05 項目群Ｒ名                 PIC X(4).
003700         05 項目群番号                 PIC 9(2).
003710         05 FILLER                     PIC X(2).
003720     03 処理種別                       PIC X(2) VALUE SPACE.
003730     03 アテンション                   PIC X(4) VALUE SPACE.
003740     03 機能キー                       PIC X(4) VALUE SPACE.
003750     03 拡張制御.
003760         05 端末制御                   PIC X(4) VALUE SPACE.
003770         05 詳細制御                   PIC X(2) VALUE SPACE.
003780     03 通知情報                       PIC X(2) VALUE SPACE.
003790     03 ユニット名.
003800         05 FILLER                     PIC X(2)  VALUE SPACE.
003810         05 端末番号                   PIC 9(3)  VALUE ZERO.
003820         05 FILLER                     PIC X(4)  VALUE SPACE.
003830     03 メッセージＷ                   PIC N(20) VALUE SPACE.
003840* 日付ＷＯＲＫ
003850 01 和暦終了年Ｗ                       PIC 9(4) VALUE ZERO.
003860 01 計算機和暦年Ｗ                     PIC 9(2) VALUE ZERO.
003870*
003880 01 計算機西暦.
003890    03 計算機西暦年                    PIC 9(4).
003900    03 計算機西暦月日                  PIC 9(4).
003910 01 計算機西暦Ｒ REDEFINES 計算機西暦.
003920    03 計算機世紀                      PIC 9(2).
003930    03 計算機日付                      PIC 9(6).
003940    03 計算機日付Ｒ REDEFINES 計算機日付.
003950       05 計算機年月                   PIC 9(4).
003960       05 計算機年月Ｒ REDEFINES 計算機年月.
003970         07 計算機年                   PIC 9(2).
003980         07 計算機月                   PIC 9(2).
003990       05 計算機日                     PIC 9(2).
004000*
004060*****************************************************************
004070*                          連結項目                             *
004080*****************************************************************
004090*
004091 01 連メ７－キー IS EXTERNAL.
004092    03  連メ７－メッセージ１               PIC X(40).
004102    03  連メ７－メッセージ２               PIC X(40).
      *
       01 連メッセージＰ情報 IS EXTERNAL.
          03 連メＰ－メッセージ番号                PIC 9(2).
          03 連メＰ－メッセージ.
             05 連メＰ－メッセージ内容             PIC X(40) OCCURS 6.
          03 連メＰ－メッセージ１                  PIC X(20).
          03 連メＰ－メッセージ２                  PIC X(12).
004120*
004130******************************************************************
004140*                      PROCEDURE  DIVISION                       *
004150******************************************************************
004160 PROCEDURE               DIVISION.
004170************
004180*           *
004190* 初期処理   *
004200*           *
004210************
004220*     PERFORM 初期化.
004240************
004250*           *
004260* 主処理     *
004270*           *
004280************
004290*
004300*     MOVE 連メ７－メッセージ１ TO メッセージ１.
004301*     MOVE 連メ７－メッセージ２ TO メッセージ２.
004310*
004320*     PERFORM 画面表示.
004330*     PERFORM 終了入力.
004290*
           MOVE 7                    TO 連メＰ－メッセージ番号.
004300     MOVE 連メ７－メッセージ１ TO 連メＰ－メッセージ内容(1).
004301     MOVE 連メ７－メッセージ２ TO 連メＰ－メッセージ内容(2).
004792*
004793      MOVE "PMSG001.DLL" TO dll-name.
004794      MOVE "PMSG001"     TO form-name.
004795      CALL "POWEROPENSHEET" USING dll-name form-name.
004340*
004350************
004360*           *
004370* 終了処理   *
004380*           *
004390************
004400*     PERFORM 終了処理.
004410     EXIT PROGRAM.
004420*
004430*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
004440*================================================================*
004450* 初期化 SECTION.
004460*
004470*     OPEN INPUT 制御情報マスタ.
004480*         MOVE NC"制御" TO ファイル名.
004490*         PERFORM オープンチェック.
004500*     PERFORM 画面オープン.
004510*     PERFORM 画面初期化.
004520*
004530*================================================================*
004540* オープンチェック SECTION.
004550*
004560*     IF 状態キー  NOT =  "00"
004570*         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
004580*         DISPLAY NC"状態キー：" 状態キー         UPON CONS
004590*         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004600*                                                 UPON CONS
004610*         ACCEPT  キー入力 FROM CONS
004620*         PERFORM ファイル閉鎖
004630*         EXIT PROGRAM.
004640**================================================================*
004650* 画面オープン SECTION.
004660**
004670*     OPEN I-O 表示ファイル.
004680*     IF 通知情報  NOT =  "00"
004690*         DISPLAY NC"表示ファイルオープンエラー" UPON CONS
004700*         DISPLAY NC"通知情報：" 通知情報        UPON CONS
004710*         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
004720*                                                UPON CONS
004730*         ACCEPT  キー入力 FROM CONS
004740*         PERFORM ファイル閉鎖
004750*         EXIT PROGRAM.
004760**================================================================*
004770* 画面初期化 SECTION.
004780**
004790*     MOVE SPACE TO 画面レコード.
004800*     INITIALIZE    画面レコード.
004810**
004820*     MOVE "MSG007G" TO 定義体名.
004830*     MOVE SPACE    TO 処理種別.
004840*     MOVE "SCREEN" TO 項目群名.
004850*     PERFORM 画面出力.
004860**================================================================*
004870* 画面表示 SECTION.
004880**
004890*     MOVE "MSG007G" TO 定義体名.
004900*     MOVE SPACE     TO 処理種別.
004910*     MOVE "SCREEN"  TO 項目群名.
004920*     PERFORM 画面出力.
004930**================================================================*
004940* 終了入力 SECTION.
004950**
004960*     MOVE "MSG007G" TO 定義体名.
004970*     MOVE SPACE     TO 処理種別.
004980*     MOVE "GRP001"  TO 項目群名.
004990*     PERFORM 画面入力.
005000**================================================================*
005010* ファイル閉鎖 SECTION.
005020**
005030*     CLOSE 表示ファイル.
005040**
005050**================================================================*
005060* 終了処理 SECTION.
005070**
005080*     PERFORM ファイル閉鎖.
005090**================================================================*
005100* 画面入力 SECTION.
005110**
005120*     READ 表示ファイル
005130*     IF 通知情報 NOT = "00"
005140*         DISPLAY NC"画面入力エラー"      UPON CONS
005150*         DISPLAY NC"処理種別：" 処理種別 UPON CONS
005160*         DISPLAY NC"項目群名：" 項目群名 UPON CONS
005170*         DISPLAY NC"通知情報：" 通知情報 UPON CONS
005180*         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"   
005190*                                         UPON CONS
005200*         ACCEPT  キー入力 FROM CONS
005210*         PERFORM ファイル閉鎖
005220*         EXIT PROGRAM.
005230**================================================================*
005240* 画面出力 SECTION.
005250**
005260*     WRITE 画面レコード
005270**
005280*     IF ( 通知情報 NOT = "00" )
005290*         DISPLAY NC"画面入力エラー"      UPON CONS
005300*         DISPLAY NC"処理種別：" 処理種別 UPON CONS
005310*         DISPLAY NC"項目群名：" 項目群名 UPON CONS
005320*         DISPLAY NC"通知情報：" 通知情報 UPON CONS
005330*         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"   
005340*                                         UPON CONS
005350*         ACCEPT  キー入力 FROM CONS
005360*         PERFORM ファイル閉鎖
005370*         EXIT PROGRAM.
005570**================================================================*
005580*******************************************************************
005590 END PROGRAM MSG007.
005600******************************************************************
