000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             PRINTITI.
000060 AUTHOR.                 佐野　誠
000070*
000080*----------------------------------------------------------------*
000090*    プリンタファイル印字調整READ,WRITE
000100*----------------------------------------------------------------*
000110 DATE-WRITTEN.           2009-06-18
000120 DATE-COMPILED.          2009-06-18
      *
      */190208 池田幸子
      */印字調整のファイルがないときにフラグを返す（個人の時初期値設定の為）
000130*----------------------------------------------------------------*
000140******************************************************************
000150*            ENVIRONMENT         DIVISION                        *
000160******************************************************************
000170 ENVIRONMENT             DIVISION.
000180 CONFIGURATION           SECTION.
000190 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000200 OBJECT-COMPUTER.        FMV-DESKPOWER.
000210 SPECIAL-NAMES.          CONSOLE  IS  CONS
000220                         SYSERR   IS  MSGBOX.
000230 INPUT-OUTPUT            SECTION.
000240 FILE-CONTROL.
000250     SELECT 印刷位置情報Ｆ   ASSIGN      TO           印刷位置情報ＦＷ
000260                             ORGANIZATION             IS LINE SEQUENTIAL
000270                             ACCESS MODE              IS SEQUENTIAL
000280                             FILE STATUS              IS 状態キー
000290                             LOCK      MODE           IS AUTOMATIC.
000300*
000310******************************************************************
000320*                      DATA DIVISION                             *
000330******************************************************************
000340 DATA                    DIVISION.
000350 FILE                    SECTION.
000360*                           ［ＲＬ＝  9］
000370 FD  印刷位置情報Ｆ RECORD  CONTAINS 9 CHARACTERS.
000380 01  印刷位置－レコード.
000390     03  印刷位置－調整データ.
000401         05  印刷位置－印字方向左右          PIC 9.
000410         05  印刷位置－区切１                PIC X.
000411         05  印刷位置－印字方向左右数        PIC 9V9.
000430         05  印刷位置－区切２                PIC X.
000441         05  印刷位置－印字方向上下          PIC 9.
000450         05  印刷位置－区切３                PIC X.
000461         05  印刷位置－印字方向上下数        PIC 9V9.
000470*
000480******************************************************************
000490*                WORKING-STORAGE SECTION                         *
000500******************************************************************
000510 WORKING-STORAGE         SECTION.
000520 01 キー入力                           PIC X    VALUE SPACE.
000530 01 状態キー                           PIC X(2) VALUE SPACE.
000540 01 終了フラグ                         PIC X(3) VALUE SPACE.
000550 01 ファイル名                         PIC N(10).
000560*
000570 01 印刷位置情報ＦＷ                   PIC X(80) VALUE SPACE.
000580*
000590******************************************************************
000600*                          連結項目                              *
000610******************************************************************
000680*****************
000690* 位置調整 *
000700*****************
000710 01 連印刷－位置調整情報 IS EXTERNAL.
000720    03 連印刷－帳票プログラム名      PIC X(8).
000730    03 連印刷－処理区分              PIC X(5).
000771    03 連印刷－調整データ.
000772       05 連印刷－印字方向左右       PIC 9.
000773       05 連印刷－印字方向左右数     PIC 9V9.
000774       05 連印刷－印字方向上下       PIC 9.
000775       05 連印刷－印字方向上下数     PIC 9V9.
000780*
000710 01 連印刷－ファイル情報 IS EXTERNAL.
000720    03 連印刷－初回設定Ｆ            PIC 9(1).
      *
000797******************************************************************
000800*                      PROCEDURE  DIVISION                       *
000810******************************************************************
000820 PROCEDURE               DIVISION.
000830************
000840*           *
000850* 初期処理   *
000860*           *
000870************
000880     PERFORM 連結項目待避.
000890************
000900*           *
000910* 主処理     *
000920*           *
000930************
000940*
000950     STRING "c:\makishisys\data\prtadjust\" DELIMITED BY SIZE
000960             連印刷－帳票プログラム名       DELIMITED BY SPACE
000970             INTO 印刷位置情報ＦＷ
000980     END-STRING.
000990*
001000     EVALUATE 連印刷－処理区分
001010     WHEN "READ"
001020         PERFORM 印刷位置情報取得
001030     WHEN "WRITE"
001040         PERFORM 印刷位置情報更新
001050     END-EVALUATE.
001060*
001070************
001080*           *
001090* 終了処理   *
001100*           *
001110************
001120     PERFORM 終了処理.
001130     EXIT PROGRAM.
001140*
001150*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
001160*================================================================*
001170 印刷位置情報取得 SECTION.
001180*================================================================*
001181*
001182     INITIALIZE 連印刷－調整データ.
001182     INITIALIZE 連印刷－ファイル情報.
001183*
001190     OPEN INPUT 印刷位置情報Ｆ.
001200     IF ( 状態キー = "35" )
              MOVE 1      TO 連印刷－初回設定Ｆ
001210        OPEN OUTPUT 印刷位置情報Ｆ
001220        CLOSE       印刷位置情報Ｆ
001230        OPEN INPUT  印刷位置情報Ｆ
001240     ELSE
001250        MOVE NC"印刷位置情報Ｆ" TO ファイル名
001260        PERFORM オープンチェック
001270     END-IF.
001280*----------------------------------------------------------------*
001290     MOVE SPACE TO 終了フラグ.
001300*
001310     READ 印刷位置情報Ｆ
001320     AT END
001330         MOVE "YES" TO 終了フラグ
001340     END-READ.
001350*
001368     IF ( 終了フラグ = SPACE )
001370        IF ( 印刷位置－印字方向左右 NOT = ZERO ) AND
001380           ( 印刷位置－印字方向左右 NOT = SPACE )
001390           MOVE 印刷位置－印字方向左右   TO 連印刷－印字方向左右
001400        END-IF
001410        IF ( 印刷位置－印字方向左右数 NOT = ZERO ) 
001430           MOVE 印刷位置－印字方向左右数   TO 連印刷－印字方向左右数
001440        END-IF
001450        IF ( 印刷位置－印字方向上下 NOT = ZERO ) AND
001460           ( 印刷位置－印字方向上下 NOT = SPACE )
001470           MOVE 印刷位置－印字方向上下   TO 連印刷－印字方向上下
001480        END-IF
001490        IF ( 印刷位置－印字方向上下数 NOT = ZERO ) 
001510           MOVE 印刷位置－印字方向上下数 TO 連印刷－印字方向上下数
001520        END-IF
001530     END-IF.
001540*
001550*================================================================*
001560 印刷位置情報更新 SECTION.
001570*================================================================*
001580     OPEN OUTPUT 印刷位置情報Ｆ.
001590        MOVE NC"印刷位置情報Ｆ" TO ファイル名.
001600        PERFORM オープンチェック.
001610*----------------------------------------------------------------*
001620     MOVE SPACE  TO 印刷位置－レコード.
001630     INITIALIZE 印刷位置－レコード.
001640*
001657     MOVE 連印刷－印字方向左右         TO 印刷位置－印字方向左右.
001660     MOVE 連印刷－印字方向左右数       TO 印刷位置－印字方向左右数.
001670     MOVE 連印刷－印字方向上下         TO 印刷位置－印字方向上下.
001680     MOVE 連印刷－印字方向上下数       TO 印刷位置－印字方向上下数.
001690     MOVE ","                TO 印刷位置－区切１ 印刷位置－区切２ 印刷位置－区切３.
001700*
001710     WRITE 印刷位置－レコード.
001720*
001730*================================================================*
001740 連結項目待避 SECTION.
001750*================================================================*
001760*
001770*================================================================*
001780 オープンチェック SECTION.
001790*================================================================*
001800     IF ( 状態キー NOT = "00" )
001810         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
001820         DISPLAY NC"状態キー：" 状態キー         UPON CONS
001830         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
001840                                                 UPON CONS
001841*-----------------------------------------*
001842         CALL "actcshm"  WITH C LINKAGE
001843*-----------------------------------------*
001850         ACCEPT  キー入力 FROM CONS
001860         PERFORM ファイル閉鎖
001870         EXIT PROGRAM.
001880*
001890*================================================================*
001900 終了処理 SECTION.
001910*================================================================*
001920     PERFORM ファイル閉鎖.
001930*
001940*================================================================*
001950 ファイル閉鎖 SECTION.
001960*
001970     CLOSE 印刷位置情報Ｆ.
001980*
001990*================================================================*
002000******************************************************************
002010 END PROGRAM PRINTITI.
002020******************************************************************
