000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             SYOUKAN.
000060 AUTHOR.                 宮原 睦美
000070*
000080*----------------------------------------------------------------*
000090*    償還払い対象判定
000100*----------------------------------------------------------------*
000110 DATE-WRITTEN.           2009-07-07
000120 DATE-COMPILED.          2009-07-07
000130*----------------------------------------------------------------*
000140******************************************************************
000150*            ENVIRONMENT         DIVISION                        *
000160******************************************************************
000170 ENVIRONMENT             DIVISION.
000180 CONFIGURATION           SECTION.
000190 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000200 OBJECT-COMPUTER.        FMV-DESKPOWER.
000210 SPECIAL-NAMES.          CONSOLE  IS  CONS
000220                         SYSERR   IS  MSGBOX.
000230 DATA                    DIVISION.
000240******************************************************************
000250*                WORKING-STORAGE SECTION                         *
000260******************************************************************
000270 WORKING-STORAGE         SECTION.
000280 01 キー入力                           PIC X    VALUE SPACE.
000290 01 状態キー                           PIC X(2) VALUE SPACE.
000300 01 終了フラグ                         PIC X(3) VALUE SPACE.
000310 01 ファイル名                         PIC N(10).
000320*
000330 01 画面位置情報ＦＷ                   PIC X(80) VALUE SPACE.
000340*
000350******************************************************************
000360*                          連結項目                              *
000370******************************************************************
000380********************
000390* メッセージ表示キー *
000400********************
000410 01 連メ－キー IS EXTERNAL.
000420    03  連メ－メッセージ             PIC N(20).
000430*
000440********************
000450* 償還払い対象判定 *
000460********************
000470 01 連償還－償還払い情報 IS EXTERNAL.
000480*in
000490    03 連償還－施術区分              PIC 9(1).
000500    03 連償還－保険証償還払い区分    PIC 9(1).
000510    03 連償還－助成償還払い区分      PIC 9(1).
000520*
000530*out
000540* ( 0:通常 1:償還払い)
000550    03 連償還－本体償還対象区分      PIC 9(1).
000560    03 連償還－助成償還対象区分      PIC 9(1).
000570*
000580    03 連償還－償還コメント          PIC X(30).
000590*
000600******************************************************************
000610*                      PROCEDURE  DIVISION                       *
000620******************************************************************
000630 PROCEDURE               DIVISION.
000640************
000650*           *
000660* 初期処理   *
000670*           *
000680************
000690*     PERFORM 初期化.
000700************
000710*           *
000720* 主処理     *
000730*           *
000740************
000750     MOVE ZERO  TO 連償還－本体償還対象区分.
000760     MOVE ZERO  TO 連償還－助成償還対象区分.
000770     MOVE SPACE TO 連償還－償還コメント.
000780* 
000790     EVALUATE 連償還－施術区分
000800*/柔整
000810     WHEN 0
000820         IF ( 連償還－保険証償還払い区分 = 2 OR 3 )
000830            MOVE 1 TO 連償還－本体償還対象区分
000840         END-IF
000850*
000860         IF ( 連償還－助成償還払い区分 = 2 OR 3 )
000870            MOVE 1 TO 連償還－助成償還対象区分
000880         END-IF
000890*
000900*/鍼灸・マッサージ
000910     WHEN 1
000920     WHEN 2
000930         IF ( 連償還－保険証償還払い区分 = 1 OR 3 )
000940            MOVE 1 TO 連償還－本体償還対象区分
000950         END-IF
000960*
000970         IF ( 連償還－助成償還払い区分 = 1 OR 3 )
000980            MOVE 1 TO 連償還－助成償還対象区分
000990         END-IF
001000     END-EVALUATE.
001010*
001020*-------------------------------------------------------------------------*
001030     EVALUATE TRUE
001040     WHEN ( 連償還－本体償還対象区分 = 1 ) AND ( 連償還－助成償還対象区分 = 1 )
001050         MOVE "保険：償還  助成：償還" TO 連償還－償還コメント
001060*
001070     WHEN ( 連償還－本体償還対象区分 = 1 ) AND ( 連償還－助成償還対象区分 NOT = 1 )
001080         MOVE "保険：償還"             TO 連償還－償還コメント
001090*
001100     WHEN ( 連償還－本体償還対象区分 NOT = 1 ) AND ( 連償還－助成償還対象区分 = 1 )
001110         MOVE "助成：償還"             TO 連償還－償還コメント
001120     END-EVALUATE.
001130*
001140     EXIT PROGRAM.
001150*
001160************
001170*           *
001180* 終了処理   *
001190*           *
001200************
001210*     PERFORM 終了処理.
001220*
001230*================================================================*
001240******************************************************************
001250 END PROGRAM SYOUKAN.
001260******************************************************************
