000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             VERUPGO.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         ＶＥＲＵＰにパラメータを渡す
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2009-09-16
000130 DATE-COMPILED.          2009-09-16
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.
000130     ARGUMENT-NUMBER IS 引数の番号
000140     ARGUMENT-VALUE  IS 引数の値.
000400******************************************************************
000410*                      DATA DIVISION                             *
000420******************************************************************
000430 DATA                    DIVISION.
000520******************************************************************
000530*                WORKING-STORAGE SECTION                         *
000540******************************************************************
000550 WORKING-STORAGE         SECTION.
000180 01 引数の数    PIC 9(4)  BINARY.
       01 種類区分Ｗ  PIC X(2).
       01 更新区分Ｗ  PIC X(1).
       01 カウンタ    PIC 9(9).
       01 ファイル名  PIC X(15).
001830*
001831* POWER COBOL用
001832 01 dll-name  PIC X(260)  VALUE SPACE.
001833 01 form-name PIC X(14)   VALUE SPACE.
001834*
001600******************************************************************
001610*                          連結項目                              *
001620******************************************************************
001630********************************
001640* バージョンアップのパラメータ *
001650********************************
       01 連バージョンアップ情報 IS EXTERNAL GLOBAL.
          03 連バ－修正種類区分            PIC X(2).
          03 連バ－修正更新区分            PIC X(1).
      *
004130******************************************************************
004140*                      PROCEDURE  DIVISION                       *
004150******************************************************************
004160 PROCEDURE               DIVISION.
      *
           ACCEPT 引数の数 FROM 引数の番号.
           DISPLAY 1  UPON 引数の番号.
           ACCEPT 種類区分Ｗ FROM 引数の値
           ON EXCEPTION 
                  DISPLAY 種類区分Ｗ "種類区分Ｗ".
      *
           MOVE 種類区分Ｗ TO 連バ－修正種類区分.
004792*
           ACCEPT 更新区分Ｗ FROM 引数の値
           ON EXCEPTION 
                  DISPLAY 更新区分Ｗ "更新区分Ｗ".
      *
           MOVE 更新区分Ｗ TO 連バ－修正更新区分.
004792*
004793     MOVE "VERUP.DLL" TO dll-name.
004794     MOVE "VERUP"     TO form-name.
004795     CALL "POWEROPENSHEET" USING dll-name form-name.
      *
004410     EXIT PROGRAM.
005570*================================================================*
005580******************************************************************
005590 END PROGRAM VERUPGO.
005600******************************************************************
