000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             VERUPGO2.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         ＶＥＲＵＰにパラメータを渡す
000100*----------------------------------------------------------------*
000110 DATE-WRITTEN.           2009-09-16
000120 DATE-COMPILED.          2009-09-16
000130*----------------------------------------------------------------*
000140******************************************************************
000150*            ENVIRONMENT         DIVISION                        *
000160******************************************************************
000170 ENVIRONMENT             DIVISION.
000180 CONFIGURATION           SECTION.
000190 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000200 OBJECT-COMPUTER.        FMV-DESKPOWER.
000210 SPECIAL-NAMES.
000220     ARGUMENT-NUMBER IS 引数の番号
000230     ARGUMENT-VALUE  IS 引数の値.
000240******************************************************************
000250*                      DATA DIVISION                             *
000260******************************************************************
000270 DATA                    DIVISION.
000280******************************************************************
000290*                WORKING-STORAGE SECTION                         *
000300******************************************************************
000310 WORKING-STORAGE         SECTION.
000320 01 引数の数    PIC 9(4)  BINARY.
000330 01 種類区分Ｗ  PIC X(2).
000340 01 更新区分Ｗ  PIC X(1).
000350 01 カウンタ    PIC 9(9).
000360 01 ファイル名  PIC X(15).
000370*
000380* POWER COBOL用
000390 01 dll-name  PIC X(260)  VALUE SPACE.
000400 01 form-name PIC X(14)   VALUE SPACE.
000410*
000420******************************************************************
000430*                          連結項目                              *
000440******************************************************************
000450********************************
000460* バージョンアップのパラメータ *
000470********************************
000480 01 連バージョンアップ情報 IS EXTERNAL GLOBAL.
000490    03 連バ－修正種類区分            PIC X(2).
000500    03 連バ－修正更新区分            PIC X(1).
000510*
000520******************************************************************
000530*                      PROCEDURE  DIVISION                       *
000540******************************************************************
000550 PROCEDURE               DIVISION.
000560*
000570     ACCEPT 引数の数 FROM 引数の番号.
000580     DISPLAY 1  UPON 引数の番号.
000590     ACCEPT 種類区分Ｗ FROM 引数の値
000600     ON EXCEPTION 
000610            DISPLAY 種類区分Ｗ "種類区分Ｗ".
000620*
000630     MOVE 種類区分Ｗ TO 連バ－修正種類区分.
000640*
000650     ACCEPT 更新区分Ｗ FROM 引数の値
000660     ON EXCEPTION 
000670            DISPLAY 更新区分Ｗ "更新区分Ｗ".
000680*
000690     MOVE 更新区分Ｗ TO 連バ－修正更新区分.
000700*
000710     MOVE "VERUPNET.DLL" TO dll-name.
000720     MOVE "VERUPNET"     TO form-name.
000730     CALL "POWEROPENSHEET" USING dll-name form-name.
000740*
000750     EXIT PROGRAM.
000760*================================================================*
000770******************************************************************
000780 END PROGRAM VERUPGO2.
000790******************************************************************
