000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAW602.
000060 AUTHOR.                 佐野 誠
000070*
000080*----------------------------------------------------------------*
000090*         レセプトファイル作成（柔ｳｨﾝﾄﾞｳｽﾞ95版）
000100*
000102*    保険証010,負傷020,受付030 から呼ばれる
000103*
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2010-12-10
000130 DATE-COMPILED.          2010-12-10
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000932     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000933                             ORGANIZATION             IS  INDEXED
000940                             ACCESS MODE              IS  DYNAMIC
000950                             RECORD KEY               IS 受－施術和暦年月
000960                                                          受－患者コード
000970                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000980                                                          受－患者カナ
000990                                                          受－患者コード
001000                             ALTERNATE RECORD KEY     IS  受－患者コード
001010                                                         受－施術和暦年月
001020                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001030                                                          受－保険種別
001040                                                          受－保険者番号
001050                                                          受－患者コード
001060                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001070                                                          受－公費種別
001080                                                     受－費用負担者番号
001090                                                          受－患者コード
001100                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001110                                                          受－助成種別
001120                                                  受－費用負担者番号助成
001130                                                          受－患者コード
001140                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
001150                                                      受－施術和暦年月
001160                                                      受－患者コード
001170                             FILE STATUS              IS  状態キー
001180                             LOCK        MODE         IS  AUTOMATIC.
001190     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
001200                             ORGANIZATION             IS  INDEXED
001210                             ACCESS MODE              IS  DYNAMIC
001220                             RECORD KEY               IS  負－施術和暦年月
001230                                                          負－患者コード
001240                             ALTERNATE RECORD KEY     IS  負－患者コード
001250                                                          負－施術和暦年月
001260                             FILE STATUS              IS  状態キー
001270                             LOCK        MODE         IS  AUTOMATIC.
001280*
001477******************************************************************
001478*                      DATA DIVISION                             *
001479******************************************************************
001480 DATA                    DIVISION.
001481 FILE                    SECTION.
001483*
001770 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001780     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001844*
001854 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001864     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001874*
001880*----------------------------------------------------------------*
001890******************************************************************
001900*                WORKING-STORAGE SECTION                         *
001910******************************************************************
001920 WORKING-STORAGE         SECTION.
001930 01 キー入力                           PIC X     VALUE SPACE.
001940 01 状態キー                           PIC X(2)  VALUE SPACE.
001950 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001960 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001980 01 ファイル名                         PIC N(6)  VALUE SPACE.
002000 01 前和暦Ｗ                           PIC 9     VALUE ZERO.
002010 01 カレント元号Ｗ                     PIC 9     VALUE ZERO.
002020 01 部位ＣＮＴ                         PIC 9     VALUE ZERO.
002152 01 カウンタ                           PIC 9(2)  VALUE ZERO.
002153 01 カウンタ２                         PIC 9(2)  VALUE ZERO.
002155*
005908*
006670*
007060******************************************************************
007070*                          連結項目                              *
007080******************************************************************
007130*
010750**
010751********************
010752** レセＦ連携用
010753********************
010754 01 連レセＦ－キー IS EXTERNAL.
010755    03 連レセＦ－施術年月.
010756       05 連レセＦ－施術和暦             PIC 9.
010757       05 連レセＦ－施術年               PIC 9(2).
010758       05 連レセＦ－施術月               PIC 9(2).
010759    03 連レセＦ－患者コード.
010760       05 連レセＦ－患者番号             PIC 9(6).
010761       05 連レセＦ－枝番                 PIC X.
010762*   / 0：柔整、1：鍼灸マ
010763    03 連レセＦ－保険変更                PIC 9.
010764**
010765********************
010766* メッセージ表示キー *
010767********************
010768 01 連メ－キー IS EXTERNAL.
010769    03  連メ－メッセージ                 PIC N(20).
010770*
010787*
010788** 月次更新連携キー
010789 01 連月－キー IS EXTERNAL.
010790    03  連月－施術和暦年月.
010791      05  連月－施術和暦               PIC 9.
010792      05  連月－施術年月.
010793        07  連月－施術年               PIC 9(2).
010794        07  連月－施術月               PIC 9(2).
010795    03  連月－患者コード.
010796      05  連月－患者番号               PIC 9(6).
010797      05  連月－枝番                   PIC X.
010798    03  連月－負傷のみ区分             PIC X(3).
010799*
010800*----------------------------------------------------------*
010801* 新計算連結
010802 01 連Ｙ計算－キー IS EXTERNAL.
010803   03 連Ｙ計算－施術和暦年月.
010804     05 連Ｙ計算－施術和暦           PIC 9.
010805     05 連Ｙ計算－施術年月.
010806       07 連Ｙ計算－施術年           PIC 9(2).
010807       07 連Ｙ計算－施術月           PIC 9(2).
010808   03 連Ｙ計算－患者コード.
010809     05 連Ｙ計算－患者番号           PIC 9(6).
010810     05 連Ｙ計算－枝番               PIC X.
010811*----------------------------------------------------------*
010812*
010814******************************************************************
010815*                      PROCEDURE  DIVISION                       *
010816******************************************************************
010817 PROCEDURE               DIVISION.
010818************
010819*          *
010820* 初期処理 *
010830*          *
010840************
010860     PERFORM 初期化.
010861*
010862*-----------------------------------------------------------*
010871*    / 月次更新の負傷・RECEのみ作成 /
010872     MOVE SPACE TO 連月－キー.
010881     INITIALIZE 連月－キー.
010891*
010892     MOVE 連レセＦ－施術和暦   TO 連月－施術和暦.
010893     MOVE 連レセＦ－施術年     TO 連月－施術年.
010894     MOVE 連レセＦ－施術月     TO 連月－施術月.
010898     MOVE 連レセＦ－患者コード TO 連月－患者コード.
010899*
010901*   / 0：柔整、1：鍼灸マ
010902     IF 連レセＦ－保険変更 = 1
010903        MOVE "HM"      TO 連月－負傷のみ区分
010904     ELSE
010905        MOVE "YAW"     TO 連月－負傷のみ区分
010906     END-IF.
010907*
010908     CALL   "GETUJIK".
010909     CANCEL "GETUJIK".
010911*
010915*
010916*-----------------------------------------------------------*
010921*
010922*-----------------------------------------------------------*
010931* YKEISAN
010941*
010942     MOVE 連レセＦ－施術和暦     TO 負－施術和暦
010943     MOVE 連レセＦ－施術年       TO 負－施術年
010944     MOVE 連レセＦ－施術月       TO 負－施術月
010945     MOVE 連レセＦ－患者番号     TO 負－患者番号
010946     MOVE 連レセＦ－枝番         TO 負－枝番
010947     READ 負傷データＦ
010948     NOT INVALID KEY
010949         IF ( 連月－負傷のみ区分  = "YAW" ) OR
010950            (( 連月－負傷のみ区分  = "HM" ) AND ( 負－部位数 NOT = ZERO ))
010953            MOVE SPACE TO 連Ｙ計算－キー
010954            INITIALIZE 連Ｙ計算－キー
010956            MOVE 連レセＦ－施術和暦   TO 連Ｙ計算－施術和暦
010957            MOVE 連レセＦ－施術年     TO 連Ｙ計算－施術年
010958            MOVE 連レセＦ－施術月     TO 連Ｙ計算－施術月
010959            MOVE 連レセＦ－患者コード TO 連Ｙ計算－患者コード
010960*
010961            CALL   "YKEISAN"
010962            CANCEL "YKEISAN"
010965         END-IF
010966     END-READ.
010972*
010977*-----------------------------------------------------------*
010998*
011000     PERFORM 終了処理.
011010     EXIT PROGRAM.
011020*
011030*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
011040*================================================================*
011050 初期化 SECTION.
011060*
011070     PERFORM ファイルオープン.
011077*
011190*================================================================*
011570*================================================================*
011580 ファイルオープン SECTION.
011590*
011870*     OPEN INPUT 受診者情報Ｆ.
011880*         MOVE NC"受情" TO ファイル名.
011890*         PERFORM オープンチェック.
011960*
011961     OPEN INPUT 負傷データＦ.
011962         MOVE NC"負傷" TO ファイル名.
011963         PERFORM オープンチェック.
011973*
011990*================================================================*
012000 オープンチェック SECTION.
012010*
012020     IF 状態キー  NOT =  "00"
012030         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
012040         DISPLAY NC"状態キー：" 状態キー         UPON CONS
012050         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
012060                                                 UPON CONS
012061*-----------------------------------------*
012062         CALL "actcshm"  WITH C LINKAGE
012063*-----------------------------------------*
012070         ACCEPT  キー入力 FROM CONS
012080         PERFORM ファイル閉鎖
012090         EXIT PROGRAM.
012091*================================================================*
024297*================================================================*
024298 ファイル閉鎖 SECTION.
024299*
024300*     CLOSE  受診者情報Ｆ.
024301     CLOSE  負傷データＦ.
024302*================================================================*
024303 終了処理 SECTION.
024304*
024305     PERFORM ファイル閉鎖.
024306*================================================================*
024307******************************************************************
024308 END PROGRAM YAW602.
024309******************************************************************
