000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAW602.
000060 AUTHOR.                 佐野 誠
000070*
000080*----------------------------------------------------------------*
000090*         レセプトファイル作成（柔ｳｨﾝﾄﾞｳｽﾞ95版）
000100*
000102*    保険証010,負傷020,受付030,特殊施術032 から呼ばれる
000103*
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2001-08-01
000130 DATE-COMPILED.          2001-08-01
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260*     SELECT  保険者マスタ    ASSIGN      TO        HOKENSL
000270*                             ORGANIZATION             IS  INDEXED
000280*                             ACCESS MODE              IS  DYNAMIC
000290*                             RECORD KEY               IS  保－保険種別
000300*                                                          保－保険者番号
000320*                             ALTERNATE RECORD KEY     IS  保－保険種別
000330*                                                          保－保険者名称
000340*                                                          保－保険者番号
000350*                             FILE STATUS              IS  状態キー
000360*                             LOCK        MODE         IS  AUTOMATIC.
000370*     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000380*                             ORGANIZATION             IS  INDEXED
000390*                             ACCESS MODE              IS  DYNAMIC
000400*                             RECORD KEY               IS  市－公費種別
000410*                                                          市－市町村番号
000420*                             ALTERNATE RECORD KEY     IS  市－公費種別
000430*                                                          市－市町村名称
000440*                                                          市－市町村番号
000450*                             FILE STATUS              IS  状態キー
000460*                             LOCK        MODE         IS  AUTOMATIC.
000461*     SELECT  部位マスタ      ASSIGN      TO        BUICODEL
000462*                             ORGANIZATION             IS  INDEXED
000463*                             ACCESS MODE              IS  DYNAMIC
000464*                             RECORD KEY               IS  部－部位コード
000465*                             FILE STATUS              IS  状態キー
000466*                             LOCK        MODE         IS  AUTOMATIC.
000467*     SELECT  名称マスタ      ASSIGN      TO        MEISYOL
000468*                             ORGANIZATION             IS  INDEXED
000469*                             ACCESS MODE              IS  DYNAMIC
000470*                             RECORD KEY               IS  名－区分コード
000471*                                                          名－名称コード
000472*                             FILE STATUS              IS  状態キー
000473*                             LOCK        MODE         IS  AUTOMATIC.
000474*     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000480*                             ORGANIZATION             IS  INDEXED
000490*                             ACCESS MODE              IS  DYNAMIC
000500*                             RECORD KEY               IS  元－元号区分
000510*                             FILE STATUS              IS  状態キー
000520*                             LOCK        MODE         IS  AUTOMATIC.
000660*     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000670*                             ORGANIZATION             IS  INDEXED
000680*                             ACCESS MODE              IS  DYNAMIC
000690*                             RECORD KEY               IS  制－制御区分
000700*                             FILE STATUS              IS  状態キー
000710*                             LOCK        MODE         IS  AUTOMATIC.
000932     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000933                             ORGANIZATION             IS  INDEXED
000940                             ACCESS MODE              IS  DYNAMIC
000950                             RECORD KEY               IS 受－施術和暦年月
000960                                                          受－患者コード
000970                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000980                                                          受－患者カナ
000990                                                          受－患者コード
001000                             ALTERNATE RECORD KEY     IS  受－患者コード
001010                                                         受－施術和暦年月
001020                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001030                                                          受－保険種別
001040                                                          受－保険者番号
001050                                                          受－患者コード
001060                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001070                                                          受－公費種別
001080                                                     受－費用負担者番号
001090                                                          受－患者コード
001100                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
001110                                                          受－助成種別
001120                                                  受－費用負担者番号助成
001130                                                          受－患者コード
001140                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
001150                                                      受－施術和暦年月
001160                                                      受－患者コード
001170                             FILE STATUS              IS  状態キー
001180                             LOCK        MODE         IS  AUTOMATIC.
001190     SELECT  施術記録Ｆ      ASSIGN      TO        SEKIROKL
001200                             ORGANIZATION             IS  INDEXED
001210                             ACCESS MODE              IS  DYNAMIC
001220                             RECORD KEY           IS 施記－施術和暦年月日
001230                                                     施記－患者コード
001240                             ALTERNATE RECORD KEY IS 施記－患者コード
001250                                                     施記－施術和暦年月日
001260                             FILE STATUS              IS  状態キー
001270                             LOCK        MODE         IS  AUTOMATIC.
001280     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
001290                             ORGANIZATION             IS  INDEXED
001300                             ACCESS MODE              IS  DYNAMIC
001310                             RECORD KEY               IS 負－施術和暦年月
001320                                                         負－患者コード
001330                             ALTERNATE RECORD KEY     IS 負－患者コード
001340                                                         負－施術和暦年月
001350                             FILE STATUS              IS  状態キー
001360                             LOCK        MODE         IS  AUTOMATIC.
001361*
001362     SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
001363                             ORGANIZATION             IS  INDEXED
001364                             ACCESS MODE              IS  DYNAMIC
001365                             RECORD KEY               IS  レセ－施術和暦年月
001366                                                          レセ－患者コード
001367                                                          レセ－レセ種別
001373                             ALTERNATE RECORD KEY     IS  レセ－患者コード
001374                                                          レセ－施術和暦年月
001375                                                          レセ－レセ種別
001376                             ALTERNATE RECORD KEY     IS  レセ－患者カナ
001377                                                          レセ－患者コード
001378                                                          レセ－施術和暦年月
001379                                                          レセ－レセ種別
001390                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
001391                                                          レセ－施術和暦年月
001392                                                          レセ－患者コード
001393                                                          レセ－レセ種別
001394                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
001396                                                          レセ－レセ種別
001397                                                          レセ－請求保険者番号
001398                                                          レセ－患者コード
001399                                                          レセ－施術和暦年月
001400                             ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
001401                                                          レセ－請求保険者番号
001403                                                          レセ－患者コード
001404                                                          レセ－レセ種別
001405                                                          レセ－施術和暦年月
001413                             FILE STATUS              IS  状態キー
001414                             LOCK        MODE         IS  AUTOMATIC.
001440******************************************************************
001450*                      DATA DIVISION                             *
001460******************************************************************
001470 DATA                    DIVISION.
001480 FILE                    SECTION.
001483*
001490*                           ［ＲＬ＝  ３２０］
001500* FD  保険者マスタ        BLOCK   CONTAINS   1   RECORDS.
001510*     COPY HOKENS          OF  XFDLIB  JOINING   保   AS  PREFIX.
001520*                           ［ＲＬ＝  ２５６］
001530* FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
001540*     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
001550*                           ［ＲＬ＝  １２８］
001552* FD  部位マスタ          BLOCK   CONTAINS   1   RECORDS.
001553*     COPY BUICODE         OF  XFDLIB  JOINING   部   AS  PREFIX.
001555*                           ［ＲＬ＝  １２８］
001556* FD  名称マスタ          BLOCK   CONTAINS   1   RECORDS.
001557*     COPY MEISYO          OF  XFDLIB  JOINING   名   AS  PREFIX.
001558*
001560* FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001570*     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001640*                           ［ＲＬ＝  ２５６］
001650* FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001660*     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
001760*                           ［ＲＬ＝  ３２０］
001770 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001780     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001790*                           ［ＲＬ＝  ２５６］
001800 FD  施術記録Ｆ          BLOCK   CONTAINS   1   RECORDS.
001810     COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001820*                           ［ＲＬ＝  １２８］
001830 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001840     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001841*
001842 FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS.
001843     COPY RECEPT          OF  XFDLIB  JOINING   レセ   AS  PREFIX.
001844**
001880*----------------------------------------------------------------*
001890******************************************************************
001900*                WORKING-STORAGE SECTION                         *
001910******************************************************************
001920 WORKING-STORAGE         SECTION.
001930 01 キー入力                           PIC X     VALUE SPACE.
001940 01 状態キー                           PIC X(2)  VALUE SPACE.
001950 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001960 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001970 01 終了フラグ３                       PIC X(3)  VALUE SPACE.
001972 01 初検フラグ                         PIC X(3)  VALUE SPACE.
001973 01 存在フラグ                         PIC X(3)  VALUE SPACE.
001974 01 更新フラグ                         PIC X(3)  VALUE SPACE.
001980 01 ファイル名                         PIC N(6)  VALUE SPACE.
002000 01 前和暦Ｗ                           PIC 9     VALUE ZERO.
002010 01 カレント元号Ｗ                     PIC 9     VALUE ZERO.
002020 01 部位ＣＮＴ                         PIC 9     VALUE ZERO.
002030 01 回数ＣＮＴ                         PIC 9(2)  VALUE ZERO.
002040 01 患者番号Ｗ                         PIC 9(6)  VALUE ZERO.
002071 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
002072*
002085*******
002150*
002152 01 カウンタ                           PIC 9(2)  VALUE ZERO.
002153 01 カウンタ２                         PIC 9(2)  VALUE ZERO.
002154 01 助成カウンタ                       PIC 9     VALUE ZERO.
002155*
002156 01 初日再検フラグ                     PIC X(3)  VALUE SPACE.
002160* 退避用
002170 01 終了年月日ＷＴ.
002180    03 終了年ＷＴ                      PIC 9(2)  VALUE ZERO.
002190    03 終了月ＷＴ                      PIC 9(2)  VALUE ZERO.
002200    03 終了日ＷＴ                      PIC 9(2)  VALUE ZERO.
002201* 初検日退避用
002202 01 初検年月日ＷＴ.
002203    03 初検和暦ＷＴ                    PIC 9     VALUE ZERO.
002204    03 初検年ＷＴ                      PIC 9(2)  VALUE ZERO.
002205    03 初検月ＷＴ                      PIC 9(2)  VALUE ZERO.
002206    03 初検日ＷＴ                      PIC 9(2)  VALUE ZERO.
002291*
002292* 枝番判定用
002293 01 開始診療日手動区分Ｗ               PIC 9    VALUE ZERO.
002294*
002295* 通院用
002296 01 通院情報Ｗ.
002297    03 通院区分Ｗ                      PIC 9 OCCURS 31.
002298*
002299* キーレセ種別用
002300 01 レセ種別Ｗ                         PIC 9(2) VALUE ZERO.
002301*
002302* データチェック用
002303 01 実行キーＷ                         PIC X(3) VALUE SPACE.
002304 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002305*
002306*************
002307* 退避用 *
002308*************
002309 01 レセプト種類Ｗ                     PIC X(4) VALUE SPACE.
002310 01 退避項目ＧＷ.
002311   03 施術和暦年月ＧＷ.
002312      05 施術和暦ＧＷ                  PIC 9(1).
002313      05 施術年ＧＷ                    PIC 9(2).
002314      05 施術月ＧＷ                    PIC 9(2).
002315   03 患者カナＧＷ                     PIC X(20).
002316   03 本人家族区分ＧＷ                 PIC 9(1).
002317   03 患者コードＧＷ.
002318      05 患者番号ＧＷ                  PIC 9(6).
002319      05 枝番ＧＷ                      PIC X(1).
002320   03 レセプト種類ＧＷ                 PIC X(4).
002321   03 レセプト種別ＧＷ                 PIC 9(2).
002322   03 保険種別ＧＷ                     PIC 9(2).
002323   03 保険者番号ＧＷ                   PIC X(10).
002324   03 公費種別ＧＷ                     PIC 9(2).
002325   03 費用負担者番号ＧＷ               PIC X(10).
002326   03 助成種別ＧＷ                     PIC 9(2).
002327   03 費用負担者番号助成ＧＷ           PIC X(10).
002328****************
002329* 連結項目待避 *
002330****************
002331*    ************
002332*    * 印刷キー *
002333*    ************
002334 01 対象データＷＲ.
002335    03 施術和暦年月ＷＲ.
002336       05 施術和暦ＷＲ                  PIC 9(1)  VALUE ZERO.
002337       05 施術年ＷＲ                    PIC 9(2)  VALUE ZERO.
002338       05 施術月ＷＲ                    PIC 9(2)  VALUE ZERO.
002339    03 保険種別ＷＲ                     PIC 9(2)  VALUE ZERO.
002340    03 保険者番号ＷＲ                   PIC X(10) VALUE SPACE.
002341    03 公費種別ＷＲ                     PIC 9(2)  VALUE ZERO.
002350    03 費用負担者番号ＷＲ               PIC X(10) VALUE SPACE.
002360    03 助成種別ＷＲ                     PIC 9(2)  VALUE ZERO.
002370    03 費用負担者番号助成ＷＲ           PIC X(10) VALUE SPACE.
002380    03 本人家族区分ＷＲ                 PIC 9(1)  VALUE ZERO.
002390    03 患者カナＷＲ                     PIC X(20) VALUE SPACE.
002400    03 患者コードＷＲ.
002410       05 患者番号ＷＲ                  PIC 9(6)  VALUE ZERO.
002420       05 枝番ＷＲ                      PIC X(1)  VALUE SPACE.
005908*
005930****************
005940* 負傷データＦ *
005950****************
005960 01 負傷情報Ｗ.
005970    03 部位数Ｗ                        PIC 9  VALUE ZERO.
005980    03 部位情報Ｗ  OCCURS  7.
005990       05 部位ＣＮＴＷ                 PIC 9  VALUE ZERO.
006000       05 部位コードＷ.
006010          07 負傷種別Ｗ                PIC 9(2)  VALUE ZERO.
006020          07 部位Ｗ                    PIC 9(2)  VALUE ZERO.
006030          07 左右区分Ｗ                PIC 9     VALUE ZERO.
006040          07 負傷位置番号Ｗ            PIC 9(2)  VALUE ZERO.
006060       05 負傷年月日Ｗ.
006070          07 負傷和暦Ｗ                PIC 9     VALUE ZERO.
006071          07 負傷年Ｗ                  PIC 9(2)  VALUE ZERO.
006080          07 負傷月Ｗ                  PIC 9(2)  VALUE ZERO.
006090          07 負傷日Ｗ                  PIC 9(2)  VALUE ZERO.
006100       05 初検年月日Ｗ.
006101          07 初検和暦Ｗ                PIC 9     VALUE ZERO.
006110          07 初検年Ｗ                  PIC 9(2)  VALUE ZERO.
006120          07 初検月Ｗ                  PIC 9(2)  VALUE ZERO.
006130          07 初検日Ｗ                  PIC 9(2)  VALUE ZERO.
006140       05 開始年月日Ｗ.
006150          07 開始年Ｗ                  PIC 9(2)  VALUE ZERO.
006160          07 開始月Ｗ                  PIC 9(2)  VALUE ZERO.
006170          07 開始日Ｗ                  PIC 9(2)  VALUE ZERO.
006180       05 終了年月日Ｗ.
006190          07 終了年Ｗ                  PIC 9(2)  VALUE ZERO.
006200          07 終了月Ｗ                  PIC 9(2)  VALUE ZERO.
006210          07 終了日Ｗ                  PIC 9(2)  VALUE ZERO.
006220       05 実日数Ｗ                     PIC 9(2)  VALUE ZERO.
006230       05 転帰区分Ｗ                   PIC 9     VALUE ZERO.
006280       05 開始年月日取得フラグ         PIC X(3)  VALUE SPACE.
006330    03 新規チェックＷ                  PIC N     VALUE SPACE.
006340    03 継続チェックＷ                  PIC N     VALUE SPACE.
006490*
006500********************
006510* 各種フラグ群退避 *
006520********************
006530 01 各種フラグＷ.
006540    03 入金済区分Ｗ                    PIC 9  VALUE ZERO.
006670*
007060******************************************************************
007070*                          連結項目                              *
007080******************************************************************
007090************
007100* 印刷キー *
007110************
007130*
007140 01 連レ印－対象データ IS EXTERNAL.
007150    03 連レ印－施術年月日.
007160       05 連レ印－施術和暦                  PIC 9(1).
007170       05 連レ印－施術年                    PIC 9(2).
007180       05 連レ印－施術月                    PIC 9(2).
007190    03 連レ印－患者コード.
007200       05 連レ印－患者番号                  PIC 9(6).
007210       05 連レ印－枝番                      PIC X(1).
007220    03 連レ印－保険種別                     PIC 9(2).
007230    03 連レ印－保険者番号                   PIC X(10).
007240    03 連レ印－公費種別                     PIC 9(2).
007250    03 連レ印－費用負担者番号               PIC X(10).
007260    03 連レ印－助成種別                     PIC 9(2).
007270    03 連レ印－費用負担者番号助成           PIC X(10).
007280    03 連レ印－患者カナ                     PIC X(20).
007290    03 連レ印－本人家族区分                 PIC 9(1).
007300*
007310*
007320*    月毎の料金
007330***********************
007340 01 連料－料金１ IS EXTERNAL.
007350   03 連料－初検.
007360      05 連料－負担率                 PIC 9(3).
007370      05 連料－初検料                 PIC 9(5).
007380      05 連料－初検加算.
007390         07 連料－初検時間外          PIC 9.
007400         07 連料－初検休日            PIC 9.
007410         07 連料－初検深夜            PIC 9.
007420      05 連料－初検加算料             PIC 9(5).
007430   03 連料－再検料                    PIC 9(5).
007440   03 連料－往療.
007450      05 連料－往療距離               PIC 9(2)V9.
007460      05 連料－往療回数               PIC 9(2).
007470      05 連料－往療料                 PIC 9(5).
007480      05 連料－往療加算料             PIC 9(5).
007490      05 連料－往療加算.
007500         07 連料－往療夜間            PIC 9.
007510         07 連料－往療難路            PIC 9.
007520         07 連料－往療暴風雨          PIC 9.
007530         07 連料－往療時間外          PIC 9.
007540   03 連料－金属副子加算料            PIC 9(5).
007550   03 連料－金属副子数.
007560      05 連料－大                     PIC 9.
007570      05 連料－中                     PIC 9.
007580      05 連料－小                     PIC 9.
007590   03 連料－施術情報提供料            PIC 9(5).
007600   03 連料－小計                      PIC 9(7).
007610   03 連料－費用額                    PIC 9(6).
007620   03 連料－一部負担金                PIC 9(6).
007630   03 連料－請求額                    PIC 9(6).
007640   03 連料－給付割合                  PIC 9(3).
007650   03 連料－受給者負担額              PIC 9(6).
007660   03 連料－助成請求金額              PIC 9(6).
007670   03 連料－受給者負担額内訳      OCCURS  10.
007680      05 連料－当日分負担額           PIC 9(4).
007690*
007700* 負傷部位毎の料金
007710***********************
007720 01 連料－料金２ IS EXTERNAL.
007730   03 連料－初回処置    OCCURS   9.
007740      05 連料－初回処置料             PIC 9(5).
007750   03 連料－初回処置料計              PIC 9(6).
007760*
007770* 逓減毎の料金
007780***********************
007790 01 連料－料金３ IS EXTERNAL.
007800**********
007810* １部位 *
007820**********
007830   03 連料－部位１.
007840      05 連料－後療１.
007850         07 連料－後療単価１              PIC 9(4).
007860         07 連料－後療回数１              PIC 9(2).
007870         07 連料－後療料１                PIC 9(5).
007880      05 連料－冷罨法１.
007890         07 連料－冷罨法回数１            PIC 9(2).
007900         07 連料－冷罨法料１              PIC 9(4).
007910      05 連料－温罨法１.
007920         07 連料－温罨法回数１            PIC 9(2).
007930         07 連料－温罨法料１              PIC 9(4).
007940      05 連料－電療１.
007950         07 連料－電療回数１              PIC 9(2).
007960         07 連料－電療料１                PIC 9(4).
007970      05 連料－小計１                     PIC 9(6).
007980      05 連料－長期逓減率１               PIC 9(3).
007990      05 連料－長期込小計１               PIC 9(6).
008000**********
008010* ２部位 *
008020**********
008030   03 連料－部位２.
008040      05 連料－後療２.
008050         07 連料－後療単価２              PIC 9(4).
008060         07 連料－後療回数２              PIC 9(2).
008070         07 連料－後療料２                PIC 9(5).
008080      05 連料－冷罨法２.
008090         07 連料－冷罨法回数２            PIC 9(2).
008100         07 連料－冷罨法料２              PIC 9(4).
008110      05 連料－温罨法２.
008120         07 連料－温罨法回数２            PIC 9(2).
008130         07 連料－温罨法料２              PIC 9(4).
008140      05 連料－電療２.
008150         07 連料－電療回数２              PIC 9(2).
008160         07 連料－電療料２                PIC 9(4).
008170      05 連料－小計２                     PIC 9(6).
008180      05 連料－長期逓減率２               PIC 9(3).
008190      05 連料－長期込小計２               PIC 9(6).
008200******************
008210* ３部位／８割 *
008220******************
008230   03 連料－部位３８.
008240      05 連料－後療３８.
008250         07 連料－後療単価３８              PIC 9(4).
008260         07 連料－後療回数３８              PIC 9(2).
008270         07 連料－後療料３８                PIC 9(5).
008280      05 連料－冷罨法３８.
008290         07 連料－冷罨法回数３８            PIC 9(2).
008300         07 連料－冷罨法料３８              PIC 9(4).
008310      05 連料－温罨法３８.
008320         07 連料－温罨法回数３８            PIC 9(2).
008330         07 連料－温罨法料３８              PIC 9(4).
008340      05 連料－電療３８.
008350         07 連料－電療回数３８              PIC 9(2).
008360         07 連料－電療料３８                PIC 9(4).
008370      05 連料－小計３８                     PIC 9(6).
008380      05 連料－多部位込小計３８             PIC 9(6).
008390      05 連料－長期逓減率３８               PIC 9(3).
008400      05 連料－長期込小計３８               PIC 9(6).
008410******************
008420* ３部位／１０割 *
008430******************
008440   03 連料－部位３０.
008450      05 連料－逓減開始月日３０.
008460         07 連料－逓減開始月３０            PIC 9(2).
008470         07 連料－逓減開始日３０            PIC 9(2).
008480      05 連料－後療３０.
008490         07 連料－後療単価３０              PIC 9(4).
008500         07 連料－後療回数３０              PIC 9(2).
008510         07 連料－後療料３０                PIC 9(5).
008520      05 連料－冷罨法３０.
008530         07 連料－冷罨法回数３０            PIC 9(2).
008540         07 連料－冷罨法料３０              PIC 9(4).
008550      05 連料－温罨法３０.
008560         07 連料－温罨法回数３０            PIC 9(2).
008570         07 連料－温罨法料３０              PIC 9(4).
008580      05 連料－電療３０.
008590         07 連料－電療回数３０              PIC 9(2).
008600         07 連料－電療料３０                PIC 9(4).
008610      05 連料－小計３０                     PIC 9(6).
008620      05 連料－長期逓減率３０               PIC 9(3).
008630      05 連料－長期込小計３０               PIC 9(6).
008640****************
008650* ４部位／５割 *
008660****************
008670   03 連料－部位４５.
008680      05 連料－後療４５.
008690         07 連料－後療単価４５              PIC 9(4).
008700         07 連料－後療回数４５              PIC 9(2).
008710         07 連料－後療料４５                PIC 9(5).
008720      05 連料－冷罨法４５.
008730         07 連料－冷罨法回数４５            PIC 9(2).
008740         07 連料－冷罨法料４５              PIC 9(4).
008750      05 連料－温罨法４５.
008760         07 連料－温罨法回数４５            PIC 9(2).
008770         07 連料－温罨法料４５              PIC 9(4).
008780      05 連料－電療４５.
008790         07 連料－電療回数４５              PIC 9(2).
008800         07 連料－電療料４５                PIC 9(4).
008810      05 連料－小計４５                     PIC 9(6).
008820      05 連料－多部位込小計４５             PIC 9(6).
008830      05 連料－長期逓減率４５               PIC 9(3).
008840      05 連料－長期込小計４５               PIC 9(6).
008850****************
008860* ４部位／８割 *
008870****************
008880   03 連料－部位４８.
008890      05 連料－逓減開始月日４８.
008900         07 連料－逓減開始月４８            PIC 9(2).
008910         07 連料－逓減開始日４８            PIC 9(2).
008920      05 連料－後療４８.
008930         07 連料－後療単価４８              PIC 9(4).
008940         07 連料－後療回数４８              PIC 9(2).
008950         07 連料－後療料４８                PIC 9(5).
008960      05 連料－冷罨法４８.
008970         07 連料－冷罨法回数４８            PIC 9(2).
008980         07 連料－冷罨法料４８              PIC 9(4).
008990      05 連料－温罨法４８.
009000         07 連料－温罨法回数４８            PIC 9(2).
009010         07 連料－温罨法料４８              PIC 9(4).
009020      05 連料－電療４８.
009030         07 連料－電療回数４８              PIC 9(2).
009040         07 連料－電療料４８                PIC 9(4).
009050      05 連料－小計４８                     PIC 9(6).
009060      05 連料－多部位込小計４８             PIC 9(6).
009070      05 連料－長期逓減率４８               PIC 9(3).
009080      05 連料－長期込小計４８               PIC 9(6).
009090******************
009100* ４部位／１０割 *
009110******************
009120   03 連料－部位４０.
009130      05 連料－逓減開始月日４０.
009140         07 連料－逓減開始月４０            PIC 9(2).
009150         07 連料－逓減開始日４０            PIC 9(2).
009160      05 連料－後療４０.
009170         07 連料－後療単価４０              PIC 9(4).
009180         07 連料－後療回数４０              PIC 9(2).
009190         07 連料－後療料４０                PIC 9(5).
009200      05 連料－冷罨法４０.
009210         07 連料－冷罨法回数４０            PIC 9(2).
009220         07 連料－冷罨法料４０              PIC 9(4).
009230      05 連料－温罨法４０.
009240         07 連料－温罨法回数４０            PIC 9(2).
009250         07 連料－温罨法料４０              PIC 9(4).
009260      05 連料－電療４０.
009270         07 連料－電療回数４０              PIC 9(2).
009280         07 連料－電療料４０                PIC 9(4).
009290      05 連料－小計４０                     PIC 9(6).
009300      05 連料－長期逓減率４０               PIC 9(3).
009310      05 連料－長期込小計４０               PIC 9(6).
009320********************
009330* ５部位／２．５割 *
009340********************
009350   03 連料－部位５２.
009360      05 連料－後療５２.
009370         07 連料－後療単価５２              PIC 9(4).
009380         07 連料－後療回数５２              PIC 9(2).
009390         07 連料－後療料５２                PIC 9(5).
009400      05 連料－冷罨法５２.
009410         07 連料－冷罨法回数５２            PIC 9(2).
009420         07 連料－冷罨法料５２              PIC 9(4).
009430      05 連料－温罨法５２.
009440         07 連料－温罨法回数５２            PIC 9(2).
009450         07 連料－温罨法料５２              PIC 9(4).
009460      05 連料－電療５２.
009470         07 連料－電療回数５２              PIC 9(2).
009480         07 連料－電療料５２                PIC 9(4).
009490      05 連料－小計５２                     PIC 9(6).
009500      05 連料－多部位込小計５２             PIC 9(6).
009510      05 連料－長期逓減率５２               PIC 9(3).
009520      05 連料－長期込小計５２               PIC 9(6).
009530****************
009540* ５部位／５割 *
009550****************
009560   03 連料－部位５５.
009570      05 連料－逓減開始月日５５.
009580         07 連料－逓減開始月５５            PIC 9(2).
009590         07 連料－逓減開始日５５            PIC 9(2).
009600      05 連料－後療５５.
009610         07 連料－後療単価５５              PIC 9(4).
009620         07 連料－後療回数５５              PIC 9(2).
009630         07 連料－後療料５５                PIC 9(5).
009640      05 連料－冷罨法５５.
009650         07 連料－冷罨法回数５５            PIC 9(2).
009660         07 連料－冷罨法料５５              PIC 9(4).
009670      05 連料－温罨法５５.
009680         07 連料－温罨法回数５５            PIC 9(2).
009690         07 連料－温罨法料５５              PIC 9(4).
009700      05 連料－電療５５.
009710         07 連料－電療回数５５              PIC 9(2).
009720         07 連料－電療料５５                PIC 9(4).
009730      05 連料－小計５５                     PIC 9(6).
009740      05 連料－多部位込小計５５             PIC 9(6).
009750      05 連料－長期逓減率５５               PIC 9(3).
009760      05 連料－長期込小計５５               PIC 9(6).
009770****************
009780* ５部位／８割 *
009790****************
009800   03 連料－部位５８.
009810      05 連料－逓減開始月日５８.
009820         07 連料－逓減開始月５８            PIC 9(2).
009830         07 連料－逓減開始日５８            PIC 9(2).
009840      05 連料－後療５８.
009850         07 連料－後療単価５８              PIC 9(4).
009860         07 連料－後療回数５８              PIC 9(2).
009870         07 連料－後療料５８                PIC 9(5).
009880      05 連料－冷罨法５８.
009890         07 連料－冷罨法回数５８            PIC 9(2).
009900         07 連料－冷罨法料５８              PIC 9(4).
009910      05 連料－温罨法５８.
009920         07 連料－温罨法回数５８            PIC 9(2).
009930         07 連料－温罨法料５８              PIC 9(4).
009940      05 連料－電療５８.
009950         07 連料－電療回数５８              PIC 9(2).
009960         07 連料－電療料５８                PIC 9(4).
009970      05 連料－小計５８                     PIC 9(6).
009980      05 連料－多部位込小計５８             PIC 9(6).
009990      05 連料－長期逓減率５８               PIC 9(3).
010000      05 連料－長期込小計５８               PIC 9(6).
010010******************
010020* ５部位／１０割 *
010030******************
010040   03 連料－部位５０.
010050      05 連料－逓減開始月日５０.
010060         07 連料－逓減開始月５０            PIC 9(2).
010070         07 連料－逓減開始日５０            PIC 9(2).
010080      05 連料－後療５０.
010090         07 連料－後療単価５０              PIC 9(4).
010100         07 連料－後療回数５０              PIC 9(2).
010110         07 連料－後療料５０                PIC 9(5).
010120      05 連料－冷罨法５０.
010130         07 連料－冷罨法回数５０            PIC 9(2).
010140         07 連料－冷罨法料５０              PIC 9(4).
010150      05 連料－温罨法５０.
010160         07 連料－温罨法回数５０            PIC 9(2).
010170         07 連料－温罨法料５０              PIC 9(4).
010180      05 連料－電療５０.
010190         07 連料－電療回数５０              PIC 9(2).
010200         07 連料－電療料５０                PIC 9(4).
010210      05 連料－小計５０                     PIC 9(6).
010220      05 連料－長期逓減率５０               PIC 9(3).
010230      05 連料－長期込小計５０               PIC 9(6).
010231**
010232* 初検時相談料/080527
010233 01 連料－初検時相談料 IS EXTERNAL     PIC 9(4).
010234**
010240*
010250 01 連－共通キー IS EXTERNAL.
010260    03  連－カレント和暦               PIC 9.
010270*
010280* キー項目
010290 01 連－キー IS EXTERNAL.
010300    03  連－患者番号                   PIC 9(6).
010310    03  連－枝番                       PIC X.
010320    03  連－患者氏名                   PIC N(10).
010330    03  連－施術和暦                   PIC 9.
010340    03  連－施術年                     PIC 9(2).
010350    03  連－施術月                     PIC 9(2).
010360    03  連－施術日                     PIC 9(2).
010370    03  連－受付時                     PIC 9(2).
010380    03  連－受付分                     PIC 9(2).
010390    03  連－受付秒                     PIC 9(2).
010400*
010401 01 連計－キー IS EXTERNAL.
010402    03  連計－負担金計算区分           PIC 9.
010403    03  連計－本人家族区分             PIC 9.
010404    03  連計－保険種別                 PIC 9(2).
010405    03  連計－保険者番号               PIC X(10).
010406    03  連計－公費種別                 PIC 9(2).
010407    03  連計－市町村番号老人           PIC X(10).
010408    03  連計－助成種別                 PIC 9(2).
010409    03  連計－市町村番号助成           PIC X(10).
010410    03  連計－患者コード.
010411      05  連計－患者番号               PIC 9(6).
010412      05  連計－枝番                   PIC X.
010413    03  連計－施術和暦年月日.
010414      05  連計－施術和暦年月.
010415        07  連計－施術和暦             PIC 9.
010416        07  連計－施術年月.
010417          09  連計－施術年             PIC 9(2).
010418          09  連計－施術月             PIC 9(2).
010419      05  連計－施術日                 PIC 9(2).
010420    03  連計－費用額                   PIC 9(6).
010421    03  連計－負担額                   PIC 9(6).
010422    03  連計－請求額                   PIC 9(6).
010423    03  連計－費用額老人               PIC 9(6).
010424    03  連計－負担額老人               PIC 9(6).
010425    03  連計－請求額老人               PIC 9(6).
010426    03  連計－費用額助成               PIC 9(6).
010427    03  連計－負担額助成               PIC 9(5).
010428    03  連計－請求額助成               PIC 9(5).
010429    03  連計－実日数                   PIC 9(2).
010430    03  連計－負担率                   PIC 9(3).
010431    03  連計－負担率区分               PIC 9.
010720*
010730 01 連レ－キー IS EXTERNAL.
010740    03 連レ－保険種別                  PIC 9(2).
010750**
010751********************
010752** レセＦ連携用
010753********************
010754 01 連レセＦ－キー IS EXTERNAL.
010755    03 連レセＦ－施術年月.
010756       05 連レセＦ－施術和暦             PIC 9.
010757       05 連レセＦ－施術年               PIC 9(2).
010758       05 連レセＦ－施術月               PIC 9(2).
010759    03 連レセＦ－患者コード.
010760       05 連レセＦ－患者番号             PIC 9(6).
010761       05 連レセＦ－枝番                 PIC X.
010762    03 連レセＦ－保険変更                PIC 9.
010763**
010764********************
010765* メッセージ表示キー *
010766********************
010767 01 連メ－キー IS EXTERNAL.
010768    03  連メ－メッセージ                 PIC N(20).
010769*
010770****
010771* 負担率取得用14/10～
010772 01 連率－負担率取得キー IS EXTERNAL.
010773    03 連率－施術和暦年月.
010774       05 連率－施術和暦               PIC 9.
010775       05 連率－施術年月.
010776          07 連率－施術年              PIC 9(2).
010777          07 連率－施術月              PIC 9(2).
010778    03 連率－患者コード.
010779       05 連率－患者番号               PIC 9(6).
010780       05 連率－枝番                   PIC X.
010781    03 連率－実際負担率                PIC 9(3).
010782    03 連率－実際本体負担率            PIC 9(3).
010783    03 連率－健保負担率                PIC 9(3).
010784    03 連率－２７老負担率              PIC 9(3).
010785    03 連率－助成負担率                PIC 9(3).
010786    03 連率－特別用負担率              PIC 9(3).
010787*
010788******************************************************************
010789*                      PROCEDURE  DIVISION                       *
010790******************************************************************
010791 PROCEDURE               DIVISION.
010800************
010810*          *
010820* 初期処理 *
010830*          *
010840************
010860     PERFORM 初期化.
010861*
010862* / 負傷名、通院がない時は、レセプトレコード削除して終了する /
010863     PERFORM データチェック.
010864     IF 実行キーＷ  NOT = "YES"
010865        PERFORM 削除処理
010866        PERFORM ファイル閉鎖
010867        EXIT PROGRAM
010868     END-IF.
010869*
010870     PERFORM レセプト呼出し.
010871     PERFORM 連結項目待避.
010872*
010873     IF 連レセＦ－保険変更 = 1
010874        PERFORM 削除処理
010875     END-IF.
010876************
010877*          *
010880* 主処理   *
010890*          *
010900************
010922*  / 再READ /
010923     MOVE 施術和暦ＷＲ    TO 受－施術和暦.
010924     MOVE 施術年ＷＲ      TO 受－施術年.
010925     MOVE 施術月ＷＲ      TO 受－施術月.
010926     MOVE 患者番号ＷＲ    TO 受－患者番号.
010927     MOVE 枝番ＷＲ        TO 受－枝番.
010928     READ 受診者情報Ｆ
010929     INVALID KEY
010930*       / ありえない /
010931         MOVE SPACE TO 存在フラグ
010934     NOT INVALID KEY
010935         MOVE "YES" TO 存在フラグ
010936     END-READ.
010937*
010938     IF 存在フラグ = "YES"
010939*       / 労災・自賠責・自費 /
010940         IF 受－保険種別 = 70 OR 80 OR 90
010941             PERFORM 情報取得
010942             PERFORM その他レコードセット
010943             PERFORM ファイル書込
010944         ELSE
010945*       / 健保・老人・助成・生保 /
010946             PERFORM 情報取得
010947             PERFORM 一般レコードセット
010948             PERFORM ファイル書込
010949*           / 助成の時は、２件作成 /
010951             IF レセプト種類Ｗ = "JYOS"
010952                 MOVE 1  TO 助成カウンタ
010953                 PERFORM 一般レコードセット
010954                 PERFORM ファイル書込
010955             END-IF
010956         END-IF
010957     END-IF.
010958*
010965************
010966*          *
010970* 終了処理 *
010980*          *
010990************
010991     INITIALIZE 連計－キー.
010992     INITIALIZE 連料－料金１
010993                連料－料金２
010994                連料－料金３.
010995     INITIALIZE 連レ印－対象データ.
010996     INITIALIZE 連料－初検時相談料.
010998*
011000     PERFORM 終了処理.
011010     EXIT PROGRAM.
011020*
011030*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
011040*================================================================*
011050 初期化 SECTION.
011060*
011070     PERFORM ファイルオープン.
011077*
011190*================================================================*
011570*================================================================*
011580 ファイルオープン SECTION.
011590*
011600*     OPEN INPUT   保険者マスタ
011610*         MOVE NC"保険者" TO ファイル名.
011620*         PERFORM オープンチェック.
011630*     OPEN INPUT   市町村マスタ
011640*         MOVE NC"市町村" TO ファイル名.
011650*         PERFORM オープンチェック.
011651*     OPEN INPUT   部位マスタ
011652*         MOVE NC"部位" TO ファイル名.
011653*         PERFORM オープンチェック.
011654*     OPEN INPUT   名称マスタ
011655*         MOVE NC"名称" TO ファイル名.
011656*         PERFORM オープンチェック.
011660*     OPEN INPUT   元号マスタ
011670*         MOVE NC"元号" TO ファイル名.
011680*         PERFORM オープンチェック.
011750*     OPEN INPUT   制御情報マスタ
011760*         MOVE NC"制御情報" TO ファイル名.
011770*         PERFORM オープンチェック.
011870     OPEN INPUT   受診者情報Ｆ.
011880         MOVE NC"受情" TO ファイル名.
011890         PERFORM オープンチェック.
011900     OPEN INPUT   施術記録Ｆ.
011910         MOVE NC"施記Ｆ" TO ファイル名.
011920         PERFORM オープンチェック.
011930     OPEN INPUT   負傷データＦ.
011940         MOVE NC"負傷" TO ファイル名.
011950         PERFORM オープンチェック.
011951*
011952     OPEN I-O   レセプトＦ.
011953         MOVE NC"レセ" TO ファイル名.
011954         PERFORM オープンチェック.
011960*
011990*================================================================*
012000 オープンチェック SECTION.
012010*
012020     IF 状態キー  NOT =  "00"
012030         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
012040         DISPLAY NC"状態キー：" 状態キー         UPON CONS
012050         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
012060                                                 UPON CONS
012070         ACCEPT  キー入力 FROM CONS
012080         PERFORM ファイル閉鎖
012090         EXIT PROGRAM.
012091*================================================================*
012174*================================================================*
012175 レセプト呼出し SECTION.
012176*
012177     INITIALIZE 連料－料金１
012178                連料－料金２
012179                連料－料金３.
012180     INITIALIZE 連レ印－対象データ.
012181     INITIALIZE 退避項目ＧＷ.
012182     MOVE 連レセＦ－施術和暦    TO 連レ印－施術和暦 受－施術和暦 施術和暦ＧＷ.
012183     MOVE 連レセＦ－施術年      TO 連レ印－施術年   受－施術年   施術年ＧＷ.
012184     MOVE 連レセＦ－施術月      TO 連レ印－施術月   受－施術月   施術月ＧＷ.
012185     MOVE 連レセＦ－患者番号    TO 連レ印－患者番号 受－患者番号 患者番号ＧＷ.
012186     MOVE 連レセＦ－枝番        TO 連レ印－枝番     受－枝番     枝番ＧＷ.
012187     READ 受診者情報Ｆ
012188     INVALID KEY
012189          MOVE  NC"　　　受診者情報Ｆにありません。" TO 連メ－メッセージ
012190          CALL   "MSG001"
012191          CANCEL "MSG001"
012192          PERFORM ファイル閉鎖
012193          EXIT PROGRAM
012194     NOT INVALID KEY
012195         PERFORM レセプト種別取得
012196         MOVE レセプト種類Ｗ         TO レセプト種類ＧＷ
012197         MOVE 受－保険種別           TO 連レ印－保険種別    保険種別ＧＷ
012198         MOVE 受－保険者番号         TO 連レ印－保険者番号  保険者番号ＧＷ
012199         MOVE 受－公費種別           TO 連レ印－公費種別    公費種別ＧＷ
012200         MOVE 受－費用負担者番号     TO 連レ印－費用負担者番号 費用負担者番号ＧＷ
012201         MOVE 受－助成種別           TO 連レ印－助成種別       助成種別ＧＷ
012202         MOVE 受－費用負担者番号助成 TO 連レ印－費用負担者番号助成 費用負担者番号助成ＧＷ
012203         MOVE 受－本人家族区分       TO 連レ印－本人家族区分   本人家族区分ＧＷ
012204         MOVE 受－患者カナ           TO 連レ印－患者カナ       患者カナＧＷ
012205         EVALUATE レセプト種類Ｗ
012206         WHEN "KOKU"
012207         WHEN "SYAH"
012208         WHEN "SYAK"
012209         WHEN "KUMH"
012210         WHEN "KUMK"
012211         WHEN "KYOH"
012212         WHEN "KYOK"
012213         WHEN "TAIS"
012214         WHEN "JIEI"
012215             MOVE 受－保険種別         TO レセプト種別ＧＷ
012216         WHEN "ROUJ"
012217             MOVE 受－公費種別         TO レセプト種別ＧＷ
012218         WHEN "JYOS"
012219         WHEN "SEIH"
012220             MOVE 受－助成種別         TO レセプト種別ＧＷ
012221         END-EVALUATE
012222*    ********
012223*    * 計算 *
012224*    ********
012225         IF 受－保険種別 = 70 OR 80 OR 90
012226            PERFORM 連結項目セット月計
012227            CALL   "TUKKEI"
012228            CANCEL "TUKKEI"
012229         ELSE
012230            PERFORM 計算連結項目セット
012231            CALL   "RESEPT"
012232            CANCEL "RESEPT"
012233         END-IF
012234     END-READ.
012235*
012236*================================================================*
012237 計算連結項目セット SECTION.
012238*
012239     MOVE SPACE TO 連計－キー.
012240     INITIALIZE    連計－キー.
012241*
012242     MOVE レセプト種別ＧＷ  TO 連レ－保険種別.
012243     MOVE 患者番号ＧＷ      TO 連計－患者番号 受－患者番号.
012244     MOVE 枝番ＧＷ          TO 連計－枝番     受－枝番.
012245     MOVE 施術和暦ＧＷ      TO 連計－施術和暦 受－施術和暦.
012246     MOVE 施術年ＧＷ        TO 連計－施術年   受－施術年.
012247     MOVE 施術月ＧＷ        TO 連計－施術月   受－施術月.
012248     MOVE ZERO              TO 連計－負担金計算区分.
012249     READ 受診者情報Ｆ
012250     NOT INVALID KEY
012251         MOVE 受－本人家族区分   TO 連計－本人家族区分  
012252         MOVE 受－保険種別       TO 連計－保険種別      
012253         MOVE 受－保険者番号     TO 連計－保険者番号    
012254         MOVE 受－公費種別       TO 連計－公費種別      
012255         MOVE 受－費用負担者番号 TO 連計－市町村番号老人
012256         IF レセプト種別ＧＷ NOT = 05
012257             MOVE 受－助成種別           TO 連計－助成種別      
012258             MOVE 受－費用負担者番号助成 TO 連計－市町村番号助成
012259         END-IF
012260     END-READ.
012261*
012262*================================================================*
012263 連結項目セット月計 SECTION.
012264*
012265     MOVE SPACE  TO 連計－キー.
012266     INITIALIZE 連計－キー.
012267*
012268     MOVE 受－施術和暦           TO 連計－施術和暦.
012269     MOVE 受－施術年             TO 連計－施術年.
012270     MOVE 受－施術月             TO 連計－施術月.
012271     MOVE 受－本人家族区分       TO 連計－本人家族区分.
012272     MOVE 受－保険種別           TO 連計－保険種別.
012273     MOVE 受－保険者番号         TO 連計－保険者番号. 
012274     MOVE 受－公費種別           TO 連計－公費種別.
012275     MOVE 受－費用負担者番号     TO 連計－市町村番号老人.
012276     MOVE 受－助成種別           TO 連計－助成種別.
012277     MOVE 受－費用負担者番号助成 TO 連計－市町村番号助成.
012278     MOVE 受－患者コード         TO 連計－患者コード.
012279*
012280*================================================================*
012281*================================================================*
012282 連結項目待避 SECTION.
012283*
012284     MOVE 連レ印－施術和暦           TO 施術和暦ＷＲ.
012285     MOVE 連レ印－施術年             TO 施術年ＷＲ.
012286     MOVE 連レ印－施術月             TO 施術月ＷＲ.
012287     MOVE 連レ印－保険種別           TO 保険種別ＷＲ.
012288     MOVE 連レ印－保険者番号         TO 保険者番号ＷＲ.
012289     MOVE 連レ印－公費種別           TO 公費種別ＷＲ.
012290     MOVE 連レ印－費用負担者番号     TO 費用負担者番号ＷＲ.
012291     MOVE 連レ印－助成種別           TO 助成種別ＷＲ.
012292     MOVE 連レ印－費用負担者番号助成 TO 費用負担者番号助成ＷＲ.
012293     MOVE 連レ印－本人家族区分       TO 本人家族区分ＷＲ.
012294     MOVE 連レ印－患者カナ           TO 患者カナＷＲ.
012295     MOVE 連レ印－患者番号           TO 患者番号ＷＲ.
012296     MOVE 連レ印－枝番               TO 枝番ＷＲ.
012297*
012298*================================================================*
012299 情報取得 SECTION.
012300*
012301     PERFORM 項目初期化.
012302     PERFORM 負傷データ取得.
012303     PERFORM 施術記録取得.
012304     PERFORM 初検日以前のデータ判定.
012305*
012306*================================================================*
012307 一般レコードセット SECTION.
012310*
012311     PERFORM 基本レコードセット.
012312     PERFORM 料金レコードセット.
012313*
012320*================================================================*
012330 基本レコードセット SECTION.
012340*
012377     PERFORM キー用レセ種別取得.
012378*  / 上記キー用レセ種別取得の後にやる /
012380     PERFORM レコード存在チェック.
012381*
012382* 初期化する（更新時も）
012386     MOVE SPACE TO レセ－レコード.
012387     INITIALIZE    レセ－レコード.
012396* / 更新時は、フラグを戻す /
012406**     IF 更新フラグ = "YES"
012407**         MOVE 入金済区分Ｗ  TO レセ－入金済区分
012436**     END-IF.
012509********************
012510* 受診者情報セット *
012511********************
012520     MOVE 施術和暦ＷＲ          TO レセ－施術和暦.
012521     MOVE 施術年ＷＲ            TO レセ－施術年.
012530     MOVE 施術月ＷＲ            TO レセ－施術月.
012531*
012532     MOVE 患者番号ＷＲ          TO レセ－患者番号.
012533     MOVE 枝番ＷＲ              TO レセ－枝番.
012534*
012535*  / キー用レセ種別で取得 /
012536     MOVE レセ種別Ｗ            TO レセ－レセ種別.
012559*
012566*     IF 受－記号(1:2) = "＊" 
012567*        MOVE  SPACE    TO  レセ－記号
012568*     ELSE
012569*        MOVE 受－記号  TO  レセ－記号
012570*     END-IF.
012571*     IF ( 受－番号(1:1) = "*"  ) OR
012572*        ( 受－番号(1:2) = "＊" )
012573*        MOVE  SPACE    TO  レセ－番号
012574*     ELSE
012575*        MOVE 受－番号  TO  レセ－番号
012576*     END-IF.
012577***
012578      MOVE SPACE   TO レセ－記号.
012579      MOVE SPACE   TO レセ－番号.
012580***
012582*
012583     MOVE 受－保険種別        TO レセ－保険種別.
012584     MOVE 受－保険者番号      TO レセ－保険者番号.
012586*
012587     MOVE 受－費用負担者番号  TO レセ－費用負担者番号.
012588     MOVE 受－受益者番号老人  TO レセ－受益者番号老人.
012589     MOVE 受－費用負担者番号助成  TO レセ－費用負担者番号助成.
012590     MOVE 受－受益者番号助成  TO レセ－受益者番号助成.
012591     MOVE 受－助成種別        TO レセ－助成種別.
012592     MOVE 受－本人家族区分    TO レセ－本人家族区分.
012593*
012594     EVALUATE レセ－レセ種別
012595     WHEN 1
012596        MOVE レセ－保険者番号         TO レセ－請求保険者番号
012597     WHEN 2
012598        MOVE レセ－費用負担者番号     TO レセ－請求保険者番号
012599     WHEN 3
012600     WHEN 7
012601        MOVE レセ－費用負担者番号助成 TO レセ－請求保険者番号
012602     WHEN OTHER
012603        MOVE レセ－保険者番号         TO レセ－請求保険者番号
012604     END-EVALUATE.
012605*
012606*** 上記後
012607     MOVE SPACE               TO レセ－保険者番号.
012608***
012610*
012612     MOVE 受－被保険者性別    TO レセ－被保険者性別.
012613     MOVE 受－被保険者カナ    TO レセ－被保険者カナ.
012614***     MOVE 受－被保険者氏名    TO レセ－被保険者氏名.
012630***     MOVE 受－住所１          TO レセ－住所１.
012640***     MOVE 受－住所２          TO レセ－住所２.
012642     MOVE SPACE               TO レセ－被保険者氏名.
012643     MOVE SPACE               TO レセ－住所１.
012644     MOVE SPACE               TO レセ－住所２.
012645***
012647     MOVE 受－郵便番号１      TO レセ－郵便番号１
012648     MOVE 受－郵便番号２      TO レセ－郵便番号２
012649     MOVE 受－患者性別        TO レセ－患者性別.
012650     MOVE 受－患者カナ        TO レセ－患者カナ.
012660     MOVE 受－患者氏名        TO レセ－患者氏名.
012730     MOVE 受－患者和暦        TO レセ－患者和暦.
012731     MOVE 受－患者年          TO レセ－患者年.
012740     MOVE 受－患者月          TO レセ－患者月.
012750     MOVE 受－患者日          TO レセ－患者日.
012760     MOVE 受－続柄            TO レセ－続柄.
012761* 
012771     MOVE 受－請求和暦        TO レセ－請求和暦.
012781     MOVE 受－請求年          TO レセ－請求年.
012791     MOVE 受－請求月          TO レセ－請求月.
012801     MOVE 受－請求区分        TO レセ－請求区分.
012810*14/10～
012811     MOVE 受－特別区分        TO レセ－特別区分.
012812*
012820********************
012830* 負傷データセット *
012840********************
012842     MOVE 部位数Ｗ            TO レセ－部位数.
012843     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
012844                 UNTIL ( 部位ＣＮＴ > 部位数Ｗ )
012854***         MOVE 部位コードＷ(部位ＣＮＴ)   TO レセ－部位コード(部位ＣＮＴ)
012880         MOVE ZERO                       TO レセ－部位コード(部位ＣＮＴ)
012881***
012882         MOVE 負傷和暦Ｗ(部位ＣＮＴ)     TO レセ－負傷和暦(部位ＣＮＴ)
012883         MOVE 負傷年Ｗ(部位ＣＮＴ)       TO レセ－負傷年(部位ＣＮＴ)
012890         MOVE 負傷月Ｗ(部位ＣＮＴ)       TO レセ－負傷月(部位ＣＮＴ)
012900         MOVE 負傷日Ｗ(部位ＣＮＴ)       TO レセ－負傷日(部位ＣＮＴ)
012910         MOVE 初検和暦Ｗ(部位ＣＮＴ)     TO レセ－初検和暦(部位ＣＮＴ)
012911         MOVE 初検年Ｗ(部位ＣＮＴ)       TO レセ－初検年(部位ＣＮＴ)
012920         MOVE 初検月Ｗ(部位ＣＮＴ)       TO レセ－初検月(部位ＣＮＴ)
012930         MOVE 初検日Ｗ(部位ＣＮＴ)       TO レセ－初検日(部位ＣＮＴ)
012932         MOVE 施術和暦ＷＲ               TO レセ－施術開始和暦(部位ＣＮＴ)
012940         MOVE 開始年Ｗ(部位ＣＮＴ)       TO レセ－施術開始年(部位ＣＮＴ)
012950         MOVE 開始月Ｗ(部位ＣＮＴ)       TO レセ－施術開始月(部位ＣＮＴ)
012960         MOVE 開始日Ｗ(部位ＣＮＴ)       TO レセ－施術開始日(部位ＣＮＴ)
012961         MOVE 施術和暦ＷＲ               TO レセ－施術終了和暦(部位ＣＮＴ)
012970         MOVE 終了年Ｗ(部位ＣＮＴ)       TO レセ－施術終了年(部位ＣＮＴ)
012980         MOVE 終了月Ｗ(部位ＣＮＴ)       TO レセ－施術終了月(部位ＣＮＴ)
012990         MOVE 終了日Ｗ(部位ＣＮＴ)       TO レセ－施術終了日(部位ＣＮＴ)
013000         MOVE 実日数Ｗ(部位ＣＮＴ)       TO レセ－実日数(部位ＣＮＴ)
013010         MOVE 転帰区分Ｗ(部位ＣＮＴ)     TO レセ－転帰区分(部位ＣＮＴ)
013020     END-PERFORM.
013030*
013040*   / 1:新規,2:継続,3:両方 /
013970     IF ( 新規チェックＷ = NC"○" ) AND ( 継続チェックＷ = NC"○" )
013971         MOVE 3  TO レセ－レセ請求区分
013972     ELSE
013973        IF 新規チェックＷ = NC"○" 
013974           MOVE 1  TO レセ－レセ請求区分
013977        ELSE
013978           MOVE 2  TO レセ－レセ請求区分
013980        END-IF
013981     END-IF.
013982*
013984********************
013985* 通院データセット *
013986********************
013987     MOVE 通院情報Ｗ   TO レセ－通院情報.
013988*
013989*
013990*================================================================*
013991 料金レコードセット SECTION.
013993*************************************************************
014000* 料金データセット(健保・老人・助成） *
014010*************************************************************
014011* 初検
014020     MOVE 連料－初検料         TO  レセ－初検料.
014030     MOVE 連料－初検加算料     TO  レセ－初検加算料.
014054     IF 連料－初検時間外 = 1
014055         MOVE 1   TO レセ－時間外
014056     END-IF.
014057     IF 連料－初検休日 = 1
014058         MOVE 1   TO レセ－休日
014059     END-IF.
014060     IF 連料－初検深夜 = 1
014061         MOVE 1   TO レセ－深夜
014063     END-IF.
014064*
014066*---------------------------------------------------------*
014067* 初検時相談料/080527
014069     IF 施術和暦年月ＷＲ >= 42006
014072        MOVE 連料－初検時相談料 TO レセ－初検時相談料
014073     END-IF.
014074*---------------------------------------------------------*
014083*
014084     MOVE 連料－再検料         TO  レセ－再検料.
014085* 往療
014086     MOVE 連料－往療距離       TO  レセ－往療距離.
014087     MOVE 連料－往療回数       TO  レセ－往療回数.
014088     MOVE 連料－往療料         TO  レセ－往療料.
014089     MOVE 連料－往療加算料     TO  レセ－往療加算料.
014090     IF 連料－往療夜間 = 1
014091         MOVE 1   TO レセ－夜間
014092     END-IF.
014093     IF 連料－往療暴風雨 = 1
014094         MOVE 1   TO レセ－暴風雨雪
014095     END-IF.
014096     IF 連料－往療難路 = 1
014097         MOVE 1   TO レセ－難路
014098     END-IF.
014099*
014100* 金属など
014101     IF 連料－大 = 1
014102         MOVE 1   TO レセ－大
014103     END-IF.
014104     IF 連料－中 = 1
014105         MOVE 1   TO レセ－中
014106     END-IF.
014107     IF 連料－小 = 1
014108         MOVE 1   TO レセ－小
014109     END-IF.
014110*
014111     MOVE 連料－金属副子加算料         TO  レセ－金属副子加算料.
014112     MOVE 連料－施術情報提供料         TO  レセ－施術情報提供料.
014113     MOVE 連料－小計                   TO  レセ－小計.
014114********************
014115* 初回処置料セット *
014116********************
014117     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
014118             UNTIL ( 部位ＣＮＴ > 部位数Ｗ )
014119         MOVE 連料－初回処置料(部位ＣＮＴ) TO レセ－初回処置料(部位ＣＮＴ)
014120     END-PERFORM.
014121     MOVE 連料－初回処置料計           TO レセ－初回処置料合計.
014161*
014340***********
014350* １部位 *
014360***********
014363     MOVE 連料－後療単価１             TO レセ－後療単価１.
014364     MOVE 連料－後療回数１             TO レセ－後療回数１.
014365     MOVE 連料－後療料１               TO レセ－後療料１.
014366     MOVE 連料－冷罨法回数１           TO レセ－冷罨法回数１.
014367     MOVE 連料－冷罨法料１             TO レセ－冷罨法料１.
014368     MOVE 連料－温罨法回数１           TO レセ－温罨法回数１.
014369     MOVE 連料－温罨法料１             TO レセ－温罨法料１.
014370     MOVE 連料－電療回数１             TO レセ－電療回数１.
014371     MOVE 連料－電療料１               TO レセ－電療料１.
014372     MOVE 連料－小計１                 TO レセ－小計１.
014374     MOVE 連料－長期逓減率１           TO レセ－長期逓減率１.
014378     MOVE 連料－長期込小計１           TO レセ－長期込小計１.
014379***********
014380* ２部位 *
014381***********
014382     MOVE 連料－後療単価２             TO レセ－後療単価２.
014383     MOVE 連料－後療回数２             TO レセ－後療回数２.
014384     MOVE 連料－後療料２               TO レセ－後療料２.
014385     MOVE 連料－冷罨法回数２           TO レセ－冷罨法回数２.
014386     MOVE 連料－冷罨法料２             TO レセ－冷罨法料２.
014387     MOVE 連料－温罨法回数２           TO レセ－温罨法回数２.
014388     MOVE 連料－温罨法料２             TO レセ－温罨法料２.
014389     MOVE 連料－電療回数２             TO レセ－電療回数２.
014390     MOVE 連料－電療料２               TO レセ－電療料２.
014391     MOVE 連料－小計２                 TO レセ－小計２.
014392     MOVE 連料－長期逓減率２           TO レセ－長期逓減率２.
014393     MOVE 連料－長期込小計２           TO レセ－長期込小計２.
014680*****************
014690* ３部位／８割 *
014700*****************
014702     MOVE 連料－後療単価３８           TO レセ－後療単価３８.
014703     MOVE 連料－後療回数３８           TO レセ－後療回数３８.
014704     MOVE 連料－後療料３８             TO レセ－後療料３８.
014705     MOVE 連料－冷罨法回数３８         TO レセ－冷罨法回数３８.
014706     MOVE 連料－冷罨法料３８           TO レセ－冷罨法料３８.
014707     MOVE 連料－温罨法回数３８         TO レセ－温罨法回数３８.
014708     MOVE 連料－温罨法料３８           TO レセ－温罨法料３８.
014709     MOVE 連料－電療回数３８           TO レセ－電療回数３８.
014710     MOVE 連料－電療料３８             TO レセ－電療料３８.
014711     MOVE 連料－小計３８               TO レセ－小計３８.
014712     MOVE 連料－多部位込小計３８       TO レセ－多部位込小計３８.
014713     MOVE 連料－長期逓減率３８         TO レセ－長期逓減率３８.
014714     MOVE 連料－長期込小計３８         TO レセ－長期込小計３８.
014860*****************
014870* ３部位／10割 *
014880*****************
014881     MOVE 連料－逓減開始月３０         TO レセ－逓減開始月３０.
014882     MOVE 連料－逓減開始日３０         TO レセ－逓減開始日３０.
014883     MOVE 連料－後療単価３０           TO レセ－後療単価３０.
014884     MOVE 連料－後療回数３０           TO レセ－後療回数３０.
014885     MOVE 連料－後療料３０             TO レセ－後療料３０.
014886     MOVE 連料－冷罨法回数３０         TO レセ－冷罨法回数３０.
014887     MOVE 連料－冷罨法料３０           TO レセ－冷罨法料３０.
014888     MOVE 連料－温罨法回数３０         TO レセ－温罨法回数３０.
014889     MOVE 連料－温罨法料３０           TO レセ－温罨法料３０.
014890     MOVE 連料－電療回数３０           TO レセ－電療回数３０.
014891     MOVE 連料－電療料３０             TO レセ－電療料３０.
014892     MOVE 連料－小計３０               TO レセ－小計３０.
014893     MOVE 連料－長期逓減率３０         TO レセ－長期逓減率３０.
014894     MOVE 連料－長期込小計３０         TO レセ－長期込小計３０.
015050*****************
015060* ４部位／５割 *
015070*****************
015071     MOVE 連料－後療単価４５           TO レセ－後療単価４５.
015072     MOVE 連料－後療回数４５           TO レセ－後療回数４５.
015073     MOVE 連料－後療料４５             TO レセ－後療料４５.
015074     MOVE 連料－冷罨法回数４５         TO レセ－冷罨法回数４５.
015075     MOVE 連料－冷罨法料４５           TO レセ－冷罨法料４５.
015076     MOVE 連料－温罨法回数４５         TO レセ－温罨法回数４５.
015077     MOVE 連料－温罨法料４５           TO レセ－温罨法料４５.
015078     MOVE 連料－電療回数４５           TO レセ－電療回数４５.
015079     MOVE 連料－電療料４５             TO レセ－電療料４５.
015080     MOVE 連料－小計４５               TO レセ－小計４５.
015081     MOVE 連料－多部位込小計４５       TO レセ－多部位込小計４５.
015082     MOVE 連料－長期逓減率４５         TO レセ－長期逓減率４５.
015083     MOVE 連料－長期込小計４５         TO レセ－長期込小計４５.
015230*****************
015240* ４部位／８割 *
015250*****************
015251     MOVE 連料－逓減開始月４８         TO レセ－逓減開始月４８.
015252     MOVE 連料－逓減開始日４８         TO レセ－逓減開始日４８.
015253     MOVE 連料－後療単価４８           TO レセ－後療単価４８.
015254     MOVE 連料－後療回数４８           TO レセ－後療回数４８.
015255     MOVE 連料－後療料４８             TO レセ－後療料４８.
015256     MOVE 連料－冷罨法回数４８         TO レセ－冷罨法回数４８.
015257     MOVE 連料－冷罨法料４８           TO レセ－冷罨法料４８.
015258     MOVE 連料－温罨法回数４８         TO レセ－温罨法回数４８.
015259     MOVE 連料－温罨法料４８           TO レセ－温罨法料４８.
015260     MOVE 連料－電療回数４８           TO レセ－電療回数４８.
015261     MOVE 連料－電療料４８             TO レセ－電療料４８.
015262     MOVE 連料－小計４８               TO レセ－小計４８.
015263     MOVE 連料－多部位込小計４８       TO レセ－多部位込小計４８.
015264     MOVE 連料－長期逓減率４８         TO レセ－長期逓減率４８.
015265     MOVE 連料－長期込小計４８         TO レセ－長期込小計４８.
015430*****************
015440* ４部位／10割 *
015450*****************
015451     MOVE 連料－逓減開始月４０         TO レセ－逓減開始月４０.
015452     MOVE 連料－逓減開始日４０         TO レセ－逓減開始日４０.
015453     MOVE 連料－後療単価４０           TO レセ－後療単価４０.
015454     MOVE 連料－後療回数４０           TO レセ－後療回数４０.
015455     MOVE 連料－後療料４０             TO レセ－後療料４０.
015456     MOVE 連料－冷罨法回数４０         TO レセ－冷罨法回数４０.
015457     MOVE 連料－冷罨法料４０           TO レセ－冷罨法料４０.
015458     MOVE 連料－温罨法回数４０         TO レセ－温罨法回数４０.
015459     MOVE 連料－温罨法料４０           TO レセ－温罨法料４０.
015460     MOVE 連料－電療回数４０           TO レセ－電療回数４０.
015461     MOVE 連料－電療料４０             TO レセ－電療料４０.
015462     MOVE 連料－小計４０               TO レセ－小計４０.
015463     MOVE 連料－長期逓減率４０         TO レセ－長期逓減率４０.
015464     MOVE 連料－長期込小計４０         TO レセ－長期込小計４０.
015620******************
015630* ５部位／2.5割 *
015640******************
015641     MOVE 連料－後療単価５２           TO レセ－後療単価５２.
015642     MOVE 連料－後療回数５２           TO レセ－後療回数５２.
015643     MOVE 連料－後療料５２             TO レセ－後療料５２.
015644     MOVE 連料－冷罨法回数５２         TO レセ－冷罨法回数５２.
015645     MOVE 連料－冷罨法料５２           TO レセ－冷罨法料５２.
015646     MOVE 連料－温罨法回数５２         TO レセ－温罨法回数５２.
015647     MOVE 連料－温罨法料５２           TO レセ－温罨法料５２.
015648     MOVE 連料－電療回数５２           TO レセ－電療回数５２.
015649     MOVE 連料－電療料５２             TO レセ－電療料５２.
015650     MOVE 連料－小計５２               TO レセ－小計５２.
015651     MOVE 連料－多部位込小計５２       TO レセ－多部位込小計５２.
015652     MOVE 連料－長期逓減率５２         TO レセ－長期逓減率５２.
015653     MOVE 連料－長期込小計５２         TO レセ－長期込小計５２.
015800*****************
015810* ５部位／５割 *
015820*****************
015821     MOVE 連料－逓減開始月５５         TO レセ－逓減開始月５５.
015822     MOVE 連料－逓減開始日５５         TO レセ－逓減開始日５５.
015823     MOVE 連料－後療単価５５           TO レセ－後療単価５５.
015824     MOVE 連料－後療回数５５           TO レセ－後療回数５５.
015825     MOVE 連料－後療料５５             TO レセ－後療料５５.
015826     MOVE 連料－冷罨法回数５５         TO レセ－冷罨法回数５５.
015827     MOVE 連料－冷罨法料５５           TO レセ－冷罨法料５５.
015828     MOVE 連料－温罨法回数５５         TO レセ－温罨法回数５５.
015829     MOVE 連料－温罨法料５５           TO レセ－温罨法料５５.
015830     MOVE 連料－電療回数５５           TO レセ－電療回数５５.
015831     MOVE 連料－電療料５５             TO レセ－電療料５５.
015832     MOVE 連料－小計５５               TO レセ－小計５５.
015833     MOVE 連料－多部位込小計５５       TO レセ－多部位込小計５５.
015834     MOVE 連料－長期逓減率５５         TO レセ－長期逓減率５５.
015835     MOVE 連料－長期込小計５５         TO レセ－長期込小計５５.
016000*****************
016010* ５部位／８割 *
016020*****************
016021     MOVE 連料－逓減開始月５８         TO レセ－逓減開始月５８.
016022     MOVE 連料－逓減開始日５８         TO レセ－逓減開始日５８.
016023     MOVE 連料－後療単価５８           TO レセ－後療単価５８.
016024     MOVE 連料－後療回数５８           TO レセ－後療回数５８.
016025     MOVE 連料－後療料５８             TO レセ－後療料５８.
016026     MOVE 連料－冷罨法回数５８         TO レセ－冷罨法回数５８.
016027     MOVE 連料－冷罨法料５８           TO レセ－冷罨法料５８.
016028     MOVE 連料－温罨法回数５８         TO レセ－温罨法回数５８.
016029     MOVE 連料－温罨法料５８           TO レセ－温罨法料５８.
016030     MOVE 連料－電療回数５８           TO レセ－電療回数５８.
016031     MOVE 連料－電療料５８             TO レセ－電療料５８.
016032     MOVE 連料－小計５８               TO レセ－小計５８.
016033     MOVE 連料－多部位込小計５８       TO レセ－多部位込小計５８.
016034     MOVE 連料－長期逓減率５８         TO レセ－長期逓減率５８.
016035     MOVE 連料－長期込小計５８         TO レセ－長期込小計５８.
016200*****************
016210* ５部位／10割 *
016220*****************
016221     MOVE 連料－逓減開始月５０         TO レセ－逓減開始月５０.
016222     MOVE 連料－逓減開始日５０         TO レセ－逓減開始日５０.
016223     MOVE 連料－後療単価５０           TO レセ－後療単価５０.
016224     MOVE 連料－後療回数５０           TO レセ－後療回数５０.
016225     MOVE 連料－後療料５０             TO レセ－後療料５０.
016226     MOVE 連料－冷罨法回数５０         TO レセ－冷罨法回数５０.
016227     MOVE 連料－冷罨法料５０           TO レセ－冷罨法料５０.
016228     MOVE 連料－温罨法回数５０         TO レセ－温罨法回数５０.
016229     MOVE 連料－温罨法料５０           TO レセ－温罨法料５０.
016230     MOVE 連料－電療回数５０           TO レセ－電療回数５０.
016231     MOVE 連料－電療料５０             TO レセ－電療料５０.
016232     MOVE 連料－小計５０               TO レセ－小計５０.
016233     MOVE 連料－長期逓減率５０         TO レセ－長期逓減率５０.
016234     MOVE 連料－長期込小計５０         TO レセ－長期込小計５０.
016235*
016245************
016255* 合計欄 *
016265************
016530     MOVE 連料－費用額                 TO レセ－合計.
016540     MOVE 連料－一部負担金             TO レセ－一部負担金.
016550     MOVE 連料－請求額                 TO レセ－請求金額.
016570     MOVE 連料－受給者負担額           TO レセ－受給者負担額.
016580     MOVE 連料－助成請求金額           TO レセ－助成請求金額.
016581*
016590* 負担率
016591* 14/10～ 老人対応  
016592     IF ( レセ－レセ種別 = 2 OR 3 ) AND
016593        ( 公費種別ＷＲ NOT = ZERO )
016595        IF 施術和暦年月ＷＲ >= 41410
016596           PERFORM 負担率取得１４１０
016597        END-IF
016598     ELSE
016599        COMPUTE レセ－負担割合 = 連計－負担率 / 10
016600     END-IF.
016601*
016602     COMPUTE レセ－給付割合 = 10 - レセ－負担割合.
016830*
016831*================================================================*
016832 負担率取得１４１０ SECTION.
016833*
016834* 平成14/10～
016836     MOVE SPACE TO 連率－負担率取得キー.
016837     INITIALIZE 連率－負担率取得キー.
016838     MOVE 施術和暦年月ＷＲ  TO 連率－施術和暦年月.
016839     MOVE 患者コードＷＲ    TO 連率－患者コード.
016840*
016841     CALL   "HUTANRIT".
016842     CANCEL "HUTANRIT".
016843*
016844** / 老人レセの時は以下
016845     COMPUTE レセ－負担割合 = 連率－２７老負担率 / 10.
016846*
016847*================================================================*
016848*================================================================*
016849*================================================================*
016851 その他レコードセット SECTION.
016861*
016862* 労災・自賠責・自費用
016871     PERFORM 基本レコードセット.
016872     MOVE 連計－費用額    TO レセ－合計.
016873     MOVE 連計－負担額    TO レセ－一部負担金.
016874     MOVE 連計－請求額    TO レセ－請求金額.
016891*
019940*================================================================*
019950 項目初期化 SECTION.
019960*
019990     INITIALIZE 負傷情報Ｗ.
019992     MOVE ZERO  TO 助成カウンタ.
020000*
020860*================================================================*
021138*================================================================*
021140 負傷データ取得 SECTION.
021150*
021330     MOVE 施術和暦ＷＲ       TO 負－施術和暦.
021340     MOVE 施術年ＷＲ         TO 負－施術年.
021350     MOVE 施術月ＷＲ         TO 負－施術月.
021360     MOVE 患者コードＷＲ     TO 負－患者コード.
021370     READ 負傷データＦ
021380     INVALID KEY
021390         CONTINUE
021400*            /* ありえない */
021410     NOT INVALID KEY
021420         MOVE 負－部位数                   TO 部位数Ｗ
021430         PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
021440                 UNTIL ( 部位ＣＮＴ > 部位数Ｗ )
021450             MOVE 負－負傷種別(部位ＣＮＴ) TO 負傷種別Ｗ(部位ＣＮＴ)
021460             MOVE 負－部位(部位ＣＮＴ)     TO 部位Ｗ(部位ＣＮＴ)
021470             MOVE 負－左右区分(部位ＣＮＴ) TO 左右区分Ｗ(部位ＣＮＴ)
021480             MOVE 負－負傷位置番号(部位ＣＮＴ) TO 負傷位置番号Ｗ(部位ＣＮＴ)
021682*
021760             MOVE 負－負傷和暦(部位ＣＮＴ)   TO 負傷和暦Ｗ(部位ＣＮＴ)
021761             MOVE 負－負傷年(部位ＣＮＴ)     TO 負傷年Ｗ(部位ＣＮＴ)
021770             MOVE 負－負傷月(部位ＣＮＴ)     TO 負傷月Ｗ(部位ＣＮＴ)
021780             MOVE 負－負傷日(部位ＣＮＴ)     TO 負傷日Ｗ(部位ＣＮＴ)
021781             MOVE 負－開始和暦(部位ＣＮＴ)   TO 初検和暦Ｗ(部位ＣＮＴ)
021790             MOVE 負－開始年(部位ＣＮＴ)     TO 初検年Ｗ(部位ＣＮＴ)
021800             MOVE 負－開始月(部位ＣＮＴ)     TO 初検月Ｗ(部位ＣＮＴ)
021810             MOVE 負－開始日(部位ＣＮＴ)     TO 初検日Ｗ(部位ＣＮＴ)
021820             IF 負－転帰区分(部位ＣＮＴ) = 9
021830                 MOVE 99                   TO 終了年Ｗ(部位ＣＮＴ)
021840                 MOVE 99                   TO 終了月Ｗ(部位ＣＮＴ)
021850                 MOVE 99                   TO 終了日Ｗ(部位ＣＮＴ)
021860             ELSE
021870                 MOVE 負－終了年(部位ＣＮＴ)   TO 終了年Ｗ(部位ＣＮＴ)
021880                 MOVE 負－終了月(部位ＣＮＴ)   TO 終了月Ｗ(部位ＣＮＴ)
021890                 MOVE 負－終了日(部位ＣＮＴ)   TO 終了日Ｗ(部位ＣＮＴ)
021900             END-IF
022100*
022110             MOVE 負－転帰区分(部位ＣＮＴ)     TO 転帰区分Ｗ(部位ＣＮＴ)
022203*
022210         END-PERFORM
022211*
022212* 新規/継続 チェック
022213         IF 連料－初検料  NOT = ZERO
022214             MOVE NC"○"   TO 新規チェックＷ
022215         ELSE
022216             MOVE NC"○"   TO 継続チェックＷ
022217         END-IF
022226* 枝番判定用
022236         MOVE 負－開始診療日手動区分 TO  開始診療日手動区分Ｗ
022246*
022280     END-READ.
022281*
022282*================================================================*
022283*================================================================*
022284 施術記録取得 SECTION.
022285*
022291     MOVE  SPACE  TO  初日再検フラグ.
022292     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1 UNTIL 部位ＣＮＴ > 部位数Ｗ
022293         IF ( 施術年ＷＲ = 初検年Ｗ(部位ＣＮＴ) ) AND
022294            ( 施術月ＷＲ = 初検月Ｗ(部位ＣＮＴ) )
022295             MOVE 患者番号ＷＲ          TO 施記－患者番号
022296             MOVE 枝番ＷＲ              TO 施記－枝番
022297             MOVE 施術和暦ＷＲ          TO 施記－施術和暦
022298             MOVE 初検年Ｗ(部位ＣＮＴ)  TO 開始年Ｗ(部位ＣＮＴ) 施記－施術年
022299             MOVE 初検月Ｗ(部位ＣＮＴ)  TO 開始月Ｗ(部位ＣＮＴ) 施記－施術月
022300             MOVE 初検日Ｗ(部位ＣＮＴ)  TO 開始日Ｗ(部位ＣＮＴ) 施記－施術日
022301         ELSE
022302             MOVE 患者番号ＷＲ          TO 施記－患者番号
022303             MOVE 枝番ＷＲ              TO 施記－枝番
022304             MOVE 施術和暦ＷＲ          TO 施記－施術和暦
022305             MOVE 施術年ＷＲ            TO 施記－施術年
022306             MOVE 施術月ＷＲ            TO 施記－施術月
022307             MOVE ZERO                  TO 施記－施術日
022308         END-IF
022309         START 施術記録Ｆ   KEY IS >= 施記－患者コード
022310                                      施記－施術和暦年月日
022311         END-START
022312         IF 状態キー = "00"
022313             MOVE ZERO  TO 実日数Ｗ(部位ＣＮＴ)
022314             MOVE ZERO  TO 終了年ＷＴ
022315             MOVE ZERO  TO 終了月ＷＴ
022316             MOVE ZERO  TO 終了日ＷＴ
022317             MOVE SPACE TO 終了フラグ２
022318             PERFORM 施術記録Ｆ読込
022319             IF  ( 終了フラグ２      = SPACE   ) AND
022320                 ( 施記－患者コード  = 患者コードＷＲ ) AND
022321                 ( 施記－施術和暦    = 施術和暦ＷＲ   ) AND
022322                 ( 施記－施術年      = 施術年ＷＲ     ) AND
022323                 ( 施記－施術月      = 施術月ＷＲ     ) 
022324*
022325*        *****************************************************************
022326*        * 開始年月日 ( その部位が当月初検でないか、
022327*                       当月初検でも枝番がある時は、最初の施術日を開始日)*
022328*        *****************************************************************
022329                 IF ( 施術年ＷＲ NOT = 初検年Ｗ(部位ＣＮＴ) ) OR
022330                    ( 施術月ＷＲ NOT = 初検月Ｗ(部位ＣＮＴ) ) OR
022331                    ( 開始診療日手動区分Ｗ = 1 )
022332                     MOVE 施記－施術年   TO 開始年Ｗ(部位ＣＮＴ)
022333                     MOVE 施記－施術月   TO 開始月Ｗ(部位ＣＮＴ)
022334                     MOVE 施記－施術日   TO 開始日Ｗ(部位ＣＮＴ)
022335                 END-IF
022336             END-IF
022337             PERFORM UNTIL ( 終了フラグ２         = "YES"            ) OR
022338                           ( 施記－患者コード NOT = 患者コードＷＲ   ) OR
022339                           ( 施記－施術和暦   NOT = 施術和暦ＷＲ     ) OR
022340                           ( 施記－施術年     NOT = 施術年ＷＲ       ) OR
022341                           ( 施記－施術月     NOT = 施術月ＷＲ       ) OR
022342                           ( 施記－施術日         > 終了日Ｗ(部位ＣＮＴ))
022343*               **********
022344*               * 実日数 *
022345*               **********
022346                COMPUTE 実日数Ｗ(部位ＣＮＴ) = 実日数Ｗ(部位ＣＮＴ) + 1
022347                MOVE 施記－施術年               TO 終了年ＷＴ
022348                MOVE 施記－施術月               TO 終了月ＷＴ
022349                MOVE 施記－施術日               TO 終了日ＷＴ
022350*
022351                PERFORM 施術記録Ｆ読込
022352            END-PERFORM
022353        END-IF
022354*       **************************
022355*       * 継続：終了年月日セット *
022356*       **************************
022357        IF 転帰区分Ｗ(部位ＣＮＴ) = 9
022358            MOVE 終了年ＷＴ    TO 終了年Ｗ(部位ＣＮＴ)
022359            MOVE 終了月ＷＴ    TO 終了月Ｗ(部位ＣＮＴ)
022360            MOVE 終了日ＷＴ    TO 終了日Ｗ(部位ＣＮＴ)
022361        END-IF
022367     END-PERFORM.
022368*
022369** ----- 前月初検のみかを判定 -----------*
022370*
022371*     MOVE 患者番号ＷＲ          TO 施記－患者番号.
022372*     MOVE 枝番ＷＲ              TO 施記－枝番.
022373*     MOVE 施術和暦ＷＲ          TO 施記－施術和暦.
022374*     MOVE 施術年ＷＲ            TO 施記－施術年.
022375*     MOVE 施術月ＷＲ            TO 施記－施術月.
022376*     MOVE ZERO                  TO 施記－施術日.
022377*     START 施術記録Ｆ   KEY IS >= 施記－患者コード
022378*                                  施記－施術和暦年月日
022379*     END-START.
022380*     IF 状態キー = "00"
022381*             MOVE SPACE TO 終了フラグ２
022382*             PERFORM 施術記録Ｆ読込
022383*             IF  ( 終了フラグ２      = SPACE   ) AND
022384*                 ( 施記－患者コード  = 患者コードＷＲ ) AND
022385*                 ( 施記－施術和暦    = 施術和暦ＷＲ   ) AND
022386*                 ( 施記－施術年      = 施術年ＷＲ     ) AND
022387*                 ( 施記－施術月      = 施術月ＷＲ     ) 
022388** 当月施術開始日が再検かどうか判定
022389*                 IF   施記－再検料請求 = 1
022390*                      MOVE "YES"  TO  初日再検フラグ
022391*                 END-IF
022392**
022393*             END-IF
022394*     END-IF.
022395*     IF 初日再検フラグ = "YES"
022396*        PERFORM 前月初検のみ判定
022397*     END-IF.
022398*
022399*================================================================*
022400 初検日以前のデータ判定 SECTION.
022401*
022402*********************************************************************************
022403*  最初の初検日以前の当月中に施術記録レコードがあった時(治癒、中止)は、請求区分の
022404*  継続にもチェックする。(新規と継続の両方)
022405*********************************************************************************
022406*********************************************************************************
022407*  追加機能として、通院情報をテーブルにセット
022408*  そのため、初検日を発見しても終わらないで、該当月すべてを読み込む
022409*********************************************************************************
022410     INITIALIZE 通院情報Ｗ.
022411*
022412** 最初の初検日を取得
022413     MOVE SPACE                 TO 初検フラグ.
022414     MOVE 患者番号ＷＲ          TO 施記－患者番号.
022415     MOVE 枝番ＷＲ              TO 施記－枝番.
022416     MOVE 施術和暦ＷＲ          TO 施記－施術和暦.
022417     MOVE 施術年ＷＲ            TO 施記－施術年.
022418     MOVE 施術月ＷＲ            TO 施記－施術月.
022419     MOVE ZERO                  TO 施記－施術日.
022420     START 施術記録Ｆ   KEY IS >= 施記－患者コード
022421                                  施記－施術和暦年月日
022422     END-START.
022423     IF 状態キー = "00"
022424         MOVE ZERO  TO 初検和暦ＷＴ
022425         MOVE ZERO  TO 初検年ＷＴ
022426         MOVE ZERO  TO 初検月ＷＴ
022427         MOVE ZERO  TO 初検日ＷＴ
022428         MOVE SPACE TO 終了フラグ２
022429         PERFORM 施術記録Ｆ読込
022430         PERFORM UNTIL ( 終了フラグ２         = "YES"           ) OR
022431                       ( 施記－患者コード NOT = 患者コードＷＲ  ) OR
022432                       ( 施記－施術和暦   NOT = 施術和暦ＷＲ    ) OR
022433                       ( 施記－施術年     NOT = 施術年ＷＲ      ) OR
022434                       ( 施記－施術月     NOT = 施術月ＷＲ      ) 
022436*          / 初検日2,後療1 /
022437               IF  施記－診療区分 = 2
022438                   MOVE 2 TO 通院区分Ｗ(施記－施術日)
022439               ELSE
022440                   MOVE 1 TO 通院区分Ｗ(施記－施術日)
022441               END-IF
022442*
022443*         /  最初の初検日を取得
022445               IF ( 施記－診療区分 = 2 ) AND ( 初検フラグ = SPACE )
022446                   MOVE 施記－施術和暦           TO 初検和暦ＷＴ
022447                   MOVE 施記－施術年             TO 初検年ＷＴ
022448                   MOVE 施記－施術月             TO 初検月ＷＴ
022449                   MOVE 施記－施術日             TO 初検日ＷＴ
022450                   MOVE "YES"                    TO 初検フラグ
022451               END-IF
022452               PERFORM 施術記録Ｆ読込
022453         END-PERFORM
022454     END-IF.
022455*
022456* 初検日以前のデータ判定
022457     IF 初検フラグ = "YES"
022458        MOVE 患者番号ＷＲ          TO 施記－患者番号
022459        MOVE 枝番ＷＲ              TO 施記－枝番
022460        MOVE 初検和暦ＷＴ          TO 施記－施術和暦
022461        MOVE 初検年ＷＴ            TO 施記－施術年
022462        MOVE 初検月ＷＴ            TO 施記－施術月
022463        MOVE 初検日ＷＴ            TO 施記－施術日
022464        START 施術記録Ｆ   KEY IS <  施記－患者コード
022465                                     施記－施術和暦年月日
022466                                     REVERSED
022467        END-START
022468        IF 状態キー = "00"
022469           MOVE SPACE  TO 終了フラグ２
022470           PERFORM 施術記録Ｆ読込
022471           IF ( 終了フラグ２    = SPACE        ) AND
022472              ( 施記－患者番号  = 患者番号ＷＲ ) AND
022473              ( 施記－枝番      = 枝番ＷＲ     ) AND
022474              ( 施記－施術和暦  = 初検和暦ＷＴ ) AND
022475              ( 施記－施術年    = 初検年ＷＴ   ) AND
022476              ( 施記－施術月    = 初検月ＷＴ   )
022477*  初検日以前の当月中に施術記録レコードがあった時
022478                IF 継続チェックＷ = SPACE
022479                   MOVE NC"○"    TO 継続チェックＷ
022480                END-IF
022481           END-IF
022482         END-IF
022483     END-IF.
022484*
023030*================================================================*
023510*================================================================*
023511 施術記録Ｆ読込 SECTION.
023512*
023513     READ 施術記録Ｆ NEXT
023514     AT END
023515         MOVE "YES" TO 終了フラグ２
023516     END-READ.
023517*
023518*================================================================*
023909*================================================================*
023919 レセプト種別取得 SECTION.
023925*
023926     EVALUATE 受－保険種別 
023927     WHEN 70
023928          MOVE "ROUS"    TO レセプト種類Ｗ
023929     WHEN 80
023930          MOVE "JIBA"    TO レセプト種類Ｗ
023931     WHEN 85
023933          MOVE "SEIH"    TO レセプト種類Ｗ
023934     WHEN 90
023935          MOVE "JIHI"    TO レセプト種類Ｗ
023936     WHEN 91
023937          MOVE "HUME"   TO レセプト種類Ｗ
023938     WHEN OTHER
023939**      / 助成がある時は、助成用（助成金額取得）で計算する /
023940          IF 受－助成種別  = ZERO
023941             EVALUATE TRUE
023942             WHEN (受－保険種別 = 01) AND (受－公費種別 = ZERO)
023943                MOVE "KOKU"    TO レセプト種類Ｗ
023944             WHEN (受－保険種別 = 02 OR 06 OR 07) AND (受－本人家族区分 = 1) AND (受－公費種別 = ZERO)
023945                MOVE "SYAH"    TO レセプト種類Ｗ
023948             WHEN (受－保険種別 = 02 OR 06 OR 07) AND (受－本人家族区分 = 2) AND (受－公費種別 = ZERO)
023955                MOVE "SYAK"    TO レセプト種類Ｗ
023958             WHEN (受－保険種別 = 03) AND (受－本人家族区分 = 1) AND (受－公費種別 = ZERO)
023965                MOVE "KUMH"    TO レセプト種類Ｗ
023968             WHEN (受－保険種別 = 03) AND (受－本人家族区分 = 2) AND (受－公費種別 = ZERO)
023975                MOVE "KUMK"    TO レセプト種類Ｗ
023978             WHEN (受－保険種別 = 04) AND (受－本人家族区分 = 1) AND (受－公費種別 = ZERO)
023985                MOVE "KYOH"    TO レセプト種類Ｗ
023988             WHEN (受－保険種別 = 04) AND (受－本人家族区分 = 2) AND (受－公費種別 = ZERO)
023995                MOVE "KYOK"    TO レセプト種類Ｗ
023998             WHEN 受－公費種別 = 05
024005                MOVE "ROUJ"    TO レセプト種類Ｗ
024008             WHEN (受－保険種別 = 08) AND (受－公費種別 = ZERO)
024015                MOVE "TAIS"    TO レセプト種類Ｗ
024018             WHEN (受－保険種別 = 09) AND (受－公費種別 = ZERO)
024025                MOVE "JIEI"    TO レセプト種類Ｗ
024028             WHEN OTHER
024029                MOVE  NC"　　　　　保険種別が不正です。" TO 連メ－メッセージ
024030                CALL   "MSG001"
024031                CANCEL "MSG001"
024032                PERFORM ファイル閉鎖
024033                EXIT PROGRAM
024034             END-EVALUATE
024035          ELSE
024036**    / 助成がある時 /
024043             MOVE "JYOS"    TO レセプト種類Ｗ
024044          END-IF
024045     END-EVALUATE.
024046*
024047*================================================================*
024048*================================================================*
024049 キー用レセ種別取得 SECTION.
024050*
024051* / レセプトＦのキー：レセ種別を決定する /
024052*
024058*   / 1:一般,2:老人,3:助成,4:労災,5:自賠責,6:自費,7:生保単独,8:保険証忘れ /
024059*
024060     EVALUATE レセプト種類Ｗ
024061     WHEN "ROUJ"
024062         MOVE  2   TO レセ種別Ｗ
024063     WHEN "JYOS"
024064        IF 助成カウンタ = ZERO
024066           IF 公費種別ＷＲ = ZERO
024067              MOVE  1   TO レセ種別Ｗ
024068           ELSE
024069              MOVE  2   TO レセ種別Ｗ
024070           END-IF
024071        ELSE
024072           MOVE  3   TO レセ種別Ｗ
024073        END-IF
024074     WHEN "ROUS"
024075         MOVE  4   TO レセ種別Ｗ
024076     WHEN "JIBA"
024077         MOVE  5   TO レセ種別Ｗ
024078     WHEN "JIHI"
024079         MOVE  6   TO レセ種別Ｗ
024080     WHEN "SEIH"
024081         MOVE  7   TO レセ種別Ｗ
024082     WHEN "HUME"
024083         MOVE  8   TO レセ種別Ｗ
024087     WHEN OTHER
024088         MOVE  1   TO レセ種別Ｗ
024089     END-EVALUATE.
024090*
024091*================================================================*
024092 レコード存在チェック SECTION.
024093*
024094* / レセプトＦにレコードがあるかチェック /
024095*
024096     MOVE SPACE TO 更新フラグ.
024097     INITIALIZE 各種フラグＷ.
024098*
024099     MOVE 施術和暦ＷＲ          TO レセ－施術和暦.
024100     MOVE 施術年ＷＲ            TO レセ－施術年.
024101     MOVE 施術月ＷＲ            TO レセ－施術月.
024102     MOVE 患者番号ＷＲ          TO レセ－患者番号.
024103     MOVE 枝番ＷＲ              TO レセ－枝番.
024104*  / キー用レセ種別で取得 /
024105     MOVE レセ種別Ｗ            TO レセ－レセ種別.
024114*
024115* -- レコードがある時は、フラグ群を退避 -----
024116     READ レセプトＦ
024117     NOT INVALID KEY
024118         MOVE "YES"             TO 更新フラグ
024119**         MOVE レセ－入金済区分  TO 入金済区分Ｗ
024120     END-READ.
024121*
024122*================================================================*
024123 ファイル書込 SECTION.
024124*
024127     IF 更新フラグ NOT = "YES"
024128        WRITE レセ－レコード
024129        IF 状態キー NOT = "00"
024130            MOVE NC"レセ追加" TO ファイル名
024131            PERFORM エラー表示
024132        END-IF
024133     ELSE
024134        REWRITE レセ－レコード
024135        IF 状態キー NOT = "00"
024136            MOVE NC"レセ更新" TO ファイル名
024137            PERFORM エラー表示
024138        END-IF
024139     END-IF.
024145*
024146*================================================================*
024147 削除処理 SECTION.
024148*----------------------------------------------------------------------------*
024149* 負傷、通院なしの時と
024150* 保険証画面で、保険種別、老人、助成種別の変更があった時に、該当年月の
024151* レコードがあったら削除する。
024152*----------------------------------------------------------------------------*
024153*
024154     MOVE 連レセＦ－施術和暦    TO レセ－施術和暦.
024155     MOVE 連レセＦ－施術年      TO レセ－施術年.
024156     MOVE 連レセＦ－施術月      TO レセ－施術月.
024157     MOVE 連レセＦ－患者番号    TO レセ－患者番号.
024158     MOVE 連レセＦ－枝番        TO レセ－枝番.
024159     MOVE ZERO                  TO レセ－レセ種別.
024173     START レセプトＦ   KEY IS >= レセ－施術和暦年月
024174                                  レセ－患者コード
024175                                  レセ－レセ種別
024176     END-START.
024187     IF 状態キー = "00"
024192         MOVE SPACE TO 終了フラグ３
024193         PERFORM レセプトＦ読込
024194         PERFORM UNTIL ( 終了フラグ３         = "YES"               ) OR
024196                       ( レセ－施術和暦   NOT = 連レセＦ－施術和暦  ) OR
024197                       ( レセ－施術年     NOT = 連レセＦ－施術年    ) OR
024198                       ( レセ－施術月     NOT = 連レセＦ－施術月    ) OR
024199                       ( レセ－患者番号   NOT = 連レセＦ－患者番号  ) OR
024200                       ( レセ－枝番       NOT = 連レセＦ－枝番      ) 
024201*
024202                DELETE  レセプトＦ
024203                IF 状態キー NOT = "00"
024204                   MOVE NC"レセプト" TO ファイル名
024205                   PERFORM エラー表示Ｄ
024206                END-IF
024207*
024210                PERFORM レセプトＦ読込
024211         END-PERFORM
024212     END-IF.
024216*
024217*================================================================*
024218 レセプトＦ読込 SECTION.
024219*
024220     READ レセプトＦ NEXT
024221     AT END
024222         MOVE "YES" TO 終了フラグ３
024223     END-READ.
024224*
024225*================================================================*
024226*================================================================*
024227 データチェック SECTION.
024228*
024229     MOVE SPACE  TO 実行キーＷ.
024230* *****************************************************************
024231* * 負傷部位有無チェック：部位数 = 0 の場合データ作成対象としない *
024232* *****************************************************************
024233     MOVE 連レセＦ－施術和暦   TO 負－施術和暦.
024234     MOVE 連レセＦ－施術年     TO 負－施術年.
024235     MOVE 連レセＦ－施術月     TO 負－施術月.
024236     MOVE 連レセＦ－患者番号   TO 負－患者番号.
024237     MOVE 連レセＦ－枝番       TO 負－枝番.
024238     READ 負傷データＦ
024239     INVALID KEY
024240         MOVE SPACE  TO 実行キーＷ
024241     NOT INVALID KEY
024242         IF 負－部位数 NOT = ZERO
024243*        *************************************************************
024244*        * 施術記録チェック：通院数 = 0 の場合データ作成対象としない *
024245*        *************************************************************
024246             MOVE 負－患者番号  TO 施記－患者番号
024247             MOVE 負－枝番      TO 施記－枝番
024248             MOVE 負－施術和暦  TO 施記－施術和暦
024249             MOVE 負－施術年    TO 施記－施術年
024250             MOVE 負－施術月    TO 施記－施術月
024251             MOVE ZERO          TO 施記－施術日
024252             START 施術記録Ｆ   KEY IS >= 施記－患者コード
024253                                          施記－施術和暦年月日
024254             END-START
024255             IF 状態キー = "00"
024256                 MOVE SPACE TO 終了フラグ２
024257                 MOVE SPACE TO 施術記録有Ｗ
024258                 PERFORM 施術記録Ｆ読込
024259                 PERFORM UNTIL ( 終了フラグ２         = "YES"          ) OR
024260                               ( 施記－患者コード NOT = 負－患者コード ) OR
024261                               ( 施記－施術和暦   NOT = 負－施術和暦   ) OR
024262                               ( 施記－施術年     NOT = 負－施術年     ) OR
024263                               ( 施記－施術月     NOT = 負－施術月     ) OR
024264                               ( 施術記録有Ｗ         = "YES"          )
024265                     MOVE "YES"  TO 施術記録有Ｗ
024266                     MOVE "YES"  TO 実行キーＷ
024267                 END-PERFORM
024268             ELSE
024269                 MOVE SPACE  TO 実行キーＷ
024270             END-IF
024271         ELSE
024272             MOVE SPACE  TO 実行キーＷ
024273         END-IF
024274     END-READ.
024275*
024276*================================================================*
024277 エラー表示 SECTION.
024278*
024279     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
024280     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
024281     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
024282     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
024283     ACCEPT  キー入力 FROM CONS
024284     PERFORM ファイル閉鎖.
024285     EXIT PROGRAM.
024286*================================================================*
024287 エラー表示Ｄ SECTION.
024288*
024289     DISPLAY NC"ファイル削除エラー：" ファイル名   UPON CONS.
024290     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
024291     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
024292     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
024293     ACCEPT  キー入力 FROM CONS.
024294     PERFORM ファイル閉鎖.
024295     EXIT PROGRAM.
024296*================================================================*
024297*================================================================*
024298 ファイル閉鎖 SECTION.
024299*
024300     CLOSE レセプトＦ 受診者情報Ｆ 施術記録Ｆ 負傷データＦ.
024302*================================================================*
024303 終了処理 SECTION.
024304*
024305     PERFORM ファイル閉鎖.
024306*================================================================*
024307******************************************************************
024308 END PROGRAM YAW602.
024309******************************************************************
