000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YAW9227.
000060 AUTHOR.                 池田  幸子
000070*
000080*----------------------------------------------------------------*
000090*         受診者リスト データ作成
000100*         MED = YAW922 YAW9228P
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2015-10-30
000130 DATE-COMPILED.          2015-10-30
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000270                             ORGANIZATION             IS  INDEXED
000280                             ACCESS MODE              IS  DYNAMIC
000290                             RECORD KEY               IS  受－施術和暦年月
000300                                                          受－患者コード
000310                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000320                                                          受－患者カナ
000330                                                          受－患者コード
000340                             ALTERNATE RECORD KEY     IS  受－患者コード
000350                                                          受－施術和暦年月
000360                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000370                                                          受－保険種別
000380                                                          受－保険者番号
000390                                                          受－患者コード
000400                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000410                                                          受－公費種別
000420                                                          受－費用負担者番号
000430                                                          受－患者コード
000440                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000450                                                          受－助成種別
000460                                                          受－費用負担者番号助成
000470                                                          受－患者コード
000480                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000490                                                          受－施術和暦年月
000500                                                          受－患者コード
000510                             FILE STATUS              IS  状態キー
000520                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  作業ファイル    ASSIGN      TO        "C:\MAKISHISYS\HMOBJ\TEMP\H9220L.DAT"
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS                   IS  DYNAMIC
                                   RECORD      KEY          IS  作－患者コード
                                   ALTERNATE RECORD KEY     IS  作－患者カナ
                                                                作－患者コード
                                   ALTERNATE RECORD KEY     IS  作－患者氏名
                                                                作－患者コード
                                   FILE        STATUS       IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W9227L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作１－患者コード
000570                                                          作１－患者カナ
000580                             ALTERNATE   RECORD  KEY  IS  作１－患者カナ
000590                                                          作１－患者コード
000600                             FILE        STATUS       IS  状態キー
000610                             LOCK        MODE         IS  AUTOMATIC.
000620******************************************************************
000630*                      DATA DIVISION                             *
000640******************************************************************
000650 DATA                    DIVISION.
000660 FILE                    SECTION.
000670*                           ［ＲＬ＝  ３２０］
000680 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000690     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001220**
       FD  作業ファイル RECORD  CONTAINS 128 CHARACTERS.
       01  作－レコード.
           03  作－レコードキー.
               05  作－患者コード.
                   07 作－患者番号               PIC 9(6).
                   07 作－枝番                   PIC X(1).
           03  作－レコードデータ.
               05  作－患者氏名                  PIC X(50).
               05  作－患者カナ                  PIC X(50).
               05  作－施術和暦年月.
                   07 作－施術和暦               PIC 9(1).
                   07 作－施術年                 PIC 9(2).
                   07 作－施術月                 PIC 9(2).
               05  FILLER                        PIC X(16).
000700*                           ［ＲＬ＝  ３２０］
000710 FD  作業ファイル１ RECORD  CONTAINS 320 CHARACTERS.
000720 01 作１－レコード.
000730    03 作１－レコードキー.
000740       05 作１－患者コード.
000750          07 作１－患者番号                     PIC 9(6).
000760          07 作１－枝番                         PIC X.
000770       05 作１－患者カナ                        PIC X(50).
000780    03 作１－レコードデータ.
000790       05 作１－患者氏名                        PIC X(50).
000800       05 作１－被保険者氏名                    PIC X(50).
000810       05 作１－本人家族区分                    PIC 9.
000820       05 作１－続柄                            PIC 9(2).
000830       05 作１－保険種別                        PIC 9(2).
000840       05 作１－保険者番号.
000850          07 作１－法別番号                     PIC X(2).
000860          07 作１－保番.
000870             09 作１－都道府県番号              PIC X(2).
000880             09 作１－保険番号                  PIC X(3).
000890             09 作１－検証番号                  PIC X.
000900             09 FILLER                          PIC X(2).
000910       05 作１－公費種別                        PIC 9(2).
000920       05 作１－費用負担者番号.
000930          07 作１－法別番号老人                 PIC X(2).
000940          07 作１－助保険老人.
000950             09 作１－府県老人                  PIC X(2).
000960             09 作１－助番老人                  PIC X(3).
000970             09 作１－助ＣＤ老人                PIC X.
000980          07 FILLER                             PIC X(2).
000990       05 作１－助成種別                        PIC 9(2).
001000       05 作１－費用負担者番号助成.
001010          07 作１－法別番号助成                 PIC X(2).
001020          07 作１－助保険助成.
001030             09 作１－府県助成                  PIC X(2).
001040             09 作１－助番助成                  PIC X(3).
001050             09 作１－助ＣＤ助成                PIC X.
001060          07 FILLER                             PIC X(2).
             05 作１－患者郵便番号.
                07 作１－患者郵便番号１               PIC X(3).
                07 作１－患者郵便番号２               PIC X(4).
             05 作１－患者住所                        PIC X(50).
001090       05 作１－患者電話番号                    PIC X(15).
001100       05 作１－患者生年月日.
001110          07 作１－患者和暦                     PIC 9.
001120          07 作１－患者年                       PIC 9(2).
001130          07 作１－患者月                       PIC 9(2).
001140          07 作１－患者日                       PIC 9(2).
001150       05 作１－最新キー情報.
001160          07 作１－施術和暦年月Ｎ.
001170             09 作１－施術和暦Ｎ                PIC 9.
001180             09 作１－施術年月Ｎ.
001190                11 作１－施術年Ｎ               PIC 9(2).
001200                11 作１－施術月Ｎ               PIC 9(2).
001210       05 FILLER                                PIC X(40).
001220*
001230*----------------------------------------------------------------*
001240******************************************************************
001250*                WORKING-STORAGE SECTION                         *
001260******************************************************************
001270 WORKING-STORAGE         SECTION.
001280 01 キー入力                           PIC X    VALUE SPACE.
001290 01 状態キー                           PIC X(2) VALUE SPACE.
001300 01 終了フラグ                         PIC X(3) VALUE SPACE.
001310 01 終了フラグ２                       PIC X(3) VALUE SPACE.
001320 01 ファイル名                         PIC N(2) VALUE SPACE.
001330 01 実行キーＷ                         PIC X(4) VALUE SPACE.
001340 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
001350 01 転記位置                           PIC 9(2)  VALUE ZERO.
001360 01 右詰保険者番号Ｗ.
001370    03 右詰数字保険者番号Ｗ            PIC 9(10) VALUE ZERO.
001380 01 文字数                             PIC 9(2)  VALUE ZERO.
001390 01 種別区分Ｗ                         PIC X(4)  VALUE SPACE.
001400 01 対象件数Ｗ                         PIC 9(5)  VALUE ZERO.
001410********
001420 01 患者カナ入力Ｗ                     PIC X(21) VALUE SPACE.
001430*/画面から入力されたカナのカウント専用(他で使うとバグる)
001440 01 カナカウンタ                       PIC 9(2)  VALUE ZERO.
001450*/その他のカウント用
001460 01 カウンタ２                         PIC 9(2)  VALUE ZERO.
001470 01 電話カウンタ                       PIC 9(2)  VALUE ZERO.
001480 01 保番カウンタ                       PIC 9(2)  VALUE ZERO.
001490 01 対象フラグ                         PIC X(3)  VALUE SPACE.
001500*
001510* **************
001520* * 項目待避用 *
001530* **************
001540 01 待避項目ＷＲ.
001550    03 施術和暦年月Ｗ.
001560       05 施術和暦Ｗ                   PIC 9(1) VALUE ZERO.
001570       05 施術年Ｗ                     PIC 9(2) VALUE ZERO.
001580       05 施術月Ｗ                     PIC 9(2) VALUE ZERO.
001590    03 保険種別Ｗ                      PIC 9(2) VALUE ZERO.
001600    03 保険者番号Ｗ                    PIC X(10) VALUE SPACE.
001610    03 開始患者コードＷ.
001620       05 開始患者番号Ｗ               PIC 9(6) VALUE ZERO.
001630       05 開始枝番Ｗ                   PIC X(1) VALUE SPACE.
001640    03 終了患者コードＷ.
001650       05 終了患者番号Ｗ               PIC 9(6) VALUE ZERO.
001660       05 終了枝番Ｗ                   PIC X(1) VALUE SPACE.
001670    03 電話番号Ｗ                      PIC X(15) VALUE SPACE.
001680    03 患者カナＷ                      PIC X(20) VALUE SPACE.
001690    03 生年和暦年月日Ｗ.
001700       05 生年和暦Ｗ                   PIC 9(1) VALUE ZERO.
001710       05 生年年Ｗ                     PIC 9(2) VALUE ZERO.
001720       05 生年月Ｗ                     PIC 9(2) VALUE ZERO.
001730       05 生年日Ｗ                     PIC 9(2) VALUE ZERO.
001740    03 名前区分Ｆ                      PIC 9(1) VALUE ZERO.
001750    03 並び順Ｆ                        PIC 9(1) VALUE ZERO.
001760******************************************************************
001770*                          連結項目                              *
001780******************************************************************
001790*
001800****************
001810* 画面入力情報 *
001820****************
       01 連入－印刷区分９２２７ IS EXTERNAL.
      */並び順 0:番号順 1:カナ順
          03 連入－並び順          PIC 9(1).
      */昇降順 0:昇順 1:降順
          03 連入－昇降順          PIC 9(1).
002040**********************
002050* メッセージ表示キー *
002060**********************
002070 01 連メ－キー IS EXTERNAL.
002080    03  連メ－メッセージ               PIC N(20).
002090*******************************************************************
002100*                      PROCEDURE  DIVISION                       *
002110******************************************************************
002120 PROCEDURE               DIVISION.
002130************
002140*           *
002150* 初期処理   *
002160*           *
002170************
002180     PERFORM 初期化.
002190************
002200*           *
002210* 主処理     *
002220*           *
002230************
002240     PERFORM 作業ファイル作成.
002250************
002260*           *
002270* 終了処理   *
002280*           *
002290************
002300     PERFORM 終了処理.
002320     MOVE ZERO TO PROGRAM-STATUS.
002330     EXIT PROGRAM.
002340*
002350*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002360*================================================================*
002370 初期化 SECTION.
002380*
002390     PERFORM ファイルオープン.
002610*================================================================*
002620 ファイルオープン SECTION.
002630*
002640     OPEN INPUT 受診者情報Ｆ.
002650         MOVE NC"受診者情報Ｆ" TO ファイル名.
002660         PERFORM オープンチェック.
001810*
001820     OPEN INPUT 作業ファイル.
001830         MOVE NC"作業ファイル" TO ファイル名.
001840         PERFORM オープンチェック.
002670*================================================================*
002680 オープンチェック SECTION.
002690*
002700     IF 状態キー  NOT =  "00"
002710         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002720         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002730         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002740                                                 UPON CONS
002750         ACCEPT  キー入力 FROM CONS
002760         PERFORM ファイル閉鎖
002770         MOVE 99 TO PROGRAM-STATUS
002780         EXIT PROGRAM.
002790*================================================================*
002800 ファイル閉鎖 SECTION.
002810*
002820     CLOSE 受診者情報Ｆ 作業ファイル.
002830*================================================================*
002840 終了処理 SECTION.
002850*
002860     PERFORM ファイル閉鎖.
002870*================================================================*
002880 エラー表示 SECTION.
002890*
002900     DISPLAY NC"状態キー" 状態キー  UPON CONS.
002910     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
002920     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
002930     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
002940     ACCEPT  キー入力 FROM CONS.
002950     PERFORM ファイル閉鎖.
002960     MOVE 99 TO PROGRAM-STATUS.
002970     EXIT PROGRAM.
002980*================================================================*
002990 作業ファイル作成 SECTION.
003000*
003010     MOVE ZERO TO 対象件数Ｗ.
003020     OPEN OUTPUT 作業ファイル１.
003030          MOVE NC"作１" TO ファイル名.
003040          PERFORM オープンチェック.
003100     MOVE ZERO       TO 作－患者番号.
003110     MOVE SPACE      TO 作－枝番.
003110     MOVE SPACE      TO 作－患者カナ.
003160     IF 状態キー = "00"
003170         MOVE SPACE  TO 終了フラグ
003180         PERFORM 作業ファイル読込
003190         PERFORM UNTIL ( 終了フラグ = "YES" )
                   MOVE 作－施術和暦年月 TO 受－施術和暦年月
                   MOVE 作－患者コード   TO 受－患者コード
                   READ 受診者情報Ｆ
                   NOT INVALID KEY
003280                PERFORM 作１レコードセット
003290                PERFORM 作１レコード書込
                   END-READ
003310             PERFORM 作業ファイル読込
003320         END-PERFORM
003330     END-IF.
002410     CLOSE 作業ファイル１.
004060*================================================================*
003970 作業ファイル読込 SECTION.
003980*
003990     READ 作業ファイル NEXT
004100     AT END
004110         MOVE "YES" TO 終了フラグ
004120     END-READ.
004130*================================================================*
004140 作１レコードセット SECTION.
004150*
004160     INITIALIZE    作１－レコード.
004170     MOVE SPACE TO 作１－レコード.
004180     MOVE 受－患者番号           TO 作１－患者番号      .
004190     MOVE 受－枝番               TO 作１－枝番          .
004200     MOVE 受－患者カナ           TO 作１－患者カナ      .
004210     MOVE 受－患者氏名           TO 作１－患者氏名      .
004220     MOVE 受－被保険者氏名       TO 作１－被保険者氏名  .
004230     MOVE 受－本人家族区分       TO 作１－本人家族区分  .
004240     MOVE 受－続柄               TO 作１－続柄          .
004250     MOVE 受－保険種別           TO 作１－保険種別      .
004260     MOVE 受－保険者番号         TO 作１－保険者番号    .
004270     MOVE 受－公費種別           TO 作１－公費種別      .
004280     MOVE 受－費用負担者番号     TO 作１－費用負担者番号.
004290     MOVE 受－助成種別           TO 作１－助成種別      .
004300     MOVE 受－費用負担者番号助成 TO 作１－費用負担者番号助成.
           MOVE 受－患者郵便番号１     TO 作１－患者郵便番号１.
           MOVE 受－患者郵便番号２     TO 作１－患者郵便番号２.
           STRING 受－患者住所１   DELIMITED BY SPACE
                  受－患者住所２   DELIMITED BY SPACE
             INTO 作１－患者住所
           END-STRING.
004330     MOVE 受－患者電話番号       TO 作１－患者電話番号  .
004340     MOVE 受－患者和暦           TO 作１－患者和暦      .
004350     MOVE 受－患者年             TO 作１－患者年        .
004360     MOVE 受－患者月             TO 作１－患者月        .
004370     MOVE 受－患者日             TO 作１－患者日        .
004380     MOVE 受－施術和暦Ｎ         TO 作１－施術和暦Ｎ    .
004390     MOVE 受－施術年Ｎ           TO 作１－施術年Ｎ      .
004400     MOVE 受－施術月Ｎ           TO 作１－施術月Ｎ      .
004410*================================================================*
004420 作１レコード書込 SECTION.
004430*
004440     WRITE 作１－レコード
004450     INVALID KEY
004460         MOVE NC"作１"  TO ファイル名
004470         PERFORM エラー表示
004480     END-WRITE.
004490     COMPUTE 対象件数Ｗ   = 対象件数Ｗ   + 1.
004930*================================================================*
004940******************************************************************
004950 END PROGRAM YAW9227.
004960******************************************************************
