000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             ZIPGO.
000060 AUTHOR.                 岡田 憲和
000070*
000080*----------------------------------------------------------------*
000090*         ZIP.DLLコールラッパー
000100*----------------------------------------------------------------*
000110 DATE-WRITTEN.           2015-05-08
000120 DATE-COMPILED.          2015-05-08
000130*----------------------------------------------------------------*
000140******************************************************************
000150*            ENVIRONMENT         DIVISION                        *
000160******************************************************************
000170 ENVIRONMENT             DIVISION.
000184 CONFIGURATION           SECTION.
000193 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000200 OBJECT-COMPUTER.        FMV-DESKPOWER.
000210 SPECIAL-NAMES.
000221     ARGUMENT-VALUE  IS PARA1.
000224******************************************************************
000230*                      DATA DIVISION                             *
000240******************************************************************
000250 DATA                    DIVISION.
000260******************************************************************
000270*                WORKING-STORAGE SECTION                         *
000280******************************************************************
000290 WORKING-STORAGE         SECTION.
000330 01 ステータスＷ         PIC S9(9) COMP-5 VALUE ZERO.
000331
000332*/ZIP圧縮
000333 01 パラ１Ｗ             PIC X(2001) VALUE SPACE.
000334 01 プログラム名Ｗ       PIC X(8)    VALUE "zip".
000335*
000340******************************************************************
000350*                      PROCEDURE  DIVISION                       *
000360******************************************************************
000370 PROCEDURE               DIVISION.
000380*
000420     MOVE "zip" TO プログラム名Ｗ.
000421     ACCEPT パラ１Ｗ FROM PARA1.
000422     CALL プログラム名Ｗ WITH C LINKAGE
000423                USING BY REFERENCE パラ１Ｗ.
000424*
000430     EXIT PROGRAM. 
000440*================================================================*
000450******************************************************************
000460 END PROGRAM ZIPGO.
000470******************************************************************
