000010*****************************************************************
000020* ‚g‰—Ã—\’è‚e@H_noyote.dat mRL=256BYTEn                     *
000030*****************************************************************
000040* SYSYTEM NAME:èI‹„ƒ}ƒbƒT[ƒW                                   *
000050* LANGUAGE PG :NetCOBOL                                         *
000060* PRODUCT DATE:2011.02.03                                       *
000070* PURPOSE     :“úX‚Ì‰—Ã—\’èî•ñ‚ð‹L˜^                         *
000080*****************************************************************
000090*
000100*     SELECT  ‚g‰—Ã—\’è‚e    ASSIGN      TO        HNOYOTEL
000110*                             ORGANIZATION             IS  INDEXED
000120*                             ACCESS MODE              IS  DYNAMIC
000130*                             RECORD KEY               IS  ‚g‰—\|Ž{p‹æ•ª
000140*                                                          ‚g‰—\|Ž{p˜a—ï”NŒŽ“ú
000150*                                                          ‚g‰—\|Š³ŽÒƒR[ƒh
000160*                             ALTERNATE RECORD KEY     IS  ‚g‰—\|Ž{p˜a—ï”NŒŽ“ú
000170*                                                          ‚g‰—\|Š³ŽÒƒR[ƒh
000180*                                                          ‚g‰—\|Ž{p‹æ•ª
000190*                             ALTERNATE RECORD KEY     IS  ‚g‰—\|Š³ŽÒƒR[ƒh
000200*                                                          ‚g‰—\|Ž{p˜a—ï”NŒŽ“ú
000210*                                                          ‚g‰—\|Ž{p‹æ•ª
000220*                             ALTERNATE RECORD KEY     IS  ‚g‰—\|Ž{p˜a—ï”NŒŽ“ú
000230*                                                          ‚g‰—\|Ž{pŽÒ”Ô†
000240*                                                          ‚g‰—\|Ž{pŠJŽnŽžŠÔ
000250*                                                          ‚g‰—\|“o˜^‡
000260*                                                          ‚g‰—\|Š³ŽÒƒR[ƒh
000270*                             ALTERNATE RECORD KEY     IS  ‚g‰—\|Ž{p˜a—ï”NŒŽ“ú
000280*                                                          ‚g‰—\|Ž{pŠJŽnŽžŠÔ
000290*                                                          ‚g‰—\|Ž{pŽÒ”Ô†
000300*                                                          ‚g‰—\|“o˜^‡
000310*                                                          ‚g‰—\|Š³ŽÒƒR[ƒh
000320*                             FILE STATUS              IS  ó‘ÔƒL[
000330*                             LOCK        MODE         IS  AUTOMATIC.
000340***
000350* FD  ‚g‰—Ã—\’è‚e   BLOCK   CONTAINS   1   RECORDS.
000360*     COPY H_NOYOTE   OF  XFDLIB  JOINING   ‚g‰—\   AS  PREFIX.
000370*
000380*****************************************************************
000390 01 ƒŒƒR[ƒh.
000400   03 ƒŒƒR[ƒhƒL[.
000410*-----------------------------------------------*
000420* 1:èI‹„A2:‚ ‚ñ‚ÜEƒ}ƒbƒT[ƒWA3:—¼•û
000430     05 Ž{p‹æ•ª                       PIC 9.
000440*-----------------------------------------------*
000450     05 Ž{p˜a—ï”NŒŽ“ú.
000460       07 Ž{p˜a—ï”NŒŽ.
000470         09 Ž{p˜a—ï                   PIC 9.
000480         09 Ž{p”NŒŽ.
000490           11 Ž{p”N                   PIC 9(2).
000500           11 Ž{pŒŽ                   PIC 9(2).
000510       07 Ž{p“ú                       PIC 9(2).
000520     05 Š³ŽÒƒR[ƒh.
000530       07 Š³ŽÒ”Ô†                     PIC 9(6).
000540       07 Ž}”Ô                         PIC X.
000550**
000560   03 ƒŒƒR[ƒhƒf[ƒ^.
000570     05 Ž{pŽÒ”Ô†                     PIC 9(4).
000580*
000590     05 Ž{pŠJŽnŽžŠÔ.
000600       07 Ž{pŠJŽnŽž                   PIC X(2).
000610       07 Ž{pŠJŽn•ª                   PIC X(2).
000620     05 “o˜^‡                         PIC 9(4)V9(3).
000630*
000640*    / 1:Ž©‘î 2:Ž{Ý 3:“¯ã /
000650     05 ‰—ÃêŠ‹æ•ª                   PIC 9(1).
000660     05 ‰—ÃêŠ.
000670       07 ‰—ÃêŠŽ{ÝƒR[ƒh           PIC 9(3).
000680*
000690     05 ‚Í‚è‚«‚ã‚¤Ž{p“à—e‹æ•ª         PIC 9(2).
000700     05 ƒ}ƒbƒT[ƒWŽ{p“à—e‹æ•ª         PIC 9(2).
000710*
000720     05 Ž{p”õl                       PIC X(80).
000730*
000740     05 FILLER                         PIC X(10).
000750*
