000001******************************************************************
000002*            IDENTIFICATION      DIVISION                        *
000003******************************************************************
000004 IDENTIFICATION          DIVISION.
000005 PROGRAM-ID.             YHN432.
000006 AUTHOR.                 池田　幸子
000007*
000008*----------------------------------------------------------------*
000009*         請求書指定【ﾃﾞｰﾀ作成】柔＋ｳｨﾝﾄﾞｳｽﾞ版
000010*  請求年月バージョン 
000011*         MED = YHN430 
000012*----------------------------------------------------------------*
000013 DATE-WRITTEN.           2015-02-25
000014 DATE-COMPILED.          2015-02-25
000015*----------------------------------------------------------------*
000016******************************************************************
000017*            ENVIRONMENT         DIVISION                        *
000018******************************************************************
000019 ENVIRONMENT             DIVISION.
000020 CONFIGURATION           SECTION.
000021 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000022 OBJECT-COMPUTER.        FMV-DESKPOWER.
000023 SPECIAL-NAMES.          CONSOLE  IS  CONS
000024                         SYSERR   IS  MSGBOX.
000025 INPUT-OUTPUT            SECTION.
000026 FILE-CONTROL.
000027     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000028                             ORGANIZATION             IS  INDEXED
000029                             ACCESS MODE              IS  DYNAMIC
000030                             RECORD KEY               IS  制－制御区分
000031                             FILE STATUS              IS  状態キー
000032                             LOCK        MODE         IS  AUTOMATIC.
000033     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000034                             ORGANIZATION             IS  INDEXED
000035                             ACCESS MODE              IS  DYNAMIC
000036                             RECORD KEY               IS 受－施術和暦年月
000037                                                          受－患者コード
000038                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000039                                                          受－患者カナ
000040                                                          受－患者コード
000041                             ALTERNATE RECORD KEY     IS  受－患者コード
000042                                                         受－施術和暦年月
000043                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000044                                                          受－保険種別
000045                                                          受－保険者番号
000046                                                          受－患者コード
000047                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000048                                                          受－公費種別
000049                                                     受－費用負担者番号
000050                                                          受－患者コード
000051                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000052                                                          受－助成種別
000053                                                  受－費用負担者番号助成
000054                                                          受－患者コード
000055                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000056                                                      受－施術和暦年月
000057                                                      受－患者コード
000058                             FILE STATUS              IS  状態キー
000059                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000095     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
000096                             ORGANIZATION             IS  INDEXED
000097                             ACCESS                   IS  DYNAMIC
000905                             RECORD      KEY          IS  作１－請求和暦年月
000907                                                          作１－分類コード
                                                                作１－県コード
                                                                作１－保険順
000908                                                          作１－保険者番号
000909                                                          作１－本人家族区分
                                                                作１－負担割合
000910                                                          作１－患者カナ
000911                                                          作１－患者コード
000912                                                          作１－施術和暦年月
000106                             FILE        STATUS       IS  状態キー
000107                             LOCK        MODE         IS  AUTOMATIC.
000108     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4322L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作２－請求和暦年月
000112                                                          作２－分類コード
000112                                                          作２－県コード
000112                                                          作２－保険順
000113                                                          作２－保険者番号
000114                             ALTERNATE RECORD KEY     IS  作２－印刷区分
000115                                                          作２－請求和暦年月
000112                                                          作２－分類コード
000112                                                          作２－県コード
000112                                                          作２－保険順
000117                                                          作２－保険者番号
000118                             FILE        STATUS       IS  状態キー
000119                             LOCK        MODE         IS  AUTOMATIC.
000120******************************************************************
000121*                      DATA DIVISION                             *
000122******************************************************************
000123 DATA                    DIVISION.
000124 FILE                    SECTION.
000125*                           ［ＲＬ＝  ２５６］
000126 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000127     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000991     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
000128*                           ［ＲＬ＝  ３２０］
000129 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000130     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
000143* 
000144 FD  作業ファイル１ RECORD  CONTAINS 256 CHARACTERS.
000145 01  作１－レコード.
000146     03  作１－レコードキー.
000147         05  作１－請求和暦年月.
000148             07  作１－請求和暦              PIC 9.
000149             07  作１－請求年                PIC 9(2).
000150             07  作１－請求月                PIC 9(2).
001261         05  作１－分類コード              PIC 9(1).
001261         05  作１－県コード                PIC X(2).
001400         05  作１－保険順                  PIC 9(2).
001271         05  作１－保険者番号.
001530             07 作１－法別番号             PIC X(2).
001540             07 作１－保番.
001550                09 作１－都道府県番号      PIC X(2).
001560                09 作１－保険番号          PIC X(3).
001570                09 作１－検証番号ＷＲ      PIC X.
001580                09 FILLER                  PIC X(2).
001280         05  作１－本人家族区分            PIC 9.
               05  作１－負担割合                PIC 9(2).
001300         05  作１－患者カナ                PIC X(50).
001310         05  作１－患者コード.
001320             07 作１－患者番号             PIC 9(6).
001330             07 作１－枝番                 PIC X(1).
001340         05  作１－施術和暦年月.
001350             07  作１－施術和暦            PIC 9.
001360             07  作１－施術年              PIC 9(2).
001370             07  作１－施術月              PIC 9(2).
000164     03  作１－レコードデータ.
000165         05  作１－被保険者氏名            PIC X(50).
000166         05  作１－患者氏名                PIC X(50).
001400         05  作１－保険種別                PIC 9(2).
001271         05  作１－保険者番号正規          PIC X(8).
000167         05  作１－費用額                  PIC 9(6).
000168         05  作１－負担額                  PIC 9(6).
000169         05  作１－請求額                  PIC 9(6).
000169         05  作１－実日数                  PIC 9(2).
001400         05  作１－親保険種別              PIC 9(2).
000172         05  FILLER                        PIC X(37).
000172*
000173*                           ［ＲＬ＝  ６４］
000174 FD  作業ファイル２ RECORD  CONTAINS 64 CHARACTERS.
000175 01  作２－レコード.
000176     03  作２－レコードキー.
000177         05  作２－請求和暦年月.
000178             07  作２－請求和暦              PIC 9.
000179             07  作２－請求年                PIC 9(2).
000180             07  作２－請求月                PIC 9(2).
001261         05  作２－分類コード                PIC 9(1).
001261         05  作２－県コード                  PIC X(2).
001400         05  作２－保険順                    PIC 9(2).
000182         05  作２－保険者番号                PIC X(10).
000183         05  作２－印刷区分                  PIC 9.
000184     03  作２－レコードデータ.
001400         05  作２－保険種別                  PIC 9(2).
000185         05  作２－件数                      PIC 9(4).
000186         05  作２－費用額                    PIC 9(8).
000187         05  作２－負担額                    PIC 9(8).
000188         05  作２－請求額                    PIC 9(8).
               05  作２－元保険者番号              PIC X(10).
               05  作２－ラベルチェック            PIC X.
               05  FILLER                          PIC X(2).
000173*
000190*----------------------------------------------------------------*
001240******************************************************************
001250*                WORKING-STORAGE SECTION                         *
001260******************************************************************
001270 WORKING-STORAGE         SECTION.
001280 01 キー入力                           PIC X     VALUE SPACE.
001290 01 状態キー                           PIC X(2)  VALUE SPACE.
001300 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001301 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001302 01 作成フラグ                         PIC X(3)  VALUE SPACE.
001303 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
001304 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
001651 01 印刷フラグ                         PIC X(3)  VALUE SPACE.
001305*
001310 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
001311 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
001321 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
001330 01 請求和暦年月ＷＲ.
001340    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
001350    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
001360    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
001320 01 保険者番号ＷＲ.
001530    03 法別番号ＷＲ                    PIC X(2)  VALUE SPACE.
001540    03 保番ＷＲ.
001550       05 都道府県番号ＷＲ             PIC X(2)  VALUE SPACE.
001560       05 保険番号ＷＲ                 PIC X(3)  VALUE SPACE.
001570       05 検証番号ＷＲ                 PIC X     VALUE SPACE.
001580       05 FILLER                       PIC X(2)  VALUE SPACE.
001370*
001410 01 請求年月Ｗ.
001420    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001430    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
001440    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
001441 01 施術年月Ｗ.
001442    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001443    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
001444    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
001450 01 集計作業用Ｗ.
001460    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
001461    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
001470    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
001480    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
001490    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
001500    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
001510 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
001520 01 ファイル名                         PIC N(2)  VALUE SPACE.
001530 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
001540 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
001541 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
001542*
001543* 県内県外用
001544 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
001545 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
001546 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001547 01 県内県外チェック                   PIC 9     VALUE ZERO.
001548 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001549 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
001550 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
001551 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
001552*
001982 01 請求書関連Ｗ.
002862        07 北海道区分Ｗ                PIC 9 VALUE ZERO.
002862        07 青森区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岩手区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 秋田区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山形区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 茨城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 栃木区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 群馬区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 埼玉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 千葉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 東京区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 神奈川区分Ｗ                PIC 9 VALUE ZERO.
002862        07 新潟区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 富山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 石川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福井区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山梨区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長野区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岐阜区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 静岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 三重区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 滋賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 京都区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大阪区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 兵庫区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 奈良区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 和歌山区分Ｗ                PIC 9 VALUE ZERO.
002862        07 鳥取区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 島根区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岡山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 広島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山口区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 徳島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 香川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛媛区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 高知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 佐賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 熊本区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大分区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 鹿児島区分Ｗ                PIC 9 VALUE ZERO.
002862        07 沖縄区分Ｗ                  PIC 9 VALUE ZERO.
001582*
001553* エラーメッセージ用
001554 01 エラーメッセージＷ.
001555    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
001556    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
001557    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
001558    03 FILLER                          PIC X(10) VALUE SPACE.
001559* 順序用
001560 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
001561 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
001562*
001563** 助成レセまとめ用
001564 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
001565*
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
001570******************************************************************
001571*                          連結項目                              *
001572******************************************************************
001580*
001581****************
001582* 画面入力情報 *
001583****************
001584**
001585 01 連入－画面情報ＹＨＮ４３０   IS EXTERNAL.
001586    03 連入－請求年月.
001587       05 連入－請求和暦               PIC 9.
001588       05 連入－請求年                 PIC 9(2).
001589       05 連入－請求月                 PIC 9(2).
001590    03 連入－提出年月日.
001591       05 連入－提出和暦               PIC 9.
001592       05 連入－提出年                 PIC 9(2).
001593       05 連入－提出月                 PIC 9(2).
001594       05 連入－提出日                 PIC 9(2).
001595    03 連入－レセプト種類              PIC X(4).
001596    03 連入－保険種別                  PIC 9(2).
001597    03 連入－印刷種類                  PIC 9.
001598    03 連入－本人家族                  PIC 9.
001599    03 連入－用紙種類                  PIC 9.
001600    03 連入－県内県外                  PIC 9.
001601    03 連入－県ＪＩＳ                  PIC X(2).
001602    03 連入－政管ＪＩＳ                PIC X(2).
001603*
001772*
001782********************
001792* メッセージ表示キー *
001802********************
001812 01 連メ３－キー IS EXTERNAL.
001822    03  連メ３－メッセージ             PIC N(20).
001832    03  連メ３－メッセージ１           PIC X(20).
001842*
001852************************
001862* 助成レセまとめ
001872************************
001882 01 連レセまとめ－キー IS EXTERNAL.
001892    03 連レセまとめ－施術和暦年月.
001902       05 連レセまとめ－施術和暦               PIC 9.
001912       05 連レセまとめ－施術年月.
001922          07 連レセまとめ－施術年              PIC 9(2).
001932          07 連レセまとめ－施術月              PIC 9(2).
001942    03 連レセまとめ－患者コード.
001952       05 連レセまとめ－患者番号               PIC 9(6).
001962       05 連レセまとめ－枝番                   PIC X(1).
001972**-------------------------------------------------------**
001982*   1:助成レセプトなしの本体まとめの判定
001992*   2:横浜・川崎用の社保助成レセかの判定
002002    03 連レセまとめ－判定区分                  PIC 9.
002012**-------------------------------------------------------**
002022*  / OUT /　 0:対象外、1:対象
002032    03 連レセまとめ－判定結果                  PIC 9.
002042**
002160******************************************************************
002170*                      PROCEDURE  DIVISION                       *
002180******************************************************************
002190 PROCEDURE               DIVISION.
002200************
002210*           *
002220* 初期処理   *
002230*           *
002240************
002250     PERFORM ファイルオープン.
002260     PERFORM 連結項目待避.
002261     PERFORM 制御情報取得.
002270************
002280*           *
002290* 主処理     *
002300*           *
002310************
002320     PERFORM 作業ファイル１作成.
002330     PERFORM 作業ファイル２作成.
002340************
002350*           *
002360* 終了処理   *
002370*           *
002380************
002390     PERFORM 終了処理.
002400     MOVE ZERO TO PROGRAM-STATUS.
002410     EXIT PROGRAM.
002420*
002430*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002440*================================================================*
002450 連結項目待避 SECTION.
002460*
002470* 連結項目の待避
002500     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002510     MOVE 連入－請求年        TO 請求年ＷＲ.
002520     MOVE 連入－請求月        TO 請求月ＷＲ.
002530     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
002540     MOVE 連入－保険種別      TO 保険種別ＷＲ.
002550     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
002551     MOVE 連入－県内県外      TO 県内県外ＷＲ.
002552     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
002553     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
002554*
002560*================================================================*
002570 ファイルオープン SECTION.
002580*
002581     OPEN INPUT 制御情報マスタ.
002582         MOVE NC"制御情報" TO ファイル名.
002583         PERFORM オープンチェック.
002590     OPEN INPUT 受診者情報Ｆ.
002600         MOVE NC"受診者情報Ｆ" TO ファイル名.
002610         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
002623*================================================================*
002630 オープンチェック SECTION.
002640*
002650     IF 状態キー  NOT =  "00"
002660         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002670         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002680         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002690                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
002700         ACCEPT  キー入力 FROM CONS
002710         PERFORM ファイル閉鎖
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM.
002731*================================================================*
002732 制御情報取得 SECTION.
002733*
009438* 制御区分02
009439     MOVE 02 TO 制－制御区分.
009440     READ 制御情報マスタ
009441     NOT INVALID KEY
009443        MOVE 制０２－北海道総括表区分  TO 北海道区分Ｗ 
009443        MOVE 制０２－青森総括表区分    TO 青森区分Ｗ 
009443        MOVE 制０２－岩手総括表区分    TO 岩手区分Ｗ 
009443        MOVE 制０２－宮城総括表区分    TO 宮城区分Ｗ 
009443        MOVE 制０２－秋田総括表区分    TO 秋田区分Ｗ 
009443        MOVE 制０２－山形総括表区分    TO 山形区分Ｗ 
009443        MOVE 制０２－福島総括表区分    TO 福島区分Ｗ 
009443        MOVE 制０２－茨城総括表区分    TO 茨城区分Ｗ 
009443        MOVE 制０２－栃木総括表区分    TO 栃木区分Ｗ 
009443        MOVE 制０２－群馬総括表区分    TO 群馬区分Ｗ 
009443        MOVE 制０２－埼玉総括表区分    TO 埼玉区分Ｗ 
009443        MOVE 制０２－千葉総括表区分    TO 千葉区分Ｗ 
009443        MOVE 制０２－東京総括表区分    TO 東京区分Ｗ 
009443        MOVE 制０２－神奈川総括表区分  TO 神奈川区分Ｗ 
009443        MOVE 制０２－新潟総括表区分    TO 新潟区分Ｗ 
009443        MOVE 制０２－富山総括表区分    TO 富山区分Ｗ 
009443        MOVE 制０２－石川総括表区分    TO 石川区分Ｗ 
009443        MOVE 制０２－福井総括表区分    TO 福井区分Ｗ 
009443        MOVE 制０２－山梨総括表区分    TO 山梨区分Ｗ 
009443        MOVE 制０２－長野総括表区分    TO 長野区分Ｗ 
009443        MOVE 制０２－岐阜総括表区分    TO 岐阜区分Ｗ 
009443        MOVE 制０２－静岡総括表区分    TO 静岡区分Ｗ 
009443        MOVE 制０２－愛知総括表区分    TO 愛知区分Ｗ 
009443        MOVE 制０２－三重総括表区分    TO 三重区分Ｗ 
009443        MOVE 制０２－滋賀総括表区分    TO 滋賀区分Ｗ 
009443        MOVE 制０２－京都総括表区分    TO 京都区分Ｗ 
009443        MOVE 制０２－大阪総括表区分    TO 大阪区分Ｗ 
009443        MOVE 制０２－兵庫総括表区分    TO 兵庫区分Ｗ 
009443        MOVE 制０２－奈良総括表区分    TO 奈良区分Ｗ 
009443        MOVE 制０２－和歌山総括表区分  TO 和歌山区分Ｗ 
009443        MOVE 制０２－鳥取総括表区分    TO 鳥取区分Ｗ 
009443        MOVE 制０２－島根総括表区分    TO 島根区分Ｗ 
009443        MOVE 制０２－岡山総括表区分    TO 岡山区分Ｗ 
009443        MOVE 制０２－広島総括表区分    TO 広島区分Ｗ 
009443        MOVE 制０２－山口総括表区分    TO 山口区分Ｗ 
009443        MOVE 制０２－徳島総括表区分    TO 徳島区分Ｗ 
009443        MOVE 制０２－香川総括表区分    TO 香川区分Ｗ 
009443        MOVE 制０２－愛媛総括表区分    TO 愛媛区分Ｗ 
009443        MOVE 制０２－高知総括表区分    TO 高知区分Ｗ 
009443        MOVE 制０２－福岡総括表区分    TO 福岡区分Ｗ 
009443        MOVE 制０２－佐賀総括表区分    TO 佐賀区分Ｗ 
009443        MOVE 制０２－長崎総括表区分    TO 長崎区分Ｗ 
009443        MOVE 制０２－熊本総括表区分    TO 熊本区分Ｗ 
009443        MOVE 制０２－大分総括表区分    TO 大分区分Ｗ 
009443        MOVE 制０２－宮崎総括表区分    TO 宮崎区分Ｗ 
009443        MOVE 制０２－鹿児島総括表区分  TO 鹿児島区分Ｗ 
009443        MOVE 制０２－沖縄総括表区分    TO 沖縄区分Ｗ 
009468     END-READ.
002739*
002740*================================================================*
002750 エラー表示 SECTION.
002760*
002770     DISPLAY NC"状態キー" 状態キー  UPON CONS.
002780     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
002790     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
002800     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
002810     ACCEPT  キー入力 FROM CONS.
002820     PERFORM ファイル閉鎖.
002830     MOVE 99 TO PROGRAM-STATUS.
002840     EXIT PROGRAM.
002850*================================================================*
002860 作業ファイル１作成 SECTION.
002870*
002880     OPEN OUTPUT 作業ファイル１.
002890         MOVE NC"作業" TO ファイル名.
002900         PERFORM オープンチェック.
002901*
002902     EVALUATE レセプト種類ＷＲ
002903*        **********************************
002904*        * 国保・社保・退職・組合・共済・自衛官
002905*        **********************************
002906         WHEN "KOKU"
002918         WHEN "SYAH"
002907         WHEN "KUMI"
002909         WHEN "KYOU"
002911         WHEN "TAIS"
002912         WHEN "JIEI"
002914             PERFORM 作業ファイル１作成１
002920*        *************
002921*        * 老人 *
002922*        *************
002923         WHEN "ROUJ"
002924             PERFORM 作業ファイル１作成３
002925*        *************
002926*        * 助成 *
002927*        *************
002928         WHEN "JYOS"
002929             PERFORM 作業ファイル１作成４
002930*        *************
002931*        * 全印刷    *
002932*        *************
002933         WHEN "ALL "
002934             PERFORM 作業ファイル１作成５
002940     END-EVALUATE.
002945*
003140     CLOSE 作業ファイル１.
003141*
003690*================================================================*
003700 作業ファイル１作成１ SECTION.
003710*
003720**********************************
003740* 国保・退職・組合・共済・自衛官
003750**********************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 1             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 1 )
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
003920                IF (受－保険種別  = 保険種別ＷＲ) OR
                         ((保険種別ＷＲ = 02) AND (受－保険種別 = 06 OR 07))
003923** 本人家族区分ありか
003924                   MOVE SPACE  TO  作成フラグ
003926                   IF 本人家族区分ＷＲ NOT = ZERO
003927                      IF 本人家族区分ＷＲ = 受－本人家族区分
003929                         MOVE "YES"  TO  作成フラグ
003930                      END-IF
003931                   ELSE
003932                      MOVE "YES"  TO  作成フラグ
003933                   END-IF 
003934** 県内県外か
003935                   IF 作成フラグ  = "YES"
003936                      MOVE SPACE  TO  作成フラグ
003937                      MOVE 受－保険種別 TO 保険種別県用ＷＫ
003938                      PERFORM 県内県外取得
003939*                    (県内1、県外2、両方0)
003940                      IF 県内県外ＷＲ NOT = ZERO
003941                         IF 県内県外ＷＲ = 1
003942                            IF 県内県外チェック = 1
003943                               MOVE "YES"  TO  作成フラグ
003944                            END-IF
003945                         ELSE
003946                            IF 県内県外チェック = ZERO
003947                               MOVE "YES"  TO  作成フラグ
003948                            END-IF
003949                         END-IF
003950                      ELSE
003951                         MOVE "YES"  TO  作成フラグ
003952                      END-IF 
003953                   END-IF 
003958*
003959                   IF 作成フラグ  = "YES"
                            PERFORM 印刷対象チェック
                            IF 印刷フラグ = "YES"
003964                         MOVE SPACE TO 作１－レコード
003965                         INITIALIZE 作１－レコード
003937                         MOVE 受－保険種別    TO 作１－保険種別
003967                         MOVE 受－保険者番号  TO 作１－保険者番号 作１－保険者番号正規
003968                         PERFORM レコードセット
003970                         PERFORM ファイル書込
                            END-IF
003981                   END-IF 
003991                END-IF 
004161             END-IF
004170             PERFORM レセプトＦ読込
004180         END-PERFORM
004190     END-IF.
004291*================================================================*
004292 作業ファイル１作成３ SECTION.
004293*
004294**********************************
004295*  老人
004296**********************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 2             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 2 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004319** 本人家族区分ありか
004320                MOVE SPACE  TO  作成フラグ
004321                IF 本人家族区分ＷＲ NOT = ZERO
004322                   IF 本人家族区分ＷＲ = 受－本人家族区分
004323                      MOVE "YES"  TO  作成フラグ
004324                   END-IF
004325                ELSE
004326                   MOVE "YES"  TO  作成フラグ
004327                END-IF 
004328** 県内県外か
004329                IF 作成フラグ  = "YES"
004330                   MOVE SPACE  TO  作成フラグ
004331                   MOVE 受－公費種別 TO 保険種別県用ＷＫ
004332                   PERFORM 県内県外取得
004333*                 (県内1、県外2、両方0)
004334                   IF 県内県外ＷＲ NOT = ZERO
004335                      IF 県内県外ＷＲ = 1
004336                         IF 県内県外チェック = 1
004337                            MOVE "YES"  TO  作成フラグ
004338                         END-IF
004339                      ELSE
004340                         IF 県内県外チェック = ZERO
004341                            MOVE "YES"  TO  作成フラグ
004342                         END-IF
004343                      END-IF
004344                   ELSE
004345                      MOVE "YES"  TO  作成フラグ
004346                   END-IF 
004347                END-IF 
004348*
004349                IF 作成フラグ  = "YES"
                         PERFORM 印刷対象チェック
                         IF 印刷フラグ = "YES"
004352                      MOVE SPACE TO 作１－レコード
004353                      INITIALIZE 作１－レコード
003937                      MOVE 受－公費種別           TO 作１－保険種別
004355                      MOVE 受－費用負担者番号     TO 作１－保険者番号 作１－保険者番号正規
004356                      PERFORM レコードセット
004357                      PERFORM 老人料金計算
004358* 請求額が ZERO の時は、書き込まない。
004359                      IF  作１－請求額 NOT = ZERO
004360                          PERFORM ファイル書込
004361                      END-IF
                         END-IF
004363                END-IF 
004364             END-IF
004365             PERFORM レセプトＦ読込
004366         END-PERFORM
004367     END-IF.
004368*================================================================*
004369 作業ファイル１作成４ SECTION.
004370*
004371**********************************
004372*  助成
004373**********************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 3             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 3 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004396** 本人家族区分ありか
004397                MOVE SPACE  TO  作成フラグ
004398                IF 本人家族区分ＷＲ NOT = ZERO
004399                   IF 本人家族区分ＷＲ = 受－本人家族区分
004400                      MOVE "YES"  TO  作成フラグ
004401                   END-IF
004402                ELSE
004403                   MOVE "YES"  TO  作成フラグ
004404                END-IF 
004405** 県内県外か
004406                IF 作成フラグ  = "YES"
004407                   MOVE SPACE  TO  作成フラグ
004408                   MOVE 受－助成種別 TO 保険種別県用ＷＫ
004409                   PERFORM 県内県外取得
004410*                 (県内1、県外2、両方0)
004411                   IF 県内県外ＷＲ NOT = ZERO
004412                      IF 県内県外ＷＲ = 1
004413                         IF 県内県外チェック = 1
004414                            MOVE "YES"  TO  作成フラグ
004415                         END-IF
004416                      ELSE
004417                         IF 県内県外チェック = ZERO
004418                            MOVE "YES"  TO  作成フラグ
004419                         END-IF
004420                      END-IF
004421                   ELSE
004422                      MOVE "YES"  TO  作成フラグ
004423                   END-IF 
004424                END-IF 
004425*
004426                IF 作成フラグ  = "YES"
                         PERFORM 印刷対象チェック
                         IF 印刷フラグ = "YES"
004434                      MOVE SPACE TO 作１－レコード
004435                      INITIALIZE 作１－レコード
003937                      MOVE 受－助成種別           TO 作１－保険種別
004437                      MOVE 受－費用負担者番号助成 TO 作１－保険者番号 作１－保険者番号正規
004438                      PERFORM レコードセット
004439                      PERFORM 助成料金計算
004446* 請求額が ZERO の時は、書き込まない。
004447                      IF  作１－請求額 NOT = ZERO
004448                         PERFORM ファイル書込
                            END-IF
004449                   END-IF
004451                END-IF
004452             END-IF
004453             PERFORM レセプトＦ読込
004454         END-PERFORM
004455     END-IF.
004456*================================================================*
004457 作業ファイル１作成５ SECTION.
004458*
004459*********************
004460* 全出力 *
004461*********************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE ZERO          TO レセ－レセ種別.
005200     MOVE ZERO          TO レセ－施術和暦.
005210     MOVE ZERO          TO レセ－施術年.  
005220     MOVE ZERO          TO レセ－施術月.  
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
004472     END-START.
004473     IF 状態キー = "00"
004474         MOVE SPACE  TO 終了フラグ
003720         PERFORM レセプトＦ読込
004476         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   )
003770             PERFORM データチェック
004492** 労災・自賠責・自費・生保単独　除く
004493             IF  レセ－レセ種別 = 4 OR 5 OR 6 OR 7
004494                 MOVE SPACE  TO 実行キーＷ
004495             END-IF
004497             IF 実行キーＷ = "YES"
004481** 本人家族区分ありか
004482                MOVE SPACE  TO  作成フラグ
004483                IF 本人家族区分ＷＲ NOT = ZERO
004484                   IF 本人家族区分ＷＲ = 受－本人家族区分
004485                      MOVE "YES"  TO  作成フラグ
004486                   END-IF
004487                ELSE
004488                   MOVE "YES"  TO  作成フラグ
004489                END-IF 
004490                IF 作成フラグ  = "YES"
004500*
005610                   EVALUATE TRUE
004501*                ******************
004502*                * 健保 老人含まず*
004503*                ******************
013940                   WHEN レセ－レセ種別   = 1
004508**                 / 県内県外か /
004509                       MOVE SPACE  TO  作成フラグ
004510                       MOVE 受－保険種別 TO 保険種別県用ＷＫ
004511                       PERFORM 県内県外取得
004512*                     (県内1、県外2、両方0)
004513                       IF 県内県外ＷＲ NOT = ZERO
004514                          IF 県内県外ＷＲ = 1
004515                             IF 県内県外チェック = 1
004516                                MOVE "YES"  TO  作成フラグ
004517                             END-IF
004518                          ELSE
004519                             IF 県内県外チェック = ZERO
004520                                MOVE "YES"  TO  作成フラグ
004521                             END-IF
004522                          END-IF
004523                       ELSE
004524                          MOVE "YES"  TO  作成フラグ
004525                       END-IF 
004530**
004531                       IF 作成フラグ  = "YES"
                                PERFORM 印刷対象チェック
                                IF 印刷フラグ = "YES"
004532                             MOVE SPACE TO 作１－レコード
004533                             INITIALIZE 作１－レコード
003937                             MOVE 受－保険種別    TO 作１－保険種別
004535                             MOVE 受－保険者番号  TO 作１－保険者番号 作１－保険者番号正規
004536                             PERFORM レコードセット
004538                             PERFORM ファイル書込
                                END-IF
004539                       END-IF
004542*                ********
004543*                * 老人 *
004544*                ********
                         WHEN レセ－レセ種別   = 2 
004547**                 / 県内県外か /
004548                       MOVE SPACE  TO  作成フラグ
004549                       MOVE 受－公費種別 TO 保険種別県用ＷＫ
004550                       PERFORM 県内県外取得
004551*                     (県内1、県外2、両方0)
004552                       IF 県内県外ＷＲ NOT = ZERO
004553                          IF 県内県外ＷＲ = 1
004554                             IF 県内県外チェック = 1
004555                                MOVE "YES"  TO  作成フラグ
004556                             END-IF
004557                          ELSE
004558                             IF 県内県外チェック = ZERO
004559                                MOVE "YES"  TO  作成フラグ
004560                             END-IF
004561                          END-IF
004562                       ELSE
004563                          MOVE "YES"  TO  作成フラグ
004564                       END-IF 
004565**
004566                       IF 作成フラグ  = "YES"
                                PERFORM 印刷対象チェック
                                IF 印刷フラグ = "YES"
004567                             MOVE SPACE TO 作１－レコード
004568                             INITIALIZE 作１－レコード
003937                             MOVE 受－公費種別           TO 作１－保険種別
004570                             MOVE 受－費用負担者番号     TO 作１－保険者番号 作１－保険者番号正規
004571                             PERFORM レコードセット
004580                             PERFORM 老人料金計算
004581* 請求額が ZERO の時は、書き込まない。
004582                             IF  作１－請求額 NOT = ZERO
004583                                 PERFORM ファイル書込
004584                             END-IF
                                END-IF
004594                       END-IF
004610*                ********
004620*                * 助成 *
004630*                ********
                         WHEN レセ－レセ種別   = 3
004651**                 / 県内県外か /
004652                       MOVE SPACE  TO  作成フラグ
004653                       MOVE 受－助成種別 TO 保険種別県用ＷＫ
004654                       PERFORM 県内県外取得
004655*                     (県内1、県外2、両方0)
004656                       IF 県内県外ＷＲ NOT = ZERO
004657                          IF 県内県外ＷＲ = 1
004658                             IF 県内県外チェック = 1
004659                                MOVE "YES"  TO  作成フラグ
004660                             END-IF
004661                          ELSE
004662                             IF 県内県外チェック = ZERO
004663                                MOVE "YES"  TO  作成フラグ
004664                             END-IF
004665                          END-IF
004666                       ELSE
004667                          MOVE "YES"  TO  作成フラグ
004668                       END-IF 
004669**
004670                       IF 作成フラグ  = "YES"
                                PERFORM 印刷対象チェック
                                IF 印刷フラグ = "YES"
004671                             MOVE SPACE TO 作１－レコード
004672                             INITIALIZE 作１－レコード
003937                             MOVE 受－助成種別           TO 作１－保険種別
004674                             MOVE 受－費用負担者番号助成 TO 作１－保険者番号 作１－保険者番号正規
004680                             PERFORM レコードセット
004690                             PERFORM 助成料金計算
004697* 請求額が ZERO の時は、書き込まない。
004698                             IF  作１－請求額 NOT = ZERO
004699                                 PERFORM ファイル書込
                                   END-IF
004700                          END-IF
004701                       END-IF
004710                   END-EVALUATE
004711                END-IF
004712             END-IF
004720             PERFORM レセプトＦ読込
004730         END-PERFORM
004740     END-IF.
004450*================================================================*
006930 レセプトＦ読込 SECTION.
006940*
006950     READ レセプトＦ NEXT
004490     AT END
004500         MOVE "YES" TO 終了フラグ
004510     END-READ.
004811*================================================================*
004812 データチェック SECTION.
004813*
004814     MOVE SPACE          TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
      *
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
004860*
004868*================================================================*
004869 レコードセット SECTION.
004870*
004871     MOVE レセ－請求和暦    TO 作１－請求和暦.
004872     MOVE レセ－請求年      TO 作１－請求年.
004873     MOVE レセ－請求月      TO 作１－請求月.
005480     MOVE レセ－負担割合    TO 作１－負担割合.
005480     MOVE レセ－レセ実日数  TO 作１－実日数.
004874     MOVE 受－施術和暦      TO 作１－施術和暦.
004875     MOVE 受－施術年        TO 作１－施術年.
004876     MOVE 受－施術月        TO 作１－施術月.
004878     MOVE 受－患者コード    TO 作１－患者コード.
004910     MOVE 受－患者カナ      TO 作１－患者カナ.
004910     MOVE 受－患者氏名      TO 作１－患者氏名.
004920     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
004939     MOVE 受－本人家族区分  TO 作１－本人家族区分.
005526     IF 受－公費種別 NOT = ZERO
005534         MOVE 1             TO 作１－本人家族区分
           END-IF.
           MOVE 受－保険種別      TO 作１－親保険種別.
005542     PERFORM 分類取得.
004954*
005240*================================================================*
005250 老人料金計算 SECTION.
005260*
005340     MOVE レセ－合計         TO 作１－費用額.
005350     MOVE レセ－一部負担金   TO 作１－負担額.
005360     MOVE レセ－請求金額     TO 作１－請求額.
005361*
005370*================================================================*
005380 助成料金計算 SECTION.
005390*
005210     MOVE レセ－合計         TO 作１－費用額.
005220     MOVE レセ－受給者負担額 TO 作１－負担額.
005230     MOVE レセ－助成請求金額 TO 作１－請求額.
005491*
005705*================================================================*
005706 分類取得 SECTION.
005707***************************************************
005708* 分類コード
005709*  1:社保・日雇
      *  2:船員
005710*  3:組合
      *  4:共済・自衛官
005711*  5:1:国保 1:退職 2:後高 3:助成（東京・愛知・高知以外）
005712*  6:助成（東京・愛知・高知）
005716*     /15.6.18 京都の後期高齢の障害で"39261"も直送分へ
005716*
      *  県固有
      *  大阪
      *  5:1:後高 1:助成（親が後高） 2:国保 2:退職 2:助成（親保険が後高以外・東京・愛知・高知以外）
005718***************************************************
005719*
005720     IF レセ－レセ種別  = 3
               IF (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39") OR
                  ((受－費用負担者番号助成(1:5) = "39261") AND (受－公費種別 = 5))
005726            MOVE  6  TO  作１－分類コード
               ELSE
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 30 TO  作１－保険順
               END-IF
005742         MOVE 受－費用負担者番号助成(3:2) TO 作１－県コード
005728     ELSE
005729         IF 受－公費種別 = ZERO
005730*       / 健保 /
005731             EVALUATE 受－保険種別
005741             WHEN 01
005743                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(1:2) TO 作１－県コード
005732             WHEN 02
005733             WHEN 06
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005734             WHEN 07
005736                 MOVE 2  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005737             WHEN 03
005740                 MOVE 3  TO  作１－分類コード
005738             WHEN 04
005739             WHEN 09
005740                 MOVE 4  TO  作１－分類コード
005753             WHEN 08
005755                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005765             END-EVALUATE
005766*
005767         ELSE
005768*       / 老人 /
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 20 TO  作１－保険順
005742             MOVE 受－費用負担者番号(3:2) TO 作１－県コード
005778         END-IF
005779     END-IF.
           IF (大阪区分Ｗ = 1) AND (作１－分類コード = 5)
005720         IF レセ－レセ種別  = 3
                  IF 受－費用負担者番号助成(3:2) = "27"
005729               IF 受－公費種別 = ZERO
005743                  MOVE 21 TO  作１－保険順
                     ELSE
005743                  MOVE 11 TO  作１－保険順
                     END-IF
010202               IF 受－助保険助成(1:3) = "274"
010203                   EVALUATE 受－法別番号助成
010204                   WHEN 41
010205                       MOVE 41274002           TO 作１－保険者番号
010206                   WHEN 80
010207                       MOVE 80274004           TO 作１－保険者番号
010208                   WHEN 82
010209                       MOVE 82274002           TO 作１－保険者番号
010210                   WHEN 83
010211                       MOVE 83274001           TO 作１－保険者番号
010212                   WHEN 86
010213                       MOVE 86274008           TO 作１－保険者番号
                         WHEN 87
009990                       MOVE "87274007"         TO 作１－保険者番号
010214                   WHEN OTHER
010215                       MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010216                   END-EVALUATE
010217               ELSE
010218                   IF ( 受－費用負担者番号助成(3:3) = "275" ) OR ( 受－費用負担者番号助成(3:5) = "27002" )
010219                       EVALUATE 受－法別番号助成
010220                       WHEN 41
010221                           MOVE 41275009           TO 作１－保険者番号
010222                       WHEN 80
010223                           MOVE 80275001           TO 作１－保険者番号
010224                       WHEN 82
010225                           MOVE 82275009           TO 作１－保険者番号
010226                       WHEN 86
010227                           MOVE 86275005           TO 作１－保険者番号
010228                       WHEN OTHER
010229                           MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010230                       END-EVALUATE
010231                   ELSE
010232                       MOVE 受－費用負担者番号助成  TO 作１－保険者番号
010233                   END-IF
                     END-IF
010234            END-IF
005728         ELSE
005729            IF 受－公費種別 = ZERO
005730*       / 健保 /
005731               EVALUATE 受－保険種別
005741               WHEN 01
                         IF 受－保険者番号(1:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009114                      IF 受－保険者番号(1:3) = "274"
009115                          MOVE 00274001       TO 作１－保険者番号
009116                      ELSE
009117                          IF ( 受－保険者番号(1:3) = "275" ) OR ( 受－保険者番号(1:5) = "27002" )
009118                             MOVE 00275008       TO 作１－保険者番号
009119                          ELSE
009120                             MOVE 00             TO 法別番号ＷＲ
009121                             MOVE 受－保険者番号 TO 保番ＷＲ
009121                             MOVE 保険者番号ＷＲ TO 作１－保険者番号
009122                          END-IF
                            END-IF
009123                   END-IF
005753               WHEN 08
                         IF 受－保険者番号(3:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009125                      IF 受－保番(1:3) = "274"
009126                         MOVE 67274001       TO 作１－保険者番号
009127                      ELSE
009128                         IF ( 受－保険者番号(3:3) = "275" ) OR ( 受－保険者番号(3:5) = "27002" )
009129                            MOVE 67275008       TO 作１－保険者番号
009130                         ELSE
009131                            MOVE 受－保険者番号 TO 作１－保険者番号
009132                         END-IF
009133                      END-IF
                         END-IF
005765               END-EVALUATE
005767            ELSE
005768*       / 老人 /
                     IF 受－費用負担者番号(3:2) = "27"
005743                  MOVE 10 TO  作１－保険順
009672                  IF 受－助保険老人(1:3) = "274"
009673                     MOVE 27274000          TO 作１－保険者番号
009674                  ELSE
009675                     IF ( 受－費用負担者番号(3:3) = "275" ) OR ( 受－費用負担者番号(3:5) = "27002" )
009676                        MOVE 27275007           TO 作１－保険者番号
009677                     ELSE
009678                        MOVE 受－費用負担者番号 TO 作１－保険者番号
009679                     END-IF
009680                  END-IF
      */後期高齢は代表番号にまとめる/080419
                        IF 受－保険者番号(1:4) = "3927"
                           MOVE "39270004" TO 作１－保険者番号
                        END-IF
005778               END-IF
                  END-IF
005778         END-IF
005779     END-IF.
005780*
006951*================================================================*
006952 印刷対象チェック  SECTION.
006953*
      */６号誌のみのときは組合、共済、直送分は出さない
      *
006957     MOVE "YES" TO 印刷フラグ.
           IF 連入－用紙種類 = 1
006963        IF (レセ－レセ種別 = 1) AND (受－保険種別 = 03 OR 04 OR 09)
006986            MOVE SPACE TO 印刷フラグ
              END-IF
006988        IF (レセ－レセ種別 = 3) AND
                 ((受－助成種別 >= 50) AND (受－助成種別 <= 60)) AND
                 (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39" OR "26")
006990              MOVE SPACE TO 印刷フラグ
006991        END-IF
            END-IF.
      *
            IF 印刷フラグ = "YES"
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 01)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 01))
                    IF (北海道区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 02)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 02))
                    IF (青森区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 03)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 03))
                    IF (岩手区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 04)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 04))
                    IF (宮城区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 05)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 05))
                    IF (秋田区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 06)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 06))
                    IF (山形区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 07)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 07))
                    IF (福島区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 08)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 08))
                    IF (茨城区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 09)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 09))
                    IF (栃木区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 10)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 10))
                    IF (群馬区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 11)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 11))
                    IF (埼玉区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
      */千葉は県固有選択になっていても６７号を出す*/150409
      *           IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 12)) OR
      *              ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 12))
      *              IF (千葉区分Ｗ = ZERO)
009576*                 MOVE "YES" TO 印刷フラグ
      *              ELSE
009576*                 MOVE SPACE TO 印刷フラグ
009577*              END-IF
009577*           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 13)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 13))
                    IF (東京区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 14)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 14))
                    IF (神奈川区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 15)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 15))
                    IF (新潟区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 16)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 16))
                    IF (富山区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 17)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 17))
                    IF (石川区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 18)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 18))
                    IF (福井区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 19)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 19))
                    IF (山梨区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 20)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 20)) OR
                    (((受－助成種別 >= 50) AND (受－助成種別 <= 60)) AND (受－費用負担者番号助成(3:2) = 20))
                    IF (長野区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 21)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 21))
                    IF (岐阜区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 22)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 22))
                    IF (静岡区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 23)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 23))
                    IF (愛知区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 24)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 24))
                    IF (三重区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 25)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 25))
                    IF (滋賀区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 26)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 26)) OR
                    ((受－助成種別 >= 50) AND (受－助成種別 <= 60))
                    IF (京都区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
                       IF (レセ－レセ種別 = 3) AND (受－保険種別 = 05) AND
                          (受－助成種別 = 53) AND (受－費用負担者番号助成(1:4) = 3926)
009576                    MOVE "YES" TO 印刷フラグ
                       ELSE
009576                    MOVE SPACE TO 印刷フラグ
                       END-IF
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 27)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 27)) OR
                    (((受－助成種別 >= 50) AND (受－助成種別 <= 60)) AND (受－費用負担者番号助成(3:2) = 27))
                    IF (大阪区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 28)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 28))
                    IF (兵庫区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 29)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 29))
                    IF (奈良区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 30)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 30))
                    IF (和歌山区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 31)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 31))
                    IF (鳥取区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 32)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 32))
                    IF (島根区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 33)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 33))
                    IF (岡山区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 34)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 34))
                    IF (広島区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 35)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 35))
                    IF (山口区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 36)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 36))
                    IF (徳島区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 37)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 37))
                    IF (香川区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 38)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 38))
                    IF (愛媛区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 39)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 39))
                    IF (高知区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 40)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 40))
                    IF (福岡区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 41)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 41))
                    IF (佐賀区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 42)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 42))
                    IF (長崎区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 43)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 43))
                    IF (熊本区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 44)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 44))
                    IF (大分区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 45)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 45))
                    IF (宮崎区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 46)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 46))
                    IF (鹿児島区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
009577           END-IF
                 IF ((受－保険種別 = 01) AND (受－保険者番号(1:2) = 47)) OR
                    ((受－保険種別 = 08 OR 05) AND (受－保険者番号(3:2) = 47))
                    IF (沖縄区分Ｗ = ZERO)
009576                 MOVE "YES" TO 印刷フラグ
                    ELSE
009576                 MOVE SPACE TO 印刷フラグ
009577              END-IF
                 END-IF
009581     END-IF.
      */神奈川県石油業06141261 を６号の対象外にする/120427
           IF 受－保険者番号 = "06141261"
006957         MOVE SPACE TO 印刷フラグ
           END-IF.
006996*
005500*================================================================*
005510 ファイル書込 SECTION.
005520*
005530     WRITE 作１－レコード
005540     INVALID KEY
005550         MOVE NC"作業"  TO ファイル名
005560         PERFORM エラー表示
005570     END-WRITE.
005580*================================================================*
005590 作業ファイル２作成 SECTION.
005600*
005610     OPEN INPUT  作業ファイル１.
005620     OPEN OUTPUT 作業ファイル２.
005630*
005640     PERFORM 作業ファイル２作成処理.
005650*
005660     CLOSE 作業ファイル２.
005670     CLOSE 作業ファイル１.
005680*================================================================*
005690 作業ファイル２作成処理 SECTION.
005700*
005813     MOVE SPACE TO 終了フラグ２.
005940*
005950     PERFORM 作業ファイル１読込.
006020     PERFORM UNTIL 終了フラグ２ = "YES"
006120         MOVE 作１－保険者番号   TO 保険者番号Ｗ
006030*
006040         MOVE SPACE TO 作２－レコード
006050         INITIALIZE 作２－レコード
               INITIALIZE 集計作業用Ｗ
               PERFORM UNTIL (終了フラグ２ = "YES") OR
                             (作１－保険者番号 NOT = 保険者番号Ｗ)
      */150620 京都の県固有を指定した時、後高の障害は７号誌を出すため、親保険が後高ではないものは集計しない
                   IF (京都区分Ｗ = 1) AND
                      ((作１－保険種別 = 53) AND (作２－保険者番号(1:5) = 39261)) AND
                      (作１－親保険種別 NOT = 05)
                      CONTINUE
                   ELSE
006060                PERFORM 作業レコード２累計
006070*
006120                MOVE 作１－請求和暦年月 TO 作２－請求和暦年月
006120                MOVE 作１－分類コード   TO 作２－分類コード
006120                MOVE 作１－県コード     TO 作２－県コード
006120                MOVE 作１－保険順       TO 作２－保険順
006120                MOVE 作１－保険種別     TO 作２－保険種別
006120                MOVE 作１－保険者番号   TO 作２－保険者番号 保険者番号Ｗ
                   END-IF
006140             PERFORM 作業ファイル１読込
006150         END-PERFORM
006160         PERFORM 作業レコード２セット
006170         PERFORM 作業ファイル２書込
006180     END-PERFORM.
006190*================================================================*
006200 作業ファイル１読込 SECTION.
006210*
006220     READ 作業ファイル１ NEXT
006230     AT END
006240         MOVE "YES" TO 終了フラグ２
006250     END-READ.
006260*================================================================*
006270 作業レコード２累計 SECTION.
006280*
006490     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
006540*===============================================================*
006550 作業レコード２セット SECTION.
006560*
006630     MOVE 件数Ｗ         TO 作２－件数.
006680*===============================================================*
006690 作業ファイル２書込 SECTION.
006700*
006710     WRITE 作２－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作２" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006790*================================================================*
006800 ファイル閉鎖 SECTION.
006810*
006820     CLOSE 制御情報マスタ 受診者情報Ｆ レセプトＦ.
006830*================================================================*
006840 終了処理 SECTION.
006850*
006860     PERFORM ファイル閉鎖.
006870*================================================================*
006871*================================================================*
006872 県内県外取得 SECTION.
006873*
006874      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
006875      EVALUATE  保険種別県用ＷＫ
006876* 国保
006877      WHEN  01
006878         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
006879            MOVE  1  TO  県内県外チェック
006880         END-IF
006881         MOVE 受－保険者番号(1:2) TO 県ＷＫ
006882* 社保
006883      WHEN  02
      */協会健保の対応/081009
               IF 受－保険者番号(5:5) = SPACE
006884             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
006885                MOVE  1  TO  県内県外チェック
006886             END-IF
006887             MOVE 受－保険者番号(1:2) TO 県ＷＫ
006888             PERFORM 県統一
006889             MOVE 県統一ＷＫ TO 県ＷＫ
               ELSE
                   IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
                       MOVE  1  TO  県内県外チェック
                   END-IF
                   MOVE 受－保険者番号(3:2) TO 県ＷＫ
               END-IF
006890* 船員
006891* 日雇
006892* 組合
006893* 共済
006894* 自衛官
006895* 退職国保
006896      WHEN  06
006897      WHEN  07
006898      WHEN  08
006899      WHEN  09
006900      WHEN  04
006901      WHEN  03
006902         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
006903            MOVE  1  TO  県内県外チェック
006904         END-IF
006905         MOVE 受－保険者番号(3:2) TO 県ＷＫ
006906* 助成
006907      WHEN 50 THRU 60
006915         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
006916            MOVE  1  TO  県内県外チェック
006917         END-IF
006918         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
006919* 老人
006920      WHEN  05
006921         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
006922            MOVE  1  TO  県内県外チェック
006923         END-IF
006924         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
006926* 労災、自賠責・自費・生保単独は除外
006927      WHEN  70
006928      WHEN  80
006928      WHEN  85
006929      WHEN  90
006930      WHEN  ZERO
006931         CONTINUE
006932*
006933     WHEN OTHER
006934         MOVE SPACE                TO エラーメッセージＷ
006935         MOVE 受－患者コード       TO エラー患者コードＷ
006936         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
006937         MOVE "-"                  TO エラー区切りＷ
006938         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
006939         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
006940         CALL   "MSG003"
006941         CANCEL "MSG003"
006942     END-EVALUATE.
006943*
006944*================================================================*
006945 県統一 SECTION.
006946*
006947     MOVE ZERO  TO  県統一ＷＫ.
006948     EVALUATE  県ＷＫ
006949*北海道
006950      WHEN  01
006951         MOVE 01 TO 県統一ＷＫ
006952*青森
006953      WHEN  02
006954         MOVE 02 TO 県統一ＷＫ
006955*岩手
006956      WHEN  03
006957         MOVE 03 TO 県統一ＷＫ
006958*宮城
006959      WHEN  04
006960         MOVE 04 TO 県統一ＷＫ
006961*秋田
006962      WHEN  05
006963         MOVE 05 TO 県統一ＷＫ
006964*山形
006965      WHEN  06
006966         MOVE 06 TO 県統一ＷＫ
006967*福島
006968      WHEN  07
006969         MOVE 07 TO 県統一ＷＫ
006970*茨城
006971      WHEN  08
006972         MOVE 08 TO 県統一ＷＫ
006973*栃木
006974      WHEN  09
006975         MOVE 09 TO 県統一ＷＫ
006976*群馬
006977      WHEN  10
006978         MOVE 10 TO 県統一ＷＫ
006979*埼玉
006980      WHEN  11
006981         MOVE 11 TO 県統一ＷＫ
006982*千葉
006983      WHEN  12
006984         MOVE 12 TO 県統一ＷＫ
006985*東京
006986      WHEN  21
006987         MOVE 13 TO 県統一ＷＫ
006988*神奈川
006989      WHEN  31
006990         MOVE 14 TO 県統一ＷＫ
006991*新潟
006992      WHEN  32
006993         MOVE 15 TO 県統一ＷＫ
006994*富山
006995      WHEN  33
006996         MOVE 16 TO 県統一ＷＫ
006997*石川
006998      WHEN  34
006999         MOVE 17 TO 県統一ＷＫ
007000*福井
007001      WHEN  35
007002         MOVE 18 TO 県統一ＷＫ
007003*山梨
007004      WHEN  36
007005         MOVE 19 TO 県統一ＷＫ
007006*長野
007007      WHEN  37
007008         MOVE 20 TO 県統一ＷＫ
007009*岐阜
007010      WHEN  38
007011         MOVE 21 TO 県統一ＷＫ
007012*静岡
007013      WHEN  39
007014         MOVE 22 TO 県統一ＷＫ
007015*愛知
007016      WHEN  51
007017         MOVE 23 TO 県統一ＷＫ
007018*三重
007019      WHEN  52
007020         MOVE 24 TO 県統一ＷＫ
007021*滋賀
007022      WHEN  53
007023         MOVE 25 TO 県統一ＷＫ
007024*京都
007025      WHEN  54
007026         MOVE 26 TO 県統一ＷＫ
007027*大阪
007028      WHEN  41
007029         MOVE 27 TO 県統一ＷＫ
007030*兵庫
007031      WHEN  42
007032         MOVE 28 TO 県統一ＷＫ
007033*奈良
007034      WHEN  55
007035         MOVE 29 TO 県統一ＷＫ
007036*和歌山
007037      WHEN  56
007038         MOVE 30 TO 県統一ＷＫ
007039*鳥取
007040      WHEN  57
007041         MOVE 31 TO 県統一ＷＫ
007042*島根
007043      WHEN  58
007044         MOVE 32 TO 県統一ＷＫ
007045*岡山
007046      WHEN  59
007047         MOVE 33 TO 県統一ＷＫ
007048*広島
007049      WHEN  60
007050         MOVE 34 TO 県統一ＷＫ
007051*山口
007052      WHEN  61
007053         MOVE 35 TO 県統一ＷＫ
007054*徳島
007055      WHEN  71
007056         MOVE 36 TO 県統一ＷＫ
007057*香川
007058      WHEN  72
007059         MOVE 37 TO 県統一ＷＫ
007060*愛媛
007061      WHEN  73
007062         MOVE 38 TO 県統一ＷＫ
007063*高知
007064      WHEN  74
007065         MOVE 39 TO 県統一ＷＫ
007066*福岡
007067      WHEN  75
007068         MOVE 40 TO 県統一ＷＫ
007069*佐賀
007070      WHEN  76
007071         MOVE 41 TO 県統一ＷＫ
007072*長崎
007073      WHEN  77
007074         MOVE 42 TO 県統一ＷＫ
007075*熊本
007076      WHEN  78
007077         MOVE 43 TO 県統一ＷＫ
007078*大分
007079      WHEN  79
007080         MOVE 44 TO 県統一ＷＫ
007081*宮崎
007082      WHEN  80
007083         MOVE 45 TO 県統一ＷＫ
007084*鹿児島
007085      WHEN  81
007086         MOVE 46 TO 県統一ＷＫ
007087*沖縄
007088      WHEN  82
007089         MOVE 47 TO 県統一ＷＫ
007090*その他
007091      WHEN  OTHER
007092         CONTINUE
007093     END-EVALUATE.
007094*
007167*================================================================*
007168*================================================================*
007169******************************************************************
007170 END PROGRAM YHN432.
007171******************************************************************
