000001******************************************************************
000002*            IDENTIFICATION      DIVISION                        *
000003******************************************************************
000004 IDENTIFICATION          DIVISION.
000005 PROGRAM-ID.             YHN431.
000006 AUTHOR.                 池田　幸子
000007*
000008*----------------------------------------------------------------*
000009*         請求書一括【ﾃﾞｰﾀ作成】柔＋ｳｨﾝﾄﾞｳｽﾞ
000010*  請求年月バージョン 
000011*         MED = YHN430 
000012*----------------------------------------------------------------*
000013 DATE-WRITTEN.           2015-02-24
000014 DATE-COMPILED.          2015-02-24
000015*----------------------------------------------------------------*
000016******************************************************************
000017*            ENVIRONMENT         DIVISION                        *
000018******************************************************************
000019 ENVIRONMENT             DIVISION.
000020 CONFIGURATION           SECTION.
000021 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000022 OBJECT-COMPUTER.        FMV-DESKPOWER.
000023 SPECIAL-NAMES.          CONSOLE  IS  CONS
000024                         SYSERR   IS  MSGBOX.
000025 INPUT-OUTPUT            SECTION.
000026 FILE-CONTROL.
000027     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000028                             ORGANIZATION             IS  INDEXED
000029                             ACCESS MODE              IS  DYNAMIC
000030                             RECORD KEY               IS  制－制御区分
000031                             FILE STATUS              IS  状態キー
000032                             LOCK        MODE         IS  AUTOMATIC.
000033     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000034                             ORGANIZATION             IS  INDEXED
000035                             ACCESS MODE              IS  DYNAMIC
000036                             RECORD KEY               IS 受－施術和暦年月
000037                                                          受－患者コード
000038                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000039                                                          受－患者カナ
000040                                                          受－患者コード
000041                             ALTERNATE RECORD KEY     IS  受－患者コード
000042                                                         受－施術和暦年月
000043                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000044                                                          受－保険種別
000045                                                          受－保険者番号
000046                                                          受－患者コード
000047                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000048                                                          受－公費種別
000049                                                     受－費用負担者番号
000050                                                          受－患者コード
000051                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000052                                                          受－助成種別
000053                                                  受－費用負担者番号助成
000054                                                          受－患者コード
000055                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000056                                                      受－施術和暦年月
000057                                                      受－患者コード
000058                             FILE STATUS              IS  状態キー
000059                             LOCK        MODE         IS  AUTOMATIC.
000078     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000079                             ORGANIZATION             IS  INDEXED
000080                             ACCESS MODE              IS  DYNAMIC
000081                             RECORD KEY               IS  請先－保険種別
000082                                                          請先－保険者番号
000083                             FILE STATUS              IS  状態キー
000084                             LOCK    MODE             IS  AUTOMATIC.
000085     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000086                             ORGANIZATION             IS  INDEXED
000087                             ACCESS MODE              IS  DYNAMIC
000088                             RECORD KEY               IS  市－公費種別
000089                                                          市－市町村番号
000090                             ALTERNATE RECORD KEY     IS  市－公費種別
000091                                                          市－市町村名称
000092                                                          市－市町村番号
000093                             FILE STATUS              IS  状態キー
000094                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000095     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
000096                             ORGANIZATION             IS  INDEXED
000097                             ACCESS                   IS  DYNAMIC
000905                             RECORD      KEY          IS  作１－請求和暦年月
000907                                                          作１－分類コード
                                                                作１－県コード
                                                                作１－保険順
000908                                                          作１－保険者番号
000909                                                          作１－本人家族区分
                                                                作１－負担割合
000910                                                          作１－患者カナ
000911                                                          作１－患者コード
000912                                                          作１－施術和暦年月
000106                             FILE        STATUS       IS  状態キー
000107                             LOCK        MODE         IS  AUTOMATIC.
000108     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4312L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作２－請求和暦年月
000112                                                          作２－分類コード
000112                                                          作２－県コード
000112                                                          作２－保険順
000113                                                          作２－保険者番号
000119                             FILE        STATUS       IS  状態キー
000120                             LOCK        MODE         IS  AUTOMATIC.
000108     SELECT  作業ファイル共  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W43121L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作共－請求和暦年月
000112                                                          作共－分類コード
000112                                                          作共－県コード
000112                                                          作共－保険順
000113                                                          作共－保険者番号
000911                                                          作共－患者コード
000912                                                          作共－施術和暦年月
000119                             FILE        STATUS       IS  状態キー
000120                             LOCK        MODE         IS  AUTOMATIC.
000121******************************************************************
000122*                      DATA DIVISION                             *
000123******************************************************************
000124 DATA                    DIVISION.
000125 FILE                    SECTION.
000126*                           ［ＲＬ＝  ２５６］
000127 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000128     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000991     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
000129*                           ［ＲＬ＝  ３２０］
000130 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000131     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
000138*                           ［ＲＬ＝  １２８］
000139 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
000140     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
000141*                           ［ＲＬ＝  ２５６］
000142 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
000143     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
000144* 
001190 FD  作業ファイル１ RECORD  CONTAINS 256 CHARACTERS.
001200 01  作１－レコード.
001210     03  作１－レコードキー.
001220         05  作１－請求和暦年月.
001230             07  作１－請求和暦            PIC 9.
001240             07  作１－請求年              PIC 9(2).
001250             07  作１－請求月              PIC 9(2).
001261         05  作１－分類コード              PIC 9(1).
001261         05  作１－県コード                PIC X(2).
001400         05  作１－保険順                  PIC 9(2).
001271         05  作１－保険者番号.
001530             07 作１－法別番号             PIC X(2).
001540             07 作１－保番.
001550                09 作１－都道府県番号      PIC X(2).
001560                09 作１－保険番号          PIC X(3).
001570                09 作１－検証番号ＷＲ      PIC X.
001580                09 FILLER                  PIC X(2).
001280         05  作１－本人家族区分            PIC 9.
               05  作１－負担割合                PIC 9(2).
001300         05  作１－患者カナ                PIC X(50).
001310         05  作１－患者コード.
001320             07 作１－患者番号             PIC 9(6).
001330             07 作１－枝番                 PIC X(1).
001340         05  作１－施術和暦年月.
001350             07  作１－施術和暦            PIC 9.
001360             07  作１－施術年              PIC 9(2).
001370             07  作１－施術月              PIC 9(2).
000164     03  作１－レコードデータ.
000165         05  作１－被保険者氏名            PIC X(50).
000166         05  作１－患者氏名                PIC X(50).
001400         05  作１－保険種別                PIC 9(2).
001271         05  作１－保険者番号正規          PIC X(8).
000167         05  作１－費用額                  PIC 9(6).
000168         05  作１－負担額                  PIC 9(6).
000169         05  作１－請求額                  PIC 9(6).
000169         05  作１－実日数                  PIC 9(2).
001400         05  作１－親保険種別              PIC 9(2).
000172         05  FILLER                        PIC X(37).
000173*
000174*                           ［ＲＬ＝  １２８］
000175 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
000176 01  作２－レコード.
000177     03  作２－レコードキー.
000178         05  作２－請求和暦年月.
000179             07  作２－請求和暦              PIC 9.
000180             07  作２－請求年                PIC 9(2).
000181             07  作２－請求月                PIC 9(2).
001261         05  作２－分類コード                PIC 9(1).
001261         05  作２－県コード                  PIC X(2).
001400         05  作２－保険順                    PIC 9(2).
000183         05  作２－保険者番号                PIC X(10).
000188     03  作２－レコードデータ.
001400         05  作２－保険種別                  PIC 9(2).
000189         05  作２－件数                      PIC 9(4).
000190         05  作２－費用額                    PIC 9(9).
000191         05  作２－負担額                    PIC 9(9).
000192         05  作２－請求額                    PIC 9(9).
000193         05  作２－本人件数                  PIC 9(3).
000194         05  作２－本人費用額                PIC 9(7).
000195         05  作２－本人負担額                PIC 9(7).
000196         05  作２－本人請求額                PIC 9(7).
000193         05  作２－本人実日数                PIC 9(4).
000197         05  作２－家族件数                  PIC 9(3).
000198         05  作２－家族費用額                PIC 9(7).
000199         05  作２－家族負担額                PIC 9(7).
000200         05  作２－家族請求額                PIC 9(7).
000197         05  作２－家族実日数                PIC 9(4).
000201         05  FILLER                          PIC X(19).
000173*
000174*                           ［ＲＬ＝  １２８］
000175 FD  作業ファイル共 RECORD  CONTAINS 128 CHARACTERS.
000176 01  作共－レコード.
000177     03  作共－レコードキー.
000178         05  作共－請求和暦年月.
000179             07  作共－請求和暦              PIC 9.
000180             07  作共－請求年                PIC 9(2).
000181             07  作共－請求月                PIC 9(2).
001261         05  作共－分類コード                PIC 9(1).
001261         05  作共－県コード                  PIC X(2).
001400         05  作共－保険順                    PIC 9(2).
000183         05  作共－保険者番号                PIC X(10).
001310         05  作共－患者コード.
001320             07 作共－患者番号               PIC 9(6).
001330             07 作共－枝番                   PIC X(1).
001340         05  作共－施術和暦年月.
001350             07  作共－施術和暦              PIC 9.
001360             07  作共－施術年                PIC 9(2).
001370             07  作共－施術月                PIC 9(2).
000188     03  作共－レコードデータ.
001400         05  作共－保険種別                  PIC 9(2).
001280         05  作共－本人家族区分              PIC 9.
000166         05  作共－患者氏名                  PIC X(50).
000192         05  作共－請求額                    PIC 9(9).
000197         05  作共－実日数                    PIC 9(4).
000201         05  FILLER                          PIC X(30).
000173*
000202*----------------------------------------------------------------*
001240******************************************************************
001250*                WORKING-STORAGE SECTION                         *
001260******************************************************************
001270 WORKING-STORAGE         SECTION.
001280 01 キー入力                           PIC X     VALUE SPACE.
001290 01 状態キー                           PIC X(2)  VALUE SPACE.
001300 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001301 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001302 01 作成フラグ                         PIC X(3)  VALUE SPACE.
001303 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
001304 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
001305*
001310 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
001311 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
001320 01 保険者番号ＷＲ.
001530    03 法別番号ＷＲ                    PIC X(2)  VALUE SPACE.
001540    03 保番ＷＲ.
001550       05 都道府県番号ＷＲ             PIC X(2)  VALUE SPACE.
001560       05 保険番号ＷＲ                 PIC X(3)  VALUE SPACE.
001570       05 検証番号ＷＲ                 PIC X     VALUE SPACE.
001580       05 FILLER                       PIC X(2)  VALUE SPACE.
001321 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
001330 01 請求和暦年月ＷＲ.
001340    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
001350    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
001360    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
001370*
001410 01 請求年月Ｗ.
001420    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001430    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
001440    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
001441 01 施術年月Ｗ.
001442    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001443    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
001444    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
001450 01 集計作業用Ｗ.
001460    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
001461    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
001470    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
001480    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
001490    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
001500    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
001545    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
001545    03 本人日数Ｗ                      PIC 9(4)  VALUE ZERO.
001548    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001549    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001550    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001551    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
001551    03 家族日数Ｗ                      PIC 9(4)  VALUE ZERO.
001552    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001553    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001554    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001510 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
001520 01 ファイル名                         PIC N(2)  VALUE SPACE.
001530 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
001540 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
001541 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
001542*
001556* 県内県外用
001557 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
001558 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
001559 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001560 01 県内県外チェック                   PIC 9     VALUE ZERO.
001561 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001562 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
001563 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
001564 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
001565*
001566* エラーメッセージ用
001567 01 エラーメッセージＷ.
001568    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
001569    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
001570    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
001571    03 FILLER                          PIC X(10) VALUE SPACE.
001577** 助成レセまとめ用
001578 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
001579*
001580* 例外用
001581 01 協会コードＷ                       PIC 9(2)  VALUE ZERO.
002877*
001982 01 請求書関連Ｗ.
002862        07 北海道区分Ｗ                PIC 9 VALUE ZERO.
002862        07 青森区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岩手区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 秋田区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山形区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 茨城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 栃木区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 群馬区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 埼玉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 千葉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 東京区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 神奈川区分Ｗ                PIC 9 VALUE ZERO.
002862        07 新潟区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 富山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 石川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福井区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山梨区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長野区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岐阜区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 静岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 三重区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 滋賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 京都区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大阪区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 兵庫区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 奈良区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 和歌山区分Ｗ                PIC 9 VALUE ZERO.
002862        07 鳥取区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 島根区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岡山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 広島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山口区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 徳島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 香川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛媛区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 高知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 佐賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 熊本区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大分区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 鹿児島区分Ｗ                PIC 9 VALUE ZERO.
002862        07 沖縄区分Ｗ                  PIC 9 VALUE ZERO.
001582*
      *
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
001583******************************************************************
001584*                          連結項目                              *
001585******************************************************************
001586*
001587****************
001588* 画面入力情報 *
001589****************
001590**
001591 01 連入－画面情報ＹＨＮ４３０   IS EXTERNAL.
001592    03 連入－請求年月.
001593       05 連入－請求和暦               PIC 9.
001594       05 連入－請求年                 PIC 9(2).
001595       05 連入－請求月                 PIC 9(2).
001596    03 連入－提出年月日.
001597       05 連入－提出和暦               PIC 9.
001598       05 連入－提出年                 PIC 9(2).
001599       05 連入－提出月                 PIC 9(2).
001600       05 連入－提出日                 PIC 9(2).
001601    03 連入－レセプト種類              PIC X(4).
001602    03 連入－保険種別                  PIC 9(2).
001603    03 連入－印刷種類                  PIC 9.
001604    03 連入－本人家族                  PIC 9.
001605    03 連入－用紙種類                  PIC 9.
001606    03 連入－県内県外                  PIC 9.
001607    03 連入－県ＪＩＳ                  PIC X(2).
001608    03 連入－政管ＪＩＳ                PIC X(2).
001609*
001782********************
001792* メッセージ表示キー *
001802********************
001812 01 連メ３－キー IS EXTERNAL.
001822    03  連メ３－メッセージ             PIC N(20).
001832    03  連メ３－メッセージ１           PIC X(20).
001842*
001852************************
001862* 助成レセまとめ
001872************************
001882 01 連レセまとめ－キー IS EXTERNAL.
001892    03 連レセまとめ－施術和暦年月.
001902       05 連レセまとめ－施術和暦               PIC 9.
001912       05 連レセまとめ－施術年月.
001922          07 連レセまとめ－施術年              PIC 9(2).
001932          07 連レセまとめ－施術月              PIC 9(2).
001942    03 連レセまとめ－患者コード.
001952       05 連レセまとめ－患者番号               PIC 9(6).
001962       05 連レセまとめ－枝番                   PIC X(1).
001972**-------------------------------------------------------**
001982*   1:助成レセプトなしの本体まとめの判定
001992*   2:横浜・川崎用の社保助成レセかの判定
002002    03 連レセまとめ－判定区分                  PIC 9.
002012**-------------------------------------------------------**
002022*  / OUT /　 0:対象外、1:対象
002032    03 連レセまとめ－判定結果                  PIC 9.
002042**
      * 
002160******************************************************************
002170*                      PROCEDURE  DIVISION                       *
002180******************************************************************
002190 PROCEDURE               DIVISION.
002200************
002210*           *
002220* 初期処理   *
002230*           *
002240************
002250     PERFORM ファイルオープン.
002251     PERFORM 連結項目待避.
002260     PERFORM 制御情報取得.
002270************
002280*           *
002290* 主処理     *
002300*           *
002310************
002320     PERFORM 作業ファイル１作成.
002330     PERFORM 作業ファイル２作成.
002340************
002350*           *
002360* 終了処理   *
002370*           *
002380************
002390     PERFORM 終了処理.
002400     MOVE ZERO TO PROGRAM-STATUS.
002410     EXIT PROGRAM.
002420*
002430*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002440*================================================================*
002450 連結項目待避 SECTION.
002460*
002470* 連結項目の待避
002500     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002510     MOVE 連入－請求年        TO 請求年ＷＲ.
002520     MOVE 連入－請求月        TO 請求月ＷＲ.
002530     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
002540     MOVE 連入－保険種別      TO 保険種別ＷＲ.
002550     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
002551     MOVE 連入－県内県外      TO 県内県外ＷＲ.
002552     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
002553     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
002554*
002560*================================================================*
002570 ファイルオープン SECTION.
002580*
002581     OPEN INPUT 制御情報マスタ.
002582         MOVE NC"制御情報" TO ファイル名.
002583         PERFORM オープンチェック.
002590     OPEN INPUT 受診者情報Ｆ.
002600         MOVE NC"受診者情報Ｆ" TO ファイル名.
002610         PERFORM オープンチェック.
002617     OPEN INPUT 請求先マスタ.
002618         MOVE NC"請求先" TO ファイル名.
002619         PERFORM オープンチェック.
002620     OPEN INPUT 市町村マスタ.
002621         MOVE NC"市町村" TO ファイル名.
002622         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
002623*================================================================*
002630 オープンチェック SECTION.
002640*
002650     IF 状態キー  NOT =  "00"
002660         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002670         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002680         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002690                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
002700         ACCEPT  キー入力 FROM CONS
002710         PERFORM ファイル閉鎖
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM.
002731*================================================================*
002732 制御情報取得 SECTION.
002733*
002734     MOVE ZEROS TO 制－制御区分.
002735     READ 制御情報マスタ
002736     NOT INVALID KEY
002738         MOVE 制－協会コード   TO 協会コードＷ
002739     END-READ.
009438* 制御区分02
009439     MOVE 02 TO 制－制御区分.
009440     READ 制御情報マスタ
009441     NOT INVALID KEY
009443        MOVE 制０２－北海道総括表区分  TO 北海道区分Ｗ 
009443        MOVE 制０２－青森総括表区分    TO 青森区分Ｗ 
009443        MOVE 制０２－岩手総括表区分    TO 岩手区分Ｗ 
009443        MOVE 制０２－宮城総括表区分    TO 宮城区分Ｗ 
009443        MOVE 制０２－秋田総括表区分    TO 秋田区分Ｗ 
009443        MOVE 制０２－山形総括表区分    TO 山形区分Ｗ 
009443        MOVE 制０２－福島総括表区分    TO 福島区分Ｗ 
009443        MOVE 制０２－茨城総括表区分    TO 茨城区分Ｗ 
009443        MOVE 制０２－栃木総括表区分    TO 栃木区分Ｗ 
009443        MOVE 制０２－群馬総括表区分    TO 群馬区分Ｗ 
009443        MOVE 制０２－埼玉総括表区分    TO 埼玉区分Ｗ 
009443        MOVE 制０２－千葉総括表区分    TO 千葉区分Ｗ 
009443        MOVE 制０２－東京総括表区分    TO 東京区分Ｗ 
009443        MOVE 制０２－神奈川総括表区分  TO 神奈川区分Ｗ 
009443        MOVE 制０２－新潟総括表区分    TO 新潟区分Ｗ 
009443        MOVE 制０２－富山総括表区分    TO 富山区分Ｗ 
009443        MOVE 制０２－石川総括表区分    TO 石川区分Ｗ 
009443        MOVE 制０２－福井総括表区分    TO 福井区分Ｗ 
009443        MOVE 制０２－山梨総括表区分    TO 山梨区分Ｗ 
009443        MOVE 制０２－長野総括表区分    TO 長野区分Ｗ 
009443        MOVE 制０２－岐阜総括表区分    TO 岐阜区分Ｗ 
009443        MOVE 制０２－静岡総括表区分    TO 静岡区分Ｗ 
009443        MOVE 制０２－愛知総括表区分    TO 愛知区分Ｗ 
009443        MOVE 制０２－三重総括表区分    TO 三重区分Ｗ 
009443        MOVE 制０２－滋賀総括表区分    TO 滋賀区分Ｗ 
009443        MOVE 制０２－京都総括表区分    TO 京都区分Ｗ 
009443        MOVE 制０２－大阪総括表区分    TO 大阪区分Ｗ 
009443        MOVE 制０２－兵庫総括表区分    TO 兵庫区分Ｗ 
009443        MOVE 制０２－奈良総括表区分    TO 奈良区分Ｗ 
009443        MOVE 制０２－和歌山総括表区分  TO 和歌山区分Ｗ 
009443        MOVE 制０２－鳥取総括表区分    TO 鳥取区分Ｗ 
009443        MOVE 制０２－島根総括表区分    TO 島根区分Ｗ 
009443        MOVE 制０２－岡山総括表区分    TO 岡山区分Ｗ 
009443        MOVE 制０２－広島総括表区分    TO 広島区分Ｗ 
009443        MOVE 制０２－山口総括表区分    TO 山口区分Ｗ 
009443        MOVE 制０２－徳島総括表区分    TO 徳島区分Ｗ 
009443        MOVE 制０２－香川総括表区分    TO 香川区分Ｗ 
009443        MOVE 制０２－愛媛総括表区分    TO 愛媛区分Ｗ 
009443        MOVE 制０２－高知総括表区分    TO 高知区分Ｗ 
009443        MOVE 制０２－福岡総括表区分    TO 福岡区分Ｗ 
009443        MOVE 制０２－佐賀総括表区分    TO 佐賀区分Ｗ 
009443        MOVE 制０２－長崎総括表区分    TO 長崎区分Ｗ 
009443        MOVE 制０２－熊本総括表区分    TO 熊本区分Ｗ 
009443        MOVE 制０２－大分総括表区分    TO 大分区分Ｗ 
009443        MOVE 制０２－宮崎総括表区分    TO 宮崎区分Ｗ 
009443        MOVE 制０２－鹿児島総括表区分  TO 鹿児島区分Ｗ 
009443        MOVE 制０２－沖縄総括表区分    TO 沖縄区分Ｗ 
009468     END-READ.
002740*
002741*================================================================*
002750 エラー表示 SECTION.
002760*
002770     DISPLAY NC"状態キー" 状態キー  UPON CONS.
002780     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
002790     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
002800     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください" UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
002810     ACCEPT  キー入力 FROM CONS.
002820     PERFORM ファイル閉鎖.
002830     MOVE 99 TO PROGRAM-STATUS.
002840     EXIT PROGRAM.
002850*================================================================*
002860 作業ファイル１作成 SECTION.
002870*
002880     OPEN OUTPUT 作業ファイル１.
002890         MOVE NC"作業" TO ファイル名.
002900         PERFORM オープンチェック.
002901*
002902     EVALUATE レセプト種類ＷＲ
002903*        ***************************************
002904*        * 国保・社保・退職・組合・共済・自衛官
002905*        ***************************************
002906         WHEN "KOKU"
002918         WHEN "SYAH"
002907         WHEN "KUMI"
002909         WHEN "KYOU"
002911         WHEN "TAIS"
002912         WHEN "JIEI"
002914             PERFORM 作業ファイル１作成１
002920*        *************
002921*        * 老人 *
002922*        *************
002923         WHEN "ROUJ"
002924             PERFORM 作業ファイル１作成３
002925*        *************
002926*        * 助成 *
002927*        *************
002928         WHEN "JYOS"
002929             PERFORM 作業ファイル１作成４
002930*        *************
002931*        * 全印刷    *
002932*        *************
002933         WHEN "ALL "
002934             PERFORM 作業ファイル１作成５
002940     END-EVALUATE.
002945*
003140     CLOSE 作業ファイル１.
003141*
003690*================================================================*
003700 作業ファイル１作成１ SECTION.
003710*
003720***************************************
003740* 国保・社保・退職・組合・共済・自衛官
003750***************************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 1             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 1 )
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
003920                IF (受－保険種別  = 保険種別ＷＲ) OR
                         ((保険種別ＷＲ = 02) AND (受－保険種別 = 06 OR 07))
003923** 本人家族区分ありか
003924                   MOVE SPACE  TO  作成フラグ
003926                   IF 本人家族区分ＷＲ NOT = ZERO
003927                      IF 本人家族区分ＷＲ = 受－本人家族区分
003929                         MOVE "YES"  TO  作成フラグ
003930                      END-IF
003931                   ELSE
003932                      MOVE "YES"  TO  作成フラグ
003933                   END-IF 
003934** 県内県外か
003935                   IF 作成フラグ  = "YES"
003936                      MOVE SPACE  TO  作成フラグ
003937                      MOVE 受－保険種別 TO 保険種別県用ＷＫ
003938                      PERFORM 県内県外取得
003939*                   (県内1、県外2、両方0)
003940                      IF 県内県外ＷＲ NOT = ZERO
003941                         IF 県内県外ＷＲ = 1
003942                            IF 県内県外チェック = 1
003943                               MOVE "YES"  TO  作成フラグ
003944                            END-IF
003945                         ELSE
003946                            IF 県内県外チェック = ZERO
003947                               MOVE "YES"  TO  作成フラグ
003948                            END-IF
003949                         END-IF
003950                      ELSE
003951                         MOVE "YES"  TO  作成フラグ
003952                      END-IF 
003953                   END-IF 
003954*
003958                   IF 作成フラグ  = "YES"
003963                      MOVE SPACE TO 作１－レコード
003964                      INITIALIZE 作１－レコード
003937                      MOVE 受－保険種別    TO 作１－保険種別
003966                      MOVE 受－保険者番号  TO 作１－保険者番号 作１－保険者番号正規
003967                      PERFORM レコードセット
003968                      PERFORM 健保料金計算
003970                      PERFORM ファイル書込
003971                   END-IF 
003981                END-IF 
004161             END-IF
004170             PERFORM レセプトＦ読込
004180         END-PERFORM
004190     END-IF.
004290*================================================================*
004291 作業ファイル１作成３ SECTION.
004292*
004293**********************************
004294*  老人
004295**********************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 2             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 2 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004318** 本人家族区分ありか
004319                MOVE SPACE  TO  作成フラグ
004320                IF 本人家族区分ＷＲ NOT = ZERO
004321                   IF 本人家族区分ＷＲ = 受－本人家族区分
004322                      MOVE "YES"  TO  作成フラグ
004323                   END-IF
004324                ELSE
004325                   MOVE "YES"  TO  作成フラグ
004326                END-IF 
004327** 県内県外か
004328                IF 作成フラグ  = "YES"
004329                   MOVE SPACE  TO  作成フラグ
004330                   MOVE 受－公費種別 TO 保険種別県用ＷＫ
004331                   PERFORM 県内県外取得
004332*                 (県内1、県外2、両方0)
004333                   IF 県内県外ＷＲ NOT = ZERO
004334                      IF 県内県外ＷＲ = 1
004335                         IF 県内県外チェック = 1
004336                            MOVE "YES"  TO  作成フラグ
004337                         END-IF
004338                      ELSE
004339                         IF 県内県外チェック = ZERO
004340                            MOVE "YES"  TO  作成フラグ
004341                         END-IF
004342                      END-IF
004343                   ELSE
004344                      MOVE "YES"  TO  作成フラグ
004345                   END-IF 
004346                END-IF 
004347*
004348                IF 作成フラグ  = "YES"
004351                   MOVE SPACE TO 作１－レコード
004352                   INITIALIZE 作１－レコード
003937                   MOVE 受－公費種別           TO 作１－保険種別
004354                   MOVE 受－費用負担者番号     TO 作１－保険者番号 作１－保険者番号正規
004355                   PERFORM レコードセット
004356                   PERFORM 老人料金計算
004357* 請求額が ZERO の時は、書き込まない。
004358                   IF  作１－請求額 NOT = ZERO
004359                       PERFORM ファイル書込
004360                   END-IF
004361                END-IF 
004362             END-IF 
004364             PERFORM レセプトＦ読込
004365         END-PERFORM
004366     END-IF.
004367*================================================================*
004368 作業ファイル１作成４ SECTION.
004369*
004370**********************************
004371*  助成
004372**********************************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE 3             TO レセ－レセ種別.
005200     MOVE SPACE         TO レセ－請求保険者番号.
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   ) OR
                             ( レセ－レセ種別 NOT = 3 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004392*
004395** 本人家族区分ありか
004396                MOVE SPACE  TO  作成フラグ
004397                IF 本人家族区分ＷＲ NOT = ZERO
004398                   IF 本人家族区分ＷＲ = 受－本人家族区分
004399                      MOVE "YES"  TO  作成フラグ
004400                   END-IF
004401                ELSE
004402                   MOVE "YES"  TO  作成フラグ
004403                END-IF 
004404** 県内県外か
004405                IF 作成フラグ  = "YES"
004406                   MOVE SPACE  TO  作成フラグ
004407                   MOVE 受－助成種別 TO 保険種別県用ＷＫ
004408                   PERFORM 県内県外取得
004409*                 (県内1、県外2、両方0)
004410                   IF 県内県外ＷＲ NOT = ZERO
004411                      IF 県内県外ＷＲ = 1
004412                         IF 県内県外チェック = 1
004413                            MOVE "YES"  TO  作成フラグ
004414                         END-IF
004415                      ELSE
004416                         IF 県内県外チェック = ZERO
004417                            MOVE "YES"  TO  作成フラグ
004418                         END-IF
004419                      END-IF
004420                   ELSE
004421                      MOVE "YES"  TO  作成フラグ
004422                   END-IF 
004423                END-IF 
004424*
004425                IF 作成フラグ  = "YES"
004433                   MOVE SPACE TO 作１－レコード
004434                   INITIALIZE 作１－レコード
003937                   MOVE 受－助成種別           TO 作１－保険種別
004436                   MOVE 受－費用負担者番号助成 TO 作１－保険者番号 作１－保険者番号正規
004437                   PERFORM レコードセット
004438                   PERFORM 助成料金計算
004445* 請求額が ZERO の時は、書き込まない。
004446                   IF  作１－請求額 NOT = ZERO
004447                       PERFORM ファイル書込
004448                   END-IF
004449                END-IF
004450             END-IF
004452             PERFORM レセプトＦ読込
004453         END-PERFORM
004454     END-IF.
004455*================================================================*
004456 作業ファイル１作成５ SECTION.
004457*
004458*********************
004459* 全出力 *
004460*********************
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE ZERO          TO レセ－レセ種別.
005200     MOVE ZERO          TO レセ－施術和暦.
005210     MOVE ZERO          TO レセ－施術年.  
005220     MOVE ZERO          TO レセ－施術月.  
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
004472     END-START.
004473     IF 状態キー = "00"
004474         MOVE SPACE  TO 終了フラグ
003720         PERFORM レセプトＦ読込
004476         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   )
003770             PERFORM データチェック
004492** 労災・自賠責・自費・生保単独　除く
004493             IF  レセ－レセ種別 = 4 OR 5 OR 6 OR 7
004494                 MOVE SPACE  TO 実行キーＷ
004495             END-IF
004496***
004497             IF 実行キーＷ = "YES"
004480** 本人家族区分ありか
004481                MOVE SPACE  TO  作成フラグ
004482                IF 本人家族区分ＷＲ NOT = ZERO
004483                   IF 本人家族区分ＷＲ = 受－本人家族区分
004484                        MOVE "YES"  TO  作成フラグ
004485                   END-IF
004486                ELSE
004487                   MOVE "YES"  TO  作成フラグ
004488                END-IF 
004489                IF 作成フラグ  = "YES"
004498*
005610                   EVALUATE TRUE
004499*                ******************
004500*                * 健保 老人含まず*
004501*                ******************
013940                   WHEN レセ－レセ種別   = 1
004506**                 / 県内県外か /
004507                      MOVE SPACE  TO  作成フラグ
004508                      MOVE 受－保険種別 TO 保険種別県用ＷＫ
004509                      PERFORM 県内県外取得
004510*                  (県内1、県外2、両方0)
004511                      IF 県内県外ＷＲ NOT = ZERO
004512                         IF 県内県外ＷＲ = 1
004513                            IF 県内県外チェック = 1
004514                               MOVE "YES"  TO  作成フラグ
004515                            END-IF
004516                         ELSE
004517                            IF 県内県外チェック = ZERO
004518                               MOVE "YES"  TO  作成フラグ
004519                            END-IF
004520                         END-IF
004521                      ELSE
004522                         MOVE "YES"  TO  作成フラグ
004523                      END-IF 
004525*
004529                      IF 作成フラグ  = "YES"
004530                         MOVE SPACE TO 作１－レコード
004531                         INITIALIZE 作１－レコード
003937                         MOVE 受－保険種別    TO 作１－保険種別
004533                         MOVE 受－保険者番号  TO 作１－保険者番号 作１－保険者番号正規
004534                         PERFORM レコードセット
004535                         PERFORM 健保料金計算
004536                         PERFORM ファイル書込
004537                      END-IF
004540*                ********
004541*                * 老人 *
004542*                ********
                         WHEN レセ－レセ種別   = 2 
004545**                 / 県内県外か /
004546                      MOVE SPACE  TO  作成フラグ
004547                      MOVE 受－公費種別 TO 保険種別県用ＷＫ
004548                      PERFORM 県内県外取得
004549*                 (県内1、県外2、両方0)
004550                      IF 県内県外ＷＲ NOT = ZERO
004551                         IF 県内県外ＷＲ = 1
004552                            IF 県内県外チェック = 1
004553                               MOVE "YES"  TO  作成フラグ
004554                            END-IF
004555                         ELSE
004556                            IF 県内県外チェック = ZERO
004557                               MOVE "YES"  TO  作成フラグ
004558                            END-IF
004559                         END-IF
004560                      ELSE
004561                         MOVE "YES"  TO  作成フラグ
004562                      END-IF 
004563**
004564                      IF 作成フラグ  = "YES"
004565                         MOVE SPACE TO 作１－レコード
004566                         INITIALIZE 作１－レコード
003937                         MOVE 受－公費種別           TO 作１－保険種別
004568                         MOVE 受－費用負担者番号     TO 作１－保険者番号 作１－保険者番号正規
004570                         PERFORM レコードセット
004580                         PERFORM 老人料金計算
004591* 請求額が ZERO の時は、書き込まない。
004592                         IF  作１－請求額 NOT = ZERO
004593                             PERFORM ファイル書込
004594                         END-IF
004595                      END-IF
004610*                ********
004620*                * 助成 *
004630*                ********
                         WHEN レセ－レセ種別   = 3
004651**                 / 県内県外か /
004652                      MOVE SPACE  TO  作成フラグ
004653                      MOVE 受－助成種別 TO 保険種別県用ＷＫ
004654                      PERFORM 県内県外取得
004655*                  (県内1、県外2、両方0)
004656                      IF 県内県外ＷＲ NOT = ZERO
004657                         IF 県内県外ＷＲ = 1
004658                            IF 県内県外チェック = 1
004659                               MOVE "YES"  TO  作成フラグ
004660                            END-IF
004661                         ELSE
004662                            IF 県内県外チェック = ZERO
004663                               MOVE "YES"  TO  作成フラグ
004664                            END-IF
004665                         END-IF
004666                      ELSE
004667                         MOVE "YES"  TO  作成フラグ
004668                      END-IF 
004669**
004670                      IF 作成フラグ  = "YES"
004671                         MOVE SPACE TO 作１－レコード
004672                         INITIALIZE 作１－レコード
003937                         MOVE 受－助成種別           TO 作１－保険種別
004674                         MOVE 受－費用負担者番号助成 TO 作１－保険者番号 作１－保険者番号正規
004680                         PERFORM レコードセット
004690                         PERFORM 助成料金計算
004697* 請求額が ZERO の時は、書き込まない。
004698                         IF  作１－請求額 NOT = ZERO
004699                             PERFORM ファイル書込
004700                         END-IF
004710                      END-IF
004711                   END-EVALUATE
                      END-IF
004712             END-IF
004720             PERFORM レセプトＦ読込
004730         END-PERFORM
004740     END-IF.
004450*================================================================*
006930 レセプトＦ読込 SECTION.
006940*
006950     READ レセプトＦ NEXT
004490     AT END
004500         MOVE "YES" TO 終了フラグ
004510     END-READ.
004811*================================================================*
004812 データチェック SECTION.
004813*
004814     MOVE SPACE          TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
      *
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
004860*
004868*================================================================*
004869 レコードセット SECTION.
004870*
004871     MOVE レセ－請求和暦    TO 作１－請求和暦.
004872     MOVE レセ－請求年      TO 作１－請求年.
004873     MOVE レセ－請求月      TO 作１－請求月.
005480     MOVE レセ－負担割合    TO 作１－負担割合.
005480     MOVE レセ－レセ実日数  TO 作１－実日数.
004874     MOVE 受－施術和暦      TO 作１－施術和暦.
004875     MOVE 受－施術年        TO 作１－施術年.
004876     MOVE 受－施術月        TO 作１－施術月.
004878     MOVE 受－患者コード    TO 作１－患者コード.
004910     MOVE 受－患者カナ      TO 作１－患者カナ.
004910     MOVE 受－患者氏名      TO 作１－患者氏名.
004920     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
004939     MOVE 受－本人家族区分  TO 作１－本人家族区分.
005526     IF 受－公費種別 NOT = ZERO
005534         MOVE 1             TO 作１－本人家族区分
           END-IF.
           MOVE 受－保険種別      TO 作１－親保険種別.
005542     PERFORM 分類取得.
004941*
005110*================================================================*
005120 健保料金計算 SECTION.
005130*
005210     MOVE レセ－合計       TO 作１－費用額.
005220     MOVE レセ－一部負担金 TO 作１－負担額.
005230     MOVE レセ－請求金額   TO 作１－請求額.
005231*
005240*================================================================*
005250 老人料金計算 SECTION.
005260*
005210     MOVE レセ－合計       TO 作１－費用額.
005220     MOVE レセ－一部負担金 TO 作１－負担額.
005230     MOVE レセ－請求金額   TO 作１－請求額.
005361*
005370*================================================================*
005380 助成料金計算 SECTION.
005390*
005210     MOVE レセ－合計         TO 作１－費用額.
005220     MOVE レセ－受給者負担額 TO 作１－負担額.
005230     MOVE レセ－助成請求金額 TO 作１－請求額.
05491*
005705*================================================================*
005706 分類取得 SECTION.
005707***************************************************
005708* 分類コード
005709*  1:社保・日雇
      *  2:船員
005710*  3:組合
      *  4:共済・自衛官
005711*  5:1:国保 1:退職 2:後高 3:助成（東京・愛知・高知以外）
005712*  6:助成（東京・愛知・高知）
005716*     /15.6.18 京都の後期高齢の障害で"39261"も直送分へ
005716*
      *  県固有
      *  大阪
      *  5:1:後高 1:助成（親が後高） 2:国保 2:退職 2:助成（親保険が後高以外・東京・愛知・高知以外）
005718***************************************************
005719*
005720     IF レセ－レセ種別  = 3
               IF (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39") OR
                  ((受－費用負担者番号助成(1:5) = "39261") AND (受－公費種別 = 5))
005726            MOVE  6  TO  作１－分類コード
               ELSE
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 30 TO  作１－保険順
               END-IF
005742         MOVE 受－費用負担者番号助成(3:2) TO 作１－県コード
005728     ELSE
005729         IF 受－公費種別 = ZERO
005730*       / 健保 /
005731             EVALUATE 受－保険種別
005741             WHEN 01
005743                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(1:2) TO 作１－県コード
005732             WHEN 02
005733             WHEN 06
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005734             WHEN 07
005736                 MOVE 2  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005737             WHEN 03
005740                 MOVE 3  TO  作１－分類コード
005738             WHEN 04
005739             WHEN 09
005740                 MOVE 4  TO  作１－分類コード
005753             WHEN 08
005755                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005765             END-EVALUATE
005766*
005767         ELSE
005768*       / 老人 /
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 20 TO  作１－保険順
005742             MOVE 受－費用負担者番号(3:2) TO 作１－県コード
005778         END-IF
005779     END-IF.
           IF (大阪区分Ｗ = 1) AND (作１－分類コード = 5)
005720         IF レセ－レセ種別  = 3
                  IF 受－費用負担者番号助成(3:2) = "27"
005729               IF 受－公費種別 = ZERO
005743                  MOVE 21 TO  作１－保険順
                     ELSE
005743                  MOVE 11 TO  作１－保険順
                     END-IF
010202               IF 受－助保険助成(1:3) = "274"
010203                   EVALUATE 受－法別番号助成
010204                   WHEN 41
010205                       MOVE 41274002           TO 作１－保険者番号
010206                   WHEN 80
010207                       MOVE 80274004           TO 作１－保険者番号
010208                   WHEN 82
010209                       MOVE 82274002           TO 作１－保険者番号
010210                   WHEN 83
010211                       MOVE 83274001           TO 作１－保険者番号
010212                   WHEN 86
010213                       MOVE 86274008           TO 作１－保険者番号
                         WHEN 87
009990                       MOVE "87274007"         TO 作１－保険者番号
010214                   WHEN OTHER
010215                       MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010216                   END-EVALUATE
010217               ELSE
010218                   IF ( 受－費用負担者番号助成(3:3) = "275" ) OR ( 受－費用負担者番号助成(3:5) = "27002" )
010219                       EVALUATE 受－法別番号助成
010220                       WHEN 41
010221                           MOVE 41275009           TO 作１－保険者番号
010222                       WHEN 80
010223                           MOVE 80275001           TO 作１－保険者番号
010224                       WHEN 82
010225                           MOVE 82275009           TO 作１－保険者番号
010226                       WHEN 86
010227                           MOVE 86275005           TO 作１－保険者番号
010228                       WHEN OTHER
010229                           MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010230                       END-EVALUATE
010231                   ELSE
010232                       MOVE 受－費用負担者番号助成  TO 作１－保険者番号
010233                   END-IF
                     END-IF
010234            END-IF
005728         ELSE
005729            IF 受－公費種別 = ZERO
005730*       / 健保 /
005731               EVALUATE 受－保険種別
005741               WHEN 01
                         IF 受－保険者番号(1:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009114                      IF 受－保険者番号(1:3) = "274"
009115                          MOVE 00274001       TO 作１－保険者番号
009116                      ELSE
009117                          IF ( 受－保険者番号(1:3) = "275" ) OR ( 受－保険者番号(1:5) = "27002" )
009118                             MOVE 00275008       TO 作１－保険者番号
009119                          ELSE
009120                             MOVE 00             TO 法別番号ＷＲ
009121                             MOVE 受－保険者番号 TO 保番ＷＲ
009121                             MOVE 保険者番号ＷＲ TO 作１－保険者番号
009122                          END-IF
                            END-IF
009123                   END-IF
005753               WHEN 08
                         IF 受－保険者番号(3:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009125                      IF 受－保番(1:3) = "274"
009126                         MOVE 67274001       TO 作１－保険者番号
009127                      ELSE
009128                         IF ( 受－保険者番号(3:3) = "275" ) OR ( 受－保険者番号(3:5) = "27002" )
009129                            MOVE 67275008       TO 作１－保険者番号
009130                         ELSE
009131                            MOVE 受－保険者番号 TO 作１－保険者番号
009132                         END-IF
009133                      END-IF
                         END-IF
005765               END-EVALUATE
005767            ELSE
005768*       / 老人 /
                     IF 受－費用負担者番号(3:2) = "27"
005743                  MOVE 10 TO  作１－保険順
009672                  IF 受－助保険老人(1:3) = "274"
009673                     MOVE 27274000          TO 作１－保険者番号
009674                  ELSE
009675                     IF ( 受－費用負担者番号(3:3) = "275" ) OR ( 受－費用負担者番号(3:5) = "27002" )
009676                        MOVE 27275007           TO 作１－保険者番号
009677                     ELSE
009678                        MOVE 受－費用負担者番号 TO 作１－保険者番号
009679                     END-IF
009680                  END-IF
      */後期高齢は代表番号にまとめる/080419
                        IF 受－保険者番号(1:4) = "3927"
                           MOVE "39270004" TO 作１－保険者番号
                        END-IF
005778               END-IF
                  END-IF
005778         END-IF
005779     END-IF.
005780*
005500*================================================================*
005510 ファイル書込 SECTION.
005520*
005530     WRITE 作１－レコード
005540     INVALID KEY
005550         MOVE NC"作業"  TO ファイル名
005560         PERFORM エラー表示
005570     END-WRITE.
005580*================================================================*
005590 作業ファイル２作成 SECTION.
005600*
005610     OPEN INPUT  作業ファイル１.
005620     OPEN OUTPUT 作業ファイル２.
005620     OPEN OUTPUT 作業ファイル共.
005630*
005640     PERFORM 作業ファイル２作成処理.
005650*
005660     CLOSE 作業ファイル共.
005660     CLOSE 作業ファイル２.
005670     CLOSE 作業ファイル１.
005680*================================================================*
005690 作業ファイル２作成処理 SECTION.
005700*
005813     MOVE SPACE TO 終了フラグ２.
005940*
005950     PERFORM 作業ファイル１読込.
006020     PERFORM UNTIL 終了フラグ２ = "YES"
006120         MOVE 作１－保険者番号   TO 保険者番号Ｗ
006030*
006040         MOVE SPACE TO 作２－レコード
006050         INITIALIZE 作２－レコード
               INITIALIZE 集計作業用Ｗ
               PERFORM UNTIL (終了フラグ２ = "YES") OR
                             (作１－保険者番号 NOT = 保険者番号Ｗ)
      */150620 京都の県固有を指定した時、後高の障害は７号誌を出すため、親保険が後高ではないものは集計しない
                   IF (京都区分Ｗ = 1) AND
                      ((作１－保険種別 = 53) AND (作２－保険者番号(1:5) = 39261)) AND
                      (作１－親保険種別 NOT = 05)
                      CONTINUE
                   ELSE
006060                PERFORM 作業レコード２累計
006070*
006120                MOVE 作１－請求和暦年月 TO 作２－請求和暦年月
006120                MOVE 作１－分類コード   TO 作２－分類コード
006120                MOVE 作１－県コード     TO 作２－県コード
006120                MOVE 作１－保険順       TO 作２－保険順
006120                MOVE 作１－保険種別     TO 作２－保険種別
006120                MOVE 作１－保険者番号   TO 作２－保険者番号 保険者番号Ｗ
                      IF 作１－分類コード = 4
                         PERFORM 作業ファイル共作成
                      END-IF
                   END-IF
006140             PERFORM 作業ファイル１読込
006150         END-PERFORM
006160         PERFORM 作業レコード２セット
006170         PERFORM 作業ファイル２書込
006180     END-PERFORM.
006190*================================================================*
006200 作業ファイル１読込 SECTION.
006210*
006220     READ 作業ファイル１ NEXT
006230     AT END
006240         MOVE "YES" TO 終了フラグ２
006250     END-READ.
006260*================================================================*
006270 作業レコード２累計 SECTION.
006280*
006490     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
006510     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
006520     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
006530     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
006531*
006532     IF 作１－本人家族区分 = 1
006534        COMPUTE 本人件数Ｗ   = 本人件数Ｗ   + 1
006535        COMPUTE 本人費用額Ｗ = 本人費用額Ｗ + 作１－費用額
006536        COMPUTE 本人負担額Ｗ = 本人負担額Ｗ + 作１－負担額
006537        COMPUTE 本人請求額Ｗ = 本人請求額Ｗ + 作１－請求額
006530        COMPUTE 本人日数Ｗ   = 本人日数Ｗ   + 作１－実日数
006538     ELSE
006539        COMPUTE 家族件数Ｗ   = 家族件数Ｗ   + 1
006540        COMPUTE 家族費用額Ｗ = 家族費用額Ｗ + 作１－費用額
006541        COMPUTE 家族負担額Ｗ = 家族負担額Ｗ + 作１－負担額
006542        COMPUTE 家族請求額Ｗ = 家族請求額Ｗ + 作１－請求額
006530        COMPUTE 家族日数Ｗ   = 家族日数Ｗ   + 作１－実日数
006543     END-IF.
006544*
006547*===============================================================*
006550 作業レコード２セット SECTION.
006560*
006630     MOVE 件数Ｗ         TO 作２－件数.
006650     MOVE 費用額Ｗ       TO 作２－費用額.
006660     MOVE 負担額Ｗ       TO 作２－負担額.
006670     MOVE 請求額Ｗ       TO 作２－請求額.
006671*
006672     MOVE 本人件数Ｗ     TO 作２－本人件数.
006673     MOVE 本人費用額Ｗ   TO 作２－本人費用額.
006674     MOVE 本人負担額Ｗ   TO 作２－本人負担額.
006675     MOVE 本人請求額Ｗ   TO 作２－本人請求額.
006675     MOVE 本人日数Ｗ     TO 作２－本人実日数.
006676     MOVE 家族件数Ｗ     TO 作２－家族件数.
006677     MOVE 家族費用額Ｗ   TO 作２－家族費用額.
006678     MOVE 家族負担額Ｗ   TO 作２－家族負担額.
006679     MOVE 家族請求額Ｗ   TO 作２－家族請求額.
006679     MOVE 家族日数Ｗ     TO 作２－家族実日数.
006680*
006687*===============================================================*
006690 作業ファイル２書込 SECTION.
006700*
006710     WRITE 作２－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作２" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006547*===============================================================*
006550 作業ファイル共作成 SECTION.
006560*
006120     MOVE 作１－請求和暦年月 TO 作共－請求和暦年月.
006120     MOVE 作１－分類コード   TO 作共－分類コード.
006120     MOVE 作１－県コード     TO 作共－県コード.
006120     MOVE 作１－保険順       TO 作共－保険順.
006120     MOVE 作１－保険者番号   TO 作共－保険者番号.
006120     MOVE 作１－患者コード   TO 作共－患者コード.
006120     MOVE 作１－施術和暦年月 TO 作共－施術和暦年月.
006120     MOVE 作１－保険種別     TO 作共－保険種別.
006120     MOVE 作１－本人家族区分 TO 作共－本人家族区分.
006120     MOVE 作１－患者氏名     TO 作共－患者氏名.
006670     MOVE 作１－請求額       TO 作共－請求額.
006679     MOVE 作１－実日数       TO 作共－実日数.
006170     PERFORM 作業ファイル共書込.
006680*
006687*===============================================================*
006690 作業ファイル共書込 SECTION.
006700*
006710     WRITE 作共－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作共" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006790*================================================================*
006800 ファイル閉鎖 SECTION.
006810*
006820     CLOSE 制御情報マスタ 受診者情報Ｆ
006821           請求先マスタ 市町村マスタ レセプトＦ.
006830*================================================================*
006840 終了処理 SECTION.
006850*
006860     PERFORM ファイル閉鎖.
006861*================================================================*
006862*================================================================*
006863 県内県外取得 SECTION.
006864*
006865      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
006866      EVALUATE  保険種別県用ＷＫ
006867* 国保
006868      WHEN  01
006869         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
006870            MOVE  1  TO  県内県外チェック
006871         END-IF
006872         MOVE 受－保険者番号(1:2) TO 県ＷＫ
006873* 社保
006874      WHEN  02
      */協会健保の対応/081009
               IF 受－保険者番号(5:5) = SPACE
006875             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
006876                MOVE  1  TO  県内県外チェック
006877             END-IF
006878             MOVE 受－保険者番号(1:2) TO 県ＷＫ
006879             PERFORM 県統一
006880             MOVE 県統一ＷＫ TO 県ＷＫ
               ELSE
                   IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
                       MOVE  1  TO  県内県外チェック
                   END-IF
                   MOVE 受－保険者番号(3:2) TO 県ＷＫ
               END-IF
006881* 船員
006882* 日雇
006883* 組合
006884* 共済
006885* 自衛官
006886* 退職国保
006887      WHEN  06
006888      WHEN  07
006889      WHEN  08
006890      WHEN  09
006891      WHEN  04
006892      WHEN  03
006893         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
006894            MOVE  1  TO  県内県外チェック
006895         END-IF
006896         MOVE 受－保険者番号(3:2) TO 県ＷＫ
006897* 助成
006898      WHEN 50 THRU 60
006899         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
006900            MOVE  1  TO  県内県外チェック
006901         END-IF
006902         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
006903* 老人
006904      WHEN  05
006905         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
006906            MOVE  1  TO  県内県外チェック
006907         END-IF
006908         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
006910* 労災、自賠責・自費・生保単独は除外
006911      WHEN  70
006912      WHEN  80
006912      WHEN  85
006913      WHEN  90
006914      WHEN  ZERO
006915         CONTINUE
006916*
006917     WHEN OTHER
006918         MOVE SPACE                TO エラーメッセージＷ
006919         MOVE 受－患者コード       TO エラー患者コードＷ
006920         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
006921         MOVE "-"                  TO エラー区切りＷ
006922         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
006923         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
006924         CALL   "MSG003"
006925         CANCEL "MSG003"
006926     END-EVALUATE.
006927*
006928*================================================================*
006929 県統一 SECTION.
006930*
006931     MOVE ZERO  TO  県統一ＷＫ.
006932     EVALUATE  県ＷＫ
006933*北海道
006934      WHEN  01
006935         MOVE 01 TO 県統一ＷＫ
006936*青森
006937      WHEN  02
006938         MOVE 02 TO 県統一ＷＫ
006939*岩手
006940      WHEN  03
006941         MOVE 03 TO 県統一ＷＫ
006942*宮城
006943      WHEN  04
006944         MOVE 04 TO 県統一ＷＫ
006945*秋田
006946      WHEN  05
006947         MOVE 05 TO 県統一ＷＫ
006948*山形
006949      WHEN  06
006950         MOVE 06 TO 県統一ＷＫ
006951*福島
006952      WHEN  07
006953         MOVE 07 TO 県統一ＷＫ
006954*茨城
006955      WHEN  08
006956         MOVE 08 TO 県統一ＷＫ
006957*栃木
006958      WHEN  09
006959         MOVE 09 TO 県統一ＷＫ
006960*群馬
006961      WHEN  10
006962         MOVE 10 TO 県統一ＷＫ
006963*埼玉
006964      WHEN  11
006965         MOVE 11 TO 県統一ＷＫ
006966*千葉
006967      WHEN  12
006968         MOVE 12 TO 県統一ＷＫ
006969*東京
006970      WHEN  21
006971         MOVE 13 TO 県統一ＷＫ
006972*神奈川
006973      WHEN  31
006974         MOVE 14 TO 県統一ＷＫ
006975*新潟
006976      WHEN  32
006977         MOVE 15 TO 県統一ＷＫ
006978*富山
006979      WHEN  33
006980         MOVE 16 TO 県統一ＷＫ
006981*石川
006982      WHEN  34
006983         MOVE 17 TO 県統一ＷＫ
006984*福井
006985      WHEN  35
006986         MOVE 18 TO 県統一ＷＫ
006987*山梨
006988      WHEN  36
006989         MOVE 19 TO 県統一ＷＫ
006990*長野
006991      WHEN  37
006992         MOVE 20 TO 県統一ＷＫ
006993*岐阜
006994      WHEN  38
006995         MOVE 21 TO 県統一ＷＫ
006996*静岡
006997      WHEN  39
006998         MOVE 22 TO 県統一ＷＫ
006999*愛知
007000      WHEN  51
007001         MOVE 23 TO 県統一ＷＫ
007002*三重
007003      WHEN  52
007004         MOVE 24 TO 県統一ＷＫ
007005*滋賀
007006      WHEN  53
007007         MOVE 25 TO 県統一ＷＫ
007008*京都
007009      WHEN  54
007010         MOVE 26 TO 県統一ＷＫ
007011*大阪
007012      WHEN  41
007013         MOVE 27 TO 県統一ＷＫ
007014*兵庫
007015      WHEN  42
007016         MOVE 28 TO 県統一ＷＫ
007017*奈良
007018      WHEN  55
007019         MOVE 29 TO 県統一ＷＫ
007020*和歌山
007021      WHEN  56
007022         MOVE 30 TO 県統一ＷＫ
007023*鳥取
007024      WHEN  57
007025         MOVE 31 TO 県統一ＷＫ
007026*島根
007027      WHEN  58
007028         MOVE 32 TO 県統一ＷＫ
007029*岡山
007030      WHEN  59
007031         MOVE 33 TO 県統一ＷＫ
007032*広島
007033      WHEN  60
007034         MOVE 34 TO 県統一ＷＫ
007035*山口
007036      WHEN  61
007037         MOVE 35 TO 県統一ＷＫ
007038*徳島
007039      WHEN  71
007040         MOVE 36 TO 県統一ＷＫ
007041*香川
007042      WHEN  72
007043         MOVE 37 TO 県統一ＷＫ
007044*愛媛
007045      WHEN  73
007046         MOVE 38 TO 県統一ＷＫ
007047*高知
007048      WHEN  74
007049         MOVE 39 TO 県統一ＷＫ
007050*福岡
007051      WHEN  75
007052         MOVE 40 TO 県統一ＷＫ
007053*佐賀
007054      WHEN  76
007055         MOVE 41 TO 県統一ＷＫ
007056*長崎
007057      WHEN  77
007058         MOVE 42 TO 県統一ＷＫ
007059*熊本
007060      WHEN  78
007061         MOVE 43 TO 県統一ＷＫ
007062*大分
007063      WHEN  79
007064         MOVE 44 TO 県統一ＷＫ
007065*宮崎
007066      WHEN  80
007067         MOVE 45 TO 県統一ＷＫ
007068*鹿児島
007069      WHEN  81
007070         MOVE 46 TO 県統一ＷＫ
007071*沖縄
007072      WHEN  82
007073         MOVE 47 TO 県統一ＷＫ
007074*その他
007075      WHEN  OTHER
007076         CONTINUE
007077     END-EVALUATE.
007078*
007079*================================================================*
007231******************************************************************
007232 END PROGRAM YHN431.
007233******************************************************************
