000001******************************************************************
000002*            IDENTIFICATION      DIVISION                        *
000003******************************************************************
000004 IDENTIFICATION          DIVISION.
000005 PROGRAM-ID.             YHN434.
000006 AUTHOR.                 池田　幸子
000007*
000008*----------------------------------------------------------------*
000009*         請求書指定【ﾃﾞｰﾀ作成（金額あり）】柔+ｳｨﾝﾄﾞｳｽﾞ版
000010*  請求年月バージョン
000011*         MED = YHN433 
000012*----------------------------------------------------------------*
000013 DATE-WRITTEN.           2015-02-26
000014 DATE-COMPILED.          2015-02-26
000015*----------------------------------------------------------------*
000016******************************************************************
000017*            ENVIRONMENT         DIVISION                        *
000018******************************************************************
000019 ENVIRONMENT             DIVISION.
000020 CONFIGURATION           SECTION.
000021 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000022 OBJECT-COMPUTER.        FMV-DESKPOWER.
000023 SPECIAL-NAMES.          CONSOLE  IS  CONS
000024                         SYSERR   IS  MSGBOX.
000025 INPUT-OUTPUT            SECTION.
000026 FILE-CONTROL.
000027     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000028                             ORGANIZATION             IS  INDEXED
000029                             ACCESS MODE              IS  DYNAMIC
000030                             RECORD KEY               IS  制－制御区分
000031                             FILE STATUS              IS  状態キー
000032                             LOCK        MODE         IS  AUTOMATIC.
000033     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000034                             ORGANIZATION             IS  INDEXED
000035                             ACCESS MODE              IS  DYNAMIC
000036                             RECORD KEY               IS 受－施術和暦年月
000037                                                         受－患者コード
000038                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000039                                                         受－患者カナ
000040                                                         受－患者コード
000041                             ALTERNATE RECORD KEY     IS 受－患者コード
000042                                                         受－施術和暦年月
000043                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000044                                                         受－保険種別
000045                                                         受－保険者番号
000046                                                         受－患者コード
000047                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000048                                                         受－公費種別
000049                                                         受－費用負担者番号
000050                                                         受－患者コード
000051                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000052                                                         受－助成種別
000053                                                         受－費用負担者番号助成
000054                                                         受－患者コード
000055                             ALTERNATE RECORD KEY     IS 受－請求和暦年月
000056                                                         受－施術和暦年月
000057                                                         受－患者コード
000058                             FILE STATUS              IS  状態キー
000059                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000128*** 指定印刷 YHN432,433で使用した作業ファイル２を 作業ファイル３ の名前で使用する．
000129     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4322L.DAT"
000130                             ORGANIZATION             IS  INDEXED
000131                             ACCESS                   IS  DYNAMIC
000132                             RECORD      KEY          IS  作３－請求和暦年月
000112                                                          作３－分類コード
000112                                                          作３－県コード
000112                                                          作３－保険順
000113                                                          作３－保険者番号
000114                             ALTERNATE RECORD KEY     IS  作３－印刷区分
000115                                                          作３－請求和暦年月
000112                                                          作３－分類コード
000112                                                          作３－県コード
000112                                                          作３－保険順
000117                                                          作３－保険者番号
000139                             FILE        STATUS       IS  状態キー
000140                             LOCK        MODE         IS  AUTOMATIC.
000150***
000151*** 作業ファイル４から、一括印刷のデータ作成(YHN431S)と同じ作業ファイル１，２を作成する。
000152     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4311L.DAT"
000153                             ORGANIZATION             IS  INDEXED
000154                             ACCESS                   IS  DYNAMIC
000155                             RECORD      KEY          IS  作１－請求和暦年月
000907                                                          作１－分類コード
                                                                作１－県コード
                                                                作１－保険順
000908                                                          作１－保険者番号
000909                                                          作１－本人家族区分
                                                                作１－負担割合
000910                                                          作１－患者カナ
000911                                                          作１－患者コード
000912                                                          作１－施術和暦年月
000163                             FILE        STATUS       IS  状態キー
000164                             LOCK        MODE         IS  AUTOMATIC.
000165     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4312L.DAT"
000166                             ORGANIZATION             IS  INDEXED
000167                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作２－請求和暦年月
000112                                                          作２－分類コード
000112                                                          作２－県コード
000112                                                          作２－保険順
000113                                                          作２－保険者番号
000176                             FILE        STATUS       IS  状態キー
000177                             LOCK        MODE         IS  AUTOMATIC.
000108     SELECT  作業ファイル共  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W43121L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作共－請求和暦年月
000112                                                          作共－分類コード
000112                                                          作共－県コード
000112                                                          作共－保険順
000113                                                          作共－保険者番号
000911                                                          作共－患者コード
000912                                                          作共－施術和暦年月
000119                             FILE        STATUS       IS  状態キー
000120                             LOCK        MODE         IS  AUTOMATIC.
000178******************************************************************
000179*                      DATA DIVISION                             *
000180******************************************************************
000181 DATA                    DIVISION.
000182 FILE                    SECTION.
000183*                           ［ＲＬ＝  ２５６］
000184 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000185     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000991     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
000186*                           ［ＲＬ＝  ３２０］
000187 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
000188     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
000204* 
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
000208*
000209*                           ［ＲＬ＝  ６４］
000210 FD  作業ファイル３ RECORD  CONTAINS 64 CHARACTERS.
000211 01  作３－レコード.
000212     03  作３－レコードキー.
000213         05  作３－請求和暦年月.
000214             07  作３－請求和暦              PIC 9.
000215             07  作３－請求年                PIC 9(2).
000216             07  作３－請求月                PIC 9(2).
001261         05  作３－分類コード                PIC 9(1).
001261         05  作３－県コード                  PIC X(2).
001400         05  作３－保険順                    PIC 9(2).
000218         05  作３－保険者番号                PIC X(10).
000219         05  作３－印刷区分                  PIC 9.
000220     03  作３－レコードデータ.
001400         05  作３－保険種別                  PIC 9(2).
000221         05  作３－件数                      PIC 9(4).
000222         05  作３－費用額                    PIC 9(8).
000223         05  作３－負担額                    PIC 9(8).
000224         05  作３－請求額                    PIC 9(8).
0              05  作２－元保険者番号              PIC X(10).
               05  作２－ラベルチェック            PIC X.
               05  FILLER                          PIC X(2).
00226*
000246 FD  作業ファイル１ RECORD  CONTAINS 256 CHARACTERS.
000247 01  作１－レコード.
000248     03  作１－レコードキー.
000249         05  作１－請求和暦年月.
000250             07  作１－請求和暦              PIC 9.
000251             07  作１－請求年                PIC 9(2).
000252             07  作１－請求月                PIC 9(2).
001261         05  作１－分類コード                PIC 9(1).
001261         05  作１－県コード                  PIC X(2).
001400         05  作１－保険順                    PIC 9(2).
001271         05  作１－保険者番号.
001530             07 作１－法別番号             PIC X(2).
001540             07 作１－保番.
001550                09 作１－都道府県番号      PIC X(2).
001560                09 作１－保険番号          PIC X(3).
001570                09 作１－検証番号ＷＲ      PIC X.
001580                09 FILLER                  PIC X(2).
001280         05  作１－本人家族区分              PIC 9.
               05  作１－負担割合                  PIC 9(2).
001300         05  作１－患者カナ                  PIC X(50).
001310         05  作１－患者コード.
001320             07 作１－患者番号               PIC 9(6).
001330             07 作１－枝番                   PIC X(1).
001340         05  作１－施術和暦年月.
001350             07  作１－施術和暦              PIC 9.
001360             07  作１－施術年                PIC 9(2).
001370             07  作１－施術月                PIC 9(2).
000164     03  作１－レコードデータ.
000165         05  作１－被保険者氏名              PIC X(50).
000166         05  作１－患者氏名                  PIC X(50).
001400         05  作１－保険種別                  PIC 9(2).
001271         05  作１－保険者番号正規          PIC X(8).
000167         05  作１－費用額                    PIC 9(6).
000168         05  作１－負担額                    PIC 9(6).
000169         05  作１－請求額                    PIC 9(6).
000169         05  作１－実日数                    PIC 9(2).
001400         05  作１－親保険種別              PIC 9(2).
000172         05  FILLER                        PIC X(37).
000274*
000275*                           ［ＲＬ＝  １２８］
000276 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
000277 01  作２－レコード.
000278     03  作２－レコードキー.
000279         05  作２－請求和暦年月.
000280             07  作２－請求和暦              PIC 9.
000281             07  作２－請求年                PIC 9(2).
000282             07  作２－請求月                PIC 9(2).
001261         05  作２－分類コード                PIC 9(1).
001261         05  作２－県コード                  PIC X(2).
001400         05  作２－保険順                    PIC 9(2).
000183         05  作２－保険者番号                PIC X(10).
000188     03  作２－レコードデータ.
001400         05  作２－保険種別                  PIC 9(2).
000189         05  作２－件数                      PIC 9(4).
000190         05  作２－費用額                    PIC 9(9).
000191         05  作２－負担額                    PIC 9(9).
000192         05  作２－請求額                    PIC 9(9).
000193         05  作２－本人件数                  PIC 9(3).
000194         05  作２－本人費用額                PIC 9(7).
000195         05  作２－本人負担額                PIC 9(7).
000196         05  作２－本人請求額                PIC 9(7).
000193         05  作２－本人実日数                PIC 9(4).
000197         05  作２－家族件数                  PIC 9(3).
000198         05  作２－家族費用額                PIC 9(7).
000199         05  作２－家族負担額                PIC 9(7).
000200         05  作２－家族請求額                PIC 9(7).
000197         05  作２－家族実日数                PIC 9(4).
000201         05  FILLER                          PIC X(19).
000173*
000174*                           ［ＲＬ＝  １２８］
000175 FD  作業ファイル共 RECORD  CONTAINS 128 CHARACTERS.
000176 01  作共－レコード.
000177     03  作共－レコードキー.
000178         05  作共－請求和暦年月.
000179             07  作共－請求和暦              PIC 9.
000180             07  作共－請求年                PIC 9(2).
000181             07  作共－請求月                PIC 9(2).
001261         05  作共－分類コード                PIC 9(1).
001261         05  作共－県コード                  PIC X(2).
001400         05  作共－保険順                    PIC 9(2).
000183         05  作共－保険者番号                PIC X(10).
001310         05  作共－患者コード.
001320             07 作共－患者番号               PIC 9(6).
001330             07 作共－枝番                   PIC X(1).
001340         05  作共－施術和暦年月.
001350             07  作共－施術和暦              PIC 9.
001360             07  作共－施術年                PIC 9(2).
001370             07  作共－施術月                PIC 9(2).
000188     03  作共－レコードデータ.
001400         05  作共－保険種別                  PIC 9(2).
001280         05  作共－本人家族区分              PIC 9.
000166         05  作共－患者氏名                  PIC X(50).
000192         05  作共－請求額                    PIC 9(9).
000197         05  作共－実日数                    PIC 9(4).
000201         05  FILLER                          PIC X(30).
000303*----------------------------------------------------------------*
000304*----------------------------------------------------------------*
001240******************************************************************
001250*                WORKING-STORAGE SECTION                         *
001260******************************************************************
001270 WORKING-STORAGE         SECTION.
001280 01 キー入力                           PIC X     VALUE SPACE.
001290 01 状態キー                           PIC X(2)  VALUE SPACE.
001300 01 終了フラグ                         PIC X(3)  VALUE SPACE.
001301 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
001302 01 終了フラグ３                       PIC X(3)  VALUE SPACE.
001303 01 作成フラグ                         PIC X(3)  VALUE SPACE.
001304 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
001305 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
001306*
001310 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
001311 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
001320 01 保険者番号ＷＲ.
001530    03 法別番号ＷＲ                    PIC X(2)  VALUE SPACE.
001540    03 保番ＷＲ.
001550       05 都道府県番号ＷＲ             PIC X(2)  VALUE SPACE.
001560       05 保険番号ＷＲ                 PIC X(3)  VALUE SPACE.
001570       05 検証番号ＷＲ                 PIC X     VALUE SPACE.
001580       05 FILLER                       PIC X(2)  VALUE SPACE.
001321 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
001330 01 請求和暦年月ＷＲ.
001340    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
001350    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
001360    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
001370*
001410 01 請求年月Ｗ.
001420    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001430    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
001440    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
001441 01 施術年月Ｗ.
001442    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
001443    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
001444    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
001450 01 集計作業用Ｗ.
001460    03 件数Ｗ                          PIC 9(4)  VALUE ZERO.
001461    03 部位数Ｗ                        PIC 9(5)  VALUE ZERO.
001470    03 通院数Ｗ                        PIC 9(4)  VALUE ZERO.
001480    03 費用額Ｗ                        PIC 9(9)  VALUE ZERO.
001490    03 負担額Ｗ                        PIC 9(9)  VALUE ZERO.
001500    03 請求額Ｗ                        PIC 9(9)  VALUE ZERO.
001510 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
001520 01 ファイル名                         PIC N(2)  VALUE SPACE.
001530 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
001540 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
001541 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
001542* エラーメッセージ用
001543 01 エラーメッセージＷ.
001544    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
001545    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
001546    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
001547    03 FILLER                          PIC X(10) VALUE SPACE.
001548*
001549* 本人/家族集計用
001550 01 本人家族集計用Ｗ.
001551    03 本人件数Ｗ                      PIC 9(3)  VALUE ZERO.
001545    03 本人日数Ｗ                      PIC 9(4)  VALUE ZERO.
001552    03 本人費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001553    03 本人負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001554    03 本人請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001555    03 家族件数Ｗ                      PIC 9(3)  VALUE ZERO.
001551    03 家族日数Ｗ                      PIC 9(4)  VALUE ZERO.
001556    03 家族費用額Ｗ                    PIC 9(7)  VALUE ZERO.
001557    03 家族負担額Ｗ                    PIC 9(7)  VALUE ZERO.
001558    03 家族請求額Ｗ                    PIC 9(7)  VALUE ZERO.
001559*
001560* 県内県外用
001561 01 県内県外ＷＲ                       PIC 9     VALUE ZERO.
001562 01 県ＪＩＳＷＫ                       PIC X(2)  VALUE SPACE.
001563 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001564 01 県内県外チェック                   PIC 9     VALUE ZERO.
001565 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001566 01 県ＷＫ２                           PIC X(2)  VALUE SPACE.
001567 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
001568 01 保険種別県用ＷＫ                   PIC 9(2)  VALUE ZERO.
001569*
001576* 順序用
001577 01 印刷保険種別Ｗ                     PIC 9(2)  VALUE ZERO.
001578 01 印刷順序Ｗ                         PIC 9(3)  VALUE ZERO.
001579*
001580** 助成レセまとめ用
001581 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
001582*
001982 01 請求書関連Ｗ.
002862        07 北海道区分Ｗ                PIC 9 VALUE ZERO.
002862        07 青森区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岩手区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 秋田区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山形区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 茨城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 栃木区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 群馬区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 埼玉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 千葉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 東京区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 神奈川区分Ｗ                PIC 9 VALUE ZERO.
002862        07 新潟区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 富山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 石川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福井区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山梨区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長野区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岐阜区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 静岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 三重区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 滋賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 京都区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大阪区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 兵庫区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 奈良区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 和歌山区分Ｗ                PIC 9 VALUE ZERO.
002862        07 鳥取区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 島根区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岡山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 広島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山口区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 徳島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 香川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛媛区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 高知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 佐賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 熊本区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大分区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 鹿児島区分Ｗ                PIC 9 VALUE ZERO.
002862        07 沖縄区分Ｗ                  PIC 9 VALUE ZERO.
      *
       01 複合プログラム名Ｗ     PIC X(8) VALUE "MOJI2".
      *
001587******************************************************************
001588*                          連結項目                              *
001589******************************************************************
001590*
001591****************
001592* 画面入力情報 *
001593****************
001594**
001595 01 連入－画面情報ＹＨＮ４３０   IS EXTERNAL.
001596    03 連入－請求年月.
001597       05 連入－請求和暦               PIC 9.
001598       05 連入－請求年                 PIC 9(2).
001599       05 連入－請求月                 PIC 9(2).
001600    03 連入－提出年月日.
001601       05 連入－提出和暦               PIC 9.
001602       05 連入－提出年                 PIC 9(2).
001603       05 連入－提出月                 PIC 9(2).
001604       05 連入－提出日                 PIC 9(2).
001605    03 連入－レセプト種類              PIC X(4).
001606    03 連入－保険種別                  PIC 9(2).
001607    03 連入－印刷種類                  PIC 9.
001608    03 連入－本人家族                  PIC 9.
001609    03 連入－用紙種類                  PIC 9.
001610    03 連入－県内県外                  PIC 9.
001611    03 連入－県ＪＩＳ                  PIC X(2).
001612    03 連入－政管ＪＩＳ                PIC X(2).
001613*
001782********************
001792* メッセージ表示キー *
001802********************
001812 01 連メ３－キー IS EXTERNAL.
001822    03  連メ３－メッセージ             PIC N(20).
001832    03  連メ３－メッセージ１           PIC X(20).
001842*
001852************************
001862* 助成レセまとめ
001872************************
001882 01 連レセまとめ－キー IS EXTERNAL.
001892    03 連レセまとめ－施術和暦年月.
001902       05 連レセまとめ－施術和暦               PIC 9.
001912       05 連レセまとめ－施術年月.
001922          07 連レセまとめ－施術年              PIC 9(2).
001932          07 連レセまとめ－施術月              PIC 9(2).
001942    03 連レセまとめ－患者コード.
001952       05 連レセまとめ－患者番号               PIC 9(6).
001962       05 連レセまとめ－枝番                   PIC X(1).
001972**-------------------------------------------------------**
001982*   1:助成レセプトなしの本体まとめの判定
001992*   2:横浜・川崎用の社保助成レセかの判定
002002    03 連レセまとめ－判定区分                  PIC 9.
002012**-------------------------------------------------------**
002022*  / OUT /　 0:対象外、1:対象
002032    03 連レセまとめ－判定結果                  PIC 9.
002042**
002160******************************************************************
002170*                      PROCEDURE  DIVISION                       *
002180******************************************************************
002190 PROCEDURE               DIVISION.
002200************
002210*           *
002220* 初期処理   *
002230*           *
002240************
002250     PERFORM ファイルオープン.
002260     PERFORM 連結項目待避.
002261     PERFORM 制御情報取得.
002270************
002280*           *
002290* 主処理     *
002300*           *
002310************
002320     PERFORM 作業ファイル１作成.
002330     PERFORM 作業ファイル２作成.
002340************
002350*           *
002360* 終了処理   *
002370*           *
002380************
002390     PERFORM 終了処理.
002400     MOVE ZERO TO PROGRAM-STATUS.
002410     EXIT PROGRAM.
002420*
002430*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002440*================================================================*
002450 連結項目待避 SECTION.
002460*
002470* 連結項目の待避
002500     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002510     MOVE 連入－請求年        TO 請求年ＷＲ.
002520     MOVE 連入－請求月        TO 請求月ＷＲ.
002530     MOVE 連入－レセプト種類  TO レセプト種類ＷＲ.
002540     MOVE 連入－保険種別      TO 保険種別ＷＲ.
002550     MOVE 連入－本人家族      TO 本人家族区分ＷＲ.
002551     MOVE 連入－県内県外      TO 県内県外ＷＲ.
002552     MOVE 連入－県ＪＩＳ      TO 県ＪＩＳＷＫ.
002553     MOVE 連入－政管ＪＩＳ    TO 政管ＪＩＳＷＫ.
002554*
002560*================================================================*
002570 ファイルオープン SECTION.
002580*
002581     OPEN INPUT 制御情報マスタ.
002582         MOVE NC"制御情報" TO ファイル名.
002583         PERFORM オープンチェック.
002590     OPEN INPUT 受診者情報Ｆ.
002600         MOVE NC"受診者情報Ｆ" TO ファイル名.
002610         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
002623*================================================================*
002630 オープンチェック SECTION.
002640*
002650     IF 状態キー  NOT =  "00"
002660         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
002670         DISPLAY NC"状態キー：" 状態キー         UPON CONS
002680         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
002690                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
002700         ACCEPT  キー入力 FROM CONS
002710         PERFORM ファイル閉鎖
002720         MOVE 99 TO PROGRAM-STATUS
002730         EXIT PROGRAM.
002731*================================================================*
002732 制御情報取得 SECTION.
002733*
009438* 制御区分02
009439     MOVE 02 TO 制－制御区分.
009440     READ 制御情報マスタ
009441     NOT INVALID KEY
009443        MOVE 制０２－北海道総括表区分  TO 北海道区分Ｗ 
009443        MOVE 制０２－青森総括表区分    TO 青森区分Ｗ 
009443        MOVE 制０２－岩手総括表区分    TO 岩手区分Ｗ 
009443        MOVE 制０２－宮城総括表区分    TO 宮城区分Ｗ 
009443        MOVE 制０２－秋田総括表区分    TO 秋田区分Ｗ 
009443        MOVE 制０２－山形総括表区分    TO 山形区分Ｗ 
009443        MOVE 制０２－福島総括表区分    TO 福島区分Ｗ 
009443        MOVE 制０２－茨城総括表区分    TO 茨城区分Ｗ 
009443        MOVE 制０２－栃木総括表区分    TO 栃木区分Ｗ 
009443        MOVE 制０２－群馬総括表区分    TO 群馬区分Ｗ 
009443        MOVE 制０２－埼玉総括表区分    TO 埼玉区分Ｗ 
009443        MOVE 制０２－千葉総括表区分    TO 千葉区分Ｗ 
009443        MOVE 制０２－東京総括表区分    TO 東京区分Ｗ 
009443        MOVE 制０２－神奈川総括表区分  TO 神奈川区分Ｗ 
009443        MOVE 制０２－新潟総括表区分    TO 新潟区分Ｗ 
009443        MOVE 制０２－富山総括表区分    TO 富山区分Ｗ 
009443        MOVE 制０２－石川総括表区分    TO 石川区分Ｗ 
009443        MOVE 制０２－福井総括表区分    TO 福井区分Ｗ 
009443        MOVE 制０２－山梨総括表区分    TO 山梨区分Ｗ 
009443        MOVE 制０２－長野総括表区分    TO 長野区分Ｗ 
009443        MOVE 制０２－岐阜総括表区分    TO 岐阜区分Ｗ 
009443        MOVE 制０２－静岡総括表区分    TO 静岡区分Ｗ 
009443        MOVE 制０２－愛知総括表区分    TO 愛知区分Ｗ 
009443        MOVE 制０２－三重総括表区分    TO 三重区分Ｗ 
009443        MOVE 制０２－滋賀総括表区分    TO 滋賀区分Ｗ 
009443        MOVE 制０２－京都総括表区分    TO 京都区分Ｗ 
009443        MOVE 制０２－大阪総括表区分    TO 大阪区分Ｗ 
009443        MOVE 制０２－兵庫総括表区分    TO 兵庫区分Ｗ 
009443        MOVE 制０２－奈良総括表区分    TO 奈良区分Ｗ 
009443        MOVE 制０２－和歌山総括表区分  TO 和歌山区分Ｗ 
009443        MOVE 制０２－鳥取総括表区分    TO 鳥取区分Ｗ 
009443        MOVE 制０２－島根総括表区分    TO 島根区分Ｗ 
009443        MOVE 制０２－岡山総括表区分    TO 岡山区分Ｗ 
009443        MOVE 制０２－広島総括表区分    TO 広島区分Ｗ 
009443        MOVE 制０２－山口総括表区分    TO 山口区分Ｗ 
009443        MOVE 制０２－徳島総括表区分    TO 徳島区分Ｗ 
009443        MOVE 制０２－香川総括表区分    TO 香川区分Ｗ 
009443        MOVE 制０２－愛媛総括表区分    TO 愛媛区分Ｗ 
009443        MOVE 制０２－高知総括表区分    TO 高知区分Ｗ 
009443        MOVE 制０２－福岡総括表区分    TO 福岡区分Ｗ 
009443        MOVE 制０２－佐賀総括表区分    TO 佐賀区分Ｗ 
009443        MOVE 制０２－長崎総括表区分    TO 長崎区分Ｗ 
009443        MOVE 制０２－熊本総括表区分    TO 熊本区分Ｗ 
009443        MOVE 制０２－大分総括表区分    TO 大分区分Ｗ 
009443        MOVE 制０２－宮崎総括表区分    TO 宮崎区分Ｗ 
009443        MOVE 制０２－鹿児島総括表区分  TO 鹿児島区分Ｗ 
009443        MOVE 制０２－沖縄総括表区分    TO 沖縄区分Ｗ 
009468     END-READ.
002739*
002740*================================================================*
002750 エラー表示 SECTION.
002760*
002770     DISPLAY NC"状態キー" 状態キー  UPON CONS.
002780     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
002790     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
002800     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
002810     ACCEPT  キー入力 FROM CONS.
002820     PERFORM ファイル閉鎖.
002830     MOVE 99 TO PROGRAM-STATUS.
002840     EXIT PROGRAM.
002841*================================================================*
002842 エラー表示Ｒ SECTION.
002843*
002844     DISPLAY NC"ファイル読込エラー" ファイル名     UPON CONS.
002845     DISPLAY NC"状態キー" 状態キー                 UPON CONS.
002846     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
002847     ACCEPT  キー入力 FROM CONS.
002848     PERFORM ファイル閉鎖.
002849     MOVE 99 TO PROGRAM-STATUS.
002850     EXIT PROGRAM.
002961*================================================================*
002962 作業ファイル３読込 SECTION.
002963*
002964     READ 作業ファイル３ NEXT
002965     AT END
002966         MOVE "YES" TO 終了フラグ
002967     END-READ.
002983*================================================================*
002984 作業ファイル１作成 SECTION.
002985****************************************************************************
002986** 作業ファイル4を読んで、該当保険者の受診者明細ファイル（作業ファイル１）
002987** を作成する。
002988****************************************************************************
002989*
002995     OPEN OUTPUT 作業ファイル１.
002996         MOVE NC"作１" TO ファイル名.
002997         PERFORM オープンチェック.
002891     OPEN INPUT  作業ファイル３.
002892         MOVE NC"作３" TO ファイル名.
002893         PERFORM オープンチェック.
003001*
002901**** 印刷対象レコードには、印刷区分=1 
002902     MOVE  1             TO 作３－印刷区分.
002903     MOVE  ZERO          TO 作３－請求和暦.
002904     MOVE  ZERO          TO 作３－請求年.
002905     MOVE  ZERO          TO 作３－請求月.
006120     MOVE  ZERO          TO 作３－分類コード
006120     MOVE LOW-VALUE      TO 作３－県コード
006120     MOVE ZERO           TO 作３－保険順
002907     MOVE  LOW-VALUE     TO 作３－保険者番号.
002908*
002909     START 作業ファイル３  KEY IS >=  作３－印刷区分
002910                                      作３－請求和暦年月
002911                                      作３－分類コード
002911                                      作３－県コード
002911                                      作３－保険順
002912                                      作３－保険者番号
003002     MOVE SPACE  TO 終了フラグ.
003003     PERFORM 作業ファイル３読込.
003004     PERFORM UNTIL  (終了フラグ = "YES") OR (作３－印刷区分 NOT = 1)
003005*
003006            EVALUATE 作３－保険種別
003007*        ***************************************************
003008*        * 国保・社保・組合・共済・日雇・船員・退職・自衛官
003009*        ***************************************************
003010              WHEN  01
003011              WHEN  02
003012              WHEN  03
003013              WHEN  04
003014              WHEN  06
003015              WHEN  07
003016              WHEN  08
003017              WHEN  09
003018                  PERFORM 作業ファイル１作成１
003019*        *************
003020*        * 老人 *
003021*        *************
003022              WHEN  05
003023                  PERFORM 作業ファイル１作成２
003024*        *************
003025*        * 助成 *
003026*        *************
003027              WHEN  50 THRU 60
003028                  PERFORM 作業ファイル１作成３
003029* 上記以外（労災・自賠責はﾃﾞｰﾀ作成 YHN431,432の対象外の為、ここにはこない）
003030              WHEN OTHER
003031                 MOVE SPACE                TO エラーメッセージＷ
003032                 MOVE 作３－保険種別       TO エラー保険種別Ｗ
003033                 MOVE  NC"保険種別が異常です。保険種別" TO 連メ３－メッセージ
003034                 MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
003035                 CALL   "MSG003"
003036                 CANCEL "MSG003"
003037            END-EVALUATE
003038*
003039            PERFORM 作業ファイル３読込
003040     END-PERFORM.
003041*
003140     CLOSE 作業ファイル３ 作業ファイル１.
003141*
003690*================================================================*
003700 作業ファイル１作成１ SECTION.
003710*
003711****************************************************
003712* 国保・社保・組合・共済・日雇・船員・退職・自衛官
003713****************************************************
003714     MOVE 作３－請求和暦    TO レセ－請求和暦.
003715     MOVE 作３－請求年      TO レセ－請求年.
003716     MOVE 作３－請求月      TO レセ－請求月.
013730     MOVE 1                 TO レセ－レセ種別.
           MOVE SPACE             TO レセ－請求保険者番号.
003719     MOVE ZERO              TO レセ－患者番号.
003720     MOVE LOW-VALUE         TO レセ－枝番.
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003728                                  レセ－施術和暦年月
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ３
003765         PERFORM レセプトＦ読込
003734         PERFORM UNTIL ( 終了フラグ３         = "YES" ) OR
003735                       ( レセ－請求和暦   NOT = 作３－請求和暦 ) OR
003736                       ( レセ－請求年     NOT = 作３－請求年   ) OR
003737                       ( レセ－請求月     NOT = 作３－請求月   ) OR
003738                       ( レセ－レセ種別 NOT = 1 )
003763*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
                      IF (受－保険種別 = 作３－保険種別) AND
                         (受－保険者番号 = 作３－保険者番号)
003923** 本人家族区分ありか
003924                   MOVE SPACE  TO  作成フラグ
003926                   IF 本人家族区分ＷＲ NOT = ZERO
003927                      IF 本人家族区分ＷＲ = 受－本人家族区分
003929                         MOVE "YES"  TO  作成フラグ
003930                      END-IF
003931                   ELSE
003932                      MOVE "YES"  TO  作成フラグ
003933                   END-IF 
003934** 県内県外か
003935                   IF 作成フラグ  = "YES"
003936                      MOVE SPACE  TO  作成フラグ
003937                      MOVE 受－保険種別 TO 保険種別県用ＷＫ
003938                      PERFORM 県内県外取得
003939*                   (県内1、県外2、両方0)
003940                      IF 県内県外ＷＲ NOT = ZERO
003941                         IF 県内県外ＷＲ = 1
003942                            IF 県内県外チェック = 1
003943                               MOVE "YES"  TO  作成フラグ
003944                            END-IF
003945                         ELSE
003946                            IF 県内県外チェック = ZERO
003947                               MOVE "YES"  TO  作成フラグ
003948                            END-IF
003949                         END-IF
003950                      ELSE
003951                         MOVE "YES"  TO  作成フラグ
003952                      END-IF 
003953                   END-IF 
003954*
003959                   IF 作成フラグ  = "YES"
003965                      MOVE SPACE TO 作１－レコード
003966                      INITIALIZE 作１－レコード
003967                      MOVE 受－保険種別    TO 作１－保険種別
003968                      MOVE 受－保険者番号  TO 作１－保険者番号
003969                      PERFORM レコードセット
003970                      PERFORM 健保料金計算
003971                      PERFORM ファイル書込
003972                   END-IF 
003981                END-IF 
003991             END-IF 
004171             PERFORM レセプトＦ読込
004180         END-PERFORM
004190     END-IF.
004247*================================================================*
004248 作業ファイル１作成２ SECTION.
004249*
004250**********************************
004251*  老人
004252**********************************
005170     MOVE 作３－請求和暦  TO レセ－請求和暦.
005180     MOVE 作３－請求年    TO レセ－請求年.  
005190     MOVE 作３－請求月    TO レセ－請求月.  
013730     MOVE 2               TO レセ－レセ種別.
005200     MOVE SPACE           TO レセ－請求保険者番号.
005230     MOVE ZERO            TO レセ－患者番号.
005240     MOVE SPACE           TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003728                                  レセ－施術和暦年月
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ３
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ３ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 作３－請求和暦 ) OR
005340                       ( レセ－請求年   NOT = 作３－請求年   ) OR
005350                       ( レセ－請求月   NOT = 作３－請求月   ) OR
                             ( レセ－レセ種別 NOT = 2 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004278*
004302                IF ( 受－公費種別       = 作３－保険種別 ) AND
004303                   ( 受－費用負担者番号 = 作３－保険者番号 )
004304** 本人家族区分ありか
004305                   MOVE SPACE  TO  作成フラグ
004306                   IF 本人家族区分ＷＲ NOT = ZERO
004307                      IF 本人家族区分ＷＲ = 受－本人家族区分
004308                         MOVE "YES"  TO  作成フラグ
004309                      END-IF
004310                   ELSE
004311                      MOVE "YES"  TO  作成フラグ
004312                   END-IF 
004313** 県内県外か
004314                   IF 作成フラグ  = "YES"
004315                      MOVE SPACE  TO  作成フラグ
004316                      MOVE 受－公費種別 TO 保険種別県用ＷＫ
004317                      PERFORM 県内県外取得
004318*                   (県内1、県外2、両方0)
004319                      IF 県内県外ＷＲ NOT = ZERO
004320                         IF 県内県外ＷＲ = 1
004321                            IF 県内県外チェック = 1
004322                               MOVE "YES"  TO  作成フラグ
004323                            END-IF
004324                         ELSE
004325                            IF 県内県外チェック = ZERO
004326                               MOVE "YES"  TO  作成フラグ
004327                            END-IF
004328                         END-IF
004329                      ELSE
004330                         MOVE "YES"  TO  作成フラグ
004331                      END-IF 
004332                   END-IF 
004333*
004334                   IF 作成フラグ  = "YES"
004337                      MOVE SPACE TO 作１－レコード
004338                      INITIALIZE 作１－レコード
004339                      MOVE 受－公費種別           TO 作１－保険種別
004340                      MOVE 受－費用負担者番号     TO 作１－保険者番号
004341                      PERFORM レコードセット
004342                      PERFORM 老人料金計算
004343* 請求額が ZERO の時は、書き込まない。
004344                      IF  作１－請求額 NOT = ZERO
004345                          PERFORM ファイル書込
004346                      END-IF
004347                   END-IF 
004348                END-IF 
004349             END-IF
004350             PERFORM レセプトＦ読込
004351         END-PERFORM
004352     END-IF.
004353*================================================================*
004354 作業ファイル１作成３ SECTION.
004355*
004356**********************************
004357*  助成
004358**********************************
005170     MOVE 作３－請求和暦  TO レセ－請求和暦.
005180     MOVE 作３－請求年    TO レセ－請求年.  
005190     MOVE 作３－請求月    TO レセ－請求月.  
013730     MOVE 3               TO レセ－レセ種別.
005200     MOVE SPACE           TO レセ－請求保険者番号.
005230     MOVE ZERO            TO レセ－患者番号.
005240     MOVE SPACE           TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000250                                  レセ－レセ種別
000230                                  レセ－請求保険者番号
000240                                  レセ－患者コード
003728                                  レセ－施術和暦年月
003762     END-START.
003763     IF 状態キー = "00"
003764         MOVE SPACE  TO 終了フラグ３
003765         PERFORM レセプトＦ読込
003766         PERFORM UNTIL ( 終了フラグ３ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 作３－請求和暦 ) OR
005340                       ( レセ－請求年   NOT = 作３－請求年   ) OR
005350                       ( レセ－請求月   NOT = 作３－請求月   ) OR
                             ( レセ－レセ種別 NOT = 3 )
004315*
003770             PERFORM データチェック
003830             IF 実行キーＷ = "YES"
004384*
004385                IF ( 受－助成種別           = 作３－保険種別 ) AND
004386                   ( 受－費用負担者番号助成 = 作３－保険者番号)
004387** 本人家族区分ありか
004388                   MOVE SPACE  TO  作成フラグ
004389                   IF 本人家族区分ＷＲ NOT = ZERO
004390                      IF 本人家族区分ＷＲ = 受－本人家族区分
004391                         MOVE "YES"  TO  作成フラグ
004392                      END-IF
004393                   ELSE
004394                      MOVE "YES"  TO  作成フラグ
004395                   END-IF 
004396** 県内県外か
004397                   IF 作成フラグ  = "YES"
004398                      MOVE SPACE  TO  作成フラグ
004399                      MOVE 受－助成種別 TO 保険種別県用ＷＫ
004400                      PERFORM 県内県外取得
004401*                   (県内1、県外2、両方0)
004402                      IF 県内県外ＷＲ NOT = ZERO
004403                         IF 県内県外ＷＲ = 1
004404                            IF 県内県外チェック = 1
004405                               MOVE "YES"  TO  作成フラグ
004406                            END-IF
004407                         ELSE
004408                            IF 県内県外チェック = ZERO
004409                               MOVE "YES"  TO  作成フラグ
004410                            END-IF
004411                         END-IF
004412                      ELSE
004413                         MOVE "YES"  TO  作成フラグ
004414                      END-IF 
004415                   END-IF 
004416*
004417                   IF 作成フラグ  = "YES"
004420                      MOVE SPACE TO 作１－レコード
004421                      INITIALIZE 作１－レコード
004422                      MOVE 受－助成種別           TO 作１－保険種別
004423                      MOVE 受－費用負担者番号助成 TO 作１－保険者番号
004424                      PERFORM レコードセット
004425                      PERFORM 助成料金計算
004431*
004432* 請求額が ZERO の時は、書き込まない。
004433                      IF  作１－請求額 NOT = ZERO
004434                          PERFORM ファイル書込
004435                      END-IF
004436                   END-IF
004437                END-IF
004438             END-IF
004439             PERFORM レセプトＦ読込
004440         END-PERFORM
004441     END-IF.
004450*================================================================*
006930 レセプトＦ読込 SECTION.
006940*
006950     READ レセプトＦ NEXT
004490     AT END
004500         MOVE "YES" TO 終了フラグ３
004510     END-READ.
004830*================================================================*
004831 データチェック SECTION.
004832*
004833     MOVE SPACE          TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
004879*
004887*================================================================*
004888 レコードセット SECTION.
004889*
004890     MOVE レセ－請求和暦    TO 作１－請求和暦.
004891     MOVE レセ－請求年      TO 作１－請求年.
004892     MOVE レセ－請求月      TO 作１－請求月.
005480     MOVE レセ－負担割合    TO 作１－負担割合.
005480     MOVE レセ－レセ実日数  TO 作１－実日数.
004893     MOVE 受－施術和暦      TO 作１－施術和暦.
004894     MOVE 受－施術年        TO 作１－施術年.
004895     MOVE 受－施術月        TO 作１－施術月.
004897     MOVE 受－患者コード    TO 作１－患者コード.
004910     MOVE 受－患者カナ      TO 作１－患者カナ.
004910     MOVE 受－患者氏名      TO 作１－患者氏名.
004920     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
004939     MOVE 受－本人家族区分  TO 作１－本人家族区分.
004932*
005526     IF 受－公費種別 NOT = ZERO
005534         MOVE 1             TO 作１－本人家族区分
           END-IF.
           MOVE 受－保険種別      TO 作１－親保険種別.
005542     PERFORM 分類取得.
004954*
005110*================================================================*
005120 健保料金計算 SECTION.
005130*
005340     MOVE レセ－合計         TO 作１－費用額.
005350     MOVE レセ－一部負担金   TO 作１－負担額.
005360     MOVE レセ－請求金額     TO 作１－請求額.
005231*
005240*================================================================*
005250 老人料金計算 SECTION.
005260*
005340     MOVE レセ－合計         TO 作１－費用額.
005350     MOVE レセ－一部負担金   TO 作１－負担額.
005360     MOVE レセ－請求金額     TO 作１－請求額.
005361*
005370*================================================================*
005380 助成料金計算 SECTION.
005390*
005340     MOVE レセ－合計         TO 作１－費用額.
005350     MOVE レセ－受給者負担額 TO 作１－負担額.
005360     MOVE レセ－助成請求金額 TO 作１－請求額.
005491*
005705*================================================================*
005706 分類取得 SECTION.
005707***************************************************
005708* 分類コード
005709*  1:社保・日雇・船員
      *  2:船員
005710*  3:組合
      *  4:共済・自衛官
005711*  5:1:国保 1:退職 2:後高 3:助成（東京・愛知・高知以外）
005712*  6:助成（東京・愛知・高知）
005716*     /15.6.18 京都の後期高齢の障害で"39261"も直送分へ
005716*
      *  県固有
      *  大阪
      *  5:1:後高 1:助成（親が後高） 2:国保 2:退職 2:助成（親保険が後高以外・東京・愛知・高知以外）
005718***************************************************
005719*
005720     IF レセ－レセ種別  = 3
               IF (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39") OR
                  ((受－費用負担者番号助成(1:5) = "39261") AND (受－公費種別 = 5))
005726            MOVE  6  TO  作１－分類コード
               ELSE
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 30 TO  作１－保険順
               END-IF
005742         MOVE 受－費用負担者番号助成(3:2) TO 作１－県コード
005728     ELSE
005729         IF 受－公費種別 = ZERO
005730*       / 健保 /
005731             EVALUATE 受－保険種別
005741             WHEN 01
005743                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(1:2) TO 作１－県コード
005732             WHEN 02
005733             WHEN 06
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005734             WHEN 07
005736                 MOVE 2  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005737             WHEN 03
005740                 MOVE 3  TO  作１－分類コード
005738             WHEN 04
005739             WHEN 09
005740                 MOVE 4  TO  作１－分類コード
005753             WHEN 08
005755                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005765             END-EVALUATE
005766*
005767         ELSE
005768*       / 老人 /
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 20 TO  作１－保険順
005742             MOVE 受－費用負担者番号(3:2) TO 作１－県コード
005778         END-IF
005779     END-IF.
           IF (大阪区分Ｗ = 1) AND (作１－分類コード = 5)
005720         IF レセ－レセ種別  = 3
                  IF 受－費用負担者番号助成(3:2) = "27"
005729               IF 受－公費種別 = ZERO
005743                  MOVE 2 TO  作１－保険順
                     ELSE
005743                  MOVE 1 TO  作１－保険順
                     END-IF
010202               IF 受－助保険助成(1:3) = "274"
010203                   EVALUATE 受－法別番号助成
010204                   WHEN 41
010205                       MOVE 41274002           TO 作１－保険者番号
010206                   WHEN 80
010207                       MOVE 80274004           TO 作１－保険者番号
010208                   WHEN 82
010209                       MOVE 82274002           TO 作１－保険者番号
010210                   WHEN 83
010211                       MOVE 83274001           TO 作１－保険者番号
010212                   WHEN 86
010213                       MOVE 86274008           TO 作１－保険者番号
                         WHEN 87
009990                       MOVE "87274007"         TO 作１－保険者番号
010214                   WHEN OTHER
010215                       MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010216                   END-EVALUATE
010217               ELSE
010218                   IF ( 受－費用負担者番号助成(3:3) = "275" ) OR ( 受－費用負担者番号助成(3:5) = "27002" )
010219                       EVALUATE 受－法別番号助成
010220                       WHEN 41
010221                           MOVE 41275009           TO 作１－保険者番号
010222                       WHEN 80
010223                           MOVE 80275001           TO 作１－保険者番号
010224                       WHEN 82
010225                           MOVE 82275009           TO 作１－保険者番号
010226                       WHEN 86
010227                           MOVE 86275005           TO 作１－保険者番号
010228                       WHEN OTHER
010229                           MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010230                       END-EVALUATE
010231                   ELSE
010232                       MOVE 受－費用負担者番号助成  TO 作１－保険者番号
010233                   END-IF
                     END-IF
010234            END-IF
005728         ELSE
005729            IF 受－公費種別 = ZERO
005730*       / 健保 /
005731               EVALUATE 受－保険種別
005741               WHEN 01
                         IF 受－保険者番号(1:2) = "27"
005743                      MOVE 2 TO  作１－保険順
009114                      IF 受－保険者番号(1:3) = "274"
009115                          MOVE 00274001       TO 作１－保険者番号
009116                      ELSE
009117                          IF ( 受－保険者番号(1:3) = "275" ) OR ( 受－保険者番号(1:5) = "27002" )
009118                             MOVE 00275008       TO 作１－保険者番号
009119                          ELSE
009120                             MOVE 00             TO 法別番号ＷＲ
009121                             MOVE 受－保険者番号 TO 保番ＷＲ
009121                             MOVE 保険者番号ＷＲ TO 作１－保険者番号
009122                          END-IF
                            END-IF
009123                   END-IF
005753               WHEN 08
                         IF 受－保険者番号(3:2) = "27"
005743                      MOVE 2 TO  作１－保険順
009125                      IF 受－保番(1:3) = "274"
009126                         MOVE 67274001       TO 作１－保険者番号
009127                      ELSE
009128                         IF ( 受－保険者番号(3:3) = "275" ) OR ( 受－保険者番号(3:5) = "27002" )
009129                            MOVE 67275008       TO 作１－保険者番号
009130                         ELSE
009131                            MOVE 受－保険者番号 TO 作１－保険者番号
009132                         END-IF
009133                      END-IF
                         END-IF
005765               END-EVALUATE
005767            ELSE
005768*       / 老人 /
                     IF 受－費用負担者番号(3:2) = "27"
005743                  MOVE 1 TO  作１－保険順
009672                  IF 受－助保険老人(1:3) = "274"
009673                     MOVE 27274000          TO 作１－保険者番号
009674                  ELSE
009675                     IF ( 受－費用負担者番号(3:3) = "275" ) OR ( 受－費用負担者番号(3:5) = "27002" )
009676                        MOVE 27275007           TO 作１－保険者番号
009677                     ELSE
009678                        MOVE 受－費用負担者番号 TO 作１－保険者番号
009679                     END-IF
009680                  END-IF
      */後期高齢は代表番号にまとめる/080419
                        IF 受－保険者番号(1:4) = "3927"
                           MOVE "39270004" TO 作１－保険者番号
                        END-IF
005778               END-IF
                  END-IF
005778         END-IF
005779     END-IF.
005780*
005500*================================================================*
005510 ファイル書込 SECTION.
005520*
005530     WRITE 作１－レコード
005540     INVALID KEY
005550         MOVE NC"作業"  TO ファイル名
005560         PERFORM エラー表示
005570     END-WRITE.
005580*================================================================*
005590 作業ファイル２作成 SECTION.
005600*
005610     OPEN INPUT  作業ファイル１.
005620     OPEN OUTPUT 作業ファイル２.
005620     OPEN OUTPUT 作業ファイル共.
005630*
005640     PERFORM 作業ファイル２作成処理.
005650*
005660     CLOSE 作業ファイル共.
005651     CLOSE 作業ファイル１.
005660     CLOSE 作業ファイル２.
005680*================================================================*
005690 作業ファイル２作成処理 SECTION.
005700*
005813     MOVE SPACE TO 終了フラグ２.
005940*
005950     PERFORM 作業ファイル１読込.
006020     PERFORM UNTIL 終了フラグ２ = "YES"
006120         MOVE 作１－保険者番号   TO 保険者番号Ｗ
006030*
006040         MOVE SPACE TO 作２－レコード
006050         INITIALIZE 作２－レコード
               INITIALIZE 集計作業用Ｗ
               INITIALIZE 本人家族集計用Ｗ
               PERFORM UNTIL (終了フラグ２ = "YES") OR
                             (作１－保険者番号 NOT = 保険者番号Ｗ)
      */150620 京都の県固有を指定した時、後高の障害は７号誌を出すため、親保険が後高ではないものは集計しない
                   IF (京都区分Ｗ = 1) AND
                      ((作１－保険種別 = 53) AND (作２－保険者番号(1:5) = 39261)) AND
                      (作１－親保険種別 NOT = 05)
                      CONTINUE
                   ELSE
006060                PERFORM 作業レコード２累計
006070*
006120                MOVE 作１－請求和暦年月 TO 作２－請求和暦年月
006120                MOVE 作１－分類コード   TO 作２－分類コード
006120                MOVE 作１－県コード     TO 作２－県コード
006120                MOVE 作１－保険順       TO 作２－保険順
006120                MOVE 作１－保険種別     TO 作２－保険種別
006120                MOVE 作１－保険者番号   TO 作２－保険者番号 保険者番号Ｗ
                   END-IF
                   IF 作１－分類コード = 3
                      PERFORM 作業ファイル共作成
                   END-IF
006140             PERFORM 作業ファイル１読込
006150         END-PERFORM
006160         PERFORM 作業レコード２セット
006170         PERFORM 作業ファイル２書込
006180     END-PERFORM.
006230*================================================================*
006240 作業ファイル１読込 SECTION.
006250*
006260     READ 作業ファイル１ NEXT
006270     AT END
006280         MOVE "YES" TO 終了フラグ２
006290     END-READ.
006300*================================================================*
006310 作業レコード２累計 SECTION.
006320*
006510     COMPUTE 件数Ｗ   = 件数Ｗ   + 1.
006520     COMPUTE 費用額Ｗ = 費用額Ｗ + 作１－費用額.
006530     COMPUTE 負担額Ｗ = 負担額Ｗ + 作１－負担額.
006540     COMPUTE 請求額Ｗ = 請求額Ｗ + 作１－請求額.
006541*
006542     IF 作１－本人家族区分 = 1
006543        COMPUTE 本人件数Ｗ   = 本人件数Ｗ   + 1
006544        COMPUTE 本人費用額Ｗ = 本人費用額Ｗ + 作１－費用額
006545        COMPUTE 本人負担額Ｗ = 本人負担額Ｗ + 作１－負担額
006546        COMPUTE 本人請求額Ｗ = 本人請求額Ｗ + 作１－請求額
006530        COMPUTE 本人日数Ｗ   = 本人日数Ｗ   + 作１－実日数
006547     ELSE
006548        COMPUTE 家族件数Ｗ   = 家族件数Ｗ   + 1
006549        COMPUTE 家族費用額Ｗ = 家族費用額Ｗ + 作１－費用額
006550        COMPUTE 家族負担額Ｗ = 家族負担額Ｗ + 作１－負担額
006551        COMPUTE 家族請求額Ｗ = 家族請求額Ｗ + 作１－請求額
006530        COMPUTE 家族日数Ｗ   = 家族日数Ｗ   + 作１－実日数
006552     END-IF.
006553*
006554*===============================================================*
006560 作業レコード２セット SECTION.
006570*
006630     MOVE 件数Ｗ         TO 作２－件数.
006640     MOVE 費用額Ｗ       TO 作２－費用額.
006650     MOVE 負担額Ｗ       TO 作２－負担額.
006660     MOVE 請求額Ｗ       TO 作２－請求額.
006661*
006662     MOVE 本人件数Ｗ     TO 作２－本人件数.
006663     MOVE 本人費用額Ｗ   TO 作２－本人費用額.
006664     MOVE 本人負担額Ｗ   TO 作２－本人負担額.
006665     MOVE 本人請求額Ｗ   TO 作２－本人請求額.
006675     MOVE 本人日数Ｗ     TO 作２－本人実日数.
006666     MOVE 家族件数Ｗ     TO 作２－家族件数.
006667     MOVE 家族費用額Ｗ   TO 作２－家族費用額.
006668     MOVE 家族負担額Ｗ   TO 作２－家族負担額.
006669     MOVE 家族請求額Ｗ   TO 作２－家族請求額.
006679     MOVE 家族日数Ｗ     TO 作２－家族実日数.
006670*
006677*===============================================================*
006680 作業ファイル２書込 SECTION.
006690*
006700     WRITE 作２－レコード
006710     INVALID KEY
006720**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006730         MOVE NC"作２" TO ファイル名
006740         PERFORM エラー表示
006750         PERFORM ファイル閉鎖
006760         MOVE 99 TO PROGRAM-STATUS
006770         EXIT PROGRAM.
006547*===============================================================*
006550 作業ファイル共作成 SECTION.
006560*
006120     MOVE 作１－請求和暦年月 TO 作共－請求和暦年月.
006120     MOVE 作１－分類コード   TO 作共－分類コード.
006120     MOVE 作１－県コード     TO 作共－県コード.
006120     MOVE 作１－保険順       TO 作共－保険順.
006120     MOVE 作１－保険者番号   TO 作共－保険者番号.
006120     MOVE 作１－患者コード   TO 作共－患者コード.
006120     MOVE 作１－施術和暦年月 TO 作共－施術和暦年月.
006120     MOVE 作１－保険種別     TO 作共－保険種別.
006120     MOVE 作１－本人家族区分 TO 作共－本人家族区分.
006120     MOVE 作１－患者氏名     TO 作共－患者氏名.
006670     MOVE 作１－請求額       TO 作共－請求額.
006679     MOVE 作１－実日数       TO 作共－実日数.
006170     PERFORM 作業ファイル共書込.
006680*
006687*===============================================================*
006690 作業ファイル共書込 SECTION.
006700*
006710     WRITE 作共－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作共" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006790*================================================================*
006800 ファイル閉鎖 SECTION.
006810*
006820     CLOSE 制御情報マスタ 受診者情報Ｆ レセプトＦ.
006830*================================================================*
006840 終了処理 SECTION.
006850*
006860     PERFORM ファイル閉鎖.
006870*================================================================*
006871*================================================================*
006872 県内県外取得 SECTION.
006873*
006874      MOVE ZERO  TO  県内県外チェック 県ＷＫ.
006875      EVALUATE  保険種別県用ＷＫ
006876* 国保
006877      WHEN  01
006878         IF 受－保険者番号(1:2) = 県ＪＩＳＷＫ
006879            MOVE  1  TO  県内県外チェック
006880         END-IF
006881         MOVE 受－保険者番号(1:2) TO 県ＷＫ
006882* 社保
006883      WHEN  02
      */協会健保の対応/081009
               IF 受－保険者番号(5:5) = SPACE
006884             IF 受－保険者番号(1:2) = 政管ＪＩＳＷＫ
006885                MOVE  1  TO  県内県外チェック
006886             END-IF
006887             MOVE 受－保険者番号(1:2) TO 県ＷＫ
006888             PERFORM 県統一
006889             MOVE 県統一ＷＫ TO 県ＷＫ
               ELSE
                   IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
                       MOVE  1  TO  県内県外チェック
                   END-IF
                   MOVE 受－保険者番号(3:2) TO 県ＷＫ
               END-IF
006890* 船員
006891* 日雇
006892* 組合
006893* 共済
006894* 自衛官
006895* 退職国保
006896      WHEN  06
006897      WHEN  07
006898      WHEN  08
006899      WHEN  09
006900      WHEN  04
006901      WHEN  03
006902         IF 受－保険者番号(3:2) = 県ＪＩＳＷＫ
006903            MOVE  1  TO  県内県外チェック
006904         END-IF
006905         MOVE 受－保険者番号(3:2) TO 県ＷＫ
006906* 助成
006907      WHEN 50 THRU 60
006908         IF 受－費用負担者番号助成(3:2) = 県ＪＩＳＷＫ
006909            MOVE  1  TO  県内県外チェック
006910         END-IF
006911         MOVE 受－費用負担者番号助成(3:2) TO 県ＷＫ
006912* 老人
006913      WHEN  05
006914         IF 受－費用負担者番号(3:2) = 県ＪＩＳＷＫ
006915            MOVE  1  TO  県内県外チェック
006916         END-IF
006917         MOVE 受－費用負担者番号(3:2) TO 県ＷＫ
006918* 労災、自賠責は除外
006919      WHEN  70
006920      WHEN  80
006920      WHEN  85
006921      WHEN  90
006922         CONTINUE
006923*
006924     WHEN OTHER
006925         MOVE SPACE                TO エラーメッセージＷ
006926         MOVE 受－患者コード       TO エラー患者コードＷ
006927         MOVE 保険種別県用ＷＫ     TO エラー保険種別Ｗ
006928         MOVE "-"                  TO エラー区切りＷ
006929         MOVE  NC"保険種別が異常です。患者－保険種別" TO 連メ３－メッセージ
006930         MOVE  エラーメッセージＷ  TO 連メ３－メッセージ１
006931         CALL   "MSG003"
006932         CANCEL "MSG003"
006933     END-EVALUATE.
006934*
006935*================================================================*
006936 県統一 SECTION.
006937*
006938     MOVE ZERO  TO  県統一ＷＫ.
006939     EVALUATE  県ＷＫ
006940*北海道
006941      WHEN  01
006942         MOVE 01 TO 県統一ＷＫ
006943*青森
006944      WHEN  02
006945         MOVE 02 TO 県統一ＷＫ
006946*岩手
006947      WHEN  03
006948         MOVE 03 TO 県統一ＷＫ
006949*宮城
006950      WHEN  04
006951         MOVE 04 TO 県統一ＷＫ
006952*秋田
006953      WHEN  05
006954         MOVE 05 TO 県統一ＷＫ
006955*山形
006956      WHEN  06
006957         MOVE 06 TO 県統一ＷＫ
006958*福島
006959      WHEN  07
006960         MOVE 07 TO 県統一ＷＫ
006961*茨城
006962      WHEN  08
006963         MOVE 08 TO 県統一ＷＫ
006964*栃木
006965      WHEN  09
006966         MOVE 09 TO 県統一ＷＫ
006967*群馬
006968      WHEN  10
006969         MOVE 10 TO 県統一ＷＫ
006970*埼玉
006971      WHEN  11
006972         MOVE 11 TO 県統一ＷＫ
006973*千葉
006974      WHEN  12
006975         MOVE 12 TO 県統一ＷＫ
006976*東京
006977      WHEN  21
006978         MOVE 13 TO 県統一ＷＫ
006979*神奈川
006980      WHEN  31
006981         MOVE 14 TO 県統一ＷＫ
006982*新潟
006983      WHEN  32
006984         MOVE 15 TO 県統一ＷＫ
006985*富山
006986      WHEN  33
006987         MOVE 16 TO 県統一ＷＫ
006988*石川
006989      WHEN  34
006990         MOVE 17 TO 県統一ＷＫ
006991*福井
006992      WHEN  35
006993         MOVE 18 TO 県統一ＷＫ
006994*山梨
006995      WHEN  36
006996         MOVE 19 TO 県統一ＷＫ
006997*長野
006998      WHEN  37
006999         MOVE 20 TO 県統一ＷＫ
007000*岐阜
007001      WHEN  38
007002         MOVE 21 TO 県統一ＷＫ
007003*静岡
007004      WHEN  39
007005         MOVE 22 TO 県統一ＷＫ
007006*愛知
007007      WHEN  51
007008         MOVE 23 TO 県統一ＷＫ
007009*三重
007010      WHEN  52
007011         MOVE 24 TO 県統一ＷＫ
007012*滋賀
007013      WHEN  53
007014         MOVE 25 TO 県統一ＷＫ
007015*京都
007016      WHEN  54
007017         MOVE 26 TO 県統一ＷＫ
007018*大阪
007019      WHEN  41
007020         MOVE 27 TO 県統一ＷＫ
007021*兵庫
007022      WHEN  42
007023         MOVE 28 TO 県統一ＷＫ
007024*奈良
007025      WHEN  55
007026         MOVE 29 TO 県統一ＷＫ
007027*和歌山
007028      WHEN  56
007029         MOVE 30 TO 県統一ＷＫ
007030*鳥取
007031      WHEN  57
007032         MOVE 31 TO 県統一ＷＫ
007033*島根
007034      WHEN  58
007035         MOVE 32 TO 県統一ＷＫ
007036*岡山
007037      WHEN  59
007038         MOVE 33 TO 県統一ＷＫ
007039*広島
007040      WHEN  60
007041         MOVE 34 TO 県統一ＷＫ
007042*山口
007043      WHEN  61
007044         MOVE 35 TO 県統一ＷＫ
007045*徳島
007046      WHEN  71
007047         MOVE 36 TO 県統一ＷＫ
007048*香川
007049      WHEN  72
007050         MOVE 37 TO 県統一ＷＫ
007051*愛媛
007052      WHEN  73
007053         MOVE 38 TO 県統一ＷＫ
007054*高知
007055      WHEN  74
007056         MOVE 39 TO 県統一ＷＫ
007057*福岡
007058      WHEN  75
007059         MOVE 40 TO 県統一ＷＫ
007060*佐賀
007061      WHEN  76
007062         MOVE 41 TO 県統一ＷＫ
007063*長崎
007064      WHEN  77
007065         MOVE 42 TO 県統一ＷＫ
007066*熊本
007067      WHEN  78
007068         MOVE 43 TO 県統一ＷＫ
007069*大分
007070      WHEN  79
007071         MOVE 44 TO 県統一ＷＫ
007072*宮崎
007073      WHEN  80
007074         MOVE 45 TO 県統一ＷＫ
007075*鹿児島
007076      WHEN  81
007077         MOVE 46 TO 県統一ＷＫ
007078*沖縄
007079      WHEN  82
007080         MOVE 47 TO 県統一ＷＫ
007081*その他
007082      WHEN  OTHER
007083         CONTINUE
007084     END-EVALUATE.
007085*
007234*================================================================*
007235*================================================================*
007236******************************************************************
007237 END PROGRAM YHN434.
007238******************************************************************
