000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YHN581.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*      請求台帳【ﾃﾞｰﾀ作成】柔+ｳｨﾝﾄﾞｳｽﾞ版
000100* 請求年月Ver.のみ
000110*      MED = YHN580  YHN582P
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2014-09-05
000140 DATE-COMPILED.          2014-09-05
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000027     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000028                             ORGANIZATION             IS  INDEXED
000029                             ACCESS MODE              IS  DYNAMIC
000030                             RECORD KEY               IS  制－制御区分
000031                             FILE STATUS              IS  状態キー
000032                             LOCK        MODE         IS  AUTOMATIC.
000420     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000430                             ORGANIZATION             IS  INDEXED
000440                             ACCESS MODE              IS  DYNAMIC
000450                             RECORD KEY               IS 受－施術和暦年月
000460                                                          受－患者コード
000470                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000480                                                          受－患者カナ
000490                                                          受－患者コード
000500                             ALTERNATE RECORD KEY     IS  受－患者コード
000510                                                         受－施術和暦年月
000520                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000530                                                          受－保険種別
000540                                                          受－保険者番号
000550                                                          受－患者コード
000560                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000570                                                          受－公費種別
000580                                                     受－費用負担者番号
000590                                                          受－患者コード
000600                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000610                                                          受－助成種別
000620                                                  受－費用負担者番号助成
000630                                                          受－患者コード
000640                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000650                                                      受－施術和暦年月
000660                                                      受－患者コード
000670                             FILE STATUS              IS  状態キー
000680                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000771*
000902     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5801L.DAT"
000903                             ORGANIZATION             IS  INDEXED
000904                             ACCESS                   IS  DYNAMIC
000905                             RECORD      KEY          IS  作１－請求和暦年月
000907                                                          作１－分類コード
                                                                作１－県コード
                                                                作１－保険順
000908                                                          作１－保険者番号
000909                                                          作１－本人家族区分
                                                                作１－負担割合
000910                                                          作１－患者カナ
000911                                                          作１－患者コード
000912                                                          作１－施術和暦年月
000913                             FILE        STATUS       IS  状態キー
000914                             LOCK        MODE         IS  AUTOMATIC.
000930* 並び順用
000931     SELECT  作業ファイル２  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W5802L.DAT"
000932                             ORGANIZATION             IS  INDEXED
000940                             ACCESS                   IS  DYNAMIC
000950                             RECORD      KEY          IS  作２－施術和暦年月
000960                                                          作２－患者コード
000970                                                          作２－保険種別
000971                             ALTERNATE RECORD KEY     IS  作２－順番
000980                             FILE        STATUS       IS  状態キー
000990                             LOCK        MODE         IS  AUTOMATIC.
      */並び順用　６号
000108     SELECT  作業ファイル３  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4313L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作３－分類コード
000112                                                          作３－県コード
000112                                                          作３－保険順
000113                                                          作３－保険者番号
000980                             FILE        STATUS       IS  状態キー
000990                             LOCK        MODE         IS  AUTOMATIC.
      */並び順用　７号
000108     SELECT  作業ファイル４  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4314L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作４－分類コード
000112                                                          作４－県コード
000112                                                          作４－保険順
000113                                                          作４－保険者番号
000980                             FILE        STATUS       IS  状態キー
000990                             LOCK        MODE         IS  AUTOMATIC.
      */並び順用　レセ
000108     SELECT  作業ファイル５  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W4315L.DAT"
000109                             ORGANIZATION             IS  INDEXED
000110                             ACCESS                   IS  DYNAMIC
000111                             RECORD      KEY          IS  作５－患者コード
000912                                                          作５－施術和暦年月
000912                                                          作５－保険種別
000134                             ALTERNATE RECORD KEY     IS  作５－６号順番
                                                                作５－７号順番
                                                                作５－患者順番
000980                             FILE        STATUS       IS  状態キー
000990                             LOCK        MODE         IS  AUTOMATIC.
001000*
001010******************************************************************
001020*                      DATA DIVISION                             *
001030******************************************************************
001040 DATA                    DIVISION.
001050 FILE                    SECTION.
000126*                           ［ＲＬ＝  ２５６］
000127 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000128     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000991     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
001120*                           ［ＲＬ＝  ３２０］
001130 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001140     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001180*
001181****
001190 FD  作業ファイル１ RECORD  CONTAINS 114 CHARACTERS.
001200 01  作１－レコード.
001210     03  作１－レコードキー.
001220         05  作１－請求和暦年月.
001230             07  作１－請求和暦            PIC 9.
001240             07  作１－請求年              PIC 9(2).
001250             07  作１－請求月              PIC 9(2).
001261         05  作１－分類コード              PIC 9(1).
001261         05  作１－県コード                PIC X(2).
001400         05  作１－保険順                  PIC 9(2).
001271         05  作１－保険者番号.
001530             07 作１－法別番号             PIC X(2).
001540             07 作１－保番.
001550                09 作１－都道府県番号      PIC X(2).
001560                09 作１－保険番号          PIC X(3).
001570                09 作１－検証番号ＷＲ      PIC X.
001580                09 FILLER                  PIC X(2).
001280         05  作１－本人家族区分            PIC 9.
               05  作１－負担割合                PIC 9(2).
001300         05  作１－患者カナ                PIC X(50).
001310         05  作１－患者コード.
001320             07 作１－患者番号             PIC 9(6).
001330             07 作１－枝番                 PIC X(1).
001340         05  作１－施術和暦年月.
001350             07  作１－施術和暦            PIC 9.
001360             07  作１－施術年              PIC 9(2).
001370             07  作１－施術月              PIC 9(2).
001380     03  作１－レコードデータ.
001400         05  作１－保険種別                PIC 9(2).
001271         05  作１－保険者番号正規          PIC X(8).
               05  作１－費用額                  PIC 9(6).
               05  作１－負担額                  PIC 9(6).
               05  作１－請求額                  PIC 9(6).
001260         05  作１－返戻区分                PIC 9.
001459*
001581 FD  作業ファイル２ RECORD  CONTAINS 64 CHARACTERS.
001582 01  作２－レコード.
001583     03  作２－レコードキー.
001584         05  作２－施術和暦年月.
001585             07  作２－施術和暦            PIC 9.
001586             07  作２－施術年              PIC 9(2).
001587             07  作２－施術月              PIC 9(2).
001588         05  作２－患者コード.
001589             07 作２－患者番号             PIC 9(6).
001590             07 作２－枝番                 PIC X(1).
001591         05  作２－保険種別                PIC 9(2).
001592     03  作２－レコードデータ.
001593         05  作２－返戻区分                PIC 9.
001594         05  作２－分類コード              PIC 9(1).
001261         05  作２－県コード                PIC X(2).
001400         05  作２－保険順                  PIC 9(2).
001595         05  作２－順番                    PIC 9(4).
001596         05  作２－本人家族区分            PIC 9.
001597         05  作２－保険者番号              PIC X(8).
001591         05  作２－負担割合                PIC 9(2).
               05  作２－費用額                  PIC 9(6).
               05  作２－負担額                  PIC 9(6).
               05  作２－請求額                  PIC 9(6).
001598         05  FILLER                        PIC X(11).
001599*
000174*                           ［ＲＬ＝  ３２］
000175 FD  作業ファイル３ RECORD  CONTAINS 32 CHARACTERS.
000176 01  作３－レコード.
000177     03  作３－レコードキー.
001261         05  作３－分類コード                PIC 9(1).
001261         05  作３－県コード                  PIC X(2).
001400         05  作３－保険順                    PIC 9(2).
000183         05  作３－保険者番号                PIC X(10).
000188     03  作３－レコードデータ.
001261         05  作３－６号順番                  PIC 9(3).
000201         05  FILLER                          PIC X(13).
000173*
000174*                           ［ＲＬ＝  ３２］
000175 FD  作業ファイル４ RECORD  CONTAINS 32 CHARACTERS.
000176 01  作４－レコード.
000177     03  作４－レコードキー.
001261         05  作４－分類コード                PIC 9(1).
001261         05  作４－県コード                  PIC X(2).
001400         05  作４－保険順                    PIC 9(2).
000183         05  作４－保険者番号                PIC X(10).
000188     03  作４－レコードデータ.
001261         05  作４－６号順番                  PIC 9(3).
001261         05  作４－７号順番                  PIC 9(3).
000201         05  FILLER                          PIC X(11).
000173*
000174*                           ［ＲＬ＝  ３２］
000175 FD  作業ファイル５ RECORD  CONTAINS 32 CHARACTERS.
000176 01  作５－レコード.
000177     03  作５－レコードキー.
001310         05  作５－患者コード.
001320             07 作５－患者番号               PIC 9(6).
001330             07 作５－枝番                   PIC X(1).
001340         05  作５－施術和暦年月.
001350             07  作５－施術和暦              PIC 9.
001360             07  作５－施術年                PIC 9(2).
001370             07  作５－施術月                PIC 9(2).
001400         05  作５－保険種別                  PIC 9(2).
000188     03  作５－レコードデータ.
001261         05  作５－６号順番                  PIC 9(3).
001261         05  作５－７号順番                  PIC 9(3).
001261         05  作５－患者順番                  PIC 9(3).
001261         05  作５－分類コード                PIC 9(1).
000201         05  FILLER                          PIC X(8).
001600*----------------------------------------------------------------*
001601******************************************************************
001610*                WORKING-STORAGE SECTION                         *
001620******************************************************************
001630 WORKING-STORAGE         SECTION.
001640 01 キー入力                           PIC X    VALUE SPACE.
001650 01 状態キー                           PIC X(2) VALUE SPACE.
001660 01 終了フラグ                         PIC X(3) VALUE SPACE.
001670 01 終了フラグ２                       PIC X(3) VALUE SPACE.
001680 01 実行キーＷ                         PIC X(3) VALUE SPACE.
001690 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
001700 01 ファイル名                         PIC N(8) VALUE SPACE.
001710 01 カウンタ                           PIC 9(2) VALUE ZERO.
001720 01 カウンタ２                         PIC 9(2) VALUE ZERO.
001730 01 対象外フラグ                       PIC X(3) VALUE SPACE.
001740 01 分類フラグ                         PIC X(3) VALUE SPACE.
001750 01 作成フラグ                         PIC X(3) VALUE SPACE.
001760 01 脱出フラグ                         PIC X(3) VALUE SPACE.
001770 01 負担割合Ｗ                         PIC 9    VALUE ZERO.
001780 01 順番Ｗ                             PIC 9(4) VALUE ZERO.
001781 01 助成レコードフラグ                 PIC X(3) VALUE SPACE.
001782 01 保険種別Ｗ                         PIC 9(2) VALUE ZERO.
001790*
001800** 退避用
001801 01 返戻区分ＷＲ                       PIC 9 VALUE ZERO.
001802 01 分類コードＷＲ                     PIC 9 VALUE ZERO.
001830 01 請求和暦年月ＷＲ.
001840    03 請求和暦ＷＲ                    PIC 9    VALUE ZERO.
001850    03 請求年ＷＲ                      PIC 9(2) VALUE ZERO.
001860    03 請求月ＷＲ                      PIC 9(2) VALUE ZERO.
001790*
001800** 合計用
       01 集計Ｗ.
          03 当月件数Ｗ                      PIC 9(4) VALUE ZERO.
          03 当月合計額Ｗ                    PIC 9(10) VALUE ZERO.
          03 当月負担金額Ｗ                  PIC 9(10) VALUE ZERO.
          03 当月請求金額Ｗ                  PIC 9(10) VALUE ZERO.
          03 返戻件数Ｗ                      PIC 9(4) VALUE ZERO.
          03 返戻合計額Ｗ                    PIC 9(10) VALUE ZERO.
          03 返戻負担金額Ｗ                  PIC 9(10) VALUE ZERO.
          03 返戻請求金額Ｗ                  PIC 9(10) VALUE ZERO.
          03 総件数Ｗ                        PIC 9(4) VALUE ZERO.
          03 総助成件数Ｗ                    PIC 9(4) VALUE ZERO.
          03 総合計額Ｗ                      PIC 9(10) VALUE ZERO.
          03 総負担金額Ｗ                    PIC 9(10) VALUE ZERO.
          03 総請求金額Ｗ                    PIC 9(10) VALUE ZERO.
          03 総助成金額Ｗ                    PIC 9(10) VALUE ZERO.
001861*
001572* 順序用
001261 01 分類コードＷ                       PIC 9(1) VALUE ZERO.
001261 01 県コードＷ                         PIC X(2) VALUE SPACE.
001400 01 保険順Ｗ                           PIC 9(2) VALUE ZERO.
001400 01 ６号順番Ｗ                         PIC 9(3) VALUE ZERO.
001400 01 ７号順番Ｗ                         PIC 9(3) VALUE ZERO.
001400 01 患者順番Ｗ                         PIC 9(3) VALUE ZERO.
001320 01 保険者番号ＷＲ.
001530    03 法別番号ＷＲ                    PIC X(2)  VALUE SPACE.
001540    03 保番ＷＲ.
001550       05 都道府県番号ＷＲ             PIC X(2)  VALUE SPACE.
001560       05 保険番号ＷＲ                 PIC X(3)  VALUE SPACE.
001570       05 検証番号ＷＲ                 PIC X     VALUE SPACE.
001580       05 FILLER                       PIC X(2)  VALUE SPACE.
001576*
001982 01 請求書関連Ｗ.
002862        07 北海道区分Ｗ                PIC 9 VALUE ZERO.
002862        07 青森区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岩手区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 秋田区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山形区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 茨城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 栃木区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 群馬区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 埼玉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 千葉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 東京区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 神奈川区分Ｗ                PIC 9 VALUE ZERO.
002862        07 新潟区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 富山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 石川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福井区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山梨区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長野区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岐阜区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 静岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 三重区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 滋賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 京都区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大阪区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 兵庫区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 奈良区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 和歌山区分Ｗ                PIC 9 VALUE ZERO.
002862        07 鳥取区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 島根区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岡山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 広島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山口区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 徳島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 香川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛媛区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 高知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 佐賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 熊本区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大分区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 鹿児島区分Ｗ                PIC 9 VALUE ZERO.
002862        07 沖縄区分Ｗ                  PIC 9 VALUE ZERO.
001559 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001561 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001563 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
001582*
001870** エラーメッセージ用
001880 01 エラーメッセージＷ.
001890    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
001900    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
001910    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
001920    03 FILLER                          PIC X(10) VALUE SPACE.
001930*
001940*****************************************************************
001950 01 計算機西暦年Ｗ                     PIC 9(2).
001960* 日付ＷＯＲＫ
001970 01 計算機西暦.
001980    03 計算機西暦年                    PIC 9(4).
001990    03 計算機西暦月日                  PIC 9(4).
002000 01 計算機西暦Ｒ REDEFINES 計算機西暦.
002010    03 計算機世紀                      PIC 9(2).
002020    03 計算機日付                      PIC 9(6).
002030    03 計算機日付Ｒ REDEFINES 計算機日付.
002040       05 計算機年月                   PIC 9(4).
002050       05 計算機年月Ｒ REDEFINES 計算機年月.
002060         07 計算機年                   PIC 9(2).
002070         07 計算機月                   PIC 9(2).
002080       05 計算機日                     PIC 9(2).
002090*
002100******************************************************************
002110*                          連結項目                              *
002120******************************************************************
002130*
002140********************
002150* メッセージ表示キー *
002160********************
002170 01 連メ－キー IS EXTERNAL.
002180    03  連メ－メッセージ               PIC N(20).
002190*
002200 01 連メ３－キー IS EXTERNAL.
002210    03  連メ３－メッセージ             PIC N(20).
002220    03  連メ３－メッセージ１           PIC X(20).
002230****************
002240* 画面入力情報 *
002250****************
002260 01 連入－画面情報ＹＨＮ５８０ IS EXTERNAL.
002270    03 連入－請求和暦年月.
002280       05 連入－請求和暦               PIC 9.
002290       05 連入－請求年月.
002300         07 連入－請求年               PIC 9(2).
002310         07 連入－請求月               PIC 9(2).
          03 連入－プレビュー区分             PIC 9.
002320*
002260 01 連印－印刷情報ＹＨＮ５８１ IS EXTERNAL.
           03 連印－当月件数                 PIC 9(4).
           03 連印－当月合計額               PIC 9(8).
           03 連印－当月負担金額             PIC 9(8).
           03 連印－当月請求金額             PIC 9(8).
           03 連印－返戻件数                 PIC 9(4).
           03 連印－返戻合計額               PIC 9(8).
           03 連印－返戻負担金額             PIC 9(8).
           03 連印－返戻請求金額             PIC 9(8).
           03 連印－総件数                   PIC 9(4).
           03 連印－総合計額                 PIC 9(8).
           03 連印－総負担金額               PIC 9(8).
           03 連印－総請求金額               PIC 9(8).
002363*
002660******************************************************************
002670*                      PROCEDURE  DIVISION                       *
002680******************************************************************
002690 PROCEDURE               DIVISION.
002700************
002710*           *
002720* 初期処理   *
002730*           *
002740************
002750     PERFORM 初期化.
002260     PERFORM 制御情報取得.
002760************
002770*           *
002780* 主処理     *
002790*           *
002800************
002810     PERFORM 作業ファイル作成.
002330     PERFORM 並び順ファイル作成.
002820************
002830*           *
002840* 終了処理   *
002850*           *
002860************
002870     PERFORM 終了処理.
002880     MOVE ZERO TO PROGRAM-STATUS.
002890     EXIT PROGRAM.
002900*
002910*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002920*================================================================*
002930 初期化 SECTION.
002940*
002950     PERFORM ファイルオープン.
002960* 連結項目の待避
002970     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002980     MOVE 連入－請求年        TO 請求年ＷＲ.
002990     MOVE 連入－請求月        TO 請求月ＷＲ.
003000*
003010*================================================================*
003020 ファイルオープン SECTION.
003030*
002581     OPEN INPUT 制御情報マスタ.
002582         MOVE NC"制御情報" TO ファイル名.
002583         PERFORM オープンチェック.
003070     OPEN INPUT 受診者情報Ｆ.
003080         MOVE NC"受診者情報Ｆ" TO ファイル名.
003090         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
003121*
003130*================================================================*
003140 オープンチェック SECTION.
003150*
003160     IF 状態キー  NOT =  "00"
003170         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003180         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003190         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003200                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
003210         ACCEPT  キー入力 FROM CONS
003220         PERFORM ファイル閉鎖
003230         MOVE 99 TO PROGRAM-STATUS
003240         EXIT PROGRAM.
003250*================================================================*
003260 ファイル閉鎖 SECTION.
003270*
003280     CLOSE 制御情報マスタ 受診者情報Ｆ レセプトＦ.
003290*================================================================*
003300 終了処理 SECTION.
003310*
003320     PERFORM ファイル閉鎖.
003330*================================================================*
003340 エラー表示 SECTION.
003350*
003360     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003370     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003380     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003390     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
003400     ACCEPT  キー入力 FROM CONS.
003410     PERFORM ファイル閉鎖.
003420     MOVE 99 TO PROGRAM-STATUS.
003430     EXIT PROGRAM.
002731*================================================================*
002732 制御情報取得 SECTION.
002733*
009438* 制御区分02
009439     MOVE 02 TO 制－制御区分.
009440     READ 制御情報マスタ
009441     NOT INVALID KEY
009443        MOVE 制０２－北海道総括表区分  TO 北海道区分Ｗ 
009443        MOVE 制０２－青森総括表区分    TO 青森区分Ｗ 
009443        MOVE 制０２－岩手総括表区分    TO 岩手区分Ｗ 
009443        MOVE 制０２－宮城総括表区分    TO 宮城区分Ｗ 
009443        MOVE 制０２－秋田総括表区分    TO 秋田区分Ｗ 
009443        MOVE 制０２－山形総括表区分    TO 山形区分Ｗ 
009443        MOVE 制０２－福島総括表区分    TO 福島区分Ｗ 
009443        MOVE 制０２－茨城総括表区分    TO 茨城区分Ｗ 
009443        MOVE 制０２－栃木総括表区分    TO 栃木区分Ｗ 
009443        MOVE 制０２－群馬総括表区分    TO 群馬区分Ｗ 
009443        MOVE 制０２－埼玉総括表区分    TO 埼玉区分Ｗ 
009443        MOVE 制０２－千葉総括表区分    TO 千葉区分Ｗ 
009443        MOVE 制０２－東京総括表区分    TO 東京区分Ｗ 
009443        MOVE 制０２－神奈川総括表区分  TO 神奈川区分Ｗ 
009443        MOVE 制０２－新潟総括表区分    TO 新潟区分Ｗ 
009443        MOVE 制０２－富山総括表区分    TO 富山区分Ｗ 
009443        MOVE 制０２－石川総括表区分    TO 石川区分Ｗ 
009443        MOVE 制０２－福井総括表区分    TO 福井区分Ｗ 
009443        MOVE 制０２－山梨総括表区分    TO 山梨区分Ｗ 
009443        MOVE 制０２－長野総括表区分    TO 長野区分Ｗ 
009443        MOVE 制０２－岐阜総括表区分    TO 岐阜区分Ｗ 
009443        MOVE 制０２－静岡総括表区分    TO 静岡区分Ｗ 
009443        MOVE 制０２－愛知総括表区分    TO 愛知区分Ｗ 
009443        MOVE 制０２－三重総括表区分    TO 三重区分Ｗ 
009443        MOVE 制０２－滋賀総括表区分    TO 滋賀区分Ｗ 
009443        MOVE 制０２－京都総括表区分    TO 京都区分Ｗ 
009443        MOVE 制０２－大阪総括表区分    TO 大阪区分Ｗ 
009443        MOVE 制０２－兵庫総括表区分    TO 兵庫区分Ｗ 
009443        MOVE 制０２－奈良総括表区分    TO 奈良区分Ｗ 
009443        MOVE 制０２－和歌山総括表区分  TO 和歌山区分Ｗ 
009443        MOVE 制０２－鳥取総括表区分    TO 鳥取区分Ｗ 
009443        MOVE 制０２－島根総括表区分    TO 島根区分Ｗ 
009443        MOVE 制０２－岡山総括表区分    TO 岡山区分Ｗ 
009443        MOVE 制０２－広島総括表区分    TO 広島区分Ｗ 
009443        MOVE 制０２－山口総括表区分    TO 山口区分Ｗ 
009443        MOVE 制０２－徳島総括表区分    TO 徳島区分Ｗ 
009443        MOVE 制０２－香川総括表区分    TO 香川区分Ｗ 
009443        MOVE 制０２－愛媛総括表区分    TO 愛媛区分Ｗ 
009443        MOVE 制０２－高知総括表区分    TO 高知区分Ｗ 
009443        MOVE 制０２－福岡総括表区分    TO 福岡区分Ｗ 
009443        MOVE 制０２－佐賀総括表区分    TO 佐賀区分Ｗ 
009443        MOVE 制０２－長崎総括表区分    TO 長崎区分Ｗ 
009443        MOVE 制０２－熊本総括表区分    TO 熊本区分Ｗ 
009443        MOVE 制０２－大分総括表区分    TO 大分区分Ｗ 
009443        MOVE 制０２－宮崎総括表区分    TO 宮崎区分Ｗ 
009443        MOVE 制０２－鹿児島総括表区分  TO 鹿児島区分Ｗ 
009443        MOVE 制０２－沖縄総括表区分    TO 沖縄区分Ｗ 
009468     END-READ.
002740*
003440*================================================================*
003450 作業ファイル作成 SECTION.
003460*
003470     OPEN OUTPUT 作業ファイル１.
003480         MOVE NC"作１" TO ファイル名.
003490         PERFORM オープンチェック.
003500*
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE ZERO          TO レセ－レセ種別.
005200     MOVE ZERO          TO レセ－施術和暦.
005210     MOVE ZERO          TO レセ－施術年.  
005220     MOVE ZERO          TO レセ－施術月.  
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
003620     END-START.
003630     IF 状態キー = "00"
003640         MOVE SPACE  TO 終了フラグ
003650         PERFORM レセプトＦ読込
003660         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   )
003730*
004010             PERFORM データチェック
004470** 労災・自賠責・自由・生保単独は対象外
003790             IF  レセ－レセ種別 = 4 OR 5 OR 6 OR 7 OR 8
004040                MOVE SPACE  TO 実行キーＷ
004050             END-IF
003737             IF  実行キーＷ = "YES"
003738                 PERFORM レコードセット
003739             END-IF
003850             PERFORM レセプトＦ読込
003860         END-PERFORM
003870     END-IF.
           PERFORM 印刷情報セット.
003880*
003890     CLOSE 作業ファイル１.
003900*
003910******
003920     OPEN OUTPUT 作業ファイル２.
003930         MOVE NC"作２" TO ファイル名.
003940         PERFORM オープンチェック.
003950     OPEN INPUT 作業ファイル１.
003960         MOVE NC"作１" TO ファイル名.
003970         PERFORM オープンチェック.
003980*
003990* 並び順用ファイル作成
004000     PERFORM 作業ファイル作成２.
004010*
004020     CLOSE 作業ファイル１ 作業ファイル２.
004030*
004031*****
004032*  ０件かチェック
004033     OPEN INPUT 作業ファイル２.
004034         MOVE NC"作２" TO ファイル名.
004035         PERFORM オープンチェック.
004036     READ 作業ファイル２ NEXT
004037     AT END
004039         MOVE  NC"　データがありません。確認して下さい。" TO 連メ－メッセージ
004040         CALL   "MSG001"
004041         CANCEL "MSG001"
004042     END-READ.
004043     CLOSE 作業ファイル２.
004044*
004046*================================================================*
004050 データチェック SECTION.
004060*
004070     MOVE SPACE  TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
004530*
004540*================================================================*
004630*================================================================*
004640 レセプトＦ読込 SECTION.
004650*
004660     READ レセプトＦ NEXT
004670     AT END
004680         MOVE "YES" TO 終了フラグ
004690     END-READ.
004700*
004780*================================================================*
004790 レコードセット SECTION.
004800*
004801     MOVE SPACE TO 助成レコードフラグ.
004803*
           IF レセ－レセ種別 = 3
004844         MOVE "YES" TO 助成レコードフラグ
           END-IF
004811     PERFORM レコード明細セット.
004827*
005442*================================================================*
005443 レコード明細セット SECTION.
005456*
005473     MOVE SPACE TO 作１－レコード.
005474     INITIALIZE 作１－レコード.
005475     MOVE レセ－請求和暦     TO 作１－請求和暦.
005476     MOVE レセ－請求年       TO 作１－請求年.
005477     MOVE レセ－請求月       TO 作１－請求月.
005478     MOVE レセ－施術和暦     TO 作１－施術和暦.
005479     MOVE レセ－施術年       TO 作１－施術年.
005480     MOVE レセ－施術月       TO 作１－施術月.
005480     MOVE レセ－負担割合     TO 作１－負担割合.
005650     MOVE レセ－請求区分     TO 作１－返戻区分.
005481     MOVE 受－患者コード     TO 作１－患者コード.
005485     MOVE 受－患者カナ       TO 作１－患者カナ.
005527     MOVE 受－本人家族区分   TO 作１－本人家族区分.
      *
           IF 助成レコードフラグ  = "YES"
005517         MOVE 受－費用負担者番号助成  TO 作１－保険者番号 作１－保険者番号正規
005518         MOVE 受－助成種別            TO 作１－保険種別
005526         IF 受－公費種別 = ZERO
                   MOVE レセ－一部負担金    TO 作１－費用額
               ELSE
                   MOVE レセ－一部負担金    TO 作１－費用額
               END-IF
               MOVE レセ－受給者負担額      TO 作１－負担額
               MOVE レセ－助成請求金額      TO 作１－請求額
004698         IF  作１－請求額 NOT = ZERO
                  PERFORM 助成集計
               END-IF
005542         PERFORM 分類取得
005524     ELSE
005526         IF 受－公費種別 = ZERO
005531             MOVE 受－保険者番号      TO 作１－保険者番号 作１－保険者番号正規
005532             MOVE 受－保険種別        TO 作１－保険種別
                   MOVE レセ－合計          TO 作１－費用額
                   MOVE レセ－一部負担金    TO 作１－負担額
                   MOVE レセ－請求金額      TO 作１－請求額
004698             IF  作１－請求額 NOT = ZERO
                      PERFORM 健保集計
                  END-IF
005533         ELSE
005534             MOVE 1                   TO 作１－本人家族区分
005538             MOVE 受－費用負担者番号  TO 作１－保険者番号 作１－保険者番号正規
005539             MOVE 受－公費種別        TO 作１－保険種別
                   MOVE レセ－合計          TO 作１－費用額
                   MOVE レセ－一部負担金    TO 作１－負担額
                   MOVE レセ－請求金額      TO 作１－請求額
004698             IF  作１－請求額 NOT = ZERO
                      PERFORM 健保集計
                  END-IF
005540         END-IF
005541*
005542         PERFORM 分類取得
005543*
005545     END-IF.
005564*
004697* 請求額が ZERO の時は、書き込まない。
004698     IF  作１－請求額 NOT = ZERO
005656         WRITE 作１－レコード
005657         IF 状態キー  NOT =  "00"
005658             MOVE NC"作１"  TO ファイル名
005659             PERFORM エラー表示
               END-IF
005660     END-IF.
005661*
005704*================================================================*
005706 健保集計 SECTION.
      *
           IF レセ－請求区分 NOT = 2
              COMPUTE 当月件数Ｗ     = 当月件数Ｗ     + 1
              COMPUTE 当月合計額Ｗ   = 当月合計額Ｗ   + レセ－合計      
              COMPUTE 当月負担金額Ｗ = 当月負担金額Ｗ + レセ－一部負担金
              COMPUTE 当月請求金額Ｗ = 当月請求金額Ｗ + レセ－請求金額  
           ELSE
              COMPUTE 返戻件数Ｗ     = 返戻件数Ｗ     + 1
              COMPUTE 返戻合計額Ｗ   = 返戻合計額Ｗ   + レセ－合計      
              COMPUTE 返戻負担金額Ｗ = 返戻負担金額Ｗ + レセ－一部負担金
              COMPUTE 返戻請求金額Ｗ = 返戻請求金額Ｗ + レセ－請求金額  
           END-IF.
      *
           COMPUTE 総件数Ｗ     = 総件数Ｗ     + 1.
           COMPUTE 総合計額Ｗ   = 総合計額Ｗ   + レセ－合計      .
           COMPUTE 総負担金額Ｗ = 総負担金額Ｗ + レセ－一部負担金.
           COMPUTE 総請求金額Ｗ = 総請求金額Ｗ + レセ－請求金額  .
      *
005704*================================================================*
005706 助成集計 SECTION.
      *
           IF レセ－請求区分 NOT = 2
              COMPUTE 当月件数Ｗ     = 当月件数Ｗ     + 1
              COMPUTE 当月請求金額Ｗ = 当月請求金額Ｗ + レセ－助成請求金額  
           ELSE
              COMPUTE 返戻件数Ｗ     = 返戻件数Ｗ     + 1
              COMPUTE 返戻請求金額Ｗ = 返戻請求金額Ｗ + レセ－助成請求金額  
           END-IF.
      *
           COMPUTE 総件数Ｗ     = 総件数Ｗ     + 1.
           COMPUTE 総請求金額Ｗ = 総請求金額Ｗ + レセ－助成請求金額  .
      *
005704*================================================================*
005706 印刷情報セット SECTION.
      *
           MOVE 当月件数Ｗ     TO 連印－当月件数.
           MOVE 当月合計額Ｗ   TO 連印－当月合計額.
           MOVE 当月負担金額Ｗ TO 連印－当月負担金額.
           MOVE 当月請求金額Ｗ TO 連印－当月請求金額.
           MOVE 返戻件数Ｗ     TO 連印－返戻件数.
           MOVE 返戻合計額Ｗ   TO 連印－返戻合計額.
           MOVE 返戻負担金額Ｗ TO 連印－返戻負担金額.
           MOVE 返戻請求金額Ｗ TO 連印－返戻請求金額.
           MOVE 総件数Ｗ       TO 連印－総件数.
           MOVE 総合計額Ｗ     TO 連印－総合計額.
           MOVE 総負担金額Ｗ   TO 連印－総負担金額.
           MOVE 総請求金額Ｗ   TO 連印－総請求金額.
      *     MOVE 総助成件数Ｗ   TO 連印－総助成件数.
      *     COMPUTE 連印－助成含請求金額 = 総請求金額Ｗ + 総助成金額Ｗ.
      *
005705*================================================================*
005706 分類取得 SECTION.
005707***************************************************
005708* 分類コード
005709*  1:社保・日雇・船員
      *  2:船員
005710*  3:組合
      *  4:共済・自衛官
005711*  5:1:国保 1:退職 2:後高 3:助成（東京・愛知・高知以外）
005712*  6:助成（東京・愛知・高知）
005716*     /15.6.18 京都の後期高齢の障害で"39261"も直送分へ
005716*
      *  県固有
      *  大阪
      *  5:10:後高 11:助成（親が後高） 20:国保 20:退職 21:助成（親保険が後高以外・東京・愛知・高知以外）
      *       
005718***************************************************
005719*
005720     IF レセ－レセ種別  = 3
               IF (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39") OR
                  ((受－費用負担者番号助成(1:5) = "39261") AND (受－公費種別 = 5))
005726            MOVE  6  TO  作１－分類コード
               ELSE
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 30 TO  作１－保険順
               END-IF
005742         MOVE 受－費用負担者番号助成(3:2) TO 作１－県コード
005728     ELSE
005729         IF 受－公費種別 = ZERO
005730*       / 健保 /
005731             EVALUATE 受－保険種別
005741             WHEN 01
005743                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(1:2) TO 作１－県コード
005732             WHEN 02
                       IF 受－保険者番号(5:5) = SPACE
006878                    MOVE 受－保険者番号(1:2) TO 県ＷＫ
006879                    PERFORM 県統一
006880                    MOVE 県統一ＷＫ TO 県ＷＫ
                       ELSE
006878                    MOVE 受－保険者番号(3:2) TO 県ＷＫ
                       END-IF
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005733             WHEN 06
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005734             WHEN 07
005736                 MOVE 2  TO  作１－分類コード
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005737             WHEN 03
005740                 MOVE 3 TO  作１－分類コード
005738             WHEN 04
005739             WHEN 09
005740                 MOVE 4  TO  作１－分類コード
005753             WHEN 08
005755                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005765             END-EVALUATE
005766*
005767         ELSE
005768*       / 老人 /
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 20 TO  作１－保険順
005742             MOVE 受－費用負担者番号(3:2) TO 作１－県コード
005778         END-IF
005779     END-IF.
           IF (大阪区分Ｗ = 1) AND (作１－分類コード = 5)
005720         IF レセ－レセ種別  = 3
                  IF 受－費用負担者番号助成(3:2) = "27"
005729               IF 受－公費種別 = ZERO
005743                  MOVE 21 TO  作１－保険順
                     ELSE
005743                  MOVE 11 TO  作１－保険順
                     END-IF
010202               IF 受－助保険助成(1:3) = "274"
010203                   EVALUATE 受－法別番号助成
010204                   WHEN 41
010205                       MOVE 41274002           TO 作１－保険者番号
010206                   WHEN 80
010207                       MOVE 80274004           TO 作１－保険者番号
010208                   WHEN 82
010209                       MOVE 82274002           TO 作１－保険者番号
010210                   WHEN 83
010211                       MOVE 83274001           TO 作１－保険者番号
010212                   WHEN 86
010213                       MOVE 86274008           TO 作１－保険者番号
                         WHEN 87
009990                       MOVE "87274007"         TO 作１－保険者番号
010214                   WHEN OTHER
010215                       MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010216                   END-EVALUATE
010217               ELSE
010218                   IF ( 受－費用負担者番号助成(3:3) = "275" ) OR ( 受－費用負担者番号助成(3:5) = "27002" )
010219                       EVALUATE 受－法別番号助成
010220                       WHEN 41
010221                           MOVE 41275009           TO 作１－保険者番号
010222                       WHEN 80
010223                           MOVE 80275001           TO 作１－保険者番号
010224                       WHEN 82
010225                           MOVE 82275009           TO 作１－保険者番号
010226                       WHEN 86
010227                           MOVE 86275005           TO 作１－保険者番号
010228                       WHEN OTHER
010229                           MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010230                       END-EVALUATE
010231                   ELSE
010232                       MOVE 受－費用負担者番号助成  TO 作１－保険者番号
010233                   END-IF
                     END-IF
010234            END-IF
005728         ELSE
005729            IF 受－公費種別 = ZERO
005730*       / 健保 /
005731               EVALUATE 受－保険種別
005741               WHEN 01
                         IF 受－保険者番号(1:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009114                      IF 受－保険者番号(1:3) = "274"
009115                          MOVE 00274001       TO 作１－保険者番号
009116                      ELSE
009117                          IF ( 受－保険者番号(1:3) = "275" ) OR ( 受－保険者番号(1:5) = "27002" )
009118                             MOVE 00275008       TO 作１－保険者番号
009119                          ELSE
009120                             MOVE 00             TO 法別番号ＷＲ
009121                             MOVE 受－保険者番号 TO 保番ＷＲ
009121                             MOVE 保険者番号ＷＲ TO 作１－保険者番号
009122                          END-IF
                            END-IF
009123                   END-IF
005753               WHEN 08
                         IF 受－保険者番号(3:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009125                      IF 受－保番(1:3) = "274"
009126                         MOVE 67274001       TO 作１－保険者番号
009127                      ELSE
009128                         IF ( 受－保険者番号(3:3) = "275" ) OR ( 受－保険者番号(3:5) = "27002" )
009129                            MOVE 67275008       TO 作１－保険者番号
009130                         ELSE
009131                            MOVE 受－保険者番号 TO 作１－保険者番号
009132                         END-IF
009133                      END-IF
                         END-IF
005765               END-EVALUATE
005767            ELSE
005768*       / 老人 /
                     IF 受－費用負担者番号(3:2) = "27"
005743                  MOVE 10 TO  作１－保険順
009672                  IF 受－助保険老人(1:3) = "274"
009673                     MOVE 27274000          TO 作１－保険者番号
009674                  ELSE
009675                     IF ( 受－費用負担者番号(3:3) = "275" ) OR ( 受－費用負担者番号(3:5) = "27002" )
009676                        MOVE 27275007           TO 作１－保険者番号
009677                     ELSE
009678                        MOVE 受－費用負担者番号 TO 作１－保険者番号
009679                     END-IF
009680                  END-IF
      */後期高齢は代表番号にまとめる/080419
                        IF 受－保険者番号(1:4) = "3927"
                           MOVE "39270004" TO 作１－保険者番号
                        END-IF
005778               END-IF
                  END-IF
005778         END-IF
005779     END-IF.
005780*
005809*================================================================*
005810 作業ファイル作成２ SECTION.
005811*
005813     MOVE SPACE TO 終了フラグ.
005814     MOVE ZERO  TO 順番Ｗ.      
005815     PERFORM 作業ファイル１読込.
005818     PERFORM UNTIL 終了フラグ = "YES"
005819         PERFORM 作２レコードセット
005820         PERFORM 作２ファイル書込
005821*
005824         PERFORM 作業ファイル１読込
005825     END-PERFORM.
005826*
005843*================================================================*
005844 作２レコードセット SECTION.
005845*
005851     COMPUTE 順番Ｗ  = 順番Ｗ + 1.
005852     MOVE 順番Ｗ  TO 作２－順番.
005853*
005854     MOVE 作１－施術和暦       TO 作２－施術和暦.
005855     MOVE 作１－施術年         TO 作２－施術年.
005856     MOVE 作１－施術月         TO 作２－施術月.
005857     MOVE 作１－患者コード     TO 作２－患者コード.
005858     MOVE 作１－保険種別       TO 作２－保険種別.
005859     MOVE 作１－返戻区分       TO 作２－返戻区分.
005860     MOVE 作１－分類コード     TO 作２－分類コード.
005860     MOVE 作１－県コード       TO 作２－県コード.
005860     MOVE 作１－保険順         TO 作２－保険順.
005861     MOVE 作１－本人家族区分   TO 作２－本人家族区分.
005862     MOVE 作１－保険者番号正規 TO 作２－保険者番号.
005859     MOVE 作１－負担割合       TO 作２－負担割合.
005859     MOVE 作１－費用額         TO 作２－費用額.
005859     MOVE 作１－負担額         TO 作２－負担額.
005859     MOVE 作１－請求額         TO 作２－請求額.
005863*
005886*================================================================*
005887 作２ファイル書込 SECTION.
005888*
005889     WRITE 作２－レコード
005890     INVALID KEY
005891         MOVE NC"作２"  TO ファイル名
005892         PERFORM エラー表示
005893     END-WRITE.
005894*================================================================*
005895 作業ファイル１読込 SECTION.
005896*
005897     READ 作業ファイル１ NEXT
005898     AT END
005899         MOVE "YES" TO 終了フラグ
005900     END-READ.
005901*
002850*================================================================*
002860 並び順ファイル作成 SECTION.
002870*
005610     OPEN INPUT  作業ファイル１.
005620     OPEN OUTPUT 作業ファイル３.
005620     OPEN OUTPUT 作業ファイル４.
005620     OPEN OUTPUT 作業ファイル５.
005630*
005813     MOVE SPACE TO 終了フラグ.
           MOVE ZERO  TO ６号順番Ｗ.
005940*
005950     PERFORM 作業ファイル１読込.
006020     PERFORM UNTIL 終了フラグ = "YES"
               MOVE ZERO  TO ７号順番Ｗ
006120         MOVE 作１－分類コード   TO 作３－分類コード 作４－分類コード 作５－分類コード 分類コードＷ
006120         MOVE 作１－県コード     TO 作３－県コード 作４－県コード 県コードＷ
006120         MOVE 作１－保険者番号   TO 作４－保険者番号 保険者番号ＷＲ
006120         MOVE 作１－保険順       TO 作３－保険順 保険順Ｗ
               IF 作１－分類コード = 3 OR 4
006120            MOVE 作１－保険者番号   TO 作３－保険者番号
               ELSE
006120            MOVE SPACE              TO 作３－保険者番号
               END-IF
006120         COMPUTE ６号順番Ｗ = ６号順番Ｗ + 1
               MOVE ６号順番Ｗ         TO 作３－６号順番 作４－６号順番 作５－６号順番
006170         PERFORM 作業ファイル３書込
               PERFORM UNTIL (終了フラグ         = "YES") OR
                             (作１－分類コード NOT = 分類コードＷ) OR
                             (((作１－県コード = SPACE) AND (作１－保険者番号 NOT = 保険者番号ＷＲ)) OR
                             ((作１－県コード NOT = SPACE) AND (作１－県コード   NOT = 県コードＷ))) OR
                             ((作１－分類コード = 5) AND (作１－保険順(1:1) NOT = 保険順Ｗ(1:1)))
                   MOVE ZERO  TO 患者順番Ｗ
006120             MOVE 作１－保険順         TO 作４－保険順 保険順Ｗ
006120             MOVE 作１－保険者番号     TO 作４－保険者番号 保険者番号ＷＲ
006120             COMPUTE ７号順番Ｗ = ７号順番Ｗ + 1
                   MOVE ７号順番Ｗ           TO 作４－７号順番 作５－７号順番
006170             PERFORM 作業ファイル４書込
                   PERFORM UNTIL (終了フラグ         = "YES") OR
                                 (作１－保険順(1:1)  NOT = 保険順Ｗ(1:1)) OR
                                 (作１－保険者番号   NOT = 保険者番号ＷＲ)
006120                 MOVE 作１－患者コード       TO 作５－患者コード
006120                 MOVE 作１－施術和暦年月     TO 作５－施術和暦年月
006120                 MOVE 作１－保険種別         TO 作５－保険種別
006120                 COMPUTE 患者順番Ｗ = 患者順番Ｗ + 1
                       MOVE 患者順番Ｗ             TO 作５－患者順番
006170                 PERFORM 作業ファイル５書込
006140                 PERFORM 作業ファイル１読込
006150             END-PERFORM
006150         END-PERFORM
006070*
006180     END-PERFORM.
005650*
005660     CLOSE 作業ファイル５.
005660     CLOSE 作業ファイル４.
005660     CLOSE 作業ファイル３.
005670     CLOSE 作業ファイル１.
006928*================================================================*
006929 県統一 SECTION.
006930*
006931     MOVE ZERO  TO  県統一ＷＫ.
006932     EVALUATE  県ＷＫ
006933*北海道
006934      WHEN  01
006935         MOVE 01 TO 県統一ＷＫ
006936*青森
006937      WHEN  02
006938         MOVE 02 TO 県統一ＷＫ
006939*岩手
006940      WHEN  03
006941         MOVE 03 TO 県統一ＷＫ
006942*宮城
006943      WHEN  04
006944         MOVE 04 TO 県統一ＷＫ
006945*秋田
006946      WHEN  05
006947         MOVE 05 TO 県統一ＷＫ
006948*山形
006949      WHEN  06
006950         MOVE 06 TO 県統一ＷＫ
006951*福島
006952      WHEN  07
006953         MOVE 07 TO 県統一ＷＫ
006954*茨城
006955      WHEN  08
006956         MOVE 08 TO 県統一ＷＫ
006957*栃木
006958      WHEN  09
006959         MOVE 09 TO 県統一ＷＫ
006960*群馬
006961      WHEN  10
006962         MOVE 10 TO 県統一ＷＫ
006963*埼玉
006964      WHEN  11
006965         MOVE 11 TO 県統一ＷＫ
006966*千葉
006967      WHEN  12
006968         MOVE 12 TO 県統一ＷＫ
006969*東京
006970      WHEN  21
006971         MOVE 13 TO 県統一ＷＫ
006972*神奈川
006973      WHEN  31
006974         MOVE 14 TO 県統一ＷＫ
006975*新潟
006976      WHEN  32
006977         MOVE 15 TO 県統一ＷＫ
006978*富山
006979      WHEN  33
006980         MOVE 16 TO 県統一ＷＫ
006981*石川
006982      WHEN  34
006983         MOVE 17 TO 県統一ＷＫ
006984*福井
006985      WHEN  35
006986         MOVE 18 TO 県統一ＷＫ
006987*山梨
006988      WHEN  36
006989         MOVE 19 TO 県統一ＷＫ
006990*長野
006991      WHEN  37
006992         MOVE 20 TO 県統一ＷＫ
006993*岐阜
006994      WHEN  38
006995         MOVE 21 TO 県統一ＷＫ
006996*静岡
006997      WHEN  39
006998         MOVE 22 TO 県統一ＷＫ
006999*愛知
007000      WHEN  51
007001         MOVE 23 TO 県統一ＷＫ
007002*三重
007003      WHEN  52
007004         MOVE 24 TO 県統一ＷＫ
007005*滋賀
007006      WHEN  53
007007         MOVE 25 TO 県統一ＷＫ
007008*京都
007009      WHEN  54
007010         MOVE 26 TO 県統一ＷＫ
007011*大阪
007012      WHEN  41
007013         MOVE 27 TO 県統一ＷＫ
007014*兵庫
007015      WHEN  42
007016         MOVE 28 TO 県統一ＷＫ
007017*奈良
007018      WHEN  55
007019         MOVE 29 TO 県統一ＷＫ
007020*和歌山
007021      WHEN  56
007022         MOVE 30 TO 県統一ＷＫ
007023*鳥取
007024      WHEN  57
007025         MOVE 31 TO 県統一ＷＫ
007026*島根
007027      WHEN  58
007028         MOVE 32 TO 県統一ＷＫ
007029*岡山
007030      WHEN  59
007031         MOVE 33 TO 県統一ＷＫ
007032*広島
007033      WHEN  60
007034         MOVE 34 TO 県統一ＷＫ
007035*山口
007036      WHEN  61
007037         MOVE 35 TO 県統一ＷＫ
007038*徳島
007039      WHEN  71
007040         MOVE 36 TO 県統一ＷＫ
007041*香川
007042      WHEN  72
007043         MOVE 37 TO 県統一ＷＫ
007044*愛媛
007045      WHEN  73
007046         MOVE 38 TO 県統一ＷＫ
007047*高知
007048      WHEN  74
007049         MOVE 39 TO 県統一ＷＫ
007050*福岡
007051      WHEN  75
007052         MOVE 40 TO 県統一ＷＫ
007053*佐賀
007054      WHEN  76
007055         MOVE 41 TO 県統一ＷＫ
007056*長崎
007057      WHEN  77
007058         MOVE 42 TO 県統一ＷＫ
007059*熊本
007060      WHEN  78
007061         MOVE 43 TO 県統一ＷＫ
007062*大分
007063      WHEN  79
007064         MOVE 44 TO 県統一ＷＫ
007065*宮崎
007066      WHEN  80
007067         MOVE 45 TO 県統一ＷＫ
007068*鹿児島
007069      WHEN  81
007070         MOVE 46 TO 県統一ＷＫ
007071*沖縄
007072      WHEN  82
007073         MOVE 47 TO 県統一ＷＫ
007074*その他
007075      WHEN  OTHER
007076         CONTINUE
007077     END-EVALUATE.
007078*
006687*===============================================================*
006690 作業ファイル３書込 SECTION.
006700*
006710     WRITE 作３－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作３" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006687*===============================================================*
006690 作業ファイル４書込 SECTION.
006700*
006710     WRITE 作４－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作４" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
006687*===============================================================*
006690 作業ファイル５書込 SECTION.
006700*
006710     WRITE 作５－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作５" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
005910*================================================================*
005911******************************************************************
005912 END PROGRAM YHN581.
005913******************************************************************
