000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YHN6061.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*         レセプトリスト印刷【ﾃﾞｰﾀ作成】新柔ｳｨﾝﾄﾞｳｽﾞ版
000100*  請求年月バージョン 
000110*         MED = YAW610 YHN612 
000120*----------------------------------------------------------------*
000130 DATE-WRITTEN.           2014-09-03
000140 DATE-COMPILED.          2014-09-03
000150*----------------------------------------------------------------*
000160******************************************************************
000170*            ENVIRONMENT         DIVISION                        *
000180******************************************************************
000190 ENVIRONMENT             DIVISION.
000200 CONFIGURATION           SECTION.
000210 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000220 OBJECT-COMPUTER.        FMV-DESKPOWER.
000230 SPECIAL-NAMES.          CONSOLE  IS  CONS
000240                         SYSERR   IS  MSGBOX.
000250 INPUT-OUTPUT            SECTION.
000260 FILE-CONTROL.
000270     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000280                             ORGANIZATION             IS  INDEXED
000290                             ACCESS MODE              IS  DYNAMIC
000300                             RECORD KEY               IS 受－施術和暦年月
000310                                                          受－患者コード
000320                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000330                                                          受－患者カナ
000340                                                          受－患者コード
000350                             ALTERNATE RECORD KEY     IS  受－患者コード
000360                                                         受－施術和暦年月
000370                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000380                                                          受－保険種別
000390                                                          受－保険者番号
000400                                                          受－患者コード
000410                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000420                                                          受－公費種別
000430                                                     受－費用負担者番号
000440                                                          受－患者コード
000450                             ALTERNATE RECORD KEY     IS 受－施術和暦年月
000460                                                          受－助成種別
000470                                                  受－費用負担者番号助成
000480                                                          受－患者コード
000490                             ALTERNATE RECORD KEY  IS 受－請求和暦年月
000500                                                      受－施術和暦年月
000510                                                      受－患者コード
000520                             FILE STATUS              IS  状態キー
000530                             LOCK        MODE         IS  AUTOMATIC.
000630     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000640                             ORGANIZATION             IS  INDEXED
000650                             ACCESS MODE              IS  DYNAMIC
000660                             RECORD KEY               IS  制－制御区分
000670                             FILE STATUS              IS  状態キー
000680                             LOCK        MODE         IS  AUTOMATIC.
000780     SELECT  請求先マスタ    ASSIGN      TO         SEIKYUSL
000790                             ORGANIZATION             IS  INDEXED
000800                             ACCESS MODE              IS  DYNAMIC
000810                             RECORD KEY               IS  請先－保険種別
000820                                                          請先－保険者番号
000830                             FILE STATUS              IS  状態キー
000840                             LOCK    MODE             IS  AUTOMATIC.
000850     SELECT  保険者マスタ    ASSIGN      TO        HOKENSL
000860                             ORGANIZATION             IS  INDEXED
000870                             ACCESS MODE              IS  DYNAMIC
000880                             RECORD KEY               IS  保－保険種別
000890                                                          保－保険者番号
000900* 将来は、キー項目の保険者名称を保険者カナにする
000910                             ALTERNATE RECORD KEY     IS  保－保険種別
000920                                                          保－保険者名称
000930                                                          保－保険者番号
000940                             FILE STATUS              IS  状態キー
000950                             LOCK        MODE         IS  AUTOMATIC.
000960     SELECT  市町村マスタ    ASSIGN      TO        SITYOSNL
000970                             ORGANIZATION             IS  INDEXED
000980                             ACCESS MODE              IS  DYNAMIC
000990                             RECORD KEY               IS  市－公費種別
001000                                                          市－市町村番号
001010                             ALTERNATE RECORD KEY     IS  市－公費種別
001020                                                          市－市町村名称
001030                                                          市－市町村番号
001040                             FILE STATUS              IS  状態キー
001050                             LOCK        MODE         IS  AUTOMATIC.
000241     SELECT  生保情報Ｆ      ASSIGN      TO        SEIHOJL
000242                             ORGANIZATION             IS INDEXED
000243                             ACCESS MODE              IS DYNAMIC
000244                             RECORD KEY               IS 生保－施術和暦年月
000245                                                         生保－患者コード
000255                             ALTERNATE RECORD KEY     IS 生保－患者コード
000265                                                         生保－施術和暦年月
000277                             FILE STATUS              IS 状態キー
000278                             LOCK        MODE         IS AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
001060     SELECT  作業ファイル１  ASSIGN      TO   "C:\MAKISHISYS\YAWOBJ\TEMP\W6101L.DAT"
001070                             ORGANIZATION             IS  INDEXED
001080                             ACCESS                   IS  DYNAMIC
001090                             RECORD      KEY          IS  作１－請求和暦年月
000907                                                          作１－分類コード
                                                                作１－県コード
                                                                作１－保険順
001130                                                          作１－保険者番号
001140                                                          作１－本人家族区分
                                                                作１－負担割合
001150                                                          作１－患者カナ
001160                                                          作１－患者コード
001170                                                          作１－施術和暦年月
001180                             FILE        STATUS       IS  状態キー
001190                             LOCK        MODE         IS  AUTOMATIC.
001200     SELECT  作業ファイル２  ASSIGN      TO  "C:\MAKISHISYS\YAWOBJ\TEMP\W6102L.DAT"
001210                             ORGANIZATION             IS  INDEXED
001220                             ACCESS                   IS  DYNAMIC
001230                             RECORD      KEY          IS  作２－保険区分
                                                                作２－順番
                                   ALTERNATE RECORD KEY     IS  作２－施術和暦年月
                                                                作２－患者コード
                                                                作２－保険区分
                                                                作２－順番
001240                             FILE        STATUS       IS  状態キー
001250                             LOCK        MODE         IS  AUTOMATIC.
001080* レセ並び順用
001081     SELECT  作業ファイル３  ASSIGN      TO  "C:\MAKISHISYS\YAWOBJ\TEMP\W5912L.DAT"
001100                             ORGANIZATION             IS  INDEXED
001110                             ACCESS                   IS  DYNAMIC
001120                             RECORD      KEY          IS  作３－施術和暦年月
001130                                                          作３－患者コード
001140                                                          作３－保険種別
001150                             FILE        STATUS       IS  状態キー
001160                             LOCK        MODE         IS  AUTOMATIC.
001260******************************************************************
001270*                      DATA DIVISION                             *
001280******************************************************************
001290 DATA                    DIVISION.
001300 FILE                    SECTION.
001310*                           ［ＲＬ＝  ３２０］
001320 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001330     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001340*                           ［ＲＬ＝  ２５６］
001350 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001360     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000991     COPY SEIGYO02        OF  XFDLIB  JOINING   制０２   AS  PREFIX.
001430*                           ［ＲＬ＝  １２８］
001440 FD  請求先マスタ          BLOCK   CONTAINS   1   RECORDS.
001450     COPY SEIKYUS         OF  XFDLIB  JOINING   請先   AS  PREFIX.
001460*                           ［ＲＬ＝  ３２０］
001470 FD  保険者マスタ        BLOCK   CONTAINS   1   RECORDS.
001480     COPY HOKENS          OF  XFDLIB  JOINING   保   AS  PREFIX.
001490*                           ［ＲＬ＝  ２５６］
001500 FD  市町村マスタ          BLOCK   CONTAINS   1   RECORDS.
001510     COPY SITYOSN        OF  XFDLIB  JOINING   市   AS  PREFIX.
001080* 
000280 FD  生保情報Ｆ          BLOCK   CONTAINS   1   RECORDS.
000281     COPY SEIHOJ          OF  XFDLIB  JOINING   生保   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001520* 
001530 FD  作業ファイル１ RECORD  CONTAINS 256 CHARACTERS.
001540 01  作１－レコード.
001550     03  作１－レコードキー.
001560         05  作１－請求和暦年月.
001570             07  作１－請求和暦              PIC 9.
001580             07  作１－請求年                PIC 9(2).
001590             07  作１－請求月                PIC 9(2).
001261         05  作１－分類コード                PIC 9(1).
001261         05  作１－県コード                  PIC X(2).
001400         05  作１－保険順                    PIC 9(2).
001271         05  作１－保険者番号.
001530             07 作１－法別番号             PIC X(2).
001540             07 作１－保番.
001550                09 作１－都道府県番号      PIC X(2).
001560                09 作１－保険番号          PIC X(3).
001570                09 作１－検証番号ＷＲ      PIC X.
001580                09 FILLER                  PIC X(2).
001640         05  作１－本人家族区分              PIC 9.
               05  作１－負担割合                  PIC 9(2).
001650         05  作１－患者カナ                  PIC X(50).
001660         05  作１－患者コード.
001670             07 作１－患者番号               PIC 9(6).
001680             07 作１－枝番                   PIC X(1).
001690         05  作１－施術和暦年月.
001700             07  作１－施術和暦              PIC 9.
001710             07  作１－施術年                PIC 9(2).
001720             07  作１－施術月                PIC 9(2).
001730     03  作１－レコードデータ.
001221         05  作１－レセ種別                  PIC 9(2).
001740         05  作１－患者氏名                  PIC X(50).
001760         05  作１－被保険者氏名              PIC X(50).
001750         05  作１－保険種別                  PIC 9(2).
001271         05  作１－保険者番号正規            PIC X(8).
001760         05  作１－ラベルチェック            PIC X.
001366         05  作１－費用額                    PIC 9(6).
001367         05  作１－負担額                    PIC 9(6).
001368         05  作１－請求額                    PIC 9(6).
001369         05  作１－レセ印刷区分              PIC 9.
001770         05  FILLER                          PIC X(37).
001780*
001790 FD  作業ファイル２ RECORD  CONTAINS 155 CHARACTERS.
001800 01  作２－レコード.
001810     03  作２－レコードキー.
001820         05  作２－保険区分                PIC 9(1).
001820         05  作２－順番                    PIC 9(4).
001830     03  作２－レコードデータ.
               05  作２－レセ種別                PIC 9(2).
001840         05  作２－患者コード.
001850             07 作２－患者番号             PIC 9(6).
001860             07 作２－枝番                 PIC X(1).
001870         05  作２－患者氏名                PIC X(50).
001740         05  作２－被保険者氏名            PIC X(50).
001880         05  作２－保険種別                PIC 9(2).
               05  作２－請求保険者番号          PIC X(10).
001890         05  作２－本人家族                PIC X(4).
001900         05  作２－施術和暦年月.
001910             07  作２－施術和暦            PIC 9.
001920             07  作２－施術年              PIC 9(2).
001930             07  作２－施術月              PIC 9(2).
001940         05  作２－印刷指定                PIC 9(1).
               05  作２－費用額                  PIC 9(6).
               05  作２－負担額                  PIC 9(6).
               05  作２－請求額                  PIC 9(6).
               05  作２－レセ印刷区分            PIC 9.
001730*
001740 FD  作業ファイル３ RECORD  CONTAINS 32 CHARACTERS.
001750 01  作３－レコード.
001760     03  作３－レコードキー.
001770         05  作３－施術和暦年月.
001780             07  作３－施術和暦            PIC 9.
001790             07  作３－施術年              PIC 9(2).
001800             07  作３－施術月              PIC 9(2).
001810         05  作３－患者コード.
001820             07 作３－患者番号             PIC 9(6).
001830             07 作３－枝番                 PIC X(1).
001840         05  作３－保険種別                PIC 9(2).
001850     03  作３－レコードデータ.
001860         05  作３－順番                    PIC 9(4).
001870         05  FILLER                        PIC X(14).
001960*----------------------------------------------------------------*
001970******************************************************************
001980*                WORKING-STORAGE SECTION                         *
001990******************************************************************
002000 WORKING-STORAGE         SECTION.
002010 01 キー入力                           PIC X     VALUE SPACE.
002020 01 状態キー                           PIC X(2)  VALUE SPACE.
002030 01 終了フラグ                         PIC X(3)  VALUE SPACE.
002040 01 終了フラグ２                       PIC X(3)  VALUE SPACE.
002050 01 作成フラグ                         PIC X(3)  VALUE SPACE.
002060 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002070 01 施術記録有Ｗ                       PIC X(3)  VALUE SPACE.
002080*
002090 01 順番Ｗ                             PIC 9(4)  VALUE ZERO.
002090 01 生保順番Ｗ                         PIC 9(4)  VALUE ZERO.
002100 01 保険種別ＷＲ                       PIC 9(2)  VALUE ZERO.
002110 01 レセプト種類ＷＲ                   PIC X(4)  VALUE SPACE.
002120 01 レセ並び順昇降Ｗ                   PIC 9(1) VALUE ZERO.
001320 01 保険者番号ＷＲ.
001530    03 法別番号ＷＲ                    PIC X(2)  VALUE SPACE.
001540    03 保番ＷＲ.
001550       05 都道府県番号ＷＲ             PIC X(2)  VALUE SPACE.
001560       05 保険番号ＷＲ                 PIC X(3)  VALUE SPACE.
001570       05 検証番号ＷＲ                 PIC X     VALUE SPACE.
001580       05 FILLER                       PIC X(2)  VALUE SPACE.
002140 01 本人家族区分ＷＲ                   PIC 9     VALUE ZERO.
001770 01 負担割合Ｗ                         PIC 9    VALUE ZERO.
002150 01 請求和暦年月ＷＲ.
002160    03 請求和暦ＷＲ                    PIC 9     VALUE ZERO.
002170    03 請求年ＷＲ                      PIC 9(2)  VALUE ZERO.
002180    03 請求月ＷＲ                      PIC 9(2)  VALUE ZERO.
002190 01 ラベル番号チェック                 PIC X(3)  VALUE SPACE.
002200 01 保険者番号ラベルＷＫ               PIC X(10)  VALUE SPACE.
002210 01 種別番号ラベルＷＫ                 PIC X(2)  VALUE SPACE.
002220*
002230 01 請求年月Ｗ.
002240    03 請求和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002250    03 請求年Ｗ                        PIC 9(2)  VALUE ZERO.
002260    03 請求月Ｗ                        PIC 9(2)  VALUE ZERO.
002270 01 施術年月Ｗ.
002280    03 施術和暦Ｗ                      PIC 9(1)  VALUE ZERO.
002290    03 施術年Ｗ                        PIC 9(2)  VALUE ZERO.
002300    03 施術月Ｗ                        PIC 9(2)  VALUE ZERO.
002310 01 本人家族区分Ｗ                     PIC 9(1)  VALUE ZERO.
002320 01 ファイル名                         PIC N(2)  VALUE SPACE.
002330 01 保険種別Ｗ                         PIC 9(2)  VALUE ZERO.
002340 01 元保険者番号Ｗ                     PIC X(10) VALUE SPACE.
002350 01 保険者番号Ｗ                       PIC X(10) VALUE SPACE.
002360 01 親保険種別Ｗ                       PIC 9(2)  VALUE ZERO.
002370 01 ラベルチェックＷ                   PIC X     VALUE SPACE.
002380 01 対象件数Ｗ                         PIC 9(5)  VALUE ZERO.
002390*
       01 金額Ｗ.
          03 費用額Ｗ                        PIC 9(6)  VALUE ZERO.
          03 負担額Ｗ                        PIC 9(6)  VALUE ZERO.
          03 請求額Ｗ                        PIC 9(6)  VALUE ZERO.
001576*
001982 01 請求書関連Ｗ.
002862        07 北海道区分Ｗ                PIC 9 VALUE ZERO.
002862        07 青森区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岩手区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 秋田区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山形区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 茨城区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 栃木区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 群馬区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 埼玉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 千葉区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 東京区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 神奈川区分Ｗ                PIC 9 VALUE ZERO.
002862        07 新潟区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 富山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 石川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福井区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山梨区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長野区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岐阜区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 静岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 三重区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 滋賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 京都区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大阪区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 兵庫区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 奈良区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 和歌山区分Ｗ                PIC 9 VALUE ZERO.
002862        07 鳥取区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 島根区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 岡山区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 広島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 山口区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 徳島区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 香川区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 愛媛区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 高知区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 福岡区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 佐賀区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 長崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 熊本区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 大分区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 宮崎区分Ｗ                  PIC 9 VALUE ZERO.
002862        07 鹿児島区分Ｗ                PIC 9 VALUE ZERO.
002862        07 沖縄区分Ｗ                  PIC 9 VALUE ZERO.
001559 01 政管ＪＩＳＷＫ                     PIC X(2)  VALUE SPACE.
001561 01 県ＷＫ                             PIC X(2)  VALUE SPACE.
001563 01 県統一ＷＫ                         PIC X(2)  VALUE SPACE.
002391*
002392** 助成レセまとめ用
002393 01 助成レセまとめフラグ               PIC X(3)  VALUE SPACE.
002394*
002400******************************************************************
002410*                          連結項目                              *
002420******************************************************************
002430*
002440****************
002450* 画面入力情報 *
002460****************
002470**
002480 01 連入－入力データ６１０ IS EXTERNAL.
002490    03 連入－請求年月.
002500       05 連入－請求和暦                  PIC 9.
002510       05 連入－請求年                    PIC 9(2).
002520       05 連入－請求月                    PIC 9(2).
002540    03 連入－保険種別                     PIC 9(2).
002600*
002610*****
002611************************
002612* 助成レセまとめ
002613************************
002614 01 連レセまとめ－キー IS EXTERNAL.
002615    03 連レセまとめ－施術和暦年月.
002616       05 連レセまとめ－施術和暦               PIC 9.
002617       05 連レセまとめ－施術年月.
002618          07 連レセまとめ－施術年              PIC 9(2).
002619          07 連レセまとめ－施術月              PIC 9(2).
002620    03 連レセまとめ－患者コード.
002621       05 連レセまとめ－患者番号               PIC 9(6).
002622       05 連レセまとめ－枝番                   PIC X(1).
002623**-------------------------------------------------------**
002624*   1:助成レセプトなしの本体まとめの判定
002625*   2:横浜・川崎用の社保助成レセかの判定
002626    03 連レセまとめ－判定区分                  PIC 9.
002627**-------------------------------------------------------**
002628*  / OUT /　 0:対象外、1:対象
002629    03 連レセまとめ－判定結果                  PIC 9.
002630**
002631******************************************************************
002632*                      PROCEDURE  DIVISION                       *
002640******************************************************************
002650 PROCEDURE               DIVISION.
002660************
002670*           *
002680* 初期処理   *
002690*           *
002700************
002710     PERFORM ファイルオープン.
002720     PERFORM 連結項目待避.
002730************
002740*           *
002750* 主処理     *
002760*           *
002770************
002780     PERFORM 作業ファイル１作成.
002790     PERFORM 作業ファイル２作成.
002810     PERFORM 並び順ファイル作成.
002800************
002810*           *
002820* 終了処理   *
002830*           *
002840************
002850     PERFORM 終了処理.
002860     MOVE ZERO TO PROGRAM-STATUS.
002870     EXIT PROGRAM.
002880*
002890*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002900*================================================================*
002910 連結項目待避 SECTION.
002920*
002930* 連結項目の待避
002940     MOVE 連入－請求和暦      TO 請求和暦ＷＲ.
002950     MOVE 連入－請求年        TO 請求年ＷＲ.
002960     MOVE 連入－請求月        TO 請求月ＷＲ.
002960     MOVE 連入－保険種別      TO 保険種別ＷＲ.
002970* レセ並び順昇順・降順セット
002980     MOVE ZEROS TO 制－制御区分.
002990     READ 制御情報マスタ
003000     NOT INVALID KEY
003010         MOVE 制－レセ並び順昇降 TO レセ並び順昇降Ｗ
003020     END-READ.
002733*
009438* 制御区分02
009439     MOVE 02 TO 制－制御区分.
009440     READ 制御情報マスタ
009441     NOT INVALID KEY
009443        MOVE 制０２－北海道総括表区分  TO 北海道区分Ｗ 
009443        MOVE 制０２－青森総括表区分    TO 青森区分Ｗ 
009443        MOVE 制０２－岩手総括表区分    TO 岩手区分Ｗ 
009443        MOVE 制０２－宮城総括表区分    TO 宮城区分Ｗ 
009443        MOVE 制０２－秋田総括表区分    TO 秋田区分Ｗ 
009443        MOVE 制０２－山形総括表区分    TO 山形区分Ｗ 
009443        MOVE 制０２－福島総括表区分    TO 福島区分Ｗ 
009443        MOVE 制０２－茨城総括表区分    TO 茨城区分Ｗ 
009443        MOVE 制０２－栃木総括表区分    TO 栃木区分Ｗ 
009443        MOVE 制０２－群馬総括表区分    TO 群馬区分Ｗ 
009443        MOVE 制０２－埼玉総括表区分    TO 埼玉区分Ｗ 
009443        MOVE 制０２－千葉総括表区分    TO 千葉区分Ｗ 
009443        MOVE 制０２－東京総括表区分    TO 東京区分Ｗ 
009443        MOVE 制０２－神奈川総括表区分  TO 神奈川区分Ｗ 
009443        MOVE 制０２－新潟総括表区分    TO 新潟区分Ｗ 
009443        MOVE 制０２－富山総括表区分    TO 富山区分Ｗ 
009443        MOVE 制０２－石川総括表区分    TO 石川区分Ｗ 
009443        MOVE 制０２－福井総括表区分    TO 福井区分Ｗ 
009443        MOVE 制０２－山梨総括表区分    TO 山梨区分Ｗ 
009443        MOVE 制０２－長野総括表区分    TO 長野区分Ｗ 
009443        MOVE 制０２－岐阜総括表区分    TO 岐阜区分Ｗ 
009443        MOVE 制０２－静岡総括表区分    TO 静岡区分Ｗ 
009443        MOVE 制０２－愛知総括表区分    TO 愛知区分Ｗ 
009443        MOVE 制０２－三重総括表区分    TO 三重区分Ｗ 
009443        MOVE 制０２－滋賀総括表区分    TO 滋賀区分Ｗ 
009443        MOVE 制０２－京都総括表区分    TO 京都区分Ｗ 
009443        MOVE 制０２－大阪総括表区分    TO 大阪区分Ｗ 
009443        MOVE 制０２－兵庫総括表区分    TO 兵庫区分Ｗ 
009443        MOVE 制０２－奈良総括表区分    TO 奈良区分Ｗ 
009443        MOVE 制０２－和歌山総括表区分  TO 和歌山区分Ｗ 
009443        MOVE 制０２－鳥取総括表区分    TO 鳥取区分Ｗ 
009443        MOVE 制０２－島根総括表区分    TO 島根区分Ｗ 
009443        MOVE 制０２－岡山総括表区分    TO 岡山区分Ｗ 
009443        MOVE 制０２－広島総括表区分    TO 広島区分Ｗ 
009443        MOVE 制０２－山口総括表区分    TO 山口区分Ｗ 
009443        MOVE 制０２－徳島総括表区分    TO 徳島区分Ｗ 
009443        MOVE 制０２－香川総括表区分    TO 香川区分Ｗ 
009443        MOVE 制０２－愛媛総括表区分    TO 愛媛区分Ｗ 
009443        MOVE 制０２－高知総括表区分    TO 高知区分Ｗ 
009443        MOVE 制０２－福岡総括表区分    TO 福岡区分Ｗ 
009443        MOVE 制０２－佐賀総括表区分    TO 佐賀区分Ｗ 
009443        MOVE 制０２－長崎総括表区分    TO 長崎区分Ｗ 
009443        MOVE 制０２－熊本総括表区分    TO 熊本区分Ｗ 
009443        MOVE 制０２－大分総括表区分    TO 大分区分Ｗ 
009443        MOVE 制０２－宮崎総括表区分    TO 宮崎区分Ｗ 
009443        MOVE 制０２－鹿児島総括表区分  TO 鹿児島区分Ｗ 
009443        MOVE 制０２－沖縄総括表区分    TO 沖縄区分Ｗ 
009468     END-READ.
003030*
003040*================================================================*
003050 ファイルオープン SECTION.
003060*
003070     OPEN INPUT 受診者情報Ｆ.
003080         MOVE NC"受診者情報Ｆ" TO ファイル名.
003090         PERFORM オープンチェック.
003130     OPEN INPUT 制御情報マスタ
003140         MOVE NC"制御情報" TO ファイル名.
003150         PERFORM オープンチェック.
003190     OPEN INPUT 請求先マスタ.
003200         MOVE NC"請求先" TO ファイル名.
003210         PERFORM オープンチェック.
003220     OPEN INPUT 保険者マスタ.
003230         MOVE NC"保険" TO ファイル名.
003240         PERFORM オープンチェック.
003250     OPEN INPUT 市町村マスタ.
003260         MOVE NC"市町村" TO ファイル名.
003270         PERFORM オープンチェック.
006630     OPEN INPUT 生保情報Ｆ.
006640         MOVE NC"生保" TO ファイル名.
006650         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
003280*================================================================*
003290 オープンチェック SECTION.
003300*
003310     IF 状態キー  NOT =  "00"
003320         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003330         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003340         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003350                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
003360         ACCEPT  キー入力 FROM CONS
003370         PERFORM ファイル閉鎖
003380         MOVE 99 TO PROGRAM-STATUS
003390         EXIT PROGRAM.
003400*================================================================*
003410 エラー表示 SECTION.
003420*
003430     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003440     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003450     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003460     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
003470     ACCEPT  キー入力 FROM CONS.
003480     PERFORM ファイル閉鎖.
003490     MOVE 99 TO PROGRAM-STATUS.
003500     EXIT PROGRAM.
003510*================================================================*
003520 作業ファイル１作成 SECTION.
003530*
003540     OPEN OUTPUT 作業ファイル１.
003550         MOVE NC"作業" TO ファイル名.
003560         PERFORM オープンチェック.
003570*
005170     MOVE 請求和暦ＷＲ  TO レセ－請求和暦.
005180     MOVE 請求年ＷＲ    TO レセ－請求年.  
005190     MOVE 請求月ＷＲ    TO レセ－請求月.  
013730     MOVE ZERO          TO レセ－レセ種別.
005200     MOVE ZERO          TO レセ－施術和暦.
005210     MOVE ZERO          TO レセ－施術年.  
005220     MOVE ZERO          TO レセ－施術月.  
005230     MOVE ZERO          TO レセ－患者番号.
005240     MOVE SPACE         TO レセ－枝番.    
013770     START レセプトＦ   KEY IS >= レセ－請求和暦年月
000230                                  レセ－施術和暦年月
000240                                  レセ－患者コード
000250                                  レセ－レセ種別
003690     END-START.
003700     IF 状態キー = "00"
003710         MOVE SPACE  TO 終了フラグ
003750         PERFORM レセプトＦ読込
003730         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
005330                       ( レセ－請求和暦 NOT = 請求和暦ＷＲ ) OR
005340                       ( レセ－請求年   NOT = 請求年ＷＲ   ) OR
005350                       ( レセ－請求月   NOT = 請求月ＷＲ   )
003770             PERFORM データチェック
003780** 労災・自賠責・自費除く
003790             IF  レセ－レセ種別 = 4 OR 5 OR 6 OR 8
003800                 MOVE SPACE  TO 実行キーＷ
003810             END-IF
003820***
003830             IF 実行キーＷ = "YES"
003840*
003842*↓* 特別処理（助成レセまとめ）
003843*                IF 受－助成種別 NOT = ZERO
003844*                   PERFORM 助成レセまとめ判定
003845*                ELSE
003846*                   MOVE SPACE TO 助成レセまとめフラグ
003847*                END-IF
003848*↑*
005610                EVALUATE TRUE
003850*                ******************
003860*                * 健保 老人含まず*
003870*                ******************
013940                WHEN レセ－レセ種別   = 1
                          IF (保険種別ＷＲ = ZERO) OR
                              ((受－保険種別 = 保険種別ＷＲ) AND ( 受－公費種別 = ZERO ))
003920                        MOVE SPACE TO 作１－レコード
003930                        INITIALIZE 作１－レコード
003940*                        PERFORM 印刷順番セット
003950                        MOVE 受－保険者番号  TO 作１－保険者番号 作１－保険者番号正規
003960                        MOVE 受－保険種別      TO 作１－保険種別
003970*** ラベル番号チェック
003980*                        MOVE 受－保険種別   TO 種別番号ラベルＷＫ
003990*                        MOVE 受－保険者番号 TO 保険者番号ラベルＷＫ
004000*                        PERFORM ラベル保険者チェック
004010                        PERFORM 料金セット
004010                        PERFORM レコードセット
004020                        PERFORM ファイル書込
004030                    END-IF
004050*                ********
004060*                * 老人 *
004070*                ********
                      WHEN レセ－レセ種別   = 2 
                          IF (保険種別ＷＲ = ZERO) OR
                             (受－公費種別 = 保険種別ＷＲ)
004100                        MOVE SPACE TO 作１－レコード
004110                        INITIALIZE 作１－レコード
004120*                        PERFORM 印刷順番セット
004130                        MOVE 受－費用負担者番号     TO 作１－保険者番号 作１－保険者番号正規
004140                        MOVE 受－公費種別      TO 作１－保険種別
004150*** ラベル番号チェック
004160*                        MOVE 受－公費種別       TO 種別番号ラベルＷＫ
004170*                        MOVE 受－費用負担者番号 TO 保険者番号ラベルＷＫ
004180*                        PERFORM ラベル市町村チェック
004010                        PERFORM 料金セット
004190                        PERFORM レコードセット
004200                        PERFORM ファイル書込
004210                    END-IF
004220*                ********
004230*                * 助成 *
004240*                ********
004241*↓* 特別処理（助成レセまとめ）**
                      WHEN レセ－レセ種別   = 3
                          IF (保険種別ＷＲ = ZERO) OR
                             (受－助成種別 = 保険種別ＷＲ)
004242                      IF ( 助成レセまとめフラグ = SPACE ) 
004270                        MOVE SPACE TO 作１－レコード
004280                        INITIALIZE 作１－レコード
004290                        MOVE 受－助成種別           TO 作１－保険種別
004300                        MOVE 受－費用負担者番号助成 TO 作１－保険者番号 作１－保険者番号正規
004310*                        PERFORM 印刷順番セット
004320*** ラベル番号チェック
004330*                        MOVE 受－助成種別           TO 種別番号ラベルＷＫ
004340*                        MOVE 受－費用負担者番号助成 TO 保険者番号ラベルＷＫ
004350*                        PERFORM ラベル市町村チェック
004010                        PERFORM 助成料金セット
004360                        PERFORM レコードセット
004445* 請求額が ZERO の時は、書き込まない。
004446                        IF  作１－請求額 NOT = ZERO
004370                            PERFORM ファイル書込
004448                        END-IF
004380                      END-IF
004381                    END-IF
004220*                ********
004230*                * 生保 *
004240*                ********
                      WHEN レセ－レセ種別   = 7
                          IF (保険種別ＷＲ = ZERO) OR
                             (受－保険種別 = 保険種別ＷＲ)
003920                        MOVE SPACE TO 作１－レコード
003930                        INITIALIZE 作１－レコード
003940*                        PERFORM 印刷順番セット
                              MOVE 受－施術和暦年月 TO 生保－施術和暦年月
                              MOVE 受－患者コード   TO 生保－患者コード
                              READ 生保情報Ｆ
                              NOT INVALID KEY
003950                           MOVE 生保－負担者番号   TO 作１－保険者番号 作１－保険者番号正規
                              END-READ
003960                        MOVE 受－保険種別     TO 作１－保険種別
003970*** ラベル番号チェック
003980*                        MOVE 受－保険種別     TO 種別番号ラベルＷＫ
003990*                        MOVE 作１－保険者番号 TO 保険者番号ラベルＷＫ
004000*                        PERFORM ラベル保険者チェック
004010                        PERFORM 料金セット
004370                        PERFORM レコードセット
004380                        PERFORM ファイル書込
004391                    END-IF
                      END-EVALUATE
004390             END-IF
004400             PERFORM レセプトＦ読込
004410         END-PERFORM
004420     END-IF.
004430     CLOSE 作業ファイル１.
004440*================================================================*
004450 レセプトＦ読込 SECTION.
004460*
004470     READ レセプトＦ NEXT
004480     AT END
004490         MOVE "YES" TO 終了フラグ
004500     END-READ.
004510*================================================================*
004520 データチェック SECTION.
004530*
004540     MOVE SPACE          TO 実行キーＷ.
005350     MOVE SPACE  TO 実行キーＷ.
005300     IF ( レセ－レセ印刷対象区分 NOT = 1 )
005310        MOVE "YES"  TO 実行キーＷ
005320     END-IF.
019520* *****************************************************************
019530* * レセプトＦの請求対象区分 = 0 の場合データ作成対象としない *
019540* *****************************************************************
005360     IF 実行キーＷ  = "YES"
005370*      (再度、実行キーＷ SPACE)
005380        MOVE SPACE  TO 実行キーＷ
019640        IF レセ－請求対象区分 NOT = ZERO
004090           MOVE レセ－施術和暦  TO 受－施術和暦
004100           MOVE レセ－施術年    TO 受－施術年
004110           MOVE レセ－施術月    TO 受－施術月
004120           MOVE レセ－患者番号  TO 受－患者番号
004130           MOVE レセ－枝番      TO 受－枝番
                 READ 受診者情報Ｆ
                 NOT INVALID KEY
019880              MOVE "YES"  TO 実行キーＷ
                 END-READ
019900        ELSE
019910           MOVE SPACE  TO 実行キーＷ
              END-IF
019950     END-IF.
005000*
005080*================================================================*
005090 レコードセット SECTION.
005100*
005110     MOVE レセ－請求和暦    TO 作１－請求和暦.
005120     MOVE レセ－請求年      TO 作１－請求年.
005130     MOVE レセ－請求月      TO 作１－請求月.
005140     MOVE レセ－施術和暦    TO 作１－施術和暦.
005150     MOVE レセ－施術年      TO 作１－施術年.
005160     MOVE レセ－施術月      TO 作１－施術月.
005480     MOVE レセ－負担割合    TO 作１－負担割合.
005170     MOVE 受－本人家族区分  TO 作１－本人家族区分.
005526     IF 受－公費種別 NOT = ZERO
005534         MOVE 1             TO 作１－本人家族区分
           END-IF.
005180     MOVE 受－患者カナ      TO 作１－患者カナ.
005190     MOVE 受－患者コード    TO 作１－患者コード.
005200     MOVE 受－患者氏名      TO 作１－患者氏名.
005210     MOVE 受－被保険者氏名  TO 作１－被保険者氏名.
005210*     IF ラベル番号チェック = "YES"
005220*        MOVE  "1"           TO 作１－ラベルチェック
005230*     END-IF.
005240*
005250*************************************************************************************
005260*  請求先マスタを読んで、データがある時は、請求先市町村コードを保険者番号に転記する。
005270*************************************************************************************
005280*** ラベル番号転帰の時は飛ばす
005290*     IF ラベル番号チェック NOT = "YES"
005300*        MOVE 作１－保険種別    TO 請先－保険種別
005310*        MOVE 作１－保険者番号  TO 請先－保険者番号
005320*        READ 請求先マスタ
005330*        NOT INVALID KEY
005340*            MOVE 請先－請求先市町村   TO 作１－保険者番号
005350*        END-READ
005360*     END-IF.
           MOVE レセ－レセ種別    TO 作１－レセ種別.
           MOVE 費用額Ｗ          TO 作１－費用額.
           MOVE 請求額Ｗ          TO 作１－請求額.
           MOVE 負担額Ｗ          TO 作１－負担額.
005541*
005542     PERFORM 分類取得.
005370*
005390*================================================================*
       料金セット SECTION.
           MOVE レセ－合計            TO 費用額Ｗ.
           MOVE レセ－請求金額        TO 請求額Ｗ.
           MOVE レセ－一部負担金      TO 負担額Ｗ.
005210     MOVE 受－レセ印刷区分      TO 作１－レセ印刷区分.
005380*
005390*================================================================*
       助成料金セット SECTION.
           MOVE レセ－合計            TO 費用額Ｗ.
           MOVE レセ－助成請求金額    TO 請求額Ｗ.
           MOVE レセ－受給者負担額    TO 負担額Ｗ.
005210     MOVE 受－レセ印刷区分助成  TO 作１－レセ印刷区分.
005510*
005705*================================================================*
005706 分類取得 SECTION.
005707***************************************************
005708* 分類コード
005709*  1:社保・日雇
      *  2:船員
005710*  3:組合
      *  4:共済・自衛官
005711*  5:1:国保 1:退職 2:後高 3:助成（東京・愛知・高知以外）
005712*  6:助成（東京・愛知・高知）
005716*     /15.6.18 京都の後期高齢の障害で"39261"も直送分へ
005716*
      *  県固有
      *  大阪
      *  5:1:後高 1:助成（親が後高） 2:国保 2:退職 2:助成（親保険が後高以外・東京・愛知・高知以外）
005718***************************************************
005719*
005720     IF レセ－レセ種別  = 3
               IF (受－費用負担者番号助成(3:2) = "13" OR "23" OR "39") OR
                  ((受－費用負担者番号助成(1:5) = "39261") AND (受－公費種別 = 5))
005726            MOVE  6  TO  作１－分類コード
               ELSE
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 30 TO  作１－保険順
               END-IF
005742         MOVE 受－費用負担者番号助成(3:2) TO 作１－県コード
005728     ELSE
005729         IF 受－公費種別 = ZERO
005730*       / 健保 /
005731             EVALUATE 受－保険種別
005741             WHEN 01
005743                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(1:2) TO 作１－県コード
005732             WHEN 02
                       IF 受－保険者番号(5:5) = SPACE
006878                    MOVE 受－保険者番号(1:2) TO 県ＷＫ
006879                    PERFORM 県統一
006880                    MOVE 県統一ＷＫ TO 県ＷＫ
                       ELSE
006878                    MOVE 受－保険者番号(3:2) TO 県ＷＫ
                       END-IF
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 県ＷＫ TO 作１－県コード
005733             WHEN 06
005736                 MOVE 1  TO  作１－分類コード
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005734             WHEN 07
005736                 MOVE 2  TO  作１－分類コード
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005737             WHEN 03
005740                 MOVE 3  TO  作１－分類コード
005738             WHEN 04
005739             WHEN 09
005740                 MOVE 4  TO  作１－分類コード
005753             WHEN 08
005755                 MOVE 5  TO  作１－分類コード
005743                 MOVE 10 TO  作１－保険順
005742                 MOVE 受－保険者番号(3:2) TO 作１－県コード
005765             END-EVALUATE
005766*
005767         ELSE
005768*       / 老人 /
005770             MOVE 5  TO  作１－分類コード
005743             MOVE 20 TO  作１－保険順
005742             MOVE 受－費用負担者番号(3:2) TO 作１－県コード
005778         END-IF
005779     END-IF.
005780*
           IF (大阪区分Ｗ = 1) AND (作１－分類コード = 5)
005720         IF レセ－レセ種別  = 3
                  IF 受－費用負担者番号助成(3:2) = "27"
005729               IF 受－公費種別 = ZERO
005743                  MOVE 21 TO  作１－保険順
                     ELSE
005743                  MOVE 11 TO  作１－保険順
                     END-IF
010202               IF 受－助保険助成(1:3) = "274"
010203                   EVALUATE 受－法別番号助成
010204                   WHEN 41
010205                       MOVE 41274002           TO 作１－保険者番号
010206                   WHEN 80
010207                       MOVE 80274004           TO 作１－保険者番号
010208                   WHEN 82
010209                       MOVE 82274002           TO 作１－保険者番号
010210                   WHEN 83
010211                       MOVE 83274001           TO 作１－保険者番号
010212                   WHEN 86
010213                       MOVE 86274008           TO 作１－保険者番号
                         WHEN 87
009990                       MOVE "87274007"         TO 作１－保険者番号
010214                   WHEN OTHER
010215                       MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010216                   END-EVALUATE
010217               ELSE
010218                   IF ( 受－費用負担者番号助成(3:3) = "275" ) OR ( 受－費用負担者番号助成(3:5) = "27002" )
010219                       EVALUATE 受－法別番号助成
010220                       WHEN 41
010221                           MOVE 41275009           TO 作１－保険者番号
010222                       WHEN 80
010223                           MOVE 80275001           TO 作１－保険者番号
010224                       WHEN 82
010225                           MOVE 82275009           TO 作１－保険者番号
010226                       WHEN 86
010227                           MOVE 86275005           TO 作１－保険者番号
010228                       WHEN OTHER
010229                           MOVE 受－費用負担者番号助成 TO 作１－保険者番号
010230                       END-EVALUATE
010231                   ELSE
010232                       MOVE 受－費用負担者番号助成  TO 作１－保険者番号
010233                   END-IF
                     END-IF
010234            END-IF
005728         ELSE
005729            IF 受－公費種別 = ZERO
005730*       / 健保 /
005731               EVALUATE 受－保険種別
005741               WHEN 01
                         IF 受－保険者番号(1:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009114                      IF 受－保険者番号(1:3) = "274"
009115                          MOVE 00274001       TO 作１－保険者番号
009116                      ELSE
009117                          IF ( 受－保険者番号(1:3) = "275" ) OR ( 受－保険者番号(1:5) = "27002" )
009118                             MOVE 00275008       TO 作１－保険者番号
009119                          ELSE
009120                             MOVE 00             TO 法別番号ＷＲ
009121                             MOVE 受－保険者番号 TO 保番ＷＲ
009121                             MOVE 保険者番号ＷＲ TO 作１－保険者番号
009122                          END-IF
                            END-IF
009123                   END-IF
005753               WHEN 08
                         IF 受－保険者番号(3:2) = "27"
005743                      MOVE 20 TO  作１－保険順
009125                      IF 受－保番(1:3) = "274"
009126                         MOVE 67274001       TO 作１－保険者番号
009127                      ELSE
009128                         IF ( 受－保険者番号(3:3) = "275" ) OR ( 受－保険者番号(3:5) = "27002" )
009129                            MOVE 67275008       TO 作１－保険者番号
009130                         ELSE
009131                            MOVE 受－保険者番号 TO 作１－保険者番号
009132                         END-IF
009133                      END-IF
                         END-IF
005765               END-EVALUATE
005767            ELSE
005768*       / 老人 /
                     IF 受－費用負担者番号(3:2) = "27"
005743                  MOVE 10 TO  作１－保険順
009672                  IF 受－助保険老人(1:3) = "274"
009673                     MOVE 27274000          TO 作１－保険者番号
009674                  ELSE
009675                     IF ( 受－費用負担者番号(3:3) = "275" ) OR ( 受－費用負担者番号(3:5) = "27002" )
009676                        MOVE 27275007           TO 作１－保険者番号
009677                     ELSE
009678                        MOVE 受－費用負担者番号 TO 作１－保険者番号
009679                     END-IF
009680                  END-IF
      */後期高齢は代表番号にまとめる/080419
                        IF 受－保険者番号(1:4) = "3927"
                           MOVE "39270004" TO 作１－保険者番号
                        END-IF
005778               END-IF
                  END-IF
005778         END-IF
005779     END-IF.
005780*
006928*================================================================*
006929 県統一 SECTION.
006930*
006931     MOVE ZERO  TO  県統一ＷＫ.
006932     EVALUATE  県ＷＫ
006933*北海道
006934      WHEN  01
006935         MOVE 01 TO 県統一ＷＫ
006936*青森
006937      WHEN  02
006938         MOVE 02 TO 県統一ＷＫ
006939*岩手
006940      WHEN  03
006941         MOVE 03 TO 県統一ＷＫ
006942*宮城
006943      WHEN  04
006944         MOVE 04 TO 県統一ＷＫ
006945*秋田
006946      WHEN  05
006947         MOVE 05 TO 県統一ＷＫ
006948*山形
006949      WHEN  06
006950         MOVE 06 TO 県統一ＷＫ
006951*福島
006952      WHEN  07
006953         MOVE 07 TO 県統一ＷＫ
006954*茨城
006955      WHEN  08
006956         MOVE 08 TO 県統一ＷＫ
006957*栃木
006958      WHEN  09
006959         MOVE 09 TO 県統一ＷＫ
006960*群馬
006961      WHEN  10
006962         MOVE 10 TO 県統一ＷＫ
006963*埼玉
006964      WHEN  11
006965         MOVE 11 TO 県統一ＷＫ
006966*千葉
006967      WHEN  12
006968         MOVE 12 TO 県統一ＷＫ
006969*東京
006970      WHEN  21
006971         MOVE 13 TO 県統一ＷＫ
006972*神奈川
006973      WHEN  31
006974         MOVE 14 TO 県統一ＷＫ
006975*新潟
006976      WHEN  32
006977         MOVE 15 TO 県統一ＷＫ
006978*富山
006979      WHEN  33
006980         MOVE 16 TO 県統一ＷＫ
006981*石川
006982      WHEN  34
006983         MOVE 17 TO 県統一ＷＫ
006984*福井
006985      WHEN  35
006986         MOVE 18 TO 県統一ＷＫ
006987*山梨
006988      WHEN  36
006989         MOVE 19 TO 県統一ＷＫ
006990*長野
006991      WHEN  37
006992         MOVE 20 TO 県統一ＷＫ
006993*岐阜
006994      WHEN  38
006995         MOVE 21 TO 県統一ＷＫ
006996*静岡
006997      WHEN  39
006998         MOVE 22 TO 県統一ＷＫ
006999*愛知
007000      WHEN  51
007001         MOVE 23 TO 県統一ＷＫ
007002*三重
007003      WHEN  52
007004         MOVE 24 TO 県統一ＷＫ
007005*滋賀
007006      WHEN  53
007007         MOVE 25 TO 県統一ＷＫ
007008*京都
007009      WHEN  54
007010         MOVE 26 TO 県統一ＷＫ
007011*大阪
007012      WHEN  41
007013         MOVE 27 TO 県統一ＷＫ
007014*兵庫
007015      WHEN  42
007016         MOVE 28 TO 県統一ＷＫ
007017*奈良
007018      WHEN  55
007019         MOVE 29 TO 県統一ＷＫ
007020*和歌山
007021      WHEN  56
007022         MOVE 30 TO 県統一ＷＫ
007023*鳥取
007024      WHEN  57
007025         MOVE 31 TO 県統一ＷＫ
007026*島根
007027      WHEN  58
007028         MOVE 32 TO 県統一ＷＫ
007029*岡山
007030      WHEN  59
007031         MOVE 33 TO 県統一ＷＫ
007032*広島
007033      WHEN  60
007034         MOVE 34 TO 県統一ＷＫ
007035*山口
007036      WHEN  61
007037         MOVE 35 TO 県統一ＷＫ
007038*徳島
007039      WHEN  71
007040         MOVE 36 TO 県統一ＷＫ
007041*香川
007042      WHEN  72
007043         MOVE 37 TO 県統一ＷＫ
007044*愛媛
007045      WHEN  73
007046         MOVE 38 TO 県統一ＷＫ
007047*高知
007048      WHEN  74
007049         MOVE 39 TO 県統一ＷＫ
007050*福岡
007051      WHEN  75
007052         MOVE 40 TO 県統一ＷＫ
007053*佐賀
007054      WHEN  76
007055         MOVE 41 TO 県統一ＷＫ
007056*長崎
007057      WHEN  77
007058         MOVE 42 TO 県統一ＷＫ
007059*熊本
007060      WHEN  78
007061         MOVE 43 TO 県統一ＷＫ
007062*大分
007063      WHEN  79
007064         MOVE 44 TO 県統一ＷＫ
007065*宮崎
007066      WHEN  80
007067         MOVE 45 TO 県統一ＷＫ
007068*鹿児島
007069      WHEN  81
007070         MOVE 46 TO 県統一ＷＫ
007071*沖縄
007072      WHEN  82
007073         MOVE 47 TO 県統一ＷＫ
007074*その他
007075      WHEN  OTHER
007076         CONTINUE
007077     END-EVALUATE.
007078*
005380*================================================================*
005390 ファイル書込 SECTION.
005400*
005410     WRITE 作１－レコード
005420     INVALID KEY
005430         MOVE NC"作業"  TO ファイル名
005440         PERFORM エラー表示
005450     END-WRITE.
005460*================================================================*
005470 作業ファイル２作成 SECTION.
005480*
005490     OPEN INPUT  作業ファイル１.
005500     OPEN OUTPUT 作業ファイル２.
005510*
005520     IF レセ並び順昇降Ｗ = 1
005530         PERFORM レセ並び順降順ファイル作成
005540     ELSE
005550         PERFORM 作業ファイル２作成処理
005560     END-IF.
005570*
005580     CLOSE 作業ファイル２.
005590     CLOSE 作業ファイル１.
005600*================================================================*
005610 レセ並び順降順ファイル作成 SECTION.
005620*
005630     MOVE ZERO       TO 順番Ｗ.      
005640     MOVE 9          TO 作１－請求和暦.
005650     MOVE 99         TO 作１－請求年.
005660     MOVE 99         TO 作１－請求月.
005670     MOVE 9          TO 作１－分類コード.
005680     MOVE HIGH-VALUE TO 作１－県コード.
005690     MOVE 99         TO 作１－保険順.
005700     MOVE HIGH-VALUE TO 作１－保険者番号.
005710     MOVE 9          TO 作１－本人家族区分.
005670     MOVE 99         TO 作１－負担割合.
005720     MOVE HIGH-VALUE TO 作１－患者カナ.
005730     MOVE 999999     TO 作１－患者番号.
005740     MOVE HIGH-VALUE TO 作１－枝番.
005750     MOVE 9          TO 作１－施術和暦.
005760     MOVE 99         TO 作１－施術年.
005770     MOVE 99         TO 作１－施術月.
005780     START 作業ファイル１ KEY IS <=  作１－請求和暦年月
005790                                     作１－分類コード
005800                                     作１－県コード
005810                                     作１－保険順
005820                                     作１－保険者番号
005830                                     作１－本人家族区分
                                           作１－負担割合
005840                                     作１－患者カナ
005850                                     作１－患者コード
005860                                     作１－施術和暦年月
005870                                     REVERSED
005880     END-START.
005890     IF 状態キー = "00"
005900*
005910         MOVE SPACE TO 終了フラグ
005920         PERFORM 作業ファイル１読込
005930         PERFORM UNTIL 終了フラグ = "YES"
005940             MOVE SPACE TO 作２－レコード
005950             INITIALIZE 作２－レコード
005960*
005970                 PERFORM 作業レコード２セット
005980                 PERFORM 作業ファイル２書込
005990*
006000             PERFORM 作業ファイル１読込
006010         END-PERFORM
006020     END-IF.
006030*================================================================*
006040 作業ファイル２作成処理 SECTION.
006050*
006060     MOVE ZERO       TO 順番Ｗ.      
006070     MOVE ZERO       TO 作１－請求和暦.
006080     MOVE ZERO       TO 作１－請求年.
006090     MOVE ZERO       TO 作１－請求月.
006100     MOVE ZERO       TO 作１－分類コード.
006110     MOVE SPACE      TO 作１－県コード.
006120     MOVE ZERO       TO 作１－保険順.
006130     MOVE LOW-VALUE  TO 作１－保険者番号.
006140     MOVE ZERO       TO 作１－本人家族区分.
006120     MOVE ZERO       TO 作１－負担割合.
006150     MOVE SPACE      TO 作１－患者カナ.
006160     MOVE ZERO       TO 作１－患者番号.
006170     MOVE LOW-VALUE  TO 作１－枝番.
006180     MOVE ZERO       TO 作１－施術和暦.
006190     MOVE ZERO       TO 作１－施術年.
006200     MOVE ZERO       TO 作１－施術月.
006210     START 作業ファイル１ KEY IS >=  作１－請求和暦年月
005790                                     作１－分類コード
005800                                     作１－県コード
005810                                     作１－保険順
006250                                     作１－保険者番号
006260                                     作１－本人家族区分
                                           作１－負担割合
006270                                     作１－患者カナ
006280                                     作１－患者コード
006290                                     作１－施術和暦年月
006300     END-START.
006310     IF 状態キー = "00"
006320*
006330         MOVE SPACE TO 終了フラグ
006340         PERFORM 作業ファイル１読込
006350         PERFORM UNTIL 終了フラグ = "YES"
006360             MOVE SPACE TO 作２－レコード
006370             INITIALIZE 作２－レコード
006380*
006390                 PERFORM 作業レコード２セット
006400                 PERFORM 作業ファイル２書込
006410*
006420             PERFORM 作業ファイル１読込
006430         END-PERFORM
006440     END-IF.
006450*================================================================*
006460 作業ファイル１読込 SECTION.
006470*
006480     READ 作業ファイル１ NEXT
006490     AT END
006500         MOVE "YES" TO 終了フラグ
006510     END-READ.
006520*===============================================================*
006530 作業レコード２セット SECTION.
006540*
           MOVE 作１－レセ種別       TO 作２－レセ種別.
006550     MOVE 作１－施術和暦       TO 作２－施術和暦.
006560     MOVE 作１－施術年         TO 作２－施術年.
006570     MOVE 作１－施術月         TO 作２－施術月.
006580     MOVE 作１－患者コード     TO 作２－患者コード.
006590     MOVE 作１－保険種別       TO 作２－保険種別
006600     MOVE 作１－患者氏名       TO 作２－患者氏名.
006610     MOVE 作１－被保険者氏名   TO 作２－被保険者氏名.
006610     IF 作１－本人家族区分 = 1
006620         MOVE "本人"           TO 作２－本人家族
006630     ELSE
006640         MOVE "家族"           TO 作２－本人家族
006650     END-IF.
007592     MOVE 作１－保険者番号正規 TO 作２－請求保険者番号.
           MOVE 作１－費用額         TO 作２－費用額.
           MOVE 作１－請求額         TO 作２－請求額.
           MOVE 作１－負担額         TO 作２－負担額.
005210     MOVE 作１－レセ印刷区分   TO 作２－レセ印刷区分.
           IF 作１－レセ種別 = 7
              MOVE 1                 TO 作２－保険区分
006670        COMPUTE 生保順番Ｗ  = 生保順番Ｗ + 1
006680        MOVE 生保順番Ｗ            TO 作２－順番
           ELSE
              MOVE ZERO              TO 作２－保険区分
006670        COMPUTE 順番Ｗ  = 順番Ｗ + 1
006680        MOVE 順番Ｗ            TO 作２－順番
           END-IF.
006680*===============================================================*
006690 作業ファイル２書込 SECTION.
006700*
006710     WRITE 作２－レコード
006720     INVALID KEY
006730**         DISPLAY NC"状態キー" 状態キー  UPON MSGBOX
006740         MOVE NC"作２" TO ファイル名
006750         PERFORM エラー表示
006760         PERFORM ファイル閉鎖
006770         MOVE 99 TO PROGRAM-STATUS
006780         EXIT PROGRAM.
007370*================================================================*
007380 並び順ファイル作成 SECTION.
007390*
007400     CLOSE 作業ファイル１.
007410     OPEN INPUT 作業ファイル１.
007420         MOVE NC"作１" TO ファイル名.
007430         PERFORM オープンチェック.
007440     OPEN OUTPUT 作業ファイル３.
007450         MOVE NC"作３" TO ファイル名.
007460         PERFORM オープンチェック.
007470*
007480     MOVE SPACE TO 終了フラグ.
007490     MOVE ZERO  TO 順番Ｗ.      
007500     PERFORM 作業ファイル１読込.
007510     PERFORM UNTIL 終了フラグ = "YES"
007520             PERFORM 作３レコードセット
007530             PERFORM 作３ファイル書込
007540             PERFORM 作業ファイル１読込
007550     END-PERFORM.
007560
007570*================================================================*
007580 作３レコードセット SECTION.
007590*
007600     MOVE 作１－施術和暦       TO 作３－施術和暦.
007610     MOVE 作１－施術年         TO 作３－施術年.
007620     MOVE 作１－施術月         TO 作３－施術月.
007630     MOVE 作１－患者コード     TO 作３－患者コード.
007640     MOVE 作１－保険種別       TO 作３－保険種別.
           IF 作１－レセ種別 = 7
007650        COMPUTE 生保順番Ｗ  = 生保順番Ｗ + 1
007660        MOVE 生保順番Ｗ        TO 作３－順番
           ELSE
007650        COMPUTE 順番Ｗ  = 順番Ｗ + 1
007660        MOVE 順番Ｗ            TO 作３－順番
           END-IF.
007670*
007680*================================================================*
007690 作３ファイル書込 SECTION.
007700*
007710     WRITE 作３－レコード
007720     INVALID KEY
007730         MOVE NC"作３"  TO ファイル名
007740         PERFORM エラー表示
007750     END-WRITE.
006790*================================================================*
006800 ファイル閉鎖 SECTION.
006810*
006820     CLOSE 受診者情報Ｆ レセプトＦ 請求先マスタ
006830           制御情報マスタ 市町村マスタ 保険者マスタ
                 生保情報Ｆ.
006840*================================================================*
006850 終了処理 SECTION.
006860*
006870     PERFORM ファイル閉鎖.
007670*================================================================*
007671*================================================================*
007672******************************************************************
007673 END PROGRAM YHN6061.
007674******************************************************************
