000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YHN721.
000060 AUTHOR.                 池田　幸子
000070*
000080*----------------------------------------------------------------*
000090*    日本ほねつぎ・鍼灸・あんま師協会　施術の事実　データ作成
000100*         MED = YHN720 
000110*----------------------------------------------------------------*
000120 DATE-WRITTEN.           2014-09-01
000130 DATE-COMPILED.          2014-09-01
000140*----------------------------------------------------------------*
000150******************************************************************
000160*            ENVIRONMENT         DIVISION                        *
000170******************************************************************
000180 ENVIRONMENT             DIVISION.
000190 CONFIGURATION           SECTION.
000200 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000210 OBJECT-COMPUTER.        FMV-DESKPOWER.
000220 SPECIAL-NAMES.          CONSOLE  IS  CONS
000230                         SYSERR   IS  MSGBOX.
000240 INPUT-OUTPUT            SECTION.
000250 FILE-CONTROL.
000260     SELECT  元号マスタ      ASSIGN      TO        GENGOUL
000270                             ORGANIZATION             IS  INDEXED
000280                             ACCESS MODE              IS  DYNAMIC
000290                             RECORD KEY               IS  元－元号区分
000300                             FILE STATUS              IS  状態キー
000310                             LOCK        MODE         IS  AUTOMATIC.
000320     SELECT  受診者情報Ｆ    ASSIGN      TO        JUSINJL
000330                             ORGANIZATION             IS  INDEXED
000340                             ACCESS MODE              IS  DYNAMIC
000350                             RECORD KEY               IS  受－施術和暦年月
000360                                                          受－患者コード
000370                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000380                                                          受－患者カナ
000390                                                          受－患者コード
000400                             ALTERNATE RECORD KEY     IS  受－患者コード
000410                                                          受－施術和暦年月
000420                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000430                                                          受－保険種別
000440                                                          受－保険者番号
000450                                                          受－患者コード
000460                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000470                                                          受－公費種別
000480                                                          受－費用負担者番号
000490                                                          受－患者コード
000500                             ALTERNATE RECORD KEY     IS  受－施術和暦年月
000510                                                          受－助成種別
000520                                                          受－費用負担者番号助成
000530                                                          受－患者コード
000540                             ALTERNATE RECORD KEY     IS  受－請求和暦年月
000550                                                          受－施術和暦年月
000560                                                          受－患者コード
000570                             FILE STATUS              IS  状態キー
000580                             LOCK        MODE         IS  AUTOMATIC.
000590     SELECT  負傷データＦ    ASSIGN      TO        HUSYOUL
000600                             ORGANIZATION             IS  INDEXED
000610                             ACCESS MODE              IS  DYNAMIC
000620                             RECORD KEY               IS  負－施術和暦年月
000630                                                          負－患者コード
000640                             ALTERNATE RECORD KEY     IS  負－患者コード
000650                                                          負－施術和暦年月
000660                             FILE STATUS              IS  状態キー
000670                             LOCK        MODE         IS  AUTOMATIC.
000680     SELECT  施術記録Ｆ      ASSIGN      TO      SEKIROKL
000690                             ORGANIZATION        IS  INDEXED
000700                             ACCESS MODE         IS  DYNAMIC
000710                             RECORD KEY          IS  施記－施術和暦年月日
000720                                                     施記－患者コード
000730                             ALTERNATE RECORD KEY IS 施記－患者コード
000740                                                     施記－施術和暦年月日
000750                             FILE STATUS              IS  状態キー
000760                             LOCK        MODE         IS  AUTOMATIC.
000770     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000780                             ORGANIZATION             IS  INDEXED
000790                             ACCESS MODE              IS  DYNAMIC
000800                             RECORD KEY               IS  制－制御区分
000810                             FILE STATUS              IS  状態キー
000820                             LOCK        MODE         IS  AUTOMATIC.
           SELECT  レセプトＦ      ASSIGN      TO        RECEPTL
                                   ORGANIZATION             IS  INDEXED
                                   ACCESS MODE              IS  DYNAMIC
                                   RECORD KEY               IS  レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－患者コード
                                                                レセ－施術和暦年月
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－施術和暦年月
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－レセ種別
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－施術和暦年月
                                   ALTERNATE RECORD KEY     IS  レセ－請求和暦年月
                                                                レセ－請求保険者番号
                                                                レセ－患者コード
                                                                レセ－レセ種別
                                                                レセ－施術和暦年月
                                   FILE STATUS              IS  状態キー
                                   LOCK        MODE         IS  AUTOMATIC.
000690     SELECT  会計データＦ    ASSIGN      TO        KAIKEIL
000700                             ORGANIZATION             IS  INDEXED
000710                             ACCESS MODE              IS  DYNAMIC
000089                             RECORD KEY               IS  会－施術和暦年月日
000090                                                          会－患者コード
000092                             ALTERNATE RECORD KEY     IS  会－患者コード
000093                                                          会－施術和暦年月日
000790                             FILE STATUS              IS  状態キー
000800                             LOCK        MODE         IS  AUTOMATIC.
000530     SELECT  作業ファイル１  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7211L.DAT"
000540                             ORGANIZATION             IS  INDEXED
000550                             ACCESS                   IS  DYNAMIC
000560                             RECORD      KEY          IS  作１－施術和暦年月日
000610                                                          作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－施術和暦年月日
                                                                作１－患者カナ
                                                                作１－患者コード
000910                             ALTERNATE RECORD KEY     IS  作１－患者コード
                                                                作１－施術和暦年月日
000910                             ALTERNATE RECORD KEY     IS  作１－患者カナ
                                                                作１－患者コード
                                                                作１－施術和暦年月日
000620                             FILE        STATUS       IS  状態キー
000630                             LOCK        MODE         IS  AUTOMATIC.
000980     SELECT  作業ファイル２  ASSIGN      TO "C:\MAKISHISYS\YAWOBJ\TEMP\W7212L.DAT"
000990                             ORGANIZATION             IS  INDEXED
001000                             ACCESS                   IS  DYNAMIC
001010                             RECORD      KEY          IS  作２－施術和暦年月
001020                                                          作２－患者コード
001030                             FILE        STATUS       IS  状態キー
001040                             LOCK        MODE         IS  AUTOMATIC.
001050******************************************************************
001060*                      DATA DIVISION                             *
001070******************************************************************
001080 DATA                    DIVISION.
001090 FILE                    SECTION.
001100*                           ［ＲＬ＝  １２８］
001110 FD  元号マスタ          BLOCK   CONTAINS   1   RECORDS.
001120     COPY GENGOU          OF  XFDLIB  JOINING   元   AS  PREFIX.
001130*                           ［ＲＬ＝  ３２０］
001140 FD  受診者情報Ｆ        BLOCK   CONTAINS   1   RECORDS.
001150     COPY JUSINJ          OF  XFDLIB  JOINING   受   AS  PREFIX.
001160*                           ［ＲＬ＝  ２５６］
001170 FD  施術記録Ｆ          BLOCK   CONTAINS   1   RECORDS.
001180    COPY SEKIROK         OF  XFDLIB  JOINING   施記 AS  PREFIX.
001190*                           ［ＲＬ＝  １２８］
001200 FD  負傷データＦ        BLOCK   CONTAINS   1   RECORDS.
001210     COPY HUSYOU          OF  XFDLIB  JOINING   負   AS  PREFIX.
001220*                           ［ＲＬ＝  ２５６］
001230 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
001240     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
      *
       FD  レセプトＦ          BLOCK   CONTAINS   1   RECORDS GLOBAL.
           COPY RECEPT          OF  XFDLIB  JOINING   レセ  AS  PREFIX.
001060*                           ［ＲＬ＝  ５１２］
001070 FD  会計データＦ        BLOCK   CONTAINS   1   RECORDS.
001080     COPY KAIKEI     OF  XFDLIB  JOINING   会   AS  PREFIX.
001250*****************
001260* 作業ファイル１ *
001270*****************
001280*                         ［ＲＬ＝  １６０］
001290 FD  作業ファイル１ RECORD  CONTAINS 160 CHARACTERS.
001300 01 作１－レコード.
001310    03 作１－レコードキー.
001320       05 作１－施術和暦年月日.
001330          07 作１－施術和暦               PIC 9.
001340          07 作１－施術年月.
001350             09 作１－施術年              PIC 9(2).
001360             09 作１－施術月              PIC 9(2).
001370          07 作１－施術日                 PIC 9(2).
001380       05 作１－患者コード.
001390          07 作１－患者番号                PIC 9(6).
001400          07 作１－枝番                    PIC X(1).
001410    03 作１－レコードデータ.
001420       05 作１－患者カナ                   PIC X(50).
001430       05 作１－患者氏名                   PIC X(50).
001440       05 作１－料金.
001450          07 作１－初検金額                PIC 9(5).
001460          07 作１－整復金額                PIC 9(5).
001470          07 作１－後療金額                PIC 9(5).
001480          07 作１－罨法金額                PIC 9(5).
001490          07 作１－電療金額                PIC 9(5).
001500          07 作１－費用額                  PIC 9(5).
001510          07 作１－一部負担金              PIC 9(5).
001520       05 FILLER                           PIC X(11).
001530*
001540*                         ［ＲＬ＝  １２８］
001550 FD  作業ファイル２ RECORD  CONTAINS 128 CHARACTERS.
001560 01 作２－レコード.
001570    03 作２－レコードキー.
001580       05 作２－施術和暦年月.
001590          07 作２－施術和暦                PIC 9.
001600          07 作２－施術年月.
001610             09 作２－施術年               PIC 9(2).
001620             09 作２－施術月               PIC 9(2).
001630       05 作２－患者コード.
001640          07 作２－患者番号                PIC 9(6).
001650          07 作２－枝番                    PIC X(1).
001660    03 作２－レコードデータ.
001670       05 作２－最終通院日.
001680          07 作２－通院月                  PIC 9(2).
001690          07 作２－通院日                  PIC 9(2).
001700       05 作２－施術回数                   PIC 9(2).
001710       05 作２－費用額                     PIC 9(6).
001720       05 作２－請求額                     PIC 9(6).
001730       05 作２－負担金                     PIC 9(5).
001740       05 作２－転帰                       OCCURS 5.
001750          07 作２－転帰区分                PIC N(1).
001760       05 作２－初検計                     PIC 9(5).
001770       05 作２－整復計                     PIC 9(5).
001780       05 作２－後療計                     PIC 9(5).
001790       05 作２－罨法計                     PIC 9(5).
001800       05 作２－電療計                     PIC 9(5).
001810       05 作２－費用計                     PIC 9(5).
001820       05 作２－負担計                     PIC 9(5).
001830       05 FILLER                           PIC X(48).
001840*
001850*----------------------------------------------------------------*
001860******************************************************************
001870*                WORKING-STORAGE SECTION                         *
001880******************************************************************
001890 WORKING-STORAGE         SECTION.
001900 01 キー入力                           PIC X    VALUE SPACE.
001910 01 状態キー                           PIC X(2) VALUE SPACE.
001920 01 終了フラグ                         PIC X(3) VALUE SPACE.
001930 01 終了フラグ２                       PIC X(3) VALUE SPACE.
001940 01 終了フラグ３                       PIC X(3) VALUE SPACE.
001950 01 ファイル名                         PIC N(2) VALUE SPACE.
001960 01 実行キーＷ                         PIC X(4) VALUE SPACE.
001970 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
001980 01 継続フラグ                         PIC X(3) VALUE SPACE.
001990 01 対象フラグ                         PIC X(3) VALUE SPACE.
002000 01 部位ＣＮＴ                         PIC 9    VALUE ZERO.
002010 01 カウンタ                           PIC 9    VALUE ZERO.
002020 01 印刷対象ありＦ                     PIC 9    VALUE ZERO.
002030 01 対象患者Ｆ                         PIC 9    VALUE ZERO.
002040* **************
002050* * 項目待避用 
002060* **************
002070 01 待避項目ＷＲ.
002080    03 施術和暦年月ＷＲ.
002090       05 施術和暦ＷＲ                 PIC 9(1) VALUE ZERO.
002100       05 施術年ＷＲ                   PIC 9(2) VALUE ZERO.
002110       05 施術月ＷＲ                   PIC 9(2) VALUE ZERO.
002120    03 施術日ＷＲ                      PIC 9(2) VALUE ZERO.
002130    03 最終通院月Ｗ                    PIC 9(2) VALUE ZERO.
002140    03 最終通院日Ｗ                    PIC 9(2) VALUE ZERO.
002150    03 受理月Ｗ                        PIC 9(2) VALUE ZERO.
002160    03 受理日Ｗ                        PIC 9(2) VALUE ZERO.
002170    03 開始日ＷＰ                      PIC 9(2) VALUE ZERO.
002180    03 終了日ＷＰ                      PIC 9(2) VALUE ZERO.
002190    03 開始和暦年月日ＷＲ.
002200       05 開始和暦年月ＷＲ.
002210          07 開始和暦ＷＲ              PIC 9(1) VALUE ZERO.
002220          07 開始年ＷＲ                PIC 9(2) VALUE ZERO.
002230          07 開始月ＷＲ                PIC 9(2) VALUE ZERO.
002240       05 開始日ＷＲ                   PIC 9(2) VALUE ZERO.
002250    03 終了和暦年月日ＷＲ.
002260       05 終了和暦年月ＷＲ.
002270          07 終了和暦ＷＲ              PIC 9(1) VALUE ZERO.
002280          07 終了年ＷＲ                PIC 9(2) VALUE ZERO.
002290          07 終了月ＷＲ                PIC 9(2) VALUE ZERO.
002300       05 終了日ＷＲ                   PIC 9(2) VALUE ZERO.
002310    03 種別区分ＷＲ                    PIC X(4) VALUE SPACE.
002320    03 保険種別ＷＲ                    PIC 9(2) VALUE ZERO.
002330    03 患者コードＷＲ.
002340       05 患者番号ＷＲ                 PIC 9(6) VALUE ZERO.
002350       05 枝番ＷＲ                     PIC X(1) VALUE SPACE.
002360    03 本人家族区分ＷＲ                PIC 9(1) VALUE ZERO.
002370*
002380    03 印刷条件ＷＲ                    PIC 9(2) VALUE ZERO.
002390*
002400 01 公費負担者番号Ｗ.
002410    03 法別番号Ｗ                      PIC X(2) VALUE SPACE.
002420    03 FILLER                          PIC X(8) VALUE SPACE.
002430 01 退避項目ＧＷ.
002440   03 レセプト種類Ｗ                 PIC X(4).
002450   03 レセプト種類ＧＷ               PIC X(4).
002460   03 レセプト種別ＧＷ               PIC 9(2).
002470*
002480 01 明細.
002490    03 初検料ＷＲ                    PIC 9(4)  VALUE ZERO.
002500    03 初検加算料ＷＲ                PIC 9(4)  VALUE ZERO.
002510    03 休日ＷＲ                      PIC 9     VALUE ZERO.
002520    03 深夜ＷＲ                      PIC 9     VALUE ZERO.
002530    03 時間外ＷＲ                    PIC 9     VALUE ZERO.
002540    03 診療時ＷＲ                    PIC 9(2)  VALUE ZERO.
002550    03 診療分ＷＲ                    PIC 9(2)  VALUE ZERO.
          03 相談料ＷＲ                    PIC 9(4)  VALUE ZERO.
002560    03 再検料ＷＲ                    PIC 9(4)  VALUE ZERO.
002570    03 往療夜間ＷＲ                  PIC 9     VALUE ZERO.
002580    03 往療難路ＷＲ                  PIC 9     VALUE ZERO.
002590    03 往療暴風ＷＲ                  PIC 9     VALUE ZERO.
002600    03 往療回数ＷＲ                  PIC 9(2)  VALUE ZERO.
002610    03 往療距離ＷＲ                  PIC 9(3)V9 VALUE ZERO.
002620    03 往療料ＷＲ                    PIC 9(6)  VALUE ZERO.
002630    03 往療加算料ＷＲ                PIC 9(5)  VALUE ZERO.
002640    03 電罨料ＷＲ                    PIC 9(4)  VALUE ZERO.
002650    03 一部負担金ＷＲ                PIC 9(5)  VALUE ZERO.
002660    03 金属副子加算料ＷＲ            PIC 9(5)  VALUE ZERO.
004330    03 運動療法料ＷＲ                PIC 9(4)  VALUE ZERO.
002670    03 施術情報提供料ＷＲ            PIC 9(6)  VALUE ZERO.
002680    03 部位Ｗ                        OCCURS 4.
002690       05 初回処置料ＷＲ             PIC 9(4)  VALUE ZERO.
002700       05 後療料ＷＲ                 PIC 9(4)  VALUE ZERO.
002710       05 冷罨料ＷＲ                 PIC 9(4)  VALUE ZERO.
002720       05 温罨料ＷＲ                 PIC 9(4)  VALUE ZERO.
002730       05 電療料ＷＲ                 PIC 9(4)  VALUE ZERO.
002740       05 部位計ＷＲ                 PIC 9(4)  VALUE ZERO.
002750       05 金属ＷＲ                   PIC 9     VALUE ZERO.
002760    03 日数ＷＲ                      PIC 9(2)  OCCURS 5 VALUE ZERO.
002770    03 冷罨法料３０ＷＲ              PIC 9(4)  VALUE ZERO.
002780    03 冷罨法料３８ＷＲ              PIC 9(4)  VALUE ZERO.
002790    03 冷罨法料４０ＷＲ              PIC 9(4)  VALUE ZERO.
002800    03 冷罨法料４５ＷＲ              PIC 9(4)  VALUE ZERO.
002810    03 冷罨法料４８ＷＲ              PIC 9(4)  VALUE ZERO.
002820    03 温罨法料３０ＷＲ              PIC 9(4)  VALUE ZERO.
002830    03 温罨法料３８ＷＲ              PIC 9(4)  VALUE ZERO.
002840    03 温罨法料４０ＷＲ              PIC 9(4)  VALUE ZERO.
002850    03 温罨法料４５ＷＲ              PIC 9(4)  VALUE ZERO.
002860    03 温罨法料４８ＷＲ              PIC 9(4)  VALUE ZERO.
002870    03 電療料３０ＷＲ                PIC 9(4)  VALUE ZERO.
002880    03 電療料３８ＷＲ                PIC 9(4)  VALUE ZERO.
002890    03 電療料４０ＷＲ                PIC 9(4)  VALUE ZERO.
002900    03 電療料４５ＷＲ                PIC 9(4)  VALUE ZERO.
002910    03 電療料４８ＷＲ                PIC 9(4)  VALUE ZERO.
002920    03 後療料３０ＷＲ                PIC 9(4)  VALUE ZERO.
002930    03 後療料３８ＷＲ                PIC 9(4)  VALUE ZERO.
002940    03 後療料４０ＷＲ                PIC 9(4)  VALUE ZERO.
002950    03 後療料４５ＷＲ                PIC 9(4)  VALUE ZERO.
002960    03 後療料４８ＷＲ                PIC 9(4)  VALUE ZERO.
002970    03 冷罨料計ＷＲ                  PIC 9(4)  VALUE ZERO.
002980    03 温罨料計ＷＲ                  PIC 9(4)  VALUE ZERO.
002990    03 電療料計ＷＲ                  PIC 9(4)  VALUE ZERO.
003000*
003010 01 集計Ｗ.
003020    03 初検計Ｗ                      PIC 9(5)  VALUE ZERO.
003030    03 整復計Ｗ                      PIC 9(5)  VALUE ZERO.
003040    03 後療計Ｗ                      PIC 9(5)  VALUE ZERO.
003050    03 罨法計Ｗ                      PIC 9(5)  VALUE ZERO.
003060    03 電療計Ｗ                      PIC 9(5)  VALUE ZERO.
003070    03 費用計Ｗ                      PIC 9(5)  VALUE ZERO.
003080    03 一部負担金計Ｗ                PIC 9(5)  VALUE ZERO.
003090** レセ下段の日付区分用 (0:最終通院日、1:月末日、9:印字なし)
003100 01 レセプト日付区分Ｗ                 PIC 9 VALUE ZERO.
003110 01 レセプト患者日付区分Ｗ             PIC 9 VALUE ZERO.
003120** 月末日用
003130 01 施術西暦年Ｗ                       PIC 9(4)  VALUE ZERO.
003140 01 商Ｗ                               PIC 9(3)  VALUE ZERO.
003150 01 余Ｗ                               PIC 9(3)  VALUE ZERO.
003160*
003170******************************************************************
003180*                          連結項目                              *
003190******************************************************************
003200*
003210************
003220* 入力キー *
003230************
003240*
003250**********************
003260* メッセージ表示キー *
003270**********************
003280 01 連メ－キー IS EXTERNAL.
003290    03  連メ－メッセージ                 PIC N(20).
003300*
003310*
003320****************
003330* 画面入力情報 *
003340****************
003350 01 連入－入力データＹＨＮ７２０ IS EXTERNAL.
003360    03 連入－開始和暦年月日.
003370       05 連入－開始和暦                  PIC 9(1).
003380       05 連入－開始年                    PIC 9(2).
003390       05 連入－開始月                    PIC 9(2).
003400       05 連入－開始日                    PIC 9(2).
003410    03 連入－終了和暦年月日.
003420       05 連入－終了和暦                  PIC 9(1).
003430       05 連入－終了年                    PIC 9(2).
003440       05 連入－終了月                    PIC 9(2).
003450       05 連入－終了日                    PIC 9(2).
          03 連入－印刷対象Ｆ                   PIC 9.
       01 連入－入力データ６６０ IS EXTERNAL.
          03 連入－施術和暦年月.
             05 連入－施術和暦                  PIC 9(1).
             05 連入－施術年                    PIC 9(2).
             05 連入－施術月                    PIC 9(2).
          03 連入－保険種別                     PIC 9(2).
          03 連入－本人家族区分                 PIC 9(1).
          03 連入－患者コード.
             05 連入－患者番号                  PIC 9(6).
             05 連入－枝番                      PIC X(1).
      *
          03 連入－印刷条件                     PIC 9(2).
          03 連入－読み順                       PIC X(4).
006810*
006820******************************************************************
006830*                      PROCEDURE  DIVISION                       *
006840******************************************************************
006850 PROCEDURE               DIVISION.
006870************
006880*           *
006890* 初期処理   *
006900*           *
006910************
006920     PERFORM 初期化.
006930************
006940*           *
006950* 主処理     *
006960*           *
006970************
006980     PERFORM 作業ファイル作成.
006990************
007000*           *
007010* 終了処理   *
007020*           *
007030************
007040*/印刷データのない場合はメッセージを出力20131
007050*     IF 印刷対象ありＦ = ZERO
007060*         MOVE  NC"　　　印刷対象データがありません" TO 連メ－メッセージ
007070*         CALL   "MSG001"
007080*         CANCEL "MSG001"
007090*     END-IF.
           MOVE 印刷対象ありＦ TO 連入－印刷対象Ｆ.
007100     PERFORM 終了処理.
007110     MOVE ZERO TO PROGRAM-STATUS.
007120     EXIT PROGRAM.
007130*
007140*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
007150*================================================================*
007160 初期化 SECTION.
007170*
007180     PERFORM ファイルオープン.
007190* 連結項目の待避
007200     INITIALIZE 待避項目ＷＲ.
007220     MOVE 連入－保険種別      TO 保険種別ＷＲ.
007230     MOVE 連入－患者番号      TO 患者番号ＷＲ.
007240     MOVE 連入－枝番          TO 枝番ＷＲ.
007250     MOVE 連入－開始和暦      TO 開始和暦ＷＲ.
007260     MOVE 連入－開始年        TO 開始年ＷＲ.
007270     MOVE 連入－開始月        TO 開始月ＷＲ.
007280     MOVE 連入－開始日        TO 開始日ＷＲ.
007290     MOVE 連入－終了和暦      TO 終了和暦ＷＲ.
007300     MOVE 連入－終了年        TO 終了年ＷＲ.
007310     MOVE 連入－終了月        TO 終了月ＷＲ.
007320     MOVE 連入－終了日        TO 終了日ＷＲ.
007330     MOVE 連入－本人家族区分  TO 本人家族区分ＷＲ.
007340*
007350     MOVE 連入－印刷条件      TO 印刷条件ＷＲ.
007360*================================================================*
007370 ファイルオープン SECTION.
007380*
007390     OPEN INPUT   元号マスタ
007400         MOVE NC"元号" TO ファイル名.
007410         PERFORM オープンチェック.
007420     OPEN INPUT 受診者情報Ｆ.
007430         MOVE NC"受診者情報Ｆ" TO ファイル名.
007440         PERFORM オープンチェック.
003250     OPEN INPUT レセプトＦ.
003260         MOVE NC"レセプトＦ" TO ファイル名.
003270         PERFORM オープンチェック.
007450     OPEN INPUT 負傷データＦ.
007460         MOVE NC"負傷データＦ" TO ファイル名.
007470         PERFORM オープンチェック.
007480     OPEN INPUT 施術記録Ｆ.
007490         MOVE NC"施術記録Ｆ"   TO ファイル名.
007500         PERFORM オープンチェック.
007510     OPEN INPUT   制御情報マスタ
007520         MOVE NC"制御情報" TO ファイル名.
007530         PERFORM オープンチェック.
003060     OPEN INPUT 会計データＦ.
003070         MOVE NC"会計" TO ファイル名.
003080         PERFORM オープンチェック.
007540*================================================================*
007550 オープンチェック SECTION.
007560*
007570     IF 状態キー  NOT =  "00"
007580         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
007590         DISPLAY NC"状態キー：" 状態キー         UPON CONS
007600         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
007610                                                 UPON CONS
003131*-----------------------------------------*
003132         CALL "actcshm"  WITH C LINKAGE
003133*-----------------------------------------*
007620         ACCEPT  キー入力 FROM CONS
007630         PERFORM ファイル閉鎖
007640         MOVE 99 TO PROGRAM-STATUS
007650         EXIT PROGRAM.
007660*================================================================*
007670 ファイル閉鎖 SECTION.
007680*
007690     CLOSE 元号マスタ  受診者情報Ｆ レセプトＦ 負傷データＦ
                 施術記録Ｆ  会計データＦ.
007700*================================================================*
007710 終了処理 SECTION.
007720*
007730     PERFORM ファイル閉鎖.
007740*================================================================*
007750 エラー表示 SECTION.
007760*
007770     DISPLAY NC"状態キー" 状態キー  UPON CONS.
007780     DISPLAY NC"５ファイル書込エラー：" ファイル名   UPON CONS.
007790     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
007800     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003321*-----------------------------------------*
003322     CALL "actcshm"  WITH C LINKAGE.
003323*-----------------------------------------*
007810     ACCEPT  キー入力 FROM CONS.
007820     PERFORM ファイル閉鎖.
007830     MOVE 99 TO PROGRAM-STATUS.
007840     EXIT PROGRAM.
007850*================================================================*
007860 受診者情報Ｆ読込 SECTION.
007870*
007880     READ 受診者情報Ｆ NEXT
007890     AT END
007900         MOVE "YES" TO 終了フラグ
007910     END-READ.
007920*================================================================*
007930 作業ファイル作成 SECTION.
007940*
007950     MOVE ZERO TO 印刷対象ありＦ.
007960*
007970     OPEN OUTPUT 作業ファイル１
007980          MOVE NC"作１" TO ファイル名
007990          PERFORM オープンチェック
008000     OPEN OUTPUT 作業ファイル２
008010          MOVE NC"作２" TO ファイル名
008020          PERFORM オープンチェック
008030*
008040     MOVE 開始和暦ＷＲ      TO 受－施術和暦.
008050     MOVE 開始年ＷＲ        TO 受－施術年.
008060     MOVE 開始月ＷＲ        TO 受－施術月.
008070     MOVE SPACE             TO 受－患者カナ.
008080     MOVE SPACE             TO 受－患者コード.
008090     START 受診者情報Ｆ   KEY IS >= 受－施術和暦年月
008100                                    受－患者カナ
008110                                    受－患者コード
008120     IF 状態キー = "00"
008130         MOVE SPACE  TO 終了フラグ
008140         PERFORM 受診者情報Ｆ読込
008150         PERFORM UNTIL ( 終了フラグ = "YES" ) OR
008160                       ( 受－施術和暦年月 > 終了和暦年月ＷＲ )
008170*/印刷対象条件の判定
008180                 IF ((保険種別ＷＲ     NOT = ZERO)              AND
008190                     (保険種別ＷＲ     NOT = 受－保険種別))     OR
008200*/患者指定時、枝番も含まれてしまう為変更20205
008210*                    ((患者番号ＷＲ     NOT = ZERO)              AND
008220*                     (患者番号ＷＲ     NOT = 受－患者番号))     OR
008230*                    ((枝番ＷＲ         NOT = SPACE)             AND
008240*                     (枝番ＷＲ         NOT = 受－枝番))         OR
008250                    ((患者番号ＷＲ    NOT = ZERO)               AND
008260                     (患者コードＷＲ   NOT = 受－患者コード))   OR
008270                    ((本人家族区分ＷＲ NOT = ZERO)              AND
008280                     (本人家族区分ＷＲ NOT = 受－本人家族区分)) OR
008290                     (受－保険種別         = 70 OR 80 OR 90)
008300*/対象外
008310                     CONTINUE
008320                 ELSE
008330*/印刷条件ＷＲ←保留
008340                     MOVE "YES" TO 対象フラグ
008350                     IF 印刷条件ＷＲ NOT = ZERO
008360                         PERFORM 印刷条件判定
008370                     END-IF
008380                     IF 対象フラグ = "YES"
008390                         PERFORM データチェック
008400                         IF 実行キーＷ = "YES"
008410                             MOVE 受－施術和暦年月 TO 施術和暦年月ＷＲ
008420                             IF 受－施術和暦年月 = 開始和暦年月ＷＲ
008430                                 MOVE 開始日ＷＲ TO 開始日ＷＰ
008440                             ELSE
008450                                 MOVE 1          TO 開始日ＷＰ
008460                             END-IF
008470                             IF 受－施術和暦年月 = 終了和暦年月ＷＲ
008480                                 MOVE 終了日ＷＲ TO 終了日ＷＰ
008490                             ELSE
008500                                 PERFORM 月末日取得
008510                                 MOVE 受理日Ｗ   TO 終了日ＷＰ
008520                             END-IF
008530                             PERFORM 作１レコードセット
008540*                           */レスポンスの向上の為201312
008550                             IF 対象患者Ｆ = 1
008560                                 PERFORM 作２レコードセット
008570                             END-IF
008580                         END-IF
008590                     END-IF
008600                 END-IF
008610                 PERFORM 受診者情報Ｆ読込
008620         END-PERFORM
008630     END-IF.
008640     CLOSE 作業ファイル１ 作業ファイル２.
008650*================================================================*
008660 作１レコードセット SECTION.
008670*
008680*/レスポンスの向上の為201312
008690     MOVE ZERO TO 対象患者Ｆ.
008700     INITIALIZE 作１－レコード.
008710     MOVE 受－患者コード   TO 作１－患者コード.
008720     MOVE 受－患者カナ     TO 作１－患者カナ.
008730     MOVE 受－患者氏名     TO 作１－患者氏名.
008740     PERFORM VARYING 施術日ＷＲ FROM 開始日ＷＰ BY 1
008750             UNTIL ( 施術日ＷＲ > 終了日ＷＰ )
008760         INITIALIZE 作１－料金
008770         MOVE 受－患者番号  TO 施記－患者番号
008780         MOVE 受－枝番      TO 施記－枝番
008790         MOVE 受－施術和暦  TO 施記－施術和暦
008800         MOVE 受－施術年    TO 施記－施術年
008810         MOVE 受－施術月    TO 施記－施術月
008820         MOVE 施術日ＷＲ    TO 施記－施術日
008830         READ 施術記録Ｆ
008840         NOT INVALID KEY
008850*/印刷データのない場合はメッセージを出力20131
008860             MOVE 1 TO 印刷対象ありＦ
008870             PERFORM レセプト呼出し１
008880             PERFORM 料金情報取得
008890             PERFORM 項目ごと計算
008900             PERFORM 作業ファイルセット
008910             PERFORM 作１レコード書込
008920*/レスポンスの向上の為201312
008930             MOVE 1 TO 対象患者Ｆ
008940         END-READ
008950     END-PERFORM.
008960*================================================================*
008970 作業ファイルセット SECTION.
008980*
008990     MOVE 会－施術和暦       TO 作１－施術和暦.
009000     MOVE 会－施術年         TO 作１－施術年.
009010     MOVE 会－施術月         TO 作１－施術月.
009020     MOVE 施術日ＷＲ         TO 作１－施術日.
009030     MOVE 一部負担金ＷＲ     TO 作１－一部負担金.
009040*================================================================*
009050 作業２ファイルセット SECTION.
009060*
009070     MOVE レセ－施術和暦     TO 作２－施術和暦.
009080     MOVE レセ－施術年       TO 作２－施術年.
009090     MOVE レセ－施術月       TO 作２－施術月.
009100     MOVE 初検計Ｗ           TO 作２－初検計.
009110     MOVE 整復計Ｗ           TO 作２－整復計.
009120     MOVE 後療計Ｗ           TO 作２－後療計.
009130     MOVE 罨法計Ｗ           TO 作２－罨法計.
009140     MOVE 電療計Ｗ           TO 作２－電療計.
009150     MOVE 費用計Ｗ           TO 作２－費用計.
009160     MOVE 一部負担金計Ｗ     TO 作２－負担計.
009170*================================================================*
009180 作２レコードセット SECTION.
009190*
009200     INITIALIZE 作２－レコード.
009210     MOVE SPACE TO 集計Ｗ.
009220     MOVE 受－患者コード   TO 作２－患者コード.
009230     PERFORM レセプト呼出し２.
009240     PERFORM 料金情報取得２.
009250     PERFORM VARYING 施術日ＷＲ FROM 1 BY 1
009260             UNTIL ( 施術日ＷＲ > 31 )
009270         INITIALIZE 作１－料金
009280         MOVE 受－患者番号  TO 施記－患者番号
009290         MOVE 受－枝番      TO 施記－枝番
009300         MOVE 受－施術和暦  TO 施記－施術和暦
009310         MOVE 受－施術年    TO 施記－施術年
009320         MOVE 受－施術月    TO 施記－施術月
009330         MOVE 施術日ＷＲ    TO 施記－施術日
009340         READ 施術記録Ｆ
009350         NOT INVALID KEY
009360             PERFORM レセプト呼出し１
009370             PERFORM 集計
009380         END-READ
009390     END-PERFORM.
009400     PERFORM 作業２ファイルセット.
009410     PERFORM 作２レコード書込.
009420*================================================================*
009430 レセプト呼出し１ SECTION.
009440*
009180     MOVE 受－患者番号  TO 会－患者番号.
009190     MOVE 受－枝番      TO 会－枝番.
009200     MOVE 受－施術和暦  TO 会－施術和暦.
009210     MOVE 受－施術年    TO 会－施術年.
009220     MOVE 受－施術月    TO 会－施術月.
009230     MOVE 施術日ＷＲ    TO 会－施術日.
009240     READ 会計データＦ
           INVALID KEY
               MOVE SPACE     TO 会－レコード
           END-READ.
009710*
009750     MOVE 会－一部負担金     TO 一部負担金ＷＲ.
009810*
009820*================================================================*
009830 レセプト呼出し２ SECTION.
009840*
           IF 受－助成種別 NOT = ZERO
              MOVE  3   TO レセ－レセ種別
           ELSE
              IF 受－公費種別 NOT = ZERO
                 MOVE  2   TO レセ－レセ種別
              ELSE
                 IF 受－保険種別 = 85
                    MOVE  7   TO レセ－レセ種別
                 ELSE
                    MOVE  1   TO レセ－レセ種別
                 END-IF
              END-IF
           END-IF.
005200     MOVE 受－施術和暦  TO レセ－施術和暦.
005210     MOVE 受－施術年    TO レセ－施術年.  
005220     MOVE 受－施術月    TO レセ－施術月.  
005230     MOVE 受－患者番号  TO レセ－患者番号.
005240     MOVE 受－枝番      TO レセ－枝番.    
           READ レセプトＦ
           INVALID KEY
               MOVE SPACE     TO レセ－レコード
           END-READ.
010170*
011040*================================================================*
011050 料金情報取得 SECTION.
011060*
011070***********************************************
011080* 料金データセット                            *
011090***********************************************
011100*    ****************************************************************
011110*    * 料金（月毎）（負傷毎）（逓減毎）については連結項目よりセット *
011120*    ****************************************************************
011130     MOVE 会－初検料             TO  初検料ＷＲ.
011140*
011150     MOVE 会－初検加算料         TO  初検加算料ＷＲ.
           MOVE 会－初検時相談料       TO  相談料ＷＲ.
011160     MOVE 会－再検料             TO  再検料ＷＲ.
011170     MOVE 会－往療料             TO  往療料ＷＲ.
011180     MOVE 会－往療加算料         TO  往療加算料ＷＲ.
011190*
011220     MOVE 会－施術情報提供料     TO  施術情報提供料ＷＲ.
011230*
011240     COMPUTE 作１－初検金額 = 初検料ＷＲ + 初検加算料ＷＲ + 再検料ＷＲ +
011250                              往療料ＷＲ + 往療加算料ＷＲ + 施術情報提供料ＷＲ + 相談料ＷＲ.
011260     MOVE 会－費用額             TO 作１－費用額.
011270*
011280*================================================================*
011290 料金情報取得２ SECTION.
011300*
011310     IF レセプト種類Ｗ = "JYOS"
011320         MOVE レセ－受給者負担額 TO 作２－負担金
011330         MOVE レセ－合計         TO 作２－費用額
011340         MOVE レセ－請求金額     TO 作２－請求額
011350     ELSE
011360         MOVE レセ－一部負担金   TO 作２－負担金
011410         MOVE レセ－合計         TO 作２－費用額
011420         MOVE レセ－請求金額     TO 作２－請求額
011440     END-IF.
011450     MOVE SPACE  TO 継続フラグ.
011460     PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
011470               UNTIL (部位ＣＮＴ > 5)
011480         EVALUATE 負－転帰区分(部位ＣＮＴ)
011490         WHEN 1
011500             MOVE NC"治"  TO 作２－転帰区分(部位ＣＮＴ)
011510         WHEN 2
011520             MOVE NC"全"  TO 作２－転帰区分(部位ＣＮＴ)
011530         WHEN 3
011540             MOVE NC"中"  TO 作２－転帰区分(部位ＣＮＴ)
011550         WHEN 4
011560             MOVE NC"転"  TO 作２－転帰区分(部位ＣＮＴ)
011570         WHEN 5
011580             MOVE NC"自"  TO 作２－転帰区分(部位ＣＮＴ)
011590         WHEN 9
011600             MOVE NC"継"  TO 作２－転帰区分(部位ＣＮＴ)
011610             MOVE "YES"   TO 継続フラグ
011620         END-EVALUATE
011630     END-PERFORM.
011640     MOVE レセ－レセ実日数   TO 作２－施術回数.
011650     MOVE ZEROS TO 制－制御区分.
011660     READ 制御情報マスタ
011670     NOT INVALID KEY
011680         MOVE 制－レセプト日付区分     TO レセプト日付区分Ｗ
011690         MOVE 制－レセプト患者日付区分 TO レセプト患者日付区分Ｗ
011700     END-READ.
011710     PERFORM 最終通院日取得.
011720     EVALUATE レセプト患者日付区分Ｗ 
011730*    /  最終通院日 /
011740     WHEN ZERO
011750*         MOVE 最終通院年Ｗ TO 患者委任年Ｗ
011760         MOVE 最終通院月Ｗ TO 作２－通院月
011770         MOVE 最終通院日Ｗ TO 作２－通院日
011780*    /  月末日 /
011790     WHEN 1 
011800         PERFORM 月末日取得
011810*         MOVE 受理年Ｗ     TO 患者委任年Ｗ
011820         MOVE 受理月Ｗ     TO 作２－通院月
011830         MOVE 受理日Ｗ     TO 作２－通院日
011840*    /  印字なし /
011850     WHEN 9
011860*         MOVE ZERO         TO 患者委任年Ｗ
011870         MOVE ZERO         TO 作２－通院月
011880         MOVE ZERO         TO 作２－通院日
011890*    /  その他は、最終通院日 /
011900     WHEN OTHER
011910*         MOVE 最終通院年Ｗ TO 患者委任年Ｗ
011920         MOVE 最終通院月Ｗ TO 作２－通院月
011930         MOVE 最終通院日Ｗ TO 作２－通院日
011940     END-EVALUATE.
011950*================================================================*
011960 項目ごと計算 SECTION.
011970***********************************************
011980* 料金データセット                            *
011990***********************************************
011200     MOVE 会－金属副子加算料     TO  金属副子加算料ＷＲ.
010840     MOVE 会－運動後療料         TO  運動療法料ＷＲ.
011210*
012000     COMPUTE 作１－整復金額 = 会－初回処置料合計 + 金属副子加算料ＷＲ + 運動療法料ＷＲ.
012010*
012020     MOVE 会－後療料１     TO 後療料ＷＲ(1).
012030     MOVE 会－後療料２     TO 後療料ＷＲ(2).
012040     MOVE 会－後療料３８   TO 後療料３８ＷＲ.
012050     MOVE 会－後療料３０   TO 後療料３０ＷＲ.
012060     COMPUTE 後療料ＷＲ(3)   = 後療料３８ＷＲ   + 後療料３０ＷＲ.
012070     MOVE 会－後療料４５   TO 後療料４５ＷＲ.
012080     MOVE 会－後療料４８   TO 後療料４８ＷＲ.
012090     MOVE 会－後療料４０   TO 後療料４０ＷＲ.
012100     COMPUTE 後療料ＷＲ(4)   = 後療料４５ＷＲ   + 後療料４８ＷＲ   + 後療料４０ＷＲ.
012110     COMPUTE 作１－後療金額 = 後療料ＷＲ(1) + 後療料ＷＲ(2) + 後療料ＷＲ(3) + 後療料ＷＲ(4).
012120********************
012130* 逓減毎料金セット *
012140********************
012150     MOVE 会－冷罨法料１   TO 冷罨料ＷＲ(1).
012160     MOVE 会－冷罨法料２   TO 冷罨料ＷＲ(2).
012170     MOVE 会－冷罨法料３８ TO 冷罨法料３８ＷＲ.
012180     MOVE 会－冷罨法料３０ TO 冷罨法料３０ＷＲ.
012190     COMPUTE 冷罨料ＷＲ(3)   = 冷罨法料３８ＷＲ  + 冷罨法料３０ＷＲ.
012200     MOVE 会－冷罨法料４５ TO 冷罨法料４５ＷＲ.
012210     MOVE 会－冷罨法料４８ TO 冷罨法料４８ＷＲ.
012220     MOVE 会－冷罨法料４０ TO 冷罨法料４０ＷＲ.
012230     COMPUTE 冷罨料ＷＲ(4)   = 冷罨法料４５ＷＲ  + 冷罨法料４８ＷＲ  + 冷罨法料４０ＷＲ.
012240     COMPUTE 冷罨料計ＷＲ = 冷罨料ＷＲ(1) + 冷罨料ＷＲ(2) + 冷罨料ＷＲ(3) + 冷罨料ＷＲ(4).
012250*
012260     MOVE 会－温罨法料１   TO 温罨料ＷＲ(1).
012270     MOVE 会－温罨法料２   TO 温罨料ＷＲ(2).
012280     MOVE 会－温罨法料３８ TO 温罨法料３８ＷＲ.
012290     MOVE 会－温罨法料３０ TO 温罨法料３０ＷＲ.
012300     COMPUTE 温罨料ＷＲ(3)   = 温罨法料３８ＷＲ  + 温罨法料３０ＷＲ.
012310     MOVE 会－温罨法料４５ TO 温罨法料４５ＷＲ.
012320     MOVE 会－温罨法料４８ TO 温罨法料４８ＷＲ.
012330     MOVE 会－温罨法料４０ TO 温罨法料４０ＷＲ.
012340     COMPUTE 温罨料ＷＲ(4)   = 温罨法料４５ＷＲ  + 温罨法料４８ＷＲ  + 温罨法料４０ＷＲ.
012350     COMPUTE 温罨料計ＷＲ = 温罨料ＷＲ(1) + 温罨料ＷＲ(2) + 温罨料ＷＲ(3) + 温罨料ＷＲ(4).
012360     COMPUTE 作１－罨法金額 = 冷罨料計ＷＲ + 温罨料計ＷＲ.
012370*
012380     MOVE 会－電療料１     TO 電療料ＷＲ(1).
012390     MOVE 会－電療料２     TO 電療料ＷＲ(2).
012400     MOVE 会－電療料３８   TO 電療料３８ＷＲ.
012410     MOVE 会－電療料３０   TO 電療料３０ＷＲ.
012420     COMPUTE 電療料ＷＲ(3)  = 電療料３８ＷＲ  + 電療料３０ＷＲ.
012430     MOVE 会－電療料４５   TO 電療料４５ＷＲ.
012440     MOVE 会－電療料４８   TO 電療料４８ＷＲ.
012450     MOVE 会－電療料４０   TO 電療料４０ＷＲ.
012460     COMPUTE 電療料ＷＲ(4)  = 電療料４５ＷＲ  + 電療料４８ＷＲ  + 電療料４０ＷＲ.
012470     COMPUTE 作１－電療金額 = 電療料ＷＲ(1) + 電療料ＷＲ(2) + 電療料ＷＲ(3) + 電療料ＷＲ(4).
012480*
012490*================================================================*
012500 集計 SECTION.
012510***********************************************
012520* 料金データセット                            *
012530***********************************************
012540     MOVE 会－初検料             TO  初検料ＷＲ.
012550*
012560     MOVE 会－初検加算料         TO  初検加算料ＷＲ.
           MOVE 会－初検時相談料       TO  相談料ＷＲ.
012570     MOVE 会－再検料             TO  再検料ＷＲ.
012580     MOVE 会－往療料             TO  往療料ＷＲ.
012590     MOVE 会－往療加算料         TO  往療加算料ＷＲ.
012600     MOVE 会－金属副子加算料     TO  金属副子加算料ＷＲ.
010840     MOVE 会－運動後療料         TO  運動療法料ＷＲ.
012610     MOVE 会－施術情報提供料     TO  施術情報提供料ＷＲ.
012620     COMPUTE 初検計Ｗ = 初検計Ｗ + 初検料ＷＲ + 初検加算料ＷＲ + 再検料ＷＲ +
012630                        往療料ＷＲ + 往療加算料ＷＲ + 施術情報提供料ＷＲ + 相談料ＷＲ.
012640*
012650     COMPUTE 整復計Ｗ = 整復計Ｗ + 会－初回処置料合計 + 金属副子加算料ＷＲ + 運動療法料ＷＲ.
012660*
012670     MOVE 会－後療料１     TO 後療料ＷＲ(1).
012680     MOVE 会－後療料２     TO 後療料ＷＲ(2).
012690     MOVE 会－後療料３８   TO 後療料３８ＷＲ.
012700     MOVE 会－後療料３０   TO 後療料３０ＷＲ.
012710     COMPUTE 後療料ＷＲ(3)   = 後療料３８ＷＲ   + 後療料３０ＷＲ.
012720     MOVE 会－後療料４５   TO 後療料４５ＷＲ.
012730     MOVE 会－後療料４８   TO 後療料４８ＷＲ.
012740     MOVE 会－後療料４０   TO 後療料４０ＷＲ.
012750     COMPUTE 後療料ＷＲ(4)   = 後療料４５ＷＲ   + 後療料４８ＷＲ   + 後療料４０ＷＲ.
012760     COMPUTE 後療計Ｗ = 後療計Ｗ + 後療料ＷＲ(1) + 後療料ＷＲ(2) + 後療料ＷＲ(3) + 後療料ＷＲ(4).
012770********************
012780* 逓減毎料金セット *
012790********************
012800     MOVE 会－冷罨法料１             TO 冷罨料ＷＲ(1).
012810     MOVE 会－冷罨法料２             TO 冷罨料ＷＲ(2).
012820     MOVE 会－冷罨法料３８           TO 冷罨法料３８ＷＲ.
012830     MOVE 会－冷罨法料３０           TO 冷罨法料３０ＷＲ.
012840     COMPUTE 冷罨料ＷＲ(3)   = 冷罨法料３８ＷＲ  + 冷罨法料３０ＷＲ.
012850     MOVE 会－冷罨法料４５           TO 冷罨法料４５ＷＲ.
012860     MOVE 会－冷罨法料４８           TO 冷罨法料４８ＷＲ.
012870     MOVE 会－冷罨法料４０           TO 冷罨法料４０ＷＲ.
012880     COMPUTE 冷罨料ＷＲ(4)   = 冷罨法料４５ＷＲ  + 冷罨法料４８ＷＲ  + 冷罨法料４０ＷＲ.
012890     COMPUTE 冷罨料計ＷＲ = 冷罨料ＷＲ(1) + 冷罨料ＷＲ(2) + 冷罨料ＷＲ(3) + 冷罨料ＷＲ(4).
012900*
012910     MOVE 会－温罨法料１             TO 温罨料ＷＲ(1).
012920     MOVE 会－温罨法料２             TO 温罨料ＷＲ(2).
012930     MOVE 会－温罨法料３８           TO 温罨法料３８ＷＲ.
012940     MOVE 会－温罨法料３０           TO 温罨法料３０ＷＲ.
012950     COMPUTE 温罨料ＷＲ(3)   = 温罨法料３８ＷＲ  + 温罨法料３０ＷＲ.
012960     MOVE 会－温罨法料４５           TO 温罨法料４５ＷＲ.
012970     MOVE 会－温罨法料４８           TO 温罨法料４８ＷＲ.
012980     MOVE 会－温罨法料４０           TO 温罨法料４０ＷＲ.
012990     COMPUTE 温罨料ＷＲ(4)   = 温罨法料４５ＷＲ  + 温罨法料４８ＷＲ  + 温罨法料４０ＷＲ.
013000     COMPUTE 温罨料計ＷＲ = 温罨料ＷＲ(1) + 温罨料ＷＲ(2) + 温罨料ＷＲ(3) + 温罨料ＷＲ(4).
013010     COMPUTE 罨法計Ｗ = 罨法計Ｗ + 冷罨料計ＷＲ + 温罨料計ＷＲ.
013020*
013030     MOVE 会－電療料１             TO 電療料ＷＲ(1).
013040     MOVE 会－電療料２             TO 電療料ＷＲ(2).
013050     MOVE 会－電療料３８           TO 電療料３８ＷＲ.
013060     MOVE 会－電療料３０           TO 電療料３０ＷＲ.
013070     COMPUTE 電療料ＷＲ(3)  = 電療料３８ＷＲ  + 電療料３０ＷＲ.
013080     MOVE 会－電療料４５           TO 電療料４５ＷＲ.
013090     MOVE 会－電療料４８           TO 電療料４８ＷＲ.
013100     MOVE 会－電療料４０           TO 電療料４０ＷＲ.
013110     COMPUTE 電療料ＷＲ(4)  = 電療料４５ＷＲ  + 電療料４８ＷＲ  + 電療料４０ＷＲ.
013120     COMPUTE 電療計Ｗ = 電療計Ｗ + 電療料ＷＲ(1) + 電療料ＷＲ(2) + 電療料ＷＲ(3) + 電療料ＷＲ(4).
013130*
013140     COMPUTE 費用計Ｗ = 費用計Ｗ + 会－費用額.
013150     COMPUTE 一部負担金計Ｗ = 一部負担金計Ｗ + 一部負担金ＷＲ.
013160*
013170*================================================================*
013180 作１レコード書込 SECTION.
013190*
013200     WRITE 作１－レコード
013210     INVALID KEY
013220         MOVE NC"作１"  TO ファイル名
013230         PERFORM エラー表示
013240     END-WRITE.
013250*================================================================*
013260 作２レコード書込 SECTION.
013270*
013280     WRITE 作２－レコード
013290     INVALID KEY
013300         MOVE NC"作２"  TO ファイル名
013310         PERFORM エラー表示
013320     END-WRITE.
013330*================================================================*
013340 データチェック SECTION.
013350*
013360     MOVE SPACE          TO 実行キーＷ.
013370* *****************************************************************
013380* * 負傷部位有無チェック：部位数 = 0 の場合データ作成対象としない *
013390* *****************************************************************
013400     MOVE 受－施術和暦   TO 負－施術和暦.
013410     MOVE 受－施術年     TO 負－施術年.
013420     MOVE 受－施術月     TO 負－施術月.
013430     MOVE 受－患者番号   TO 負－患者番号.
013440     MOVE 受－枝番       TO 負－枝番.
013450     READ 負傷データＦ
013460     INVALID KEY
013470         MOVE SPACE  TO 実行キーＷ
013480     NOT INVALID KEY
013490         IF 負－部位数 NOT = ZERO
013500*        *************************************************************
013510*        * 施術記録チェック：通院数 = 0 の場合データ作成対象としない *
013520*        *************************************************************
013530             MOVE 負－患者番号  TO 施記－患者番号
013540             MOVE 負－枝番      TO 施記－枝番
013550             MOVE 負－施術和暦  TO 施記－施術和暦
013560             MOVE 負－施術年    TO 施記－施術年
013570             MOVE 負－施術月    TO 施記－施術月
013580             MOVE ZERO          TO 施記－施術日
013590             START 施術記録Ｆ   KEY IS >= 施記－患者コード
013600                                          施記－施術和暦年月日
013610             END-START
013620             IF 状態キー = "00"
013630                 MOVE SPACE TO 終了フラグ２
013640                 MOVE SPACE TO 施術記録有Ｗ
013650                 PERFORM 施術記録Ｆ読込
013660                 PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
013670                               (施記－患者コード NOT = 負－患者コード) OR
013680                               (施記－施術和暦   NOT = 負－施術和暦  ) OR
013690                               (施記－施術年     NOT = 負－施術年    ) OR
013700                               (施記－施術月     NOT = 負－施術月    ) OR
013710                               (施術記録有Ｗ         = "YES"         )
013720                     MOVE "YES"  TO 施術記録有Ｗ
013730                     MOVE "YES"  TO 実行キーＷ
013740                 END-PERFORM
013750             ELSE
013760                 MOVE SPACE  TO 実行キーＷ
013770             END-IF
013780         ELSE
013790             MOVE SPACE  TO 実行キーＷ
013800         END-IF
013810     END-READ.
013820*
013830*================================================================*
013840 施術記録Ｆ読込 SECTION.
013850*
013860     READ 施術記録Ｆ NEXT
013870     AT END
013880         MOVE "YES"  TO 終了フラグ２
013890     END-READ.
013900*================================================================*
013910 印刷条件判定 SECTION.
013920*
013930     MOVE SPACE TO 対象フラグ
013940*/労災自賠責のデータは対象外
013950     IF 受－保険種別 NOT = 70 AND 80
013960         EVALUATE 印刷条件ＷＲ
013970         WHEN 01
013980             PERFORM 初検判定
013990         WHEN 02
014000             PERFORM 後療のみ判定
014010         WHEN 03
014020             PERFORM 終了判定
014030         WHEN 04
014040             PERFORM 初検判定
014050             IF 対象フラグ = "YES"
014060                 PERFORM 終了判定
014070             END-IF
014080         WHEN OTHER
014090             CONTINUE
014100         END-EVALUATE
014110     END-IF.
014120*================================================================*
014130 初検判定 SECTION.
014140*
014150     MOVE 受－患者番号  TO 施記－患者番号
014160     MOVE 受－枝番      TO 施記－枝番
014170     MOVE 受－施術和暦  TO 施記－施術和暦
014180     MOVE 受－施術年    TO 施記－施術年
014190     MOVE 受－施術月    TO 施記－施術月
014200     MOVE ZERO          TO 施記－施術日
014210     START 施術記録Ｆ   KEY IS >= 施記－患者コード
014220                                  施記－施術和暦年月日
014230     END-START
014240     IF 状態キー = "00"
014250         MOVE SPACE TO 終了フラグ２
014260         PERFORM 施術記録Ｆ読込
014270         PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
014280                       (施記－患者コード NOT = 受－患者コード) OR
014290                       (施記－施術和暦   NOT = 受－施術和暦  ) OR
014300                       (施記－施術年     NOT = 受－施術年    ) OR
014310                       (施記－施術月     NOT = 受－施術月    )
014320*
014330             IF 施記－診療区分 = 2
014340                 MOVE "YES" TO 対象フラグ
014350                 MOVE "YES" TO 終了フラグ２
014360             END-IF
014370             PERFORM 施術記録Ｆ読込
014380         END-PERFORM
014390     END-IF.
014400*================================================================*
014410 後療のみ判定 SECTION.
014420*
014430     MOVE 受－患者番号  TO 施記－患者番号
014440     MOVE 受－枝番      TO 施記－枝番
014450     MOVE 受－施術和暦  TO 施記－施術和暦
014460     MOVE 受－施術年    TO 施記－施術年
014470     MOVE 受－施術月    TO 施記－施術月
014480     MOVE ZERO          TO 施記－施術日
014490     START 施術記録Ｆ   KEY IS >= 施記－患者コード
014500                                  施記－施術和暦年月日
014510     END-START
014520     IF 状態キー = "00"
014530         MOVE SPACE TO 終了フラグ２
014540         PERFORM 施術記録Ｆ読込
014550         PERFORM UNTIL (終了フラグ２         = "YES"         ) OR
014560                       (施記－患者コード NOT = 受－患者コード) OR
014570                       (施記－施術和暦   NOT = 受－施術和暦  ) OR
014580                       (施記－施術年     NOT = 受－施術年    ) OR
014590                       (施記－施術月     NOT = 受－施術月    )
014600*
014610             IF 施記－診療区分 = 1
014620                 MOVE "YES" TO 対象フラグ
014630             ELSE
014640                 MOVE SPACE TO 対象フラグ
014650                 MOVE "YES" TO 終了フラグ２
014660             END-IF
014670             PERFORM 施術記録Ｆ読込
014680         END-PERFORM
014690     END-IF.
014700*================================================================*
014710 終了判定 SECTION.
014720*
014730     MOVE "YES" TO 対象フラグ.
014740*
014750     MOVE 受－施術和暦   TO 負－施術和暦.
014760     MOVE 受－施術年     TO 負－施術年.
014770     MOVE 受－施術月     TO 負－施術月.
014780     MOVE 受－患者番号   TO 負－患者番号.
014790     MOVE 受－枝番       TO 負－枝番.
014800     READ 負傷データＦ
014810     INVALID KEY
014820         MOVE SPACE  TO 対象フラグ
014830     NOT INVALID KEY
014840         IF 負－部位数 = ZERO
014850             MOVE SPACE TO 対象フラグ
014860         ELSE
014870             PERFORM VARYING 部位ＣＮＴ FROM 1 BY 1
014880                      UNTIL (部位ＣＮＴ > 負－部位数)
014890                 IF 負－転帰区分(部位ＣＮＴ) = 9 OR 5
014900                     MOVE SPACE TO 対象フラグ
014910                 END-IF
014920             END-PERFORM
014930         END-IF
014940     END-READ.
014950*================================================================*
014960 月末日取得 SECTION.
014970*
014980     MOVE 施術和暦ＷＲ TO 元－元号区分.
014990     READ 元号マスタ
015000     NOT INVALID KEY
015010         MOVE 元－開始西暦年 TO 施術西暦年Ｗ
015020     END-READ.
015030     IF 施術西暦年Ｗ NOT = ZERO
015040        COMPUTE 施術西暦年Ｗ = 施術西暦年Ｗ + 施術年ＷＲ - 1
015050     END-IF.
015060*
015070     MOVE 施術月ＷＲ   TO 受理月Ｗ.
015080     EVALUATE 施術月ＷＲ
015090     WHEN 4
015100     WHEN 6
015110     WHEN 9
015120     WHEN 11
015130         MOVE 30 TO 受理日Ｗ
015140     WHEN 2
015150         DIVIDE 4 INTO 施術西暦年Ｗ GIVING    商Ｗ
015160                                    REMAINDER 余Ｗ
015170         END-DIVIDE
015180         IF 余Ｗ = ZERO
015190             MOVE 29 TO 受理日Ｗ
015200         ELSE
015210             MOVE 28 TO 受理日Ｗ
015220         END-IF
015230     WHEN 1
015240     WHEN 3
015250     WHEN 5
015260     WHEN 7
015270     WHEN 8
015280     WHEN 10
015290     WHEN 12
015300         MOVE 31 TO 受理日Ｗ
015310     WHEN OTHER
015320          CONTINUE
015330     END-EVALUATE.
015340*
015350*================================================================*
015360 最終通院日取得 SECTION.
015370     MOVE ZERO          TO 最終通院月Ｗ.
015380     MOVE ZERO          TO 最終通院日Ｗ.
015390     MOVE 受－患者番号  TO 施記－患者番号.
015400     MOVE 受－枝番      TO 施記－枝番.
015410     MOVE 施術和暦ＷＲ  TO 施記－施術和暦.
015420     MOVE 施術年ＷＲ    TO 施記－施術年.
015430     MOVE 施術月ＷＲ    TO 施記－施術月.
015440     MOVE 31            TO 施記－施術日.
015450*
015460     START 施術記録Ｆ   KEY IS <= 施記－患者コード
015470                                  施記－施術和暦年月日
015480                                  REVERSED
015490     END-START.
015500*
015510     IF 状態キー = "00"
015520         MOVE SPACE  TO 終了フラグ２
015530         PERFORM 施術記録Ｆ読込
015540         IF ( 施記－患者番号 = 受－患者番号 ) AND ( 施記－枝番 = 受－枝番 ) AND 
015550            ( 施記－施術和暦 = 施術和暦ＷＲ ) AND ( 施記－施術年 = 施術年ＷＲ ) AND
015560            ( 施記－施術月 = 施術月ＷＲ )     AND ( 終了フラグ２ = SPACE )
015570             MOVE  施記－施術月  TO  最終通院月Ｗ
015580             MOVE  施記－施術日  TO  最終通院日Ｗ
015590         END-IF
015600     END-IF.
015610******************************************************************
015620 END PROGRAM YHN721.
015630******************************************************************
