000010******************************************************************
000020*            IDENTIFICATION      DIVISION                        *
000030******************************************************************
000040 IDENTIFICATION          DIVISION.
000050 PROGRAM-ID.             YHP102.
000060 AUTHOR.                 池田 幸子
000070*
000080*----------------------------------------------------------------*
000090*      提出FPD作成【FPD書込】柔ｳｨﾝﾄﾞｳｽﾞ95版
000100* 請求年月Ver.
000110*      MED = YHP100G 
000120* 画面をＵＳＢ作成と一緒にした
000130*----------------------------------------------------------------*
000140 DATE-WRITTEN.           2010-04-08
000150 DATE-COMPILED.          2010-04-08
000160*----------------------------------------------------------------*
000170******************************************************************
000180*            ENVIRONMENT         DIVISION                        *
000190******************************************************************
000200 ENVIRONMENT             DIVISION.
000210 CONFIGURATION           SECTION.
000220 SOURCE-COMPUTER.        FMV-DESKPOWER-TS.
000230 OBJECT-COMPUTER.        FMV-DESKPOWER.
000240 SPECIAL-NAMES.          CONSOLE  IS  CONS
000250                         SYSERR   IS  MSGBOX.
000260 INPUT-OUTPUT            SECTION.
000270 FILE-CONTROL.
000280     SELECT  制御情報マスタ  ASSIGN      TO        SEIGYOL
000290                             ORGANIZATION             IS  INDEXED
000300                             ACCESS MODE              IS  DYNAMIC
000310                             RECORD KEY               IS  制－制御区分
000320                             FILE STATUS              IS  状態キー
000330                             LOCK        MODE         IS  AUTOMATIC.
000340     SELECT  作業ファイル１  ASSIGN      TO        "C:\MAKISHISYS\YAWOBJ\TEMP\W1011L.DAT"
000350                             ORGANIZATION             IS  SEQUENTIAL
000360                             ACCESS                   IS  SEQUENTIAL
000370                             FILE        STATUS       IS  状態キー
000380                             LOCK        MODE         IS  AUTOMATIC.
000390*
000410     SELECT 会提出ファイル ASSIGN    TO    FD-NAME
000420                             ORGANIZATION             IS  SEQUENTIAL
000430                             ACCESS MODE              IS  SEQUENTIAL
000440                             FILE STATUS              IS  状態キー
000450                             LOCK      MODE           IS  AUTOMATIC.
000460******************************************************************
000470*                      DATA DIVISION                             *
000480******************************************************************
000490 DATA                    DIVISION.
000500 FILE                    SECTION.
000510*
000520*                           ［ＲＬ＝  ２５６］
000530 FD  制御情報マスタ          BLOCK   CONTAINS   1   RECORDS.
000540     COPY SEIGYO          OF  XFDLIB  JOINING   制   AS  PREFIX.
000550*
001536 FD  作業ファイル１ RECORD  CONTAINS 1920 CHARACTERS.
001537 01  作１－レコード.
001538*   / ヘッダ部は使用しない /
001539     03  作１－レコードヘッダ.
001540         05  作１－請求和暦年月キー.
001541             07  作１－請求和暦            PIC 9.
001542             07  作１－請求年              PIC 9(2).
001543             07  作１－請求月              PIC 9(2).
001544         05  作１－施術和暦年月キー.
001545             07  作１－施術和暦            PIC 9.
001546             07  作１－施術年              PIC 9(2).
001547             07  作１－施術月              PIC 9(2).
001548         05  作１－保険区分キー            PIC 9.
001549         05  作１－保険者番号キー          PIC 9(8).
001550         05  作１－本人家族区分キー        PIC 9.
001551         05  作１－被保険者カナキー        PIC X(20).
001552         05  作１－患者コードキー.
001553             07 作１－患者番号キー         PIC 9(6).
001554             07 作１－枝番                 PIC X(1).
001555     03  作１－レコードデータ.
001556         05  作１－請求年月                PIC 9(6).
001557         05  作１－施術年月                PIC 9(6).
001558         05  作１－会員番号                PIC 9(7).
001559         05  作１－登録記号番号            PIC X(11).
001560         05  作１－保険者番号              PIC X(8).
001561         05  作１－記号                    PIC X(30).
001562         05  作１－番号                    PIC X(16).
001563         05  作１－医療助成区分            PIC 9.
001564         05  作１－助成負担者番号          PIC X(8).
001565         05  作１－助成受給者番号          PIC X(16).
001566         05  作１－助成負担者番号２        PIC X(8).
001567         05  作１－助成受給者番号２        PIC X(16).
001568         05  作１－保険種別区分            PIC 9.
001569         05  作１－単併区分                PIC 9.
001570         05  作１－本家区分                PIC 9.
001571         05  作１－給付割合                PIC 9(2).
001572         05  作１－本人家族区分            PIC 9.
001573         05  作１－被保険者カナ            PIC X(25).
001574         05  作１－被保険者氏名            PIC X(30).
001575         05  作１－患者カナ                PIC X(25).
001576         05  作１－患者氏名                PIC X(30).
001577         05  作１－患者性別                PIC 9.
001578         05  作１－患者生年月日            PIC 9(8).
001579         05  作１－合計金額                PIC 9(6).
001580         05  作１－一部負担金              PIC 9(6).
001581         05  作１－請求金額                PIC 9(6).
001582         05  作１－公費負担金額            PIC 9(6).
001583         05  作１－公費請求金額            PIC 9(6).
001584         05  作１－全体実日数              PIC 9(2).
001585         05  作１－部位数                  PIC 9.
001586         05  作１－再請求区分              PIC 9.
001587         05  作１－業者区分                PIC 9(2).
001588         05  作１－高齢者区分              PIC 9.
001589         05  作１－患者番号                PIC 9(5).
      */運動後療追加↓↓↓/20180607
               05 作１－運動後療料回数           PIC 9(1).
               05 作１－運動後療料               PIC 9(5).
      */明細書発行体制加算追加↓↓↓/20221020
               05 作１－明細書発行回数           PIC 9(1).
               05 作１－明細書発行               PIC 9(3).
               05 作１－明細書発行月日           PIC 9(4).
001598*         05 作１－予備                     PIC X(57).
001598*         05 作１－予備                     PIC X(48).
001598         05 作１－予備                     PIC X(40).
      */明細書発行体制加算追加↑↑↑/20221020
      */運動後療追加↑↑↑/20180607
001591*
001592         05  作１－負傷データ  OCCURS 5.
001593             07  作１－負傷区分            PIC 9.
001594             07  作１－負傷名              PIC X(32).
001595             07  作１－負傷年月日          PIC 9(8).
001596             07  作１－初検年月日          PIC 9(8).
001597             07  作１－施術開始年月日      PIC 9(8).
001598             07  作１－施術終了年月日      PIC 9(8).
001599             07  作１－実日数              PIC 9(2).
001600             07  作１－転帰区分            PIC 9.
001601             07  作１－整復固定施療回数    PIC 9.
001602             07  作１－整復固定施療料      PIC 9(5).
001603*
001604         05  作１－新規区分                PIC 9.
001605         05  作１－継続区分                PIC 9.
001606         05  作１－施術日                  PIC X(31).
001607         05  作１－初検回数                PIC 9.
001608         05  作１－初検料                  PIC 9(5).
001609         05  作１－初検休日加算回数        PIC 9.
001610         05  作１－初検深夜加算回数        PIC 9.
001611         05  作１－初検時間外加算回数      PIC 9.
001612         05  作１－初検加算                PIC 9(5).
001613         05  作１－相談支援回数            PIC 9.
001614         05  作１－相談支援料              PIC 9(5).
001615
001616         05  作１－再検回数                PIC 9.
001617         05  作１－再検料                  PIC 9(5).
001618         05  作１－往療距離                PIC 9(3).
001619         05  作１－往療回数                PIC 9(2).
001620         05  作１－往療料                  PIC 9(5).
001621         05  作１－夜間加算往療回数        PIC 9.
001622         05  作１－難路加算往療回数        PIC 9.
001623         05  作１－暴風雨雪加算往療回数    PIC 9.
001624         05  作１－往療加算                PIC 9(5).
      */金属副子変更↓↓↓/20180611
000561         05 作１－金属副子回数             PIC 9.
000561         05 作１－ダミー                   PIC X(2).
001625*         05  作１－金属副子大回数          PIC 9.
001626*         05  作１－金属副子中回数          PIC 9.
001627*         05  作１－金属副子小回数          PIC 9.
      */金属副子変更↑↑↑/20180611
001628         05  作１－金属副子加算            PIC 9(5).
001629         05  作１－情報提供料回数          PIC 9.
001630         05  作１－情報提供料              PIC 9(5).
001631*
001632         05  作１－負傷部位データ  OCCURS 6.
001633             07  作１－逓減開始月日        PIC 9(4).
001634             07  作１－後療回数            PIC 9(2).
001635             07  作１－後療料              PIC 9(5).
001636             07  作１－冷罨法回数          PIC 9.
001637             07  作１－冷罨法料            PIC 9(5).
001638             07  作１－温罨法回数          PIC 9(2).
001639             07  作１－温罨法料            PIC 9(5).
001640             07  作１－電療回数            PIC 9(2).
001641             07  作１－電療料              PIC 9(5).
001642             07  作１－多部位逓減率        PIC 9(2).
001643             07  作１－多部位逓減額        PIC 9(5).
001644             07  作１－長期逓減率          PIC 9(2).
001645             07  作１－料金計              PIC 9(5).
001646*
001647         05  作１－被保険者住所            PIC X(60).
001648         05  作１－負傷原因                PIC X(200).
001649         05  作１－経過                    PIC X(50).
001650         05  作１－長期理由                PIC X(400).
001651         05  作１－改行文字                PIC X(2).
001652         05  FILLER                        PIC X(73).
001653*
001654*
001655 FD  会提出ファイル RECORD  CONTAINS 1800 CHARACTERS.
001656 01  会提－レコード.
001657     03  会提－レコードデータ.
002150         05  会提－請求年月                PIC 9(6).
002151         05  会提－施術年月                PIC 9(6).
002152         05  会提－会員番号                PIC 9(7).
002153         05  会提－登録記号番号            PIC X(11).
002154         05  会提－保険者番号              PIC X(8).
002155         05  会提－記号                    PIC X(30).
002156         05  会提－番号                    PIC X(16).
002157         05  会提－医療助成区分            PIC 9.
002158         05  会提－助成負担者番号          PIC X(8).
002159         05  会提－助成受給者番号          PIC X(16).
002160         05  会提－助成負担者番号２        PIC X(8).
002161         05  会提－助成受給者番号２        PIC X(16).
002162         05  会提－保険種別区分            PIC 9.
002163         05  会提－単併区分                PIC 9.
002164         05  会提－本家区分                PIC 9.
002165         05  会提－給付割合                PIC 9(2).
002166         05  会提－本人家族区分            PIC 9.
002167         05  会提－被保険者カナ            PIC X(25).
002168         05  会提－被保険者氏名            PIC X(30).
002169         05  会提－患者カナ                PIC X(25).
002170         05  会提－患者氏名                PIC X(30).
002171         05  会提－患者性別                PIC 9.
002172         05  会提－患者生年月日            PIC 9(8).
002173         05  会提－合計金額                PIC 9(6).
002174         05  会提－一部負担金              PIC 9(6).
002175         05  会提－請求金額                PIC 9(6).
002176         05  会提－公費負担金額            PIC 9(6).
002177         05  会提－公費請求金額            PIC 9(6).
002178         05  会提－全体実日数              PIC 9(2).
002179         05  会提－部位数                  PIC 9.
002180         05  会提－再請求区分              PIC 9.
002181         05  会提－業者区分                PIC 9(2).
002182         05  会提－高齢者区分              PIC 9.
      */20180611
002183*         05  会提－患者番号                PIC 9(5).
002183         05  会提－患者番号                PIC 9(8).
      */運動後療追加↓↓↓/20180611
               05 会提－運動後療料回数           PIC 9(1).
               05 会提－運動後療料               PIC 9(5).
      */明細書発行体制加算追加↓↓↓/20221020
               05 会提－明細書発行回数           PIC 9(1).
               05 会提－明細書発行               PIC 9(3).
               05 会提－明細書発行月日           PIC 9(4).
001598*         05 会提－予備                     PIC X(57).
001598*         05 会提－予備                     PIC X(48).
001598         05 会提－予備                     PIC X(40).
      */明細書発行体制加算追加↑↑↑/20221020
      */運動後療追加↑↑↑/20180611
002185*
002186         05  会提－負傷データ  OCCURS 5.
002187             07  会提－負傷区分            PIC 9.
002188             07  会提－負傷名              PIC X(32).
002189             07  会提－負傷年月日          PIC 9(8).
002190             07  会提－初検年月日          PIC 9(8).
002191             07  会提－施術開始年月日      PIC 9(8).
002192             07  会提－施術終了年月日      PIC 9(8).
002193             07  会提－実日数              PIC 9(2).
002194             07  会提－転帰区分            PIC 9.
002195             07  会提－整復固定施療回数    PIC 9.
002196             07  会提－整復固定施療料      PIC 9(5).
002197*
002198         05  会提－新規区分                PIC 9.
002199         05  会提－継続区分                PIC 9.
002200         05  会提－施術日                  PIC X(31).
002201         05  会提－初検回数                PIC 9.
002202         05  会提－初検料                  PIC 9(5).
002203         05  会提－初検休日加算回数        PIC 9.
002204         05  会提－初検深夜加算回数        PIC 9.
002205         05  会提－初検時間外加算回数      PIC 9.
002206         05  会提－初検加算                PIC 9(5).
002207         05  会提－相談支援回数            PIC 9.
002208         05  会提－相談支援料              PIC 9(5).
002209
002210         05  会提－再検回数                PIC 9.
002211         05  会提－再検料                  PIC 9(5).
002212         05  会提－往療距離                PIC 9(3).
002213         05  会提－往療回数                PIC 9(2).
002214         05  会提－往療料                  PIC 9(5).
002215         05  会提－夜間加算往療回数        PIC 9.
002216         05  会提－難路加算往療回数        PIC 9.
002217         05  会提－暴風雨雪加算往療回数    PIC 9.
002218         05  会提－往療加算                PIC 9(5).
      */金属副子変更↓↓↓/20180611
000561         05  会提－金属副子回数            PIC 9.
000561         05  会提－ダミー                  PIC X(2).
002219*         05  会提－金属副子大回数          PIC 9.
002220*         05  会提－金属副子中回数          PIC 9.
002221*         05  会提－金属副子小回数          PIC 9.
      */金属副子変更↑↑↑/20180607
002222         05  会提－金属副子加算            PIC 9(5).
002223         05  会提－情報提供料回数          PIC 9.
002224         05  会提－情報提供料              PIC 9(5).
002225*
002226         05  会提－負傷部位データ  OCCURS 6.
002227             07  会提－逓減開始月日        PIC 9(4).
002228             07  会提－後療回数            PIC 9(2).
002229             07  会提－後療料              PIC 9(5).
002230             07  会提－冷罨法回数          PIC 9.
002231             07  会提－冷罨法料            PIC 9(5).
002232             07  会提－温罨法回数          PIC 9(2).
002233             07  会提－温罨法料            PIC 9(5).
002234             07  会提－電療回数            PIC 9(2).
002235             07  会提－電療料              PIC 9(5).
002236             07  会提－多部位逓減率        PIC 9(2).
002237             07  会提－多部位逓減額        PIC 9(5).
002238             07  会提－長期逓減率          PIC 9(2).
002239             07  会提－料金計              PIC 9(5).
002240*
002241         05  会提－被保険者住所            PIC X(60).
002242         05  会提－負傷原因                PIC X(200).
002243         05  会提－経過                    PIC X(50).
002244         05  会提－長期理由                PIC X(400).
002245         05  会提－改行文字                PIC X(2).
002246***
002248*----------------------------------------------------------------*
002249******************************************************************
002250*                WORKING-STORAGE SECTION                         *
002251******************************************************************
002252 WORKING-STORAGE         SECTION.
002253 01 キー入力                           PIC X    VALUE SPACE.
002254 01 状態キー                           PIC X(2) VALUE SPACE.
002255 01 終了フラグ                         PIC X(3) VALUE SPACE.
002256 01 終了フラグ２                       PIC X(3) VALUE SPACE.
002257 01 実行キーＷ                         PIC X(3)  VALUE SPACE.
002258 01 施術記録有Ｗ                       PIC X(3) VALUE SPACE.
002259 01 ファイル名                         PIC N(8) VALUE SPACE.
002260 01 カウンタ                           PIC 9(1) VALUE ZERO.
002270 01 連番Ｗ                             PIC 9(4) VALUE ZERO.
002280**
002290** エラーメッセージ用
002300 01 エラーメッセージＷ.
002310    03 エラー患者コードＷ              PIC X(7) VALUE SPACE.
002320    03 エラー区切りＷ                  PIC X(1) VALUE SPACE.
002330    03 エラー保険種別Ｗ                PIC X(2) VALUE SPACE.
002340    03 FILLER                          PIC X(10) VALUE SPACE.
002350*
002360* フロッピーパス用
002370 01 定期修正ＦＤＷ                     PIC X VALUE SPACE.
002380 01 FD-NAME                            PIC X(30) VALUE SPACE.
002390******************************************************************
002400*                          連結項目                              *
002410******************************************************************
002420*
002430 01 連入－画面情報ＹＨＰ１００ IS EXTERNAL.
002440    03 連入－ドライブ                  PIC X(1).
      *
      *0:通常 1:固定パス
       01 連入－固定フラグ３２１１ IS EXTERNAL.
          03 連入－固定フラグ                PIC 9(1).
002450*
002460********************
002470* メッセージ表示キー *
002480********************
002490 01 連メ－キー IS EXTERNAL.
002500    03  連メ－メッセージ               PIC N(20).
002510*
002520 01 連メ７－キー IS EXTERNAL.
002530    03  連メ７－メッセージ１               PIC X(40).
002540    03  連メ７－メッセージ２               PIC X(40).
002550*
002560******************************************************************
002570*                      PROCEDURE  DIVISION                       *
002580******************************************************************
002590 PROCEDURE               DIVISION.
002600************
002610*           *
002620* 初期処理   *
002630*           *
002640************
002650     PERFORM 初期化.
002660************
002670*           *
002680* 主処理     *
002690*           *
002700************
002710     PERFORM 提出ファイル作成.
002720************
002730*           *
002740* 終了処理   *
002750*           *
002760************
002770     PERFORM 終了処理.
002780     MOVE ZERO TO PROGRAM-STATUS.
002790     EXIT PROGRAM.
002800*
002810*<<<<<<<<<<<<<<<<<<<<<<<<< END OF PROGRAM >>>>>>>>>>>>>>>>>>>>>>>>
002820*================================================================*
002830 初期化 SECTION.
002840*
002850     PERFORM ファイルオープン.
002860*
002870*================================================================*
002880 ファイルオープン SECTION.
002890*
002900*     OPEN INPUT 制御情報マスタ.
002910*         MOVE NC"制御情報マスタ" TO ファイル名.
002920*         PERFORM オープンチェック.
002930*     MOVE ZERO TO 制－制御区分.
002940*     READ 制御情報マスタ
002950*     NOT INVALID KEY
002960*         MOVE 制－定期修正ＦＤ TO 定期修正ＦＤＷ
002970*     END-READ.
           IF 連入－固定フラグ = 1
002890        MOVE "C:\makishisys\RYOYOHI.DAT" TO FD-NAME
           ELSE
002980        MOVE 連入－ドライブ TO 定期修正ＦＤＷ
002990        IF 定期修正ＦＤＷ = SPACE
003000           MOVE "A" TO 定期修正ＦＤＷ
003010        END-IF
003020        STRING 定期修正ＦＤＷ DELIMITED BY SIZE
003030              ":\RYOYOHI.DAT"  DELIMITED BY SIZE
003040              INTO FD-NAME
003050        END-STRING
           END-IF.
003060*
003070     OPEN OUTPUT 会提出ファイル.
003080     IF 状態キー  NOT =  "00"
003090         MOVE  "指定されたドライブがないか、" TO 連メ７－メッセージ１
003100         MOVE  "書き込むことが出来ません。" TO 連メ７－メッセージ２
003110         CALL   "MSG007"
003120         CANCEL "MSG007"
003130         MOVE 99 TO PROGRAM-STATUS
003140         EXIT PROGRAM
003150     END-IF.
003160*
003170     OPEN INPUT 作業ファイル１.
003180         MOVE NC"作１" TO ファイル名.
003190         PERFORM オープンチェック.
003200*================================================================*
003210 オープンチェック SECTION.
003220*
003230     IF 状態キー  NOT =  "00"
003240         DISPLAY ファイル名 NC"Ｆオープンエラー" UPON CONS
003250         DISPLAY NC"状態キー：" 状態キー         UPON CONS
003260         DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"
003270                                                 UPON CONS
003280*-----------------------------------------*
003290         CALL "actcshm"  WITH C LINKAGE
003300*-----------------------------------------*
003310         ACCEPT  キー入力 FROM CONS
003320         PERFORM ファイル閉鎖
003330         MOVE 99 TO PROGRAM-STATUS
003340         EXIT PROGRAM.
003350*================================================================*
003360 ファイル閉鎖 SECTION.
003370*
003380     CLOSE  会提出ファイル 作業ファイル１.
003390*            制御情報マスタ.
003400*================================================================*
003410 終了処理 SECTION.
003420*
003430     PERFORM ファイル閉鎖.
003440*================================================================*
003450 エラー表示 SECTION.
003460*
003470     DISPLAY NC"状態キー" 状態キー  UPON CONS.
003480     DISPLAY NC"ファイル書込エラー：" ファイル名   UPON CONS.
003490     DISPLAY NC"システム管理者に連絡してください"  UPON CONS.
003500     DISPLAY NC"数字１文字入力しＥＮＴＥＲキーを押してください"                                                                    UPON CONS.
003510*-----------------------------------------*
003520     CALL "actcshm"  WITH C LINKAGE.
003530*-----------------------------------------*
003540     ACCEPT  キー入力 FROM CONS.
003550     PERFORM ファイル閉鎖.
003560     MOVE 99 TO PROGRAM-STATUS.
003570     EXIT PROGRAM.
003580*================================================================*
003590 提出ファイル作成 SECTION.
003600*
003610     MOVE SPACE   TO 終了フラグ.
003620     PERFORM 作業ファイル１読込.
003630     IF  終了フラグ = "YES"
003640         MOVE  NC"　データが０件です。確認して下さい。" TO 連メ－メッセージ
003650         CALL   "MSG001"
003660         CANCEL "MSG001"
003670         PERFORM ファイル閉鎖
003680         MOVE 99 TO PROGRAM-STATUS
003690         EXIT PROGRAM
003700     END-IF.
003710*
003720     PERFORM UNTIL 終了フラグ = "YES"
003730              PERFORM レコードセット
003740              PERFORM ファイル書込
003750         PERFORM 作業ファイル１読込
003760     END-PERFORM.
003770*
003780*================================================================*
003790 レコードセット SECTION.
003800*
003810     MOVE SPACE TO 会提－レコード.
003820     INITIALIZE    会提－レコード.
003830*
004530     MOVE 作１－請求年月             TO 会提－請求年月.
004531     MOVE 作１－施術年月             TO 会提－施術年月.
004532     MOVE 作１－会員番号             TO 会提－会員番号.
004533     MOVE 作１－登録記号番号         TO 会提－登録記号番号.
004534     MOVE 作１－保険者番号           TO 会提－保険者番号.
004535     MOVE 作１－記号                 TO 会提－記号.
004536     MOVE 作１－番号                 TO 会提－番号.
004537     MOVE 作１－医療助成区分         TO 会提－医療助成区分.
004538     MOVE 作１－助成負担者番号       TO 会提－助成負担者番号.
004539     MOVE 作１－助成受給者番号       TO 会提－助成受給者番号.
004540     MOVE 作１－助成負担者番号２     TO 会提－助成負担者番号２.
004541     MOVE 作１－助成受給者番号２     TO 会提－助成受給者番号２.
004542     MOVE 作１－保険種別区分         TO 会提－保険種別区分.
004543     MOVE 作１－単併区分             TO 会提－単併区分.
004544     MOVE 作１－本家区分             TO 会提－本家区分.
004545     MOVE 作１－給付割合             TO 会提－給付割合.
004546     MOVE 作１－本人家族区分         TO 会提－本人家族区分.
004547     MOVE 作１－被保険者カナ         TO 会提－被保険者カナ.
004548     MOVE 作１－被保険者氏名         TO 会提－被保険者氏名.
004549     MOVE 作１－患者カナ             TO 会提－患者カナ.
004550     MOVE 作１－患者氏名             TO 会提－患者氏名.
004551     MOVE 作１－患者性別             TO 会提－患者性別.
004552     MOVE 作１－患者生年月日         TO 会提－患者生年月日.
004553     MOVE 作１－合計金額             TO 会提－合計金額.
004554     MOVE 作１－一部負担金           TO 会提－一部負担金.
004555     MOVE 作１－請求金額             TO 会提－請求金額.
004556     MOVE 作１－公費負担金額         TO 会提－公費負担金額.
004557     MOVE 作１－公費請求金額         TO 会提－公費請求金額.
004558     MOVE 作１－全体実日数           TO 会提－全体実日数.
004559     MOVE 作１－部位数               TO 会提－部位数.
004560     MOVE 作１－再請求区分           TO 会提－再請求区分.
004561     MOVE 作１－業者区分             TO 会提－業者区分.
004562     MOVE 作１－高齢者区分           TO 会提－高齢者区分.
004563     MOVE 作１－患者番号             TO 会提－患者番号.
004564*
004565     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL (カウンタ > 5)
004566         MOVE 作１－負傷区分(カウンタ)         TO 会提－負傷区分(カウンタ)
004567         MOVE 作１－負傷名(カウンタ)           TO 会提－負傷名(カウンタ)
004568         MOVE 作１－負傷年月日(カウンタ)       TO 会提－負傷年月日(カウンタ)
004569         MOVE 作１－初検年月日(カウンタ)       TO 会提－初検年月日(カウンタ)
004570         MOVE 作１－施術開始年月日(カウンタ)   TO 会提－施術開始年月日(カウンタ)
004571         MOVE 作１－施術終了年月日(カウンタ)   TO 会提－施術終了年月日(カウンタ)
004572         MOVE 作１－実日数(カウンタ)           TO 会提－実日数(カウンタ)
004573         MOVE 作１－転帰区分(カウンタ)         TO 会提－転帰区分(カウンタ)
004574         MOVE 作１－整復固定施療回数(カウンタ) TO 会提－整復固定施療回数(カウンタ)
004575         MOVE 作１－整復固定施療料(カウンタ)   TO 会提－整復固定施療料(カウンタ)
004576     END-PERFORM.
004577*
004578     MOVE 作１－新規区分             TO 会提－新規区分.
004579     MOVE 作１－継続区分             TO 会提－継続区分.
004580     MOVE 作１－施術日               TO 会提－施術日.
004581     MOVE 作１－初検回数             TO 会提－初検回数.
004582     MOVE 作１－初検料               TO 会提－初検料.
004583     MOVE 作１－初検休日加算回数     TO 会提－初検休日加算回数.
004584     MOVE 作１－初検深夜加算回数     TO 会提－初検深夜加算回数.
004585     MOVE 作１－初検時間外加算回数   TO 会提－初検時間外加算回数.
004586     MOVE 作１－初検加算             TO 会提－初検加算.
004587     MOVE 作１－相談支援回数         TO 会提－相談支援回数.
004588     MOVE 作１－相談支援料           TO 会提－相談支援料.
004589
004590     MOVE 作１－再検回数             TO 会提－再検回数.
004591     MOVE 作１－再検料               TO 会提－再検料.
004592     MOVE 作１－往療距離             TO 会提－往療距離.
004593     MOVE 作１－往療回数             TO 会提－往療回数.
004594     MOVE 作１－往療料               TO 会提－往療料.
004595     MOVE 作１－夜間加算往療回数     TO 会提－夜間加算往療回数.
004596     MOVE 作１－難路加算往療回数     TO 会提－難路加算往療回数.
004597     MOVE 作１－暴風雨雪加算往療回数 TO 会提－暴風雨雪加算往療回数.
004598     MOVE 作１－往療加算             TO 会提－往療加算.
      */金属副子運動後療追加↓↓↓/20180611
004610     MOVE 作１－金属副子回数     TO  会提－金属副子回数.
004610     MOVE SPACE                  TO  会提－ダミー.
004610     MOVE 作１－運動後療料回数   TO  会提－運動後療料回数.
004610     MOVE 作１－運動後療料       TO  会提－運動後療料.
004599*     MOVE 作１－金属副子大回数       TO 会提－金属副子大回数.
004600*     MOVE 作１－金属副子中回数       TO 会提－金属副子中回数.
004601*     MOVE 作１－金属副子小回数       TO 会提－金属副子小回数.
      */金属副子運動後療追加↑↑↑/20180611
004602     MOVE 作１－金属副子加算         TO 会提－金属副子加算.
004603     MOVE 作１－情報提供料回数       TO 会提－情報提供料回数.
004604     MOVE 作１－情報提供料           TO 会提－情報提供料.
      */明細書発行体制加算追加↓↓↓/20221020
           MOVE 作１－明細書発行回数       TO 会提－明細書発行回数.
           MOVE 作１－明細書発行           TO 会提－明細書発行.
           MOVE 作１－明細書発行月日       TO 会提－明細書発行月日.
      */明細書発行体制加算追加↑↑↑/20221020
004605*
004606     PERFORM VARYING カウンタ FROM 1 BY 1 UNTIL (カウンタ > 6)
004607         MOVE 作１－逓減開始月日(カウンタ)  TO 会提－逓減開始月日(カウンタ)
004608         MOVE 作１－後療回数(カウンタ)      TO 会提－後療回数(カウンタ)
004609         MOVE 作１－後療料(カウンタ)        TO 会提－後療料(カウンタ)
004610         MOVE 作１－冷罨法回数(カウンタ)    TO 会提－冷罨法回数(カウンタ)
004611         MOVE 作１－冷罨法料(カウンタ)      TO 会提－冷罨法料(カウンタ)
004612         MOVE 作１－温罨法回数(カウンタ)    TO 会提－温罨法回数(カウンタ)
004613         MOVE 作１－温罨法料(カウンタ)      TO 会提－温罨法料(カウンタ)
004614         MOVE 作１－電療回数(カウンタ)      TO 会提－電療回数(カウンタ)
004615         MOVE 作１－電療料(カウンタ)        TO 会提－電療料(カウンタ)
004616         MOVE 作１－多部位逓減率(カウンタ)  TO 会提－多部位逓減率(カウンタ)
004617         MOVE 作１－多部位逓減額(カウンタ)  TO 会提－多部位逓減額(カウンタ)
004618         MOVE 作１－長期逓減率(カウンタ)    TO 会提－長期逓減率(カウンタ)
004619         MOVE 作１－料金計(カウンタ)        TO 会提－料金計(カウンタ)
004620     END-PERFORM.
004621*
004622     MOVE 作１－被保険者住所         TO 会提－被保険者住所.
004623     MOVE 作１－負傷原因             TO 会提－負傷原因.
004624     MOVE 作１－経過                 TO 会提－経過.
004625     MOVE 作１－長期理由             TO 会提－長期理由.
004626     MOVE 作１－改行文字             TO 会提－改行文字.
004627*
004628*================================================================*
004629 作業ファイル１読込 SECTION.
004630*
004631     READ 作業ファイル１ NEXT
004632     AT END
004633         MOVE "YES" TO 終了フラグ
004634     END-READ.
004635*
004636*================================================================*
004637 ファイル書込 SECTION.
004640*
004650     WRITE 会提－レコード.
004660     IF 状態キー  NOT =  "00"
004670         MOVE NC"会提出ファイル" TO ファイル名
004680         PERFORM エラー表示
004690     END-IF.
004700*================================================================*
004710******************************************************************
004720 END PROGRAM YHP102.
004730******************************************************************
